[
    {
        "post_id":43278,
        "thread_id":43278,
        "title":"820-3332 Failed GPU Prox, Die, L\/R Fin",
        "user_id":1539,
        "username":"ThisIsWes:AASP",
        "post_date":"2018-12-12 10:03:28",
        "message":"Received 820-3332 as \"running slow, fans high\". \nu8900 previously 'repaired' by Apple. I replaced with leaded still. All else looks great, no liquid, only some thermal paste residue. \nTesting showed 8 related failed sensors - GPU proximity, GPU Die, Left\/Right Fin stack. visually, u5550 area looked good. Tested against a good board - solid 3.3v in, resistors are good but pins 2,3,4,5 are bouncing around from .3v-.9v. Replaced c5551, c5552 with no change. Swapped u5550 (from 820-3115) and the issue appeared to be gone, pins 2-5 were all at consistent voltages. \nInstalled and tested, fans still high and sensors failed again. PRAM reset x3 and SMC reset. Ran fine and passed the tests. \nLet sit overnight without power and this morning the issue is back. Resets will not solve. U5550 still testing good. \nPics included. (MUX switching failure due to testing without display)."
    },
    {
        "post_id":43283,
        "thread_id":43278,
        "title":"820-3332 Failed GPU Prox, Die, L\/R Fin",
        "user_id":1539,
        "username":"ThisIsWes:AASP",
        "post_date":"2018-12-12 11:44:22",
        "message":"Voltages back to bouncing around on pins 2,3,4,5. Replaced u5550 again, this time from a 3332. No change immediately, but after looking over the board and verifying traces between q5501, q5503 and u5550 the voltages on u5550 have leveled out and the board runs fine. \nI don't think i'm solving the issue here. Not sure how these symptoms can come and go unless theres some trace\/connection somewhere thats hit or miss.. Will run through the cleaner and see what happens. \n\nOnly found one other similar topic: [url]https:\/\/www.rossmanngroup.com\/boards\/forum\/board-repair-troubleshooting\/21549-820-3332-th1h-sensor-error[\/url]"
    },
    {
        "post_id":43288,
        "thread_id":43278,
        "title":"820-3332 Failed GPU Prox, Die, L\/R Fin",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2018-12-12 13:16:14",
        "message":"I would say replace U8900 if possible."
    },
    {
        "post_id":43310,
        "thread_id":43278,
        "title":"820-3332 Failed GPU Prox, Die, L\/R Fin",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-12-13 00:21:07",
        "message":"Be sure all traces from U5550 to its sensors are OK.\nCheck SCL\/SDA lines too.\nAlso chek\/change R5551\/52."
    },
    {
        "post_id":43496,
        "thread_id":43278,
        "title":"820-3332 Failed GPU Prox, Die, L\/R Fin",
        "user_id":1539,
        "username":"ThisIsWes:AASP",
        "post_date":"2018-12-17 14:52:02",
        "message":"Replaced u8900 - Fans high and running slow. Reset SMC - runs normal and sensors passed on the first loop of testing then failed on the second. \nReplaced q5501, q5503 - Runs normal then same as above. First L\/R fin stack failed then GPU Die followed. \n\nSDA around u5550 and to test point by SMC is all good, same with SCL and test point on opposite side. \nu5550 to sensors match good board. \n\nBad SMC as sometimes a reset will help for a bit? Otherwise, I'm thinking broken ball\/trace somewhere thats affected by board movement."
    },
    {
        "post_id":43497,
        "thread_id":43278,
        "title":"820-3332 Failed GPU Prox, Die, L\/R Fin",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-12-17 14:57:43",
        "message":"Try other SMC, or reball the original."
    }
]