[
    {
        "post_id":25938,
        "thread_id":25938,
        "title":"[SOLVED]820-00165 water damaged, no 5V, u7501 pin 4 no enable voltage, R7551 is ok",
        "user_id":1101,
        "username":"ielectron",
        "post_date":"2017-09-26 15:27:42",
        "message":"On a water damaged 820-00165, macbook air 13, around the SMC there was 2 testpoints corroded away therefore the track was broken, R5193 SMS_INT_L + R5178 SMC_TDO, i fixed the tracks, the resistors were not corroded, both connects to PP3V42, which is there, before and after the resistors, i cleaned the board too, checked SMC balls under microscope, doesnt look dirty (the first row of balls what are visible), there is green light on charger, 3.3V and G3H 8.6V are ok, wont turn on, , only the 5V is missing, what else can i check, it seems that SMC is not enabling the 5V.  I dont have donor board with another SMC, hope its something else..."
    },
    {
        "post_id":25951,
        "thread_id":25938,
        "title":"[SOLVED]820-00165 water damaged, no 5V, u7501 pin 4 no enable voltage, R7551 is ok",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-09-26 16:34:30",
        "message":"Probably corrosion under the SMC, flux and heat it but not reflow. Also inspect U1900, U1950 for corrosion. PPVRTC present? Corrosion around U6100?"
    },
    {
        "post_id":25968,
        "thread_id":25938,
        "title":"[SOLVED]820-00165 water damaged, no 5V, u7501 pin 4 no enable voltage, R7551 is ok",
        "user_id":1101,
        "username":"ielectron",
        "post_date":"2017-09-27 03:50:16",
        "message":"ur great! i checked them, there was corrosion on U1950 and gate, on pin 1, its funny cause i checked it under the scope, but i was using an ext. led light which creates shadows on the board, the water damage was so small that it was hiding in the shadow created by the directional led light, i replaced that, was still no good, than just for the sake of it i replaced u7501 (creating 3.3V and 5V) and it started. Did not recognise battery, i could not perform pram reset only smc reset, but pram reset is possible with ext. usb keyboard, and after that it recognized the battery and charging, and now i can perform pram reset with its own keyboard.\nTHX!!"
    },
    {
        "post_id":31822,
        "thread_id":25938,
        "title":"[SOLVED]820-00165 water damaged, no 5V, u7501 pin 4 no enable voltage, R7551 is ok",
        "user_id":557,
        "username":"MDY",
        "post_date":"2018-02-20 09:50:01",
        "message":"I can confirm that board works ok without SMS_INT_L"
    }
]