[
    {
        "post_id":101081,
        "thread_id":64136,
        "title":"820-01700 No S5",
        "user_id":32178,
        "username":"prodigy83",
        "post_date":"2023-08-21 08:23:22",
        "message":"My reference: TT9832\n\nBoard History: A very tiny amount of corrosion was found on C9034 (PP1V8_SSD1 shorted and replaced capacitor), and CA780 was corroded and replaced.\nProblem: Anything with S5 in it, I do not get, I do however get all the PP power rails, SLP and AWAKE rails. \n\nBoard is getting 20v. \nWhen I hooked the computer up in Apple Configurator 2, it showed up as being in \"Recovery\" mode. I did do a restore, and it appeared the restore did take because I got no errors at all, and I even saw the apple logo with the progress bar come up on the screen. The computer did show up like it normally does with that lock image. The computer though would restart itself after being on this screen for about 1 minute. \nWhen I tried to do another revive, restore, and update, I was then getting errors. I am wondering if the computer is just getting too hot and not finishing because it seems like it shuts off in the last 4 out of 4 process and then boots itself back again in to the \"Recovery\" mode. I am successful every time with getting the computer in to DFU mode.\n[ATTACH]61274[\/ATTACH]\n[ATTACH]61275[\/ATTACH]\n[ATTACH]61276[\/ATTACH]"
    },
    {
        "post_id":101083,
        "thread_id":64136,
        "title":"820-01700 No S5",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-08-21 08:34:27",
        "message":"If appears in Recovery force it off and try to start it in DFU."
    },
    {
        "post_id":101084,
        "thread_id":64136,
        "title":"820-01700 No S5",
        "user_id":32178,
        "username":"prodigy83",
        "post_date":"2023-08-21 09:05:51",
        "message":"Yes, I was successfull upon doing this already. Sorry I may not have made that clear. Each time I was able to get it back in to DFU mode and each time I did so before trying each revive, restore, and update, got the above photoed error when attempting this."
    },
    {
        "post_id":101087,
        "thread_id":64136,
        "title":"820-01700 No S5",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-08-21 09:44:26",
        "message":"Something else may be affected by corrosion.\nDo you now get G3S and SSD voltages?\n\nYou can consider to flash SoC ROM and try again DFU.\nBut if is corrosion issue, it will not help.\nDon't forget to make backup..."
    },
    {
        "post_id":101090,
        "thread_id":64136,
        "title":"820-01700 No S5",
        "user_id":32178,
        "username":"prodigy83",
        "post_date":"2023-08-21 10:55:24",
        "message":"[QUOTE=\"2informaticos, post: 101087, member: 682\"]\nSomething else may be affected by corrosion.\nDo you now gett G3S and SSD voltages?\n[\/QUOTE]\nYes on all.\nI am going to try another DFU with each revive, restore, and update to see what happens now. I did see a couple areas of concern that may have needed flux\/reflow. If none of these work I will try the ROM. Thank you very much!"
    },
    {
        "post_id":101093,
        "thread_id":64136,
        "title":"820-01700 No S5",
        "user_id":32178,
        "username":"prodigy83",
        "post_date":"2023-08-21 12:46:26",
        "message":"Plugged it in, it was again in recovery mode. Placed it in DFU, did a Restore, it worked! Oh, I also placed the heatsink back on, not sure if this helped much, thank you so very much again!"
    },
    {
        "post_id":101096,
        "thread_id":64136,
        "title":"820-01700 No S5",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-08-21 15:26:09",
        "message":"Did you reflash SoC ROM?"
    },
    {
        "post_id":101105,
        "thread_id":64136,
        "title":"820-01700 No S5",
        "user_id":32178,
        "username":"prodigy83",
        "post_date":"2023-08-22 06:13:43",
        "message":"[QUOTE=\"2informaticos, post: 101096, member: 682\"]\nDid you reflash SoC ROM?\n[\/QUOTE]\nNope, I just checked all the SSD voltages and G3S once more, all were present, but in addition to this, Q3501 and QB701 looked like it could of had some debris\/corrosion setting in. I reflowed with hot air and Amtech flux. Finally stuck the motherboard back in its shell, it was again in recovery mode, so I stuck it in DFU, then did a restore, that worked perfectly, oh yea, I also stuck the heat sink back on too. I really appreciate all your help."
    }
]