[
    {
        "post_id":7226,
        "thread_id":7226,
        "title":"Power Adapter Source",
        "user_id":135,
        "username":"bjf",
        "post_date":"2016-09-23 15:40:45",
        "message":"[FONT=inherit]I'm buying power adapters on eBay that are most certainly not from Apple (just based on price) but I'm pretty convinced my current source is getting them from a factory in China that has the same (or extremely similar) manufacturing setup as Apple (as in they borrowed the specs from Apple and are creating perfect knockoffs.) The difference between these and other knockoffs is night and day. They look and function flawlessly. Does anyone know of a direct source for something like this? Somewhere you can buy large quantities?[\/FONT]\n\n(Business Talk might be the wrong place for this so I'm reposting it over here where it might actually get seen.)"
    },
    {
        "post_id":7229,
        "thread_id":7226,
        "title":"Power Adapter Source",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-09-23 15:50:02",
        "message":"Measure the output voltage on the pins, if it is the full rated voltage they are shitty knock off just like the rest. Original Apple ones will only enable full output voltage after being connected to the machine."
    },
    {
        "post_id":7230,
        "thread_id":7226,
        "title":"Power Adapter Source",
        "user_id":135,
        "username":"bjf",
        "post_date":"2016-09-23 16:26:09",
        "message":"Yep, bullshit. Extremely convincing, but still bullshit. Thanks for the tip. It came up with full voltage. My genuine 85W was showing around 6.5V. Too bad. I really need to find a good source for genuine adapters."
    },
    {
        "post_id":7233,
        "thread_id":7226,
        "title":"Power Adapter Source",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-09-23 16:55:02",
        "message":"There are some listed on Ebay. I have bought from someone in FL and they did send me REAL ones. Around $22 I payed when I took 100 of them, 60W ones."
    },
    {
        "post_id":7237,
        "thread_id":7226,
        "title":"Power Adapter Source",
        "user_id":135,
        "username":"bjf",
        "post_date":"2016-09-23 20:12:08",
        "message":"That sounds pretty ideal. Let me know if you happen to remember the user. I've looked and can't find anything that seems legit."
    }
]