[
    {
        "post_id":39565,
        "thread_id":39565,
        "title":"820-00165 Echo chime",
        "user_id":1464,
        "username":"Bouba148",
        "post_date":"2018-09-13 14:29:53",
        "message":"Hi RRG Team,\n\nI've bought for myself a 00165 board that had liquid damage around U6100 and U6101, Machine was turning on but get stuck on the Apple loading bar.\nsomeone already worked on it as one traces to U6101 as been reworked and also I assume that the SPI ROM U6100 had also been changed as I've read it and the serial number in the does't match which the one on the cover.\nSo I've ordered a new SI ROM with a clean ME Region. before I receved it I did a mistake: I've put back the old one BUT in the WRONG WAY, so it fried.......\n\nWhen I received the new one , I installed it, the machine turned ON but with an Echo Chime ( regarding what I've read in different topics it maybe the U0500 CPU chip ), in fact this one is getting very hot.\nAnd after few tries, the machine now even doesn't goes till the Echo Chime......\n\nAny suggestion? Should I check any other components before being sure that the CPU is dead?\n\nThanks"
    },
    {
        "post_id":39572,
        "thread_id":39565,
        "title":"820-00165 Echo chime",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-09-14 00:02:09",
        "message":"Did you try the backup again?\nSave the new chip content; even I doubt about its \"clean\" ME.\nAnd reflash with your backup..."
    },
    {
        "post_id":39574,
        "thread_id":39565,
        "title":"820-00165 Echo chime",
        "user_id":1464,
        "username":"Bouba148",
        "post_date":"2018-09-14 01:09:26",
        "message":"I can try but, already installed the same New chip from the same ebay store in another 00165 board and it worked at the first time.\nAlso i've asked that vendor to have a clean ME Region and the serial i've provided, write into it. \nAs I told you the U0500 is getting very hot. \nSo let me try and get back to you....."
    },
    {
        "post_id":39578,
        "thread_id":39565,
        "title":"820-00165 Echo chime",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-09-14 04:18:53",
        "message":"Soldering SPI chip in reverse cannot fry the CPU.\nBut if it gets very hot, is possible to be damaged by other reason, unknown at this moment...\nCheck which secondary voltages appear."
    },
    {
        "post_id":42030,
        "thread_id":39565,
        "title":"820-00165 Echo chime",
        "user_id":1464,
        "username":"Bouba148",
        "post_date":"2018-11-09 17:47:13",
        "message":"Hi 2Informaticos,\n\nI'm back with that board as I received the medusa2, I cleaned as you suggested me previously the ME Region without success.\nI have 1.801V for PPVCC_S0_CPU  is it not too hight for the CPU?\n\nI just remind before soldering the SPI chip reverse the board was \"fine\"  just needed to replace the SPI chip.\nAfter soldering reverse and seeing some fume on it,  it first started with Echo Chime  then like now: nothing except the CPU gets HOT and fan is trying to cool it down by turning at full speed."
    },
    {
        "post_id":42031,
        "thread_id":39565,
        "title":"820-00165 Echo chime",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-11-09 18:45:13",
        "message":"I don't think the MLB got damaged by soldering SPI chip at reverse.\nThe chip should be bad now, I hope you used new one...\n\nTry new BIOS dump now, or reflash with the backup.\nLet see what happens."
    }
]