[
    {
        "post_id":43594,
        "thread_id":43594,
        "title":"Does anyone here have experience fixing dell laptops?",
        "user_id":1495,
        "username":"PPVCC_S0_CPU",
        "post_date":"2018-12-18 17:33:22",
        "message":"Probably a long shot, i have a dell DA0D13MBCD1 rev d1 motherboard, initially it wasn't turning on, checked under microscope and found cap on vcore circuit was shorted, replaced and now it turns on, but do have anything on screen, after measuring around, i found that vcc_gfx_core is missing, there are no shorts on that line, google suggested it that this rails comes up when board have completed posting and usually bios is suspect behind it, i have reflashed bios many times, but its not working, if some one have experience dealing with these laptops, then please let me know what to do next."
    },
    {
        "post_id":43598,
        "thread_id":43594,
        "title":"Does anyone here have experience fixing dell laptops?",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2018-12-18 18:54:34",
        "message":"If VCore was shorted your CPU is dead. Simple as that"
    },
    {
        "post_id":43604,
        "thread_id":43594,
        "title":"Does anyone here have experience fixing dell laptops?",
        "user_id":1495,
        "username":"PPVCC_S0_CPU",
        "post_date":"2018-12-18 21:32:09",
        "message":"[QUOTE=\"JohnB8812, post: 43598\"]If VCore was shorted your CPU is dead. Simple as that [\/QUOTE]\nit wasn't vcore line but it was a capacitor on input voltage of vcore chip"
    },
    {
        "post_id":43605,
        "thread_id":43594,
        "title":"Does anyone here have experience fixing dell laptops?",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2018-12-18 21:49:34",
        "message":"Gotcha then yeah no idea on those sorry :("
    },
    {
        "post_id":43611,
        "thread_id":43594,
        "title":"Does anyone here have experience fixing dell laptops?",
        "user_id":1309,
        "username":"Inwerp",
        "post_date":"2018-12-19 00:19:21",
        "message":"any usb activity or on bios datalines? if you have a shorted cap on the main VCC rail, you should probably check all other fets and power controllers around, check if resets are being released, if you have pwr_good and gfx vcore enable and so on."
    }
]