[
    {
        "post_id":47130,
        "thread_id":47130,
        "title":"820-3662 Boots very slowly. PPBUS is 12.26V",
        "user_id":135,
        "username":"bjf",
        "post_date":"2019-03-07 17:23:18",
        "message":"This board was hit at the battery connector by liquid. It had 1.8V on SMBUS_SMC_5_G3_SCL. That is back to 3.4V but PPBUS is at 12.26V so I'm not sure what's happening with the SMC. I can't be sure, but I believe PPBUS was at 12.6V because the board was working fine but not recognizing the battery at all. Not sure what might have changed."
    },
    {
        "post_id":47132,
        "thread_id":47130,
        "title":"820-3662 Boots very slowly. PPBUS is 12.26V",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-03-07 17:55:38",
        "message":"Solve the 12.26 problem if both SMBUS lines are ok then either ISL or SMC issue it sounds like"
    },
    {
        "post_id":47135,
        "thread_id":47130,
        "title":"820-3662 Boots very slowly. PPBUS is 12.26V",
        "user_id":135,
        "username":"bjf",
        "post_date":"2019-03-08 01:20:51",
        "message":"Yes, the SMBUS lines are okay, so i'm trying to solve what signal is being sent to the ISL from the SMC reducing the voltage. I usually only see this when the SMC is not working at all. In this case the computer is actually booting, so I'm not sure what the communication is."
    },
    {
        "post_id":47139,
        "thread_id":47130,
        "title":"820-3662 Boots very slowly. PPBUS is 12.26V",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-03-08 03:02:32",
        "message":"PPBUS_G3H correct level is send by SMC to U7100 via I2C bus (SCL\/SDA lines).\nU7100 requires high level at CHGR_RST_L also.\n\nSCL is near positive line of battery connector.\nI suppose an overvoltage there, because of liquid spill.\nUsually SMC is affected, as it is the more sensitive.\n\nCheck diode mode (red probe to ground) on both lines; less than 1% difference allowed.\nIf no good, remove D7050 and check again.\nStill bad, check without U7100.\nFinally, only remains SMC."
    },
    {
        "post_id":47185,
        "thread_id":47130,
        "title":"820-3662 Boots very slowly. PPBUS is 12.26V",
        "user_id":135,
        "username":"bjf",
        "post_date":"2019-03-08 11:32:24",
        "message":"Thanks, yes, they're good. .504 for SDA and .506 for SCL. Those both have measured fine from the beginning but the voltage was 1.8V on SCL until I ran a little flux underneath the SMC and heated up the area around the SCL ball. I removed the edge bonding before doing that and was careful with the heat. That restored the 3.4V on SCL but then PPBUS dropped down to 12.26V and the computer slowed down. CHGR_RST_L is at 3.4V."
    },
    {
        "post_id":47186,
        "thread_id":47130,
        "title":"820-3662 Boots very slowly. PPBUS is 12.26V",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-03-08 11:41:34",
        "message":"That sounds to me like an SMC issue then. Probably was little screwed up to begin with from liquid."
    },
    {
        "post_id":47193,
        "thread_id":47130,
        "title":"820-3662 Boots very slowly. PPBUS is 12.26V",
        "user_id":135,
        "username":"bjf",
        "post_date":"2019-03-08 16:38:31",
        "message":"Yes, normally I would call this a dead SMC but I replaced the 3 resistors above the SMC (R5381, R5361 and R5174) and everything is good now. We'll see where it ends up after final testing, but so far so good. I've never recovered correct data line voltage by reflowing the top of the SMC but I'l be trying it more often now."
    },
    {
        "post_id":47194,
        "thread_id":47130,
        "title":"820-3662 Boots very slowly. PPBUS is 12.26V",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-03-08 16:45:00",
        "message":"When you detect corrosion near SMC is better to reball it.\nHeating it with good flux is good for diagnose usually.\nYou can leave it as is, but do not discard warranty time return..."
    },
    {
        "post_id":47198,
        "thread_id":47130,
        "title":"820-3662 Boots very slowly. PPBUS is 12.26V",
        "user_id":135,
        "username":"bjf",
        "post_date":"2019-03-08 17:06:05",
        "message":"Thanks, yeah, I wish I had time but I don't reball or replace SMC's anymore. I just have too many boards to work on. If a reflow doesn't fix it I just sell them as-is, even if I know it's just an SMC replacement or reballing.\n\nAs far as holding up, all of our repairs are for computers we bought, and we sell them all with 1-year warranties so if it's going to fail I'm sure it will happen well within that first year."
    }
]