[
    {
        "post_id":60481,
        "thread_id":59451,
        "title":"820-00840 one port stuck at 5v",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-06-04 21:30:31",
        "message":"Hello. I got a 820-00840 in that had some minor liquid damage and corrosion around the backlight output caps and the CD3215 chips. When I plugged in the app meter, it would not even turn on for either port. Found short on PP20V_USBC_XA_VBUS so I replaced U3100 and the short was gone. Now when I connect the charger to the port for U3200, it goes to 20v 0.60a, but the port for U3100 stays at 5v 0.01a and PP3V3_G3H is 0v when using this port only. PP3V3_G3H is 3.3v when connected to the other port so not sure what is happening. I have replaced U3100 3 times now with the same result each time so U3100 is not the issue. It seems like PP3V3_G3H is being shorted to ground whenever I used the usb port for U3100, but it measures .329 in diode mode. Any idea what could cause this?"
    },
    {
        "post_id":60502,
        "thread_id":59451,
        "title":"820-00840 one port stuck at 5v",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-06-05 03:19:32",
        "message":"Use the logic; you cannot have short on a rail where you get voltage from other port!\n\nNon-working port doesn't open input MOSFET probably.\nReplace that MOSFET, but check its series coil first."
    },
    {
        "post_id":60550,
        "thread_id":59451,
        "title":"820-00840 one port stuck at 5v",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-06-05 18:26:16",
        "message":"Sorry which MOSFET should I replace? There was some corrosion around Q3350, Q3360, and Q3351. I replaced all 3 but no change."
    },
    {
        "post_id":60561,
        "thread_id":59451,
        "title":"820-00840 one port stuck at 5v",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-06-06 03:50:22",
        "message":"Q3100 is the corresponding MOSFET of U3100.\nBe sure first it gets 5V on the input; check fuse and coil.\nYou can bypass it IN-OUT, only for test..."
    },
    {
        "post_id":60577,
        "thread_id":59451,
        "title":"820-00840 one port stuck at 5v",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-06-06 09:09:24",
        "message":"Yea that was it. I changed Q3100 and now I got 20v on both ports and the board boots. Thanks for the help."
    }
]