[
    {
        "post_id":55393,
        "thread_id":55393,
        "title":"820-00923 no power stuck in 20v 0amps",
        "user_id":924,
        "username":"punkieftw",
        "post_date":"2019-12-18 15:14:21",
        "message":"Hi, first let me excuse me about my very bad english. \n\nI have a retina usb-c model coming from another store, had some liquid damage but i never see that cause the first place clean that. So, they replace some components randomly i pretend. \n\nWhen the machine comes to my store, in the usb-c meter was got nothing. I replace the U7000 and restore the PP3V3_G3H. From here, all is going well.\n\nIn the firsts attempts of the machine to turn on, used to get 19v and 0.22 amps in the usb-c meter and does not turns on. later on a 8th attempt i realized some part was getting so hot. that was Q7030\/40. i get out those from the board, i measure all the pins of the Q7030\/40 looking for some short to ground, and no have any short. so, i assume this components are bad. i replace those two, and at this time only the Q7030 got hot. But no have any short, i replace that again and have the same. \n\nLater same day, and now in the USB-C meter have 20v and 0.00 amps. I got some measures and i realized i have low PPBUS 1.6v i look for a short to ground and is not shorted. Looking for this rail i have noticed the PPDCIN_G3H is missing. so, i have PP20V_USBC_XB_VBUS but i don't know where look from now. \n\nThese types of machines are very confusing. \n\nI suspect the liquid was in the u7000 area, Q7030, and U3100\/200 Because the board looks in these areas.\n\nPlease, let me know where i must look or measure.\n\nthanks in advance."
    },
    {
        "post_id":55396,
        "thread_id":55393,
        "title":"820-00923 no power stuck in 20v 0amps",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-12-18 16:35:13",
        "message":"What is the USB-C meter indication now?\nDo you get voltage at R7020?\nWhy did you change Q7030\/40 without checking them?\nIf already removed from board why didn't measure them?\nIf was liquid on CD3215 chips, is better to reball them."
    },
    {
        "post_id":55408,
        "thread_id":55393,
        "title":"820-00923 no power stuck in 20v 0amps",
        "user_id":924,
        "username":"punkieftw",
        "post_date":"2019-12-19 08:24:57",
        "message":"Hi, Thanks for ur fast answer.\n\nThe USB-C meter now indicate 20.0v and 0.00 Amps. (for a second, gets 19.9v and 0.003 Amps but just a sec).\nIn the R7020 get 0.0070v in all pins and i measure in resistance mode too, get O.L.\nI change the Q7030\/40 because those two was getting hot and i try to take out of the board to measure and look for a short.\nI can reball that CD3215 but i dont think this have some crap in his pad cause this CD3215 have this black resin under the chip."
    },
    {
        "post_id":55413,
        "thread_id":55393,
        "title":"820-00923 no power stuck in 20v 0amps",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-12-19 12:23:59",
        "message":"Really no voltage at R7020?\nHow do you get 20V on USB port then?\n3V42 and proper SMC_RESET_L signal required for that; no way if U7000 doesn't work..."
    },
    {
        "post_id":55414,
        "thread_id":55393,
        "title":"820-00923 no power stuck in 20v 0amps",
        "user_id":924,
        "username":"punkieftw",
        "post_date":"2019-12-19 12:59:26",
        "message":"When i plug in the usb-c , gets first 5v and the U7000 generates the 3v3 to power on the CD3215.. then, switches to 20v and 3.3v disappears."
    },
    {
        "post_id":55456,
        "thread_id":55393,
        "title":"820-00923 no power stuck in 20v 0amps",
        "user_id":924,
        "username":"punkieftw",
        "post_date":"2019-12-20 16:23:35",
        "message":"Hello? \n\nAny ideas?"
    },
    {
        "post_id":55457,
        "thread_id":55393,
        "title":"820-00923 no power stuck in 20v 0amps",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-12-20 17:41:17",
        "message":"Your board remains at steady 20V, with 0V at R7020?\nPost diode mode (red probe at ground) at F7000."
    }
]