[
    {
        "post_id":46417,
        "thread_id":46417,
        "title":"820-4924 no image, no CPU fan",
        "user_id":2354,
        "username":"onetailbeast",
        "post_date":"2019-02-18 15:49:59",
        "message":"Hi,\nI?ll be as brief as possible. (I am beginner)\n\n820-4924 (macbook pro early 2015)\nProblem ? no image. There was an image for a split second when opened the Lid ? then black. Restarting, pulling battery ? doesn?t help. Later tried to shine flashlight through the Logo, but was too late. By ?late? I mean after disconnecting battery 3-4 times (with nylon opening tool) now on Start laptop Chimes, cuts off Chime in the middle, restarts, Chimes, cuts off chime in the middle, restarts, Chimes, cuts off? loop.\nRemembered have Same laptop with broken LCD. Great. Swap motherboard. Did. Laptop worked for a while until I connected battery ? now second board has same issue. Suspect battery-killer, but still need to fix (now two) boards. Now will use battery from second machine.\nAlso CPU fan doesn?t spin anymore.\n\nHave heard Louis mentioned PPBUS_G3H in his videos like a gozillion times so got multimeter.\nPPBUS_G3H ? 12.4V (15.84 kOhm line resistance)\nPP3V3_S0 ? 3.3V\n\nPlease help to figure out."
    },
    {
        "post_id":46423,
        "thread_id":46417,
        "title":"820-4924 no image, no CPU fan",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-02-18 17:29:16",
        "message":"Post exact voltage for SCL\/SDA lines of battery bus; just charger, do NOT connect that battery again.\nAlso post diode mode (red probe to ground) on same lines.\n\n12.4V is strange value for PPBUS_G3H; check with other multimeter, we need to confirm real value.\n\nFan doesn't spin on the start as normal behaviour for this model."
    },
    {
        "post_id":46460,
        "thread_id":46417,
        "title":"820-4924 no image, no CPU fan",
        "user_id":2354,
        "username":"onetailbeast",
        "post_date":"2019-02-19 15:41:55",
        "message":"SCL\/SDA I've measured through R5380\/R5381 - 3.42V      diod mode - 0.340 (red on Ground)\nPPBUS_G3H from several places on motherboard still 12.4V on one multimeter and 12.6V on another      in diod mode - 0.151"
    },
    {
        "post_id":46471,
        "thread_id":46417,
        "title":"820-4924 no image, no CPU fan",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-02-19 17:07:24",
        "message":"OK, 12.6V sounds good.\nStop using the other multimeter for voltage; use it for diode mode and ohm scale.\n\nBattery bus doesn't look affected.\nBut is still possible that SMC got damaged.\nClean the battery connector as best as possible.\nBetter to remove it and inspect for liquid sign under it.\n\nAt least one board is half-dead now.\nConnect charger and battery, post SCL\/SDA voltages.\n\nBe aware, never connect\/disconnect battery when charger is plugged in."
    },
    {
        "post_id":46474,
        "thread_id":46417,
        "title":"820-4924 no image, no CPU fan",
        "user_id":2354,
        "username":"onetailbeast",
        "post_date":"2019-02-19 17:50:30",
        "message":"with battery and charger plugged in - voltage on SCL\/SDA is same - 3.42V \/ 3.41V"
    },
    {
        "post_id":46475,
        "thread_id":46417,
        "title":"820-4924 no image, no CPU fan",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-02-19 17:56:00",
        "message":"Seems that there is nothing wrong with battery.\nAt least doesn't generate overvoltage on its bus.\nBut connect\/disconnect it several times, could affect SMC...\n\nMachine still restart if starts in SMC bypass mode?\nPRAM reset done?"
    },
    {
        "post_id":46479,
        "thread_id":46417,
        "title":"820-4924 no image, no CPU fan",
        "user_id":338,
        "username":"arnonabuurs",
        "post_date":"2019-02-19 20:45:27",
        "message":"I just got one with the same issue. Note that the fan does not spin, only after a temperature treshhold is reached. Try change display cable, they always fail for this model. Did the trick for me just now. 50% of all display issues with 4924 are display cable. Easy to swap and test.  Many people replace the display while it is only the cable, did that for 2 years so I have a nice stock of working displays now ;)"
    },
    {
        "post_id":46490,
        "thread_id":46417,
        "title":"820-4924 no image, no CPU fan",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-02-20 01:28:09",
        "message":"MLB supposed to be checked on the desk alone, without LCD connected.\nIf doesn't restart, then LCD issue; or other accessories issue."
    },
    {
        "post_id":46532,
        "thread_id":46417,
        "title":"820-4924 no image, no CPU fan",
        "user_id":2354,
        "username":"onetailbeast",
        "post_date":"2019-02-20 20:51:39",
        "message":"You might not remember beginning of the thread (as you help more then just me). There are two identical macbooks. Problem started in #1. #2 I just happen to have with broken screen. So after testing lines (with your help) I suspect the culprit to be battery #1 (which you told me NOT to connect any more) so I am testing macbook #1 with battery #2. So far it is working. Tomorrow will play a non stop movies on youtube to see if macbook survives with charger plugged in and without.\nThank you very much for your help. Hope to have new questions for you soon.\nSay Hi to Louis please."
    },
    {
        "post_id":46533,
        "thread_id":46417,
        "title":"820-4924 no image, no CPU fan",
        "user_id":2354,
        "username":"onetailbeast",
        "post_date":"2019-02-20 20:53:52",
        "message":"[B][URL=\"https:\/\/boards.rossmanngroup.com\/member\/338-arnonabuurs\"]arnonabuurs - [\/URL][\/B][COLOR=#000000]thank you for the tip. Noted.[\/COLOR]"
    }
]