[
    {
        "post_id":25726,
        "thread_id":25726,
        "title":"820-2396 dead smc?",
        "user_id":170,
        "username":"rob777",
        "post_date":"2017-09-20 21:48:17",
        "message":"820-2396 has green light. Seemed to of charged a dead battery. Zero evidence of liquid damage. Won't turn on. \nPpbus g3h is 12.4v\nsmc_reset_l is high at 3.4v\n\nim guessing this is why we are not turning on. I tried shorting it to ground as I assume that would be like doing an smc reset but no change in anything. \nFigure I have to figure out smc_reset_l before going any further. \nIs it more likely a faulty smc causing this high reading or U5010 which as far as I can tell is working as it should. \nThanks."
    },
    {
        "post_id":25729,
        "thread_id":25726,
        "title":"820-2396 dead smc?",
        "user_id":637,
        "username":"TCRScircuit",
        "post_date":"2017-09-20 23:00:09",
        "message":"What does the L mean on SMC_RESET_L? In otherwords, the SMC is being held in reset mode if it is Low (Hence the L). 3.4 is normal. PPBUS is a little low. What is reistance between pins 17\/18 and 27\/28 of the ISL? (U7000)"
    },
    {
        "post_id":25752,
        "thread_id":25726,
        "title":"820-2396 dead smc?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-09-21 16:51:06",
        "message":"Battery indicator working? Checked all rails for short? Voltage on C1802\/03? PP3V3_S5?"
    },
    {
        "post_id":26330,
        "thread_id":25726,
        "title":"820-2396 dead smc?",
        "user_id":170,
        "username":"rob777",
        "post_date":"2017-10-04 00:40:42",
        "message":"Ok sorry the delayed reply, this got pushed to the side seeing as though it’s a personal goal.\nUnderstand the smc reset L now. My understanding of it was reversed. \nSo made a mistake. Went to measure resistance of pin 17\/18 of the ISL. Charger was still plugged in and I made smoke.. Pads 16\/17\/18 all disinter-grated. I have an ISL from another board on the there with jumpers made.\nI get a green light, no orange light and laptop won’t power on.\n\n\nNow to answr the questions.\nResitance over pin 17\/18 is 1.6k ohms.\nPin 27\/28 is 20.3 ohms\nPPBUS_G3h is 12.5v with charger plugged in 11.3v battery only\nSMC_BC_ACOK is back and 3.4v\nPP3V42_G3H is 3.4v\nBattery indicator is working\nC1802 is 3.4v as is C1803\n\nAnd there you go. Just found PP3v3_s5 all over the place. It  drops from 3 to 0 and everything in between. \n\nGoing to go look at that now. Thanks for the questions Duke. I’ll write back if\/when I get stuck next!"
    },
    {
        "post_id":26342,
        "thread_id":25726,
        "title":"820-2396 dead smc?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-10-04 05:54:22",
        "message":"Resitance over pin 17\/18 is 1.6k ohms, tell me what is wrong about that..."
    },
    {
        "post_id":26386,
        "thread_id":25726,
        "title":"820-2396 dead smc?",
        "user_id":170,
        "username":"rob777",
        "post_date":"2017-10-04 22:32:52",
        "message":"I think it should be about 3ohms shouldn’t it?? \nAnyway its a piece of shit this thing. Pin 2 R7052 beeps to ground. \nRemoved R7050 and pin 4 still beeps to ground. \nSo CHGR_CSO_R_N goes to ground yet R7052 and R7050 are off the board. U5420 isn’t on board so how on earth does it connect to ground I have no idea."
    },
    {
        "post_id":26401,
        "thread_id":25726,
        "title":"820-2396 dead smc?",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-10-05 03:49:41",
        "message":"With 820-2396 I assume you meant 820-2936?\n\nAlso with the voltage measurement of PPBUS_G3H in your previous post was that before you made the mistake or after?\n\nAre you sure the U7000 is ok? Since that is the only way to ground with R7050 and U5420 not on the board without it being a internal short. How much resistance is there in Ohm?"
    },
    {
        "post_id":26409,
        "thread_id":25726,
        "title":"820-2396 dead smc?",
        "user_id":170,
        "username":"rob777",
        "post_date":"2017-10-05 05:34:38",
        "message":"Appreciate the reply man. Yes 2936 is what I meant sorry.\n\nAfter I made the mistake I took those measurements. I have pretty much given up on this though, it's a mind fucking rabbits hole I've concluded.\n\nU7000 isn't even on the board, neither is C7050, R7051 or R7052. R7050 is also off the board.\n\nWhen I touched ground and pin 2 pad of R7051 and R7052 it would beep. When I touched on R7050 and ground it would also beep. Something else has obviously happened since I took those measurements, as even the other side of F7040 beeps now.. I figured the line is shorted inside the board layers so I cut the via's to the pads on R7050,R7051,R7052. Pads no longer beep. I start putting it all back together with jumpers and notice that those lines beep to ground again. WTF. This whole time I'm also testing against another board (although dead) and having different and as expected results.\n\nCurrently there is no u7000 on the board or R7050. Nothing beeps to ground in that area anymore. I put R7050 back on, it beeps. I take it off it doesn't, I take one from another board, test continuity of R7050 before putting on and no beep. Put it on, touch ground and it beeps. Take it off and pads don't beep but R7050 now does. \n\nAnd that was it. I went home for the night. I have 12 iPhone touch ic's waiting for me in the morning. May as well stick to what I know, doubt I'll be looking at it again. I reckon that 'mistake' fucked it big time. It only cost me $40 anyway.\n\nCheers"
    },
    {
        "post_id":26413,
        "thread_id":25726,
        "title":"820-2396 dead smc?",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-10-05 06:45:51",
        "message":"The resistor R7050 is not going to ground so you probably have a short on one of the other pins. Its a very low resistance resistor for current measuring so it pretty much functions like a wire between all the 4 pins.\nNot sure what you're doing\n\nAgain what is the resistance in Ohm to ground on all pins with and without the resistor on there? (8 separate measurements)"
    },
    {
        "post_id":26432,
        "thread_id":25726,
        "title":"820-2396 dead smc?",
        "user_id":296,
        "username":"jadao",
        "post_date":"2017-10-05 13:57:43",
        "message":"Probably short from system side (F7040 pin 2 side) or battery circuitry (C7055-56-57 and Q7055)?\n\nWith R7050 on the board, you can simply inject 1 or 2 volts where you find a short and see if something heat."
    },
    {
        "post_id":26494,
        "thread_id":25726,
        "title":"820-2396 dead smc?",
        "user_id":170,
        "username":"rob777",
        "post_date":"2017-10-06 19:56:16",
        "message":"So with R7050 off the board, F7040 on the board and no U7000 I get OL on all pins except pin 1 which is 144ohms.\nWith R7050 on the board it is 144ohms across all pins."
    },
    {
        "post_id":26496,
        "thread_id":25726,
        "title":"820-2396 dead smc?",
        "user_id":170,
        "username":"rob777",
        "post_date":"2017-10-06 20:08:57",
        "message":"With no F7040 I get between 25 and 30ohms across all pins and Pin 2 F040 gets 144ohms.\n\nSo short from system side then?"
    },
    {
        "post_id":26497,
        "thread_id":25726,
        "title":"820-2396 dead smc?",
        "user_id":170,
        "username":"rob777",
        "post_date":"2017-10-06 20:16:11",
        "message":"Upon injecting voltage Q7035 gets very very hot so will change that next"
    },
    {
        "post_id":26498,
        "thread_id":25726,
        "title":"820-2396 dead smc?",
        "user_id":296,
        "username":"jadao",
        "post_date":"2017-10-07 02:23:09",
        "message":"It makes sense that Q7035 is shorting to ground, it's attached to pin 1 R7050. Replace it and check. I had sometimes to replace both Fets q7035 q7030 and ISL.\n\nNow, for system side I don't know if résistance 140ohms to ground on pin2 F7040 (fuse removed) is low or normal. I know in diode mode wit fuse on board it should be something like 0.4xx."
    },
    {
        "post_id":26548,
        "thread_id":25726,
        "title":"820-2396 dead smc?",
        "user_id":170,
        "username":"rob777",
        "post_date":"2017-10-08 22:40:04",
        "message":"Replaced Q7035, Q7030 another u7000 from donor board. \nPin 27\/28 is 20.1ohm\nPin 16\/17 is 2.9ohms\nthere is 16v on pin 2 U7000\n0v on pin 3 U7000 \nsmc_bc_acok is missing again too\nand ppbus_g3h is now 0.5v\n\ni replaced u7000 three times. All from donor board. Does anyone wanna help me persist with this otherwise I have to give up unfortunately."
    },
    {
        "post_id":26552,
        "thread_id":25726,
        "title":"820-2396 dead smc?",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-10-09 01:03:28",
        "message":"Alright so think about it, Pin 3, CHGR_ACIN is 0v... Thats not right\nWhats the voltage of PPDCIN_G3H? Check R7010 and R7011 voltage dividers, R7010 is most likely closed or ISL6259 is pulling it down.\n\nBy the way I can recommend having a spool of new ISL6259 because you will be replacing this on more devices in the future. Saves the trouble with shitty donor boards."
    }
]