[
    {
        "post_id":57469,
        "thread_id":57469,
        "title":"820-00840-A Not turning on. Different voltages depending on which USBC port is used.",
        "user_id":22870,
        "username":"joshAU",
        "post_date":"2020-03-12 16:49:28",
        "message":"Hi All. \nFirst post....\nI've got a Macbook Pro in for repair that is not turning on, with no fans or other signs of life.\n\nNo signs of any water damage, or of any physical damage. \n\n\nI've tried it with a known good USBC charger. \n\n[B]PP3V3_S5 appears shorted, with resistance to ground being 0.5 Ohms.[\/B]\n\nThe unit gets differing voltages on some rails, depending on which USBC port has power connected. \n\neg, with power connected to the rear USBC port:\n\nPPBUS_G3H 1.67v\nPPDCIN_G3H_SNS 5.14v\nPP5V_S5 0v\nPP3V3_G3H 2.26v\nPP3V3_S5 0v\n\ncompared to when power is connected to the front USBC port:\n\nPPBUS_G3H 3.37v\nPPDCIN_G3H_SNS 3.50v\nPP5V_S5 0v\nPP3V3_G3H 0.03v\nPP3V3_S5 0v\n\nI'm not familiar with USBC charging, but from my understanding there should be 20V on both USBC ports?\n\nHaving a read and watching a few videos, including the video on this site titled \"5v instead of 20v on USB-C charger\"\nI was guessing the issue could be the U7000 chip, or one of the two USBC chips - U3100\/U3200, but am not experienced enough to tell for sure.\nHowever, given PP3V3_S5 is shorted, and that line doesn't go to any of those 3 chips, I guess that may not be correct.\n\n\nResistance to ground:\nPPBUS_G3H 192.8 Ohms\nPPDCIN_G3H_SNS 125K Ohms\nPP5V_S5 73.8K Ohms\nPP3V3_G3H 17.2 Ohms\nPP3V3_S5 [B]0.5 Ohms[\/B]\n\n\nAny suggestions of likely causes\/things to check first first?\nAny help greatly appreciated. \nThank you."
    },
    {
        "post_id":57472,
        "thread_id":57469,
        "title":"820-00840-A Not turning on. Different voltages depending on which USBC port is used.",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-03-12 17:38:41",
        "message":"First of all, welcome to the forum!\n\n\"PP3V3_G3H 17.2 Ohms\"\nThis is very low too.\nThis could be caused by U3100\/200.\n\nYou have problems in USB-C controllers area for sure.\nBecause you get different behaviour, depending which port is connected.\n\nThe big problem is the short on 3V3_S5.\nSMC is connected on both mentioned voltages and could be bad too.\nEasy to find the culprit injecting voltage on 3V3_S5 power rail.\n\nDon't forget to take a look at USB-C redriver chip; not present in schematic, nor boardview.\nIf you don't know what I mean, do a forum search for \"redriver chip\", a recent post should pop up."
    },
    {
        "post_id":57477,
        "thread_id":57469,
        "title":"820-00840-A Not turning on. Different voltages depending on which USBC port is used.",
        "user_id":22870,
        "username":"joshAU",
        "post_date":"2020-03-12 18:30:09",
        "message":"Thanks 2informaticos.\nI appreciate the welcome, and the advice.\n\nI'm trying to locate the source of the 3V3_S5 short.- hoping its one of the caps on the line.\nI just got a variable bench power supply.\nWhats the max safe volt to inject on that line?"
    },
    {
        "post_id":57485,
        "thread_id":57469,
        "title":"820-00840-A Not turning on. Different voltages depending on which USBC port is used.",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-03-13 02:48:42",
        "message":"Less than 4V in any case.\nBut not sure if something heats there, as not so low value for such voltage.\nRemove first the CD3215 where 3V3_G3H drops to 0.003V.\n\nAnd please use schematic names when you refer to a component.\nLeft\/right and front\/back doesn't help to find a component in schematic..."
    }
]