[
    {
        "post_id":65046,
        "thread_id":59999,
        "title":"820 2849 kernel panics",
        "user_id":1104,
        "username":"Jay",
        "post_date":"2020-09-11 20:46:21",
        "message":"Howdy,\nI know of the 15\" 2010 model that has a simple fix replacing C9560 but now I have a 17\" 2010 model with kernel panics.\nC9560 on the 17\" is not 330µF so can't try to replace that one but before I start looking for a good replacement cap to try out (if not C9560 then whatever the 17\" equivalent may be), does the 17\" suffer the same issue as the 15\" or should I not bother and keep looking for another cause?"
    },
    {
        "post_id":65054,
        "thread_id":59999,
        "title":"820 2849 kernel panics",
        "user_id":1057,
        "username":"piernov",
        "post_date":"2020-09-12 06:02:51",
        "message":"The 2849 doesn't suffer from the common failure of C9560 on 2850, but there could always be a randomly failing tantalum capacitor anyway.\nMake sure it's not a software issue and paste the full kernel panic log."
    },
    {
        "post_id":65058,
        "thread_id":59999,
        "title":"820 2849 kernel panics",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-09-12 06:23:28",
        "message":"You should discard HDD and software first.\nAlso run corresponding ASD and see if any error pops up.\nYou may need to run ASD OS version, as EFI version will not properly check GPU.\nRun Unigine test in macOS at least."
    },
    {
        "post_id":65176,
        "thread_id":59999,
        "title":"820 2849 kernel panics",
        "user_id":1104,
        "username":"Jay",
        "post_date":"2020-09-13 18:44:01",
        "message":"When booting from the internal drive, it either hangs at the Apple logo, logo + bar or shuts off.\nAlt-boot shows me the boot picker and I can select an external drive no problem but once it starts loading the OS (any OS), same problems, this includes ASD."
    },
    {
        "post_id":65183,
        "thread_id":59999,
        "title":"820 2849 kernel panics",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-09-14 00:35:50",
        "message":"Looks like board gets stuck when switch to GPU.\nCheck if you can load Windows Live USB.\nIf you can, this confirms GPU issue; as its driver is not loaded in this case."
    },
    {
        "post_id":65308,
        "thread_id":59999,
        "title":"820 2849 kernel panics",
        "user_id":1104,
        "username":"Jay",
        "post_date":"2020-09-16 20:31:43",
        "message":"Been looking around but don't have a clear picture of where i can find that windows live to make a USB from.\nAssuming it is GPU related, which component would I go after to see if it's the same problem that affects the 15\" models?"
    }
]