[
    {
        "post_id":78067,
        "thread_id":61474,
        "title":"820-3437",
        "user_id":29940,
        "username":"andrespi",
        "post_date":"2021-07-23 12:55:07",
        "message":"hello this board have corrosion in pad test point near r1915 and r1916, this test point disappeared due to corrosion,This test point is linked to the smc, it is possible to make a bridge save the board.\n\n\nen español(si eres de españa me entiendes mejor)\nesta placa tiene un problema de corrosion en un punto de prueba, pero este punto de prueba desaparecio debido corrosion, no veo la forma de hacer un puente ya que este test point va unido a un punto debajo del smc, por lo tanto r1915 no va quedar unido al smc a ni tampoco las señales que van al punto de prueba van estar unidas al smc o me equivoco; o la solucion es colocar un puente de r1916 hasta el punto debajo smc .espero que me entiendas mi pregunta :("
    },
    {
        "post_id":78068,
        "thread_id":61474,
        "title":"820-3437",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-07-23 13:41:25",
        "message":"Nada de SMC; alli es la señal de 24MHz para PCH.\n\nSi notas el punto de la pista interna justo debajo del test point, intenta soldar un hilo muy fino (0.01-0.05mm) hasta los dos resistores.\nSi no ves rastro de una pista interna, quizas que vaya al PCH directamente de los resistores; tendrias mucha suerte en tal caso.\nLa presencia de una oscilacion de 24MHz significaria que el PCH esta bien conectado entonces.\n\nI hope you understand me..."
    },
    {
        "post_id":78070,
        "thread_id":61474,
        "title":"820-3437",
        "user_id":29940,
        "username":"andrespi",
        "post_date":"2021-07-23 15:17:44",
        "message":"te refieres a raspar el test point hasta encontrar una pista interna y soldar un hilo al resistor?.Aqui una imagen"
    },
    {
        "post_id":78072,
        "thread_id":61474,
        "title":"820-3437",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-07-23 15:33:42",
        "message":"Al limpiar con alcohol, deberis ver la punta de esa pista, si va por alli.\n\nCheck for24MHz with o-scope; if present, don't do anything."
    }
]