[
    {
        "post_id":16776,
        "thread_id":16776,
        "title":"[SOLVED] 820-3115, F9700 Keeps Blowing",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-03-17 11:07:34",
        "message":"Not really sure how to proceed with this one:\n\n820-3115 with no backlight. F9700 measured OL, replaced and still no backlight. Measured F9700 again, and it was OL again, and blown. This is with known-good test assembly and good LCD assembly. Removed F9700 and checked pin 1 with LCD plugged in, and it measures 12.54v. Not really sure what could be pulling voltage through F9700 to blow it?\n\nHaven't encountered this before, so I replaced LP8550 to be safe, and no luck, F9700 still blows. PPBUS_G3H measures normally with no shorts.\n\nAny advice on how to proceed is appreciated, thanks!"
    },
    {
        "post_id":16777,
        "thread_id":16776,
        "title":"[SOLVED] 820-3115, F9700 Keeps Blowing",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2017-03-17 11:09:06",
        "message":"Have you measured resistance to ground once on the backlight rail before replacing fuses?\n\nReplacing backlight fuse without checking resistance to ground on output is like running into the tunnel that the roadrunner paints for the coyote on the side of the mountain and repeatedly running into it and falling down.\n\nUse diode mode to make it easy, red probe on ground, black probe on pin 21\/22 of LCD connector."
    },
    {
        "post_id":16778,
        "thread_id":16776,
        "title":"[SOLVED] 820-3115, F9700 Keeps Blowing",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-03-17 11:20:50",
        "message":"Hey Louis,\n\nThanks. Yeah, there's a short to ground on pins 21\/22 of LCD connector (.001), but pins 1 and 2 of F9700 read .418 and .748, respectively. I didn't even check at the LCD connector initially, definitely an oversight on my part--thanks! Certainly something's up there; went to pull C9797 and it cracked away from the solder--clearly defective. Replaced and all is well. Backlight restored.\n\nThanks, Louis!"
    },
    {
        "post_id":16782,
        "thread_id":16776,
        "title":"[SOLVED] 820-3115, F9700 Keeps Blowing",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2017-03-17 11:45:36",
        "message":"q9806 doesn't open until the machine turns on. you won't see the short to ground after the fuse."
    }
]