[
    {
        "post_id":72496,
        "thread_id":60869,
        "title":"820-01041 Stuck at 20v 0.04A",
        "user_id":3199,
        "username":"JdYoda",
        "post_date":"2021-03-01 21:18:27",
        "message":"Hi. First of all sorry for my non-perfect english.\nI have a problem with A1990 mac. It came with a corrosion on C9081 and line PPBUS_G3H_SSD1_SNS was shorted which is a very common issue on that model. After removing shorted cap mac booted and worked stable for 2 weeks, but now it returned back. Not turning on.\n   All 4 CD3215 works good, all LDOs is present, charger switching to 20 volts, but taking just 0.04-0.06 amps\nMac can be detected in DFU mode by apple configurator, but reviving and restoring ends up with an error\n\nBut most weird thing is that after i plug in the charger and than plug it off - PPBUS_G3H is shorted for 2-3 seconds, and then goes back to normal value 0.44 in diod mode. If i plug in charger again - voltage for ppbus is 12.6, whitch is seems to be a bit low. After unplugging the charger ppbus is shorted for 2-3 seconds, and goes back to normal again. I feel very confused and can not understand how is it possible that short circuit can be present and than gone by itself in couple seconds\n\nAny ideas folks?"
    },
    {
        "post_id":72502,
        "thread_id":60869,
        "title":"820-01041 Stuck at 20v 0.04A",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-03-02 02:25:58",
        "message":"First of all, welcome to the forum!\n\nThere is no short at all.\nAllow few seconds after power is removed, before measure ohm scale, or diode mode.\nLet time to discharge remanent voltage stored on the caps.\n\nYou probably have SSD problem, if liquid spilled on its area.\nDFU ends with error if T2 cannot access SSD.\nCheck diode mode to ground on all power rails of SSD."
    },
    {
        "post_id":72515,
        "thread_id":60869,
        "title":"820-01041 Stuck at 20v 0.04A",
        "user_id":3199,
        "username":"JdYoda",
        "post_date":"2021-03-02 04:13:56",
        "message":"Thanks for greetings!\n\nYou were right, there was a short on PP5V_S4_X_USBC. C3508 was removed, short is gone, but nothing changed, still 20v 0.05 amps, PPBUS_G3H 12.6v. SSD power lines is not shorted. And PP5V_s4 is missing, S5 is present and stable. Also i found out that PP3V3_TBT_X_SX is missing as well, and it comes out from CD3215. Is it possible that CD3215 is damaged because there was a short on PP5V_S4_X_USBC which goes directly to CD3215? All 4 LDOs (3.3, 1.8, 1.8, and 1.1) is present on all 4 CD3215"
    },
    {
        "post_id":72516,
        "thread_id":60869,
        "title":"820-01041 Stuck at 20v 0.04A",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-03-02 04:28:03",
        "message":"PP3V3_TBT_X_SX  should appear only when external device is connected.\n\nIf cannot finish DFU correctly, there is something wrong with T2, or SSD.\nBe sure no short on any other secondary voltage."
    }
]