[
    {
        "post_id":25375,
        "thread_id":25375,
        "title":"820-2530 turns on but no video or chime anymore",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2017-09-14 22:46:05",
        "message":"I just had a post on here a couple days ago with this board not turning on. Here is the link to it \n[url]https:\/\/www.rossmanngroup.com\/boards\/forum\/board-repair-troubleshooting\/25072-solved-820-2530-no-green-light-or-s3-s0-rails[\/url]\n\nIts been a few days because I had to order another dc-in board for this since my test one doesn't look that great even though it works fine. I put 2 different dc-in boards and put the board in the housing plugged in the battery and everything. When I hit the power button the fans spin but I got no video or chime.\n\nI checked and there was 0v on Pin 1 of U9000 so no screen is detected.  I even plugged in another known working screen and that didn't work either. \nHere are some measurments I got and things I've tried doing to fix this.\nCPU Vcore - 1.15v\nC7771 voltage - 1.06v\nResistance to ground on pp3v42_g3h - 5.4kohms (Dead MCP??? What could cause it to die so soon after working - I tried heating MCP then turning on but that didn't work.)\nSMC\/PRAM reset\nRemoved Ram sticks and got beeps\nUSB Mouse lights up\nThe DC-IN connector didn't look to great on the Adapter_Sense pin. I've tried removing Dc-in board and plugging battery in and turning on with keyboard but that still didn't work."
    },
    {
        "post_id":25390,
        "thread_id":25375,
        "title":"820-2530 turns on but no video or chime anymore",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2017-09-15 09:39:14",
        "message":"If MCP vcore present? If it is and there is no obvious corrosion I would vote bad MCP79"
    },
    {
        "post_id":25404,
        "thread_id":25375,
        "title":"820-2530 turns on but no video or chime anymore",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-09-15 13:43:47",
        "message":"5.4K on 3V42 is too low :("
    },
    {
        "post_id":25409,
        "thread_id":25375,
        "title":"820-2530 turns on but no video or chime anymore",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2017-09-15 13:57:37",
        "message":"I have 1v on MCP vcore so I guess the mcp is the issue. The time when it worked I believe was after it came out of the oven after a cleaning so maybe that's why it turned on."
    }
]