[
    {
        "post_id":101527,
        "thread_id":64197,
        "title":"A1278 820-2936 adapter_sense open line to ground, and then not",
        "user_id":55318,
        "username":"CaptOnH2O",
        "post_date":"2023-09-13 23:34:35",
        "message":"TLDR: system would boot but no chime, no screen, only fan spinning up to high speed after 1-2 minutes. Isolated logic board showed expected voltages except ADAPTER_SENSE (0V and unexpected OPEN LINE to Ground when unpowered). Problem resolved after several minutes of rest. Should I consider replacing a chip that's on its way to failing?\n\nDETAILS\nI'm working on the same system mentioned in [URL='https:\/\/boards.rossmanngroup.com\/threads\/solved-a1278-820-2936-a-only-0-3v-on-adapter-sense-pin.64156\/#post-101360']this post[\/URL]. After about a week running stable, I eventually removed the drive (SATA SSD) to scan for issues and do a fresh OS install. **Possible mistake during reassembly - see below** Upon boot up, the system chimed but no screen activity and fan went from normal to fast after 1-2 minutes. I forced a shutdown to not risk thermal damage. Waited and retried - no chime, no screen, fan went from normal to fast after 1-2 minutes. Tried to reset NVRAM and SMC; no indication of success, no chime, no screen, fan went normal then fast after a minute or so. Removed the logic board, checked voltages and resistance...\n\n**Possible mistake**\nDuring disassembly, I noticed a piece of thin metal from the display cable retainer (pictured) was lose laying between the frame and logic board near R6929.\n\n(from rough memory)\nPP3V42_G3H ~3.5V\nPP3V3_S0 ~3.5V\nSMC_BC_ACOK ~3.5V\n[U]Unexpected find [\/U]=> ADAPTER_SENSE (@J6900, R6900, U6900) 0V and test to ground shows OPEN LINE\n\nAfter a while of checking voltages and resistance with nothing else out of the ordinary (limited in my knowledge), I took a break, came back and ADAPTER_SENSE is now showing 40k resistance. Reassembled system, boots as if nothing ever happened.\n\nIs this the sign of a chip starting to fail? Anything I should try or check?"
    },
    {
        "post_id":101528,
        "thread_id":64197,
        "title":"A1278 820-2936 adapter_sense open line to ground, and then not",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-09-14 01:00:15",
        "message":"Checking in ohm scale doesn't help too much.\nYou should check in diode mode (red probe on ground) and compare with good board.\n\nADAPTER_SENSE will have same voltage as SYS_ONEWIRE, when U6900 is enabled; so be sure R6929 is good first.\nU6900 only joins INT\/EXT pins, to allow SMC <-> Magsafe communication."
    }
]