[
    {
        "post_id":18136,
        "thread_id":18136,
        "title":"Way to prevent board from failing Serial Number Format Verification?",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-04-10 12:55:56",
        "message":"Occasionally, I'll encounter a board for a customer that is not repairable. It either has an internal short, bad RAM slots (both), etc. In these cases, I tell the customer I can just sell them a refurbished board of the same model and pay them X amount for trade on their old board. Well, I've had a few customers who were concerned about keeping their serial numbers in tact. These are usually retail-level stores, and I tell them I can just pull the serial\/MLB numbers from the bad\/dead board, switch the stickers over, etc., and they can keep their serials. No biggie.\n\nBut, as you know, these boards will now fail the \"Serial Number Format Verification Test\" in ASD; I don't think it really \"matters\" that a board fails this, because the serial shows normally in OSX and the machine works just fine, but is there an extra step to take to ensure the board won't fail this test? Is there any harm in the board not passing this test? I.e., will it cause any verification issues with the App Store, or FaceTime\/Messages, etc? \n\nI haven't had any issues in the past with it, but wanted to confirm before sending off this latest board where the customer wanted to maintain their serial number. Board doesn't have AppleCare or anything (it's a 2012 pre-retina model). Thanks!"
    },
    {
        "post_id":18145,
        "thread_id":18136,
        "title":"Way to prevent board from failing Serial Number Format Verification?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-04-10 16:14:23",
        "message":"Dunno if it affects anything. You need to copy over a whole bunch more of the original BIOS. I never messed with it, but it seems there is some signature that is used. Put both files in hex editor and compare. But really just don't mess with it, why care about a serial number?"
    }
]