[
    {
        "post_id":33447,
        "thread_id":33447,
        "title":"820-3662 Burning MagSafe",
        "user_id":1404,
        "username":"jamiehorn1",
        "post_date":"2018-04-09 11:29:14",
        "message":"Hi everyone,\n\ni have a strange board in at the minute which ive never experienced before. \n\nWhen a magsafe adapter is connected it ends up burning out the two end pins on the MagSafe board and kills the charger.\n\na little reluctant to plug in my charger as they are so bloody expensive!\n\nThe customer has been using both genuine and non genuine chargers.\n\nwhen I connect a MagSafe with the PSU at 18.5v it just spins the fan and stops temporarily then spins again.\nthe board looks fine, no signs of liquid of burnt components. Fuse looks perfect.\n\nany ideas that you can think of? Could this be as simple as a MagSafe board?\n\nThanks!"
    },
    {
        "post_id":33474,
        "thread_id":33447,
        "title":"820-3662 Burning MagSafe",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-04-10 06:04:11",
        "message":"Just a dead magsafe board from a shit China charger. But the fan spinning and then off and on again is NOT a good sign! Using an 85W charger?"
    },
    {
        "post_id":33481,
        "thread_id":33447,
        "title":"820-3662 Burning MagSafe",
        "user_id":1404,
        "username":"jamiehorn1",
        "post_date":"2018-04-10 07:05:23",
        "message":"Thought that might be the case. I will test with the known good MagSafe board. \nYes it’s a 85W tip wired up to the PSU, should the voltage input be set at 18.5 or 20V? I notice on the schematic it says 20V not 18.5 so that could be why the machine is not powering up normally."
    },
    {
        "post_id":33483,
        "thread_id":33447,
        "title":"820-3662 Burning MagSafe",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-04-10 07:56:29",
        "message":"Not 100% sure but 18.5V is fine I think."
    },
    {
        "post_id":33486,
        "thread_id":33447,
        "title":"820-3662 Burning MagSafe",
        "user_id":1404,
        "username":"jamiehorn1",
        "post_date":"2018-04-10 08:20:20",
        "message":"Great thanks for the help! May as well mark this as solved, just wanted a second opinion??"
    }
]