[
    {
        "post_id":18198,
        "thread_id":18198,
        "title":"[SOLVED]Advice needed on trackpad issue",
        "user_id":681,
        "username":"iambehr",
        "post_date":"2017-04-11 15:31:43",
        "message":"I have a 2015 15\" MBPr that had tea spilled in it. \nThe trackpad works but the \"click\" is very soft - I suspect that some of the tea got in to the trackpad. I tested with a good trackpad, and it \"clicks\" much better.\n\nIs it worth trying to dig the trackpad out? Has anyone had any luck removing the battery without destroying it? Does anyone know enough about the force touch trackpads to recommend a fix?\n\nThanks,\n\nStefan"
    },
    {
        "post_id":18199,
        "thread_id":18198,
        "title":"[SOLVED]Advice needed on trackpad issue",
        "user_id":375,
        "username":"gcain",
        "post_date":"2017-04-11 15:39:04",
        "message":"I remove the batteries from the newer MBPs fairly often, and have never had a problem.\n\nUse a thin art spatular and pour a bit of IPA as you work along.\n\nThen I use 3m double sided adhesive to stick the battery back in, or it rattles."
    },
    {
        "post_id":18207,
        "thread_id":18198,
        "title":"[SOLVED]Advice needed on trackpad issue",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-04-11 15:56:35",
        "message":"Try cleaning the edges first. I do it with a toothbrush and water, then suck it out with the vacuum cleaner. Don't use too much water of course."
    },
    {
        "post_id":18801,
        "thread_id":18198,
        "title":"[SOLVED]Advice needed on trackpad issue",
        "user_id":681,
        "username":"iambehr",
        "post_date":"2017-04-20 14:17:19",
        "message":"Just wanted to say this was resolved. It was the freaking trackpad cable."
    },
    {
        "post_id":18810,
        "thread_id":18198,
        "title":"[SOLVED]Advice needed on trackpad issue",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-04-20 15:15:47",
        "message":"I see you resolved this, but it's worth mentioning as well that the ForceTouch trackpads have an incredibly light \"click\" anyway. I'm sure you know that already, especially if you resolved it, but they don't travel near as much as the pre-2015 models."
    }
]