[
    {
        "post_id":41226,
        "thread_id":41226,
        "title":"Macbook 2016 and up display issues",
        "user_id":338,
        "username":"arnonabuurs",
        "post_date":"2018-10-25 23:49:17",
        "message":"Hi Guys, just posting this out here to see if anyone of you have the same issue. Ive had already like 10-15 people come in with Macbook 12 inch, non touchbat and touchbar who get lines in the display as seen in attached pic. After replacing the display the lines are gone only for the same people to come back few weeks later with new lines in the display. Its becoming xpensive to service this crap. Any of you have these same issues and anyone has an idea what causes this? Bad cables same as the 13 inch 2015, that are glued in now? Or logic board issues> Any ideas let me know.\n\nEdit: the lines usually appear in the top or bottom of the display, no damaged to the housing or display!"
    },
    {
        "post_id":41233,
        "thread_id":41226,
        "title":"Macbook 2016 and up display issues",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-10-26 01:44:00",
        "message":"This looks like LCD problem, not generated by cable, or MLB.\nThe TFT matrix lines get broken, near the edge of the display; maybe shock, or corrosion..."
    },
    {
        "post_id":41234,
        "thread_id":41226,
        "title":"Macbook 2016 and up display issues",
        "user_id":338,
        "username":"arnonabuurs",
        "post_date":"2018-10-26 03:00:53",
        "message":"Thing is, I replaced about 5-6 displays and had at least 8-10 people coming in with the same issues. Most of customer had the same issues weeks after we placed a new display. No liquid damage, no scratches nothing. So im getting very worried about replacing these display if they really fail that easily. I cant be the only one with this issue I assume. We have been replacing Mac displays since 2013 and never had issues like this :("
    },
    {
        "post_id":41235,
        "thread_id":41226,
        "title":"Macbook 2016 and up display issues",
        "user_id":338,
        "username":"arnonabuurs",
        "post_date":"2018-10-26 03:02:49",
        "message":"Forgot to mention, I have swapped out these displays with another Mac sometime before, and it was working again which lead me thinking that the boards have some issue"
    },
    {
        "post_id":41236,
        "thread_id":41226,
        "title":"Macbook 2016 and up display issues",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-10-26 03:34:42",
        "message":"Do these lines move when you press the screen in these areas?\nMLB, or video cable problem should affect the entire screen.\nYou could get lines on all the screen, but separated by same width of good zones."
    },
    {
        "post_id":41276,
        "thread_id":41226,
        "title":"Macbook 2016 and up display issues",
        "user_id":338,
        "username":"arnonabuurs",
        "post_date":"2018-10-27 04:05:05",
        "message":"Kinda weird, customer comes to my office and tells me when it gets hot i get stripes. So the mac has no stripes at all, I ran Cinebench for 10 minutes and I get striped slowly getting more clear. At some point even pink bar in the display. This was a brand new display. Sending it to another shop now to have them try another display, see if that makes any difference. I will post some images a bit later. Connecting an external display is OK, so seems to be some display or display cable issue. I have read a few people online who also said it has to do with heat and crappy mac display. They dont move, its not like cracks. The appear and disappear."
    },
    {
        "post_id":41319,
        "thread_id":41226,
        "title":"Macbook 2016 and up display issues",
        "user_id":289,
        "username":"smiba",
        "post_date":"2018-10-28 04:50:24",
        "message":"If heat affects the issue its definitely a problem with the LCD display itself because the metal and solder will slightly expend.\n\nI've had Macbook Air displays (older models) with lines across the screen that went away or came back depending on the temprature"
    },
    {
        "post_id":41361,
        "thread_id":41226,
        "title":"Macbook 2016 and up display issues",
        "user_id":338,
        "username":"arnonabuurs",
        "post_date":"2018-10-29 00:14:30",
        "message":"Got another one in today lol. Weird not many more people seems to have issues, must be the hot weather here in Thailand I guess!"
    }
]