[
    {
        "post_id":83691,
        "thread_id":62084,
        "title":"Time\/date in T2 machine",
        "user_id":145,
        "username":"Sykulski",
        "post_date":"2021-12-13 02:16:30",
        "message":"Hello\n\nCan anybody tell me which chip stores the time and date in a MacBook Pro 13 A1989?\n\nAnd is it possible to program this chip with correct time and date via a chip programmer?\n\nThe reason for this is that I have a customer that forgot the password for his FileVault enabled T2 machine and we cannot access the Apple-id servers to reset the password  because the machine has been lying for a long time and lost all power in the battery. So computers date is 1976 now. I also cannot edit the time through Terminal because the machine asks for the administrator password (which he forgot) before it will start Terminal.\n\nSo we are in a kind of paradox where we can only reset the password if we change the date. But we cannot change the date because we don't know the password.\n\nOh... And reinstalling the machine is not an option as it is the data on it that's important.\n\nHmmm. And thanks in advance\n\n\/M"
    },
    {
        "post_id":83706,
        "thread_id":62084,
        "title":"Time\/date in T2 machine",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-12-13 07:05:10",
        "message":"Need the password to decrypt FileVault.\n\nThe clock is set automatically if you connect the machine to Internet, via wireless.\nIt should be available starting on Internet Recovery."
    },
    {
        "post_id":83710,
        "thread_id":62084,
        "title":"Time\/date in T2 machine",
        "user_id":145,
        "username":"Sykulski",
        "post_date":"2021-12-13 07:26:10",
        "message":"Yes I have tried that. But time is not adjusted automatically. It can boot from internet recovery but the time is still 1976 after connecting to Wi-Fi."
    },
    {
        "post_id":83713,
        "thread_id":62084,
        "title":"Time\/date in T2 machine",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-12-13 08:02:47",
        "message":"Give it time; clock must be adjusted once connected to corresponding server."
    },
    {
        "post_id":83734,
        "thread_id":62084,
        "title":"Time\/date in T2 machine",
        "user_id":145,
        "username":"Sykulski",
        "post_date":"2021-12-14 01:21:31",
        "message":"How long time? Been waiting for half an hour now and still not automatically adjusted. \n\nAlso nothing happens when i press \"Open Date & Time\" other than the button changes to blue. This is in Safari from recovery partition\n\n[ATTACH]60309[\/ATTACH]"
    },
    {
        "post_id":83735,
        "thread_id":62084,
        "title":"Time\/date in T2 machine",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-12-14 01:52:44",
        "message":"Setting clock requires administrative privileges.\nThat may be the reason why you can't access it at all.\nBut connecting to Internet should adjust it automatically.\n\nThe problem is that even changing the clock successfully, FileVault can't be decrypted without correct password."
    },
    {
        "post_id":83748,
        "thread_id":62084,
        "title":"Time\/date in T2 machine",
        "user_id":145,
        "username":"Sykulski",
        "post_date":"2021-12-14 02:59:38",
        "message":"Yes. But if the clock gets adjusted then we can use Apple-id to reset the password. Now we cannot because Apple-id server rejects the connection because of wrong time\/date."
    },
    {
        "post_id":83774,
        "thread_id":62084,
        "title":"Time\/date in T2 machine",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-12-14 19:09:28",
        "message":"Try to start with Command + R, or Command + Alt + R."
    },
    {
        "post_id":83778,
        "thread_id":62084,
        "title":"Time\/date in T2 machine",
        "user_id":145,
        "username":"Sykulski",
        "post_date":"2021-12-14 22:01:33",
        "message":"I have tried both. It can boot to internal recovery partition and to internet recovery system completely fine. I also tried booting to internet recovery both via LAN cable and Wi-Fi.\n\nIn normal recovery (cmd+R): I can reach disk utility (disk is grey because of FileVault), Safari help system (warns me about the date is wrong). I can connect to a Wi-Fi without errors but date still not adjusted and I let it stay connected all day yesterday but it did not adjust. I cannot start the terminal or the startup security editor because I asks for password of an administrator account.\n\nIn internet recovery (alt+cmd+R): I cannot really do so much as it asks for the password before showing the menu. I can connect to Wi-Fi and I can click “forgot password”. When I click this it says is gives a connection issue error even though it is connected to internet either via LAN cable, Wi-Fi or both! This is probably because it cannot establish secure connection because of the date mismatch \n\nI have also tried to click the “reset password via iCloud” option fromthe FileVault login menu. This option shows up after a couple of failed login attempts. It thenboots Into a Password Recovery menu. Here I get the option to write the Apple ID of the user. I write it and a gear spins for a while and then an error with red font type shows up “cannot connect to the Apple ID servers”even though I first connected to both Wi-Fi and\/or LAN - probably because it cannot establish secure connection because of the date\/time mismatch\n\nThat’s why I thought maybe last option is to flash the correct date into the corresponding chip. I have the tools but I am not sure in which chip and what format this is stored"
    },
    {
        "post_id":83783,
        "thread_id":62084,
        "title":"Time\/date in T2 machine",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-12-15 03:43:31",
        "message":"The real time clock is managed by PCH's RTC block; you can't change anything there.\n\nThe clock showed by system runs at least?"
    },
    {
        "post_id":83786,
        "thread_id":62084,
        "title":"Time\/date in T2 machine",
        "user_id":145,
        "username":"Sykulski",
        "post_date":"2021-12-15 03:53:39",
        "message":"The clock is not showed in upper right corner in the recovery system.\n\nBut it is running as the date under Safari (run from the \"Get help online\"-menu) says April 15, 1976 today (yesterday it was April 14, 1976)"
    }
]