[
    {
        "post_id":30678,
        "thread_id":30678,
        "title":"802-3462 Quarter fan spin",
        "user_id":906,
        "username":"Joesipaq",
        "post_date":"2018-01-23 07:53:48",
        "message":"Hey all,\nSeverely waterdamaged board. Hobby board.\nMy 25mhz signal is terrible and dropping with the fan cycle. Looks like its possibly not getting pulled all the way to ground? R1885 and R1886 checked out ok.\n[ATTACH type=\"full\" width=\"15%\"]30679._xfImport[\/ATTACH]\n\n32khz is fine and always present.\n[ATTACH type=\"full\" width=\"15%\"]30680._xfImport[\/ATTACH]\ncpuvcore is only present with fanspin.\n\nShould I replace u2600? There was no liquid damage near it. Trying a newyear thing of thinking all the way through something before shotgunning parts onto a motherboard.\n\nCheers"
    },
    {
        "post_id":30681,
        "thread_id":30678,
        "title":"802-3462 Quarter fan spin",
        "user_id":36,
        "username":"aprendiz",
        "post_date":"2018-01-23 08:02:26",
        "message":"First voltages, PPBUS_G3H, PP3V42_G3H, do you have green light?? water damage around bios IC? Where was water damage???"
    },
    {
        "post_id":30682,
        "thread_id":30678,
        "title":"802-3462 Quarter fan spin",
        "user_id":906,
        "username":"Joesipaq",
        "post_date":"2018-01-23 08:43:16",
        "message":"green light changes to amber. Kinda thought that was needed for the other power rails to come on. Same with pp3v42_G3H. Do you get any cpuvcore or others with that missing?\n\nNo battery connected - didn't mention that part. makes sense now your question.\n\nppbusg3h at 12.57v\npp3v42g3h at 3.42v\n\nno water damage around bios suprizingly. resistors (r6100, r6101) test ok. You will prolly ask about the current sensing resistors too, they check out fine on the isl chips pins.\n\nwhere to start with the waterdamage...\n\nu4650 - but nothing serious\nQ9709 - been replaced. but thats for backlight - so doubt its a problem at this point\nQ7260 - replaced\nU5400 - replaced\nC7565 - looks dark - but diode mode checks out at 0.160\nQ7100 - replaced\nU6990 - replaced and general re flow around area.\nJTAG- removed\n\nthats the majority of it.\n\nHistory - laptop was on a desk - clients ceiling collapsed on it during a rain storm in the middle of the night on a Sunday. Monday it was found."
    },
    {
        "post_id":30687,
        "thread_id":30678,
        "title":"802-3462 Quarter fan spin",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-01-23 13:55:43",
        "message":"So the board is power cycling? Is CPU Vcore coming up? Corrosion near SMC?"
    },
    {
        "post_id":30692,
        "thread_id":30678,
        "title":"802-3462 Quarter fan spin",
        "user_id":906,
        "username":"Joesipaq",
        "post_date":"2018-01-23 16:12:09",
        "message":"Yes, CPU vcore is coming up with fan spin. Then cuts out. And repeats indefinitely\nno corrosion near SMC."
    },
    {
        "post_id":30694,
        "thread_id":30678,
        "title":"802-3462 Quarter fan spin",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-01-23 17:39:35",
        "message":"If Q7100 was really damaged it will probably have fried the CPU."
    },
    {
        "post_id":30696,
        "thread_id":30678,
        "title":"802-3462 Quarter fan spin",
        "user_id":906,
        "username":"Joesipaq",
        "post_date":"2018-01-23 19:08:34",
        "message":"It wasn't shorted out, but had a bit of corrosion around it. Water must have sat on it for a bit. The edges of the pads that are exposed ( the three connected together) were gone, so I pulled it to make sure there was something under it still and replaced it while it was off.\n\nIs that 25mhz signal looking ok??? Guess I could pull apart another machine and compare it when I get back in the shop. I was expecting a square wave of some sorts though. Something that could slow data to pass on it. Not agreeing that u2600 is probably bad?"
    },
    {
        "post_id":30700,
        "thread_id":30678,
        "title":"802-3462 Quarter fan spin",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-01-24 05:58:49",
        "message":"The 25MHz is likely fine and is just impedance\/noise\/loading issues from you measuring. I don't think this is going to be a fix unless you have a corroded trace or resistor somewhere. Nothing much else you can do in this case."
    },
    {
        "post_id":30707,
        "thread_id":30678,
        "title":"802-3462 Quarter fan spin",
        "user_id":906,
        "username":"Joesipaq",
        "post_date":"2018-01-24 09:21:22",
        "message":"Since this is a project board, anything else you recommend trying out before sticking it in the pile of - look at when you own a real microscope - pile? I still have one of those great ol usb ones so i might be missing something"
    },
    {
        "post_id":30711,
        "thread_id":30678,
        "title":"802-3462 Quarter fan spin",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-01-24 11:47:11",
        "message":"Inspect better for corrosion is the only thing or replace the CPU if nothing else is found."
    },
    {
        "post_id":30855,
        "thread_id":30678,
        "title":"802-3462 Quarter fan spin",
        "user_id":906,
        "username":"Joesipaq",
        "post_date":"2018-01-30 13:05:47",
        "message":"No Title\n\nSo duke, i have some spare time and I did find some more corrosion i didn't catch the first time around. There is some on the Trackpad connector - J5700  (i have had that cause no boot before) and i added a photo of Q7630. Q7100 looked about the same. Now I can figure since those are pins 2,3,4 that there is a huge solder joint under the chip, and its fine. Those caps tested OK too, I dont like a little solderball i see though.\n\nI guess for me the next logical step would be to pull the trackpad connector?"
    },
    {
        "post_id":30861,
        "thread_id":30678,
        "title":"802-3462 Quarter fan spin",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-01-30 13:34:12",
        "message":"Trackpad connector will probably not prevent it from booting. The problem with the corrosion at the FET is that it will have touched the gate pin and that will cause the controller to lose the ability to control the voltage. It is very likely the CPU saw a voltage spike and got killed."
    },
    {
        "post_id":30863,
        "thread_id":30678,
        "title":"802-3462 Quarter fan spin",
        "user_id":906,
        "username":"Joesipaq",
        "post_date":"2018-01-30 14:54:40",
        "message":"Thanks duke, that's great to know how the liquid touching the gate will cause it to pass whatever voltage it can (deciding on the additional voltage on the gate) I didn't think of that. Ill defiantly keep that in mind for future repairs too that i see come by. I'd say this one can be closed - but unsolved. If i do happen to have another free day to play with it, ill trying some more with the basic components to see if by some change the cpu is still good and maybe somewhere still has corrosion hiding. No harm in practicing my soldering skills and getting to know the circuits\/schematics better!"
    }
]