[
    {
        "post_id":84323,
        "thread_id":62140,
        "title":"820-00138 no image",
        "user_id":27938,
        "username":"KootenayMacGuy",
        "post_date":"2021-12-28 13:11:49",
        "message":"I have an 820-00138 that had corrosion around the display connector area, and had no image. After a quick clean with alcohol and a toothbrush, I was able to get an image, but the area needed to be touched up to be reliable, and replacement of the LVDS connector and display cable was also needed. I replaced necessary filters and resistors in this are and replaced the connector and cable. Unfortunately, now I am unable to get an image. I have the boardview file but the backlight circuit and associated capacitors\/resistors on the schematic do not match the corresponding components on the actual board, so this makes it difficult to diagnose. I have been using the 820-00163 boardview wich seems to have the correct component layout, minus the backlight circuit. The display has been verfied to function correctly, just not with this board. Here are my diode readings from the display connector:\n\n1: 1.258\n2: OL\n3: .562\n4: .560\n5: .709\n6: 1.827\n7: 1.790\n8: .743\n9: OL\n10: OL\n11: OL\n12: OL\n13: GND\n14: OL\n15: OL\n16: GND\n17: OL\n18: OL\n19: GND\n20: OL\n21: OL\n22: GND\n23: OL\n24: OL\n25: GND\n26: GND\n27: GND\n28: .588\n29: .588\n30: .588\n\nAll of these measurements were taken with the display disconnected\n\nNow what I noticed between this board and the 820-00163 board is that pins 9 (LCD_HPD-CONN) and 10 (LCD_FSS)  have a reading of .643 and .699 respectively. I followed these lines to the corresponding resistors on the board (820-00163) and the resistors were not shorted and measured good. Just as of note, the backlight would occasionally come on during testing but no image was displayed. What might the issue be?"
    },
    {
        "post_id":84324,
        "thread_id":62140,
        "title":"820-00138 no image",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-12-28 13:17:18",
        "message":"LCD_HPD goes high (LCD connected)?"
    },
    {
        "post_id":84331,
        "thread_id":62140,
        "title":"820-00138 no image",
        "user_id":27938,
        "username":"KootenayMacGuy",
        "post_date":"2021-12-28 14:42:22",
        "message":"LCD_HPD is high @ 3.31V with display connected"
    },
    {
        "post_id":84332,
        "thread_id":62140,
        "title":"820-00138 no image",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-12-28 16:23:08",
        "message":"Check FL8300-03 continuity.\nAlso check their traces to J8300 and C8320-27.\nBe sure all the caps are good, including C8238\/39."
    }
]