[
    {
        "post_id":87200,
        "thread_id":62450,
        "title":"A1708 820-00840 Missing PP1V1_UPC_XA(lowXB)_LDO_BMC - All other LDOs present",
        "user_id":32299,
        "username":"posarah",
        "post_date":"2022-03-11 00:42:44",
        "message":"Hi All.\n\nJust wanted to see if I can get some assistance with a A1708 I'm working on. Board while looking clean had it's liquid marker tripped by U2890. Board started off as fluctuating between 0.0157A @ 5.1762V to 0.0132A - 5.1751V 0.190A. Went through and checked the CD3215 bootup table on logiwiki. Found all LDOs (step 2) are present bar P1V1_UPC_XA_LDO_BMC which is completely missing regardless which USB port I use and P1V1_UPC_XB_LDO_BMC which is 0.280V, Logiwiki noted that's likely a faulty TBT rom, and judging the sticker near it had tripped I decided to remove the rom and low and behold there was junk under it. Replaced it and now the boards up to 0.0230 with a short dip to 0.01 and a short spike to 0.04 than rinse and repeat. \nAfter replacing the TBT rom it shortly did get warm, not hot but it was evaporating IPA after maybe 40 sec or so, but after leaving it on for a minute or so and power cycling it's no longer doing that. Nothing else seems to be getting hot. Confirmed all traces between the TBT rom and the CDs are ok, as logi also mentions they often break.    \n\nWhat else could be causing PP1v1 to be missing? Besides bad CDs hopefully because I do not have replacements. \n\nThanks for your assistance."
    },
    {
        "post_id":87204,
        "thread_id":62450,
        "title":"A1708 820-00840 Missing PP1V1_UPC_XA(lowXB)_LDO_BMC - All other LDOs present",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-03-11 01:52:37",
        "message":"1V1 LDO must appear only on the powered port.\n\nDid you replace U2890 from donor board, same model?\nCheck all surrounding resistors.\n\nDo you get L6995 voltage?"
    },
    {
        "post_id":87210,
        "thread_id":62450,
        "title":"A1708 820-00840 Missing PP1V1_UPC_XA(lowXB)_LDO_BMC - All other LDOs present",
        "user_id":32299,
        "username":"posarah",
        "post_date":"2022-03-11 04:05:49",
        "message":"Ah didn’t know that, thanks. I assumed that since these have a master and a slave CD, since the slave has to communicate through the master to the rom chip, that the masters ldo would be present when using its port but not the slaves, but when using the slaves port both would be present.\n\n\nNo I used a tbt rom from the 820-01598 I was trying to fix as it was the only other board I had with that same chip and hoped the firmware would be the same.\n\nR2893 is 3209 ohms in circuit R2892 is 3249 ohms in circuit, and R2891 is 3.27K ohms in circuit. Not sure why my meter decided to measure the top two in ohms measurements and the last in k measurements caught me out for a second there I thought the first 2 it was saying 320.9k ohms. surrounding resistors around the TBT rom all measure ok, and also checked r3000 and r3001 since the wiki points those out as well.\n\nYes I’m getting 3.42V which is a bit high, isn’t it suppose to be 3.3v?  One other thing I noticed, I went on and did steps 3-12 on the CD table and HV_GATE 1 is 10.89v and gate 2 is 7.14v when the table says it should be 5v until the charger switches to 20v than it boosts to 20v for the pros.  Not sure if that’s relevant  though just thought I should mention.\n\nShould also mention both CD fuses have been checked and both have 5.12v when their respective USB port is connected."
    },
    {
        "post_id":87211,
        "thread_id":62450,
        "title":"A1708 820-00840 Missing PP1V1_UPC_XA(lowXB)_LDO_BMC - All other LDOs present",
        "user_id":32299,
        "username":"posarah",
        "post_date":"2022-03-11 05:18:08",
        "message":"Just checked the voltages on the no stuff caps as well as I noticed in another post last year you requested those.\n\n\nC3120 pad 1: 5.12v \/ pad 2: 4.19V\nC3121 pad 1: 4.56v dips to 4.31 than back up\npad 2: 8.36 fluctuates all over the place quite rapidly. Lowest value was 6.35v.\n\nC3220 pad 1: 5.16v \/ pad 2: 7.2v\nC3221 pad 1: 5.15V dips to 4.82v than back up\n pad 2: 10.86V dips to 9.75v after about 20 sec but bounced back to 10.86 immediately."
    },
    {
        "post_id":87212,
        "thread_id":62450,
        "title":"A1708 820-00840 Missing PP1V1_UPC_XA(lowXB)_LDO_BMC - All other LDOs present",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-03-11 05:25:04",
        "message":"STOP wasting time!\nPut first correct U2890; it has firmware, specific for each board."
    },
    {
        "post_id":87293,
        "thread_id":62450,
        "title":"A1708 820-00840 Missing PP1V1_UPC_XA(lowXB)_LDO_BMC - All other LDOs present",
        "user_id":32299,
        "username":"posarah",
        "post_date":"2022-03-12 20:37:03",
        "message":"After the board numbers they usually have a dash something do we know what that denotes? I'm assuming probably a region designation. I did get a 820-00840-A donor board today, but the board I need a rom for is 820-00840-1. Does that matter? I've ordered some TBT roms from our local electronics supplier incase it does need to be the exact same one and will flash one once they arrive since I've been told these are actually flashable unlike most Apple chips."
    },
    {
        "post_id":87297,
        "thread_id":62450,
        "title":"A1708 820-00840 Missing PP1V1_UPC_XA(lowXB)_LDO_BMC - All other LDOs present",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-03-13 00:46:54",
        "message":"The last digit should'n be important here.\n\nDid you try to read the original U2890?"
    },
    {
        "post_id":87300,
        "thread_id":62450,
        "title":"A1708 820-00840 Missing PP1V1_UPC_XA(lowXB)_LDO_BMC - All other LDOs present",
        "user_id":32299,
        "username":"posarah",
        "post_date":"2022-03-13 03:04:56",
        "message":"Not yet, I do not have a programmer ATM so I was not able to. In the order of purchasing the roms, I also purchased a programmer. Also saw chipsetpro offer A u2980 programmer, are they any good? Might get one of those as well."
    }
]