[
    {
        "post_id":37432,
        "thread_id":37432,
        "title":"820-00928-A Liquid Damage",
        "user_id":1242,
        "username":"ddahlstrom",
        "post_date":"2018-07-21 15:05:03",
        "message":"I have an Macbook A1707 that had some liquid spilled on board. I cleaned it off and cannot see too much in terms of obvious damage after the cleaning. When plugged in with either battery, charger, or both, the fans spin but otherwise there are no signs of life. Measuring PPBUS_G3H gives us about 12.5V, which I know is kind of low from the 13.1V on the schematic. Am I correct in saying that this indicates a short that is pulling down that power rail somehwere on the board? Also, any opinions or advice on where to look first? I am not too familiar with these newer model macbooks."
    },
    {
        "post_id":37522,
        "thread_id":37432,
        "title":"820-00928-A Liquid Damage",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-07-24 18:05:46",
        "message":"PPBUS is fine.\nUse USB-C to USB adapter and connect a mouse and see if it lights up.  Also connect an external screen and see if there is video.\nWhere was the liquid damage?"
    },
    {
        "post_id":37848,
        "thread_id":37432,
        "title":"820-00928-A Liquid Damage",
        "user_id":1242,
        "username":"ddahlstrom",
        "post_date":"2018-07-31 17:24:12",
        "message":"Have connected external screen and no video image that way. Do not have a dongle that could fit a regular usb mouse. However, the USBs work for charging, but do not get image external on any USB-C ports using HDMI adapter. I have had time to further troubleshoot the board after hand\/sonic cleaning and have found the following results:\n\nWith charging cable or battery, PPBUS tests fine and the fans stutter after a couple of seconds then begin spinning properly. Went through the entire board and all of the power rails seem to be active, but maybe Im not understanding the power on sequence of this computer. Some of my more interesting measurements are as follows (sorry if some info is not relevant, as I am new to this):\n\n12.6V on PPBUS\n3.3V on R6928 pins 1 and 2\nR0605 is 0.905k ohms (seems a little low from 1k?)\nPin 2 of R0605 is 0V and pin 1 is 1V\nPP1V2_S3 is 1.203V on pin 1 of C7930\n5V at pin 1 of C7651\n0.9V on pin 1 of CA128\n3.3V on pin 1 of RA330\n3.3V on pin 1 of C4520\n3.3V on pin 1 of C3919\n\nSome light exposure to moisture on left side right above GPUc, and U3200 looked rough but not bad after cleaning. Some on the bottom portion of board by main charging IC. Regular water was dropped on top of the keyboard and alot on the touchbar itself, which may have shorted it out. Bottom of board actually looked okay and had minimal  exposure, if any. I can attach some photos."
    },
    {
        "post_id":37853,
        "thread_id":37432,
        "title":"820-00928-A Liquid Damage",
        "user_id":1242,
        "username":"ddahlstrom",
        "post_date":"2018-07-31 18:05:12",
        "message":"If it helps i am using 000281 schematic and boardview as closest fit for this model"
    },
    {
        "post_id":37915,
        "thread_id":37432,
        "title":"820-00928-A Liquid Damage",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-08-01 15:46:40",
        "message":"CPU Vcore present on L7211?"
    },
    {
        "post_id":37982,
        "thread_id":37432,
        "title":"820-00928-A Liquid Damage",
        "user_id":1242,
        "username":"ddahlstrom",
        "post_date":"2018-08-02 13:42:12",
        "message":"CPU VCore is 1.08V on pins 1 and 2 of L7211"
    },
    {
        "post_id":37998,
        "thread_id":37432,
        "title":"820-00928-A Liquid Damage",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-08-02 16:29:49",
        "message":"That sucks as that means all power is OK. Only thing I can advice is to inspect everything again for corroded resistor or traces. Also get USB-C to USB adapter to test a mouse for lighting up."
    },
    {
        "post_id":38008,
        "thread_id":37432,
        "title":"820-00928-A Liquid Damage",
        "user_id":1242,
        "username":"ddahlstrom",
        "post_date":"2018-08-02 18:49:34",
        "message":"Forsure, if the keyboard or trackpad was failing could that prevent an image from displaying?"
    },
    {
        "post_id":38033,
        "thread_id":37432,
        "title":"820-00928-A Liquid Damage",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-08-03 14:30:52",
        "message":"Disconnect all that crap and just have LCD connected. Or just the bare board with USB-C connected and check for external image."
    },
    {
        "post_id":38041,
        "thread_id":37432,
        "title":"820-00928-A Liquid Damage",
        "user_id":1242,
        "username":"ddahlstrom",
        "post_date":"2018-08-03 14:58:45",
        "message":"Fans will not spin without keyboard connector. With only usb-c charger, external adapter to HDMI, and keyboard no external image. With only lcd, charger and keyboard, again no image. Any other thoughts?"
    },
    {
        "post_id":38117,
        "thread_id":37432,
        "title":"820-00928-A Liquid Damage",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-08-05 13:53:17",
        "message":"There is not much more to do than inspect again for corroded traces\/resistors. As there was liquid near GPU\/CPU FETs it may have killed them."
    }
]