[
    {
        "post_id":21054,
        "thread_id":21054,
        "title":"[SOLVED]820-00426, bad SMC?",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-05-30 11:31:57",
        "message":"Working on a very lightly liquid-damaged 820-00426. Board was cleaned before I got it, but there is zero sign of corrosion or liquid burning at all. Everything looks perfect. I have no green\/orange light, and my ppbus_g3h is at 12.26v. Bad SMC is where I'm leaning; does this sound about right? 3v42 is 3.43v. I found that my SMC_RESET_L signal is only .7v, so it's got the SMC in reset mode. I replaced U5110, and SMC_RESET_L is still .7v, so I'd imagine the SMC is stuck in reset mode and will need replacing.\n\nMy second question is; would the SMC from an 820-00138 (or maybe an 820-3787?) be compatible with the 820-00426? I know typically you always want to pull an SMC from an identical model, but I know the 00426 is just the DG version of 00138. What I DON'T know, is whether or not this means the SMCs are different.\n\nI have zero 00426 parts boards, and only 1 00138 board with an SMC I could try.\n\nAny ideas or input? Does this sound like a bad SMC, and does anyone know if an SMC from an 00138 board would work with an 820-00426 board? Thanks as always."
    },
    {
        "post_id":21069,
        "thread_id":21054,
        "title":"[SOLVED]820-00426, bad SMC?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-05-30 16:59:40",
        "message":"Could be crap under SMC, could be the pull-up resistor on SMC_RESET too. I actually doubt it will be the SMC."
    },
    {
        "post_id":21077,
        "thread_id":21054,
        "title":"[SOLVED]820-00426, bad SMC?",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-05-30 18:05:58",
        "message":"Hey Duke, thanks. I checked the resistor tied to U5110\/SMC_RESET_L (schematic not in front of me, sorry), and it was reading properly. It actually read out of spec in-circuit, but when I removed it, it read properly out-of-circuit (100K I believe it was); this sort of reinforces the crap-under-SMC diagnosis. I'll heat the SMC up some with some flux tomorrow and see if that resolves; if not, I'll pull and reball the SMC."
    },
    {
        "post_id":21111,
        "thread_id":21054,
        "title":"[SOLVED]820-00426, bad SMC?",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-05-31 09:09:21",
        "message":"You nailed it again, duke. Reflowed the SMC for a good 5-7 seconds, applied some clean flux underneath and my green\/orange light returned, and SMC_RESET_L is back to 3.4v. Board is in the machine running right now, and all seems well. If there are any issues, I'll post an update, but everything seems good to go with regards to the OP issue. Thanks!"
    }
]