[
    {
        "post_id":26677,
        "thread_id":26677,
        "title":"820-3476 Black Screen",
        "user_id":135,
        "username":"bjf",
        "post_date":"2017-10-11 11:27:31",
        "message":"This board worked fine initially but then the screen went black while I was using it. It seemed like the processor lost power. The computer had so signs of life besides a spinning fan. After testing it, the CPU is actually getting power (1.75V). With the board out I can see that the fan comes up for a second, dies down and then spins back up and stays spinning, kind of like the 3437 boards. But that's it - no post, no boot. I was convinced this was going to be a CPU issue. I'm not sure now which part of the board would fail but still allow the board to spin up. Any thoughts? I attached pre-cleaning pics. It looks like the main area hit was around U1900, Y1905, the top right part of the SMC where the 3V42 lines are and some near J6100 (now removed) on the other side of the board. I replaced all visibly damaged components in those areas and made sure pads were clean underneath anything not replaced."
    },
    {
        "post_id":26680,
        "thread_id":26677,
        "title":"820-3476 Black Screen",
        "user_id":557,
        "username":"MDY",
        "post_date":"2017-10-11 11:30:09",
        "message":"Chime? Mouse light?"
    },
    {
        "post_id":26681,
        "thread_id":26677,
        "title":"820-3476 Black Screen",
        "user_id":135,
        "username":"bjf",
        "post_date":"2017-10-11 11:36:40",
        "message":"It does have a mouse light but no chime, no video, no caps lock light."
    },
    {
        "post_id":26682,
        "thread_id":26677,
        "title":"820-3476 Black Screen",
        "user_id":557,
        "username":"MDY",
        "post_date":"2017-10-11 11:42:20",
        "message":"Sure no image? Tried another screen?"
    },
    {
        "post_id":26683,
        "thread_id":26677,
        "title":"820-3476 Black Screen",
        "user_id":135,
        "username":"bjf",
        "post_date":"2017-10-11 11:54:03",
        "message":"Yeah, it's weird. I'm using my known-good test screen. Nothing. And that's after having it completely assembled with another good screen and it also not putting out video. I was using it when it died. The screen just turned off and the computer became completely non-responsive. But the fan was still running and there was heat."
    },
    {
        "post_id":26684,
        "thread_id":26677,
        "title":"820-3476 Black Screen",
        "user_id":557,
        "username":"MDY",
        "post_date":"2017-10-11 11:58:17",
        "message":"Check with flashlight if only backlight is missing. If mouse light, board should be alive. Try pram reset. \n​​"
    },
    {
        "post_id":26688,
        "thread_id":26677,
        "title":"820-3476 Black Screen",
        "user_id":135,
        "username":"bjf",
        "post_date":"2017-10-11 12:14:55",
        "message":"Tried PRAM, and no, there's no video. The board is definitely not posting. Remember too that it's spinning up, turning off, then spinning up again. This board is not supposed to do that."
    },
    {
        "post_id":26700,
        "thread_id":26677,
        "title":"820-3476 Black Screen",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-10-11 17:28:04",
        "message":"On\/OFF could be many things. First check U6100 and termination resistors\/traces. Could also be crap under SMC.\nDid you replace U1900 and check if the traces to Y1905 are in tact?"
    },
    {
        "post_id":26767,
        "thread_id":26677,
        "title":"820-3476 Black Screen",
        "user_id":135,
        "username":"bjf",
        "post_date":"2017-10-13 09:45:27",
        "message":"Thanks, fan still just goes up, down, and then comes back up and stays on, but no post. I replaced U1900, checked traces to Y1905, checked U6100 resistors and traces. Tried cleaning under the SMC. Re-cleaned the board in the ultrasonic. It feels like a component was on it's last leg and gave out. The computer booted normally a few times and allowed me to install the system but then started losing it's brain and then finally stopped posting altogether."
    },
    {
        "post_id":26780,
        "thread_id":26677,
        "title":"820-3476 Black Screen",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-10-13 22:23:19",
        "message":"ON\/off like that is many times the termination resistors\/traces to the SMC. Check the resistors between U6100 and the SMC. Also double check U1950."
    },
    {
        "post_id":26815,
        "thread_id":26677,
        "title":"820-3476 Black Screen",
        "user_id":135,
        "username":"bjf",
        "post_date":"2017-10-14 22:15:07",
        "message":"Ok, I went the spill area above the SMC and near U1900 and reflowed and moved every component to make sure they were making good contact and it's working now. I ran a little flux under the top of the SMC also. Not sure which one fixed it but it's been running solid for a couple days. Thanks for the help."
    }
]