[
    {
        "post_id":25785,
        "thread_id":25785,
        "title":"820-3476 Freezes in OSX",
        "user_id":468,
        "username":"ALB-Repairs",
        "post_date":"2017-09-22 07:44:21",
        "message":"Hi\nBeen an odd week as this is not an isolated incident. \nWe've seen 3 3476 boards that freeze in OSX, two were repaired for liquid damage, the other was free of liquid and physical damage, and arrived to us with this fault and no previous rework\/repair. They are all 2.6ghz\/8gb, All tested in there individual shells.\n\nIve tried reflowing the RAM on the non liquid damaged board, it had no effect on the fault.\nHas anyone come across this fault before? its the first time ive seen this behaviour from this model."
    },
    {
        "post_id":25799,
        "thread_id":25785,
        "title":"820-3476 Freezes in OSX",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-09-22 12:41:22",
        "message":"Usually RAM issues so could also be CPU related. Not worth messing with in my opinion."
    },
    {
        "post_id":44699,
        "thread_id":25785,
        "title":"820-3476 Freezes in OSX",
        "user_id":1309,
        "username":"Inwerp",
        "post_date":"2019-01-12 08:14:26",
        "message":"Just in case some one searches for this issue. \nThis is the display problem. I will try to investigate what's wrong exactly, but it works perfectly with my bench screen. \nas far as i can see, it freezes in the moment it tries to adjust brightness, so it is some kind of sensor failure and as always - this look like another damn signature defect."
    },
    {
        "post_id":44704,
        "thread_id":25785,
        "title":"820-3476 Freezes in OSX",
        "user_id":468,
        "username":"ALB-Repairs",
        "post_date":"2019-01-12 11:59:11",
        "message":"[QUOTE=\"Inwerp, post: 44699\"]Just in case some one searches for this issue.\nThis is the display problem. I will try to investigate what's wrong exactly, but it works perfectly with my bench screen.\nas far as i can see, it freezes in the moment it tries to adjust brightness, so it is some kind of sensor failure and as always - this look like another damn signature defect.\n[\/QUOTE]\n\nHolly thread revival, \nif not for anyone interested i revisited what seemed to be the same issue recently. \nI had an 820-3476 that would freeze as soon as you got to OSX, however if plugged into an external display would run fine.\nThis was due to corrosion under 8340 and a rusted pad. I think this freezing issue is caused by a bad LCD_HPD_CONN or DP_INT_HPD"
    },
    {
        "post_id":44719,
        "thread_id":25785,
        "title":"820-3476 Freezes in OSX",
        "user_id":1309,
        "username":"Inwerp",
        "post_date":"2019-01-13 04:36:55",
        "message":"unfortunately my board is virgin-clean and it happens to run OK on my cracked bench test display, so it is not the board.\nit is also kind of difficult to diagnose since verbose mode switches to the GUI just before this freeze happens. on the working display it looks like it changes resolution at the moment, but my eyes are not good enough to confirm it. this is definetely some fancy retina-shit and it should be fixable since invertor board is accessable and teoretically repairable. \ni will check if i have something fancy going on on HPD line. (i found i rather stupid that hotplug line even matters for internal display)"
    },
    {
        "post_id":44720,
        "thread_id":25785,
        "title":"820-3476 Freezes in OSX",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-01-13 04:43:06",
        "message":"HPD signal is required for internal LCD detection, in case of eDP type.\nCheck its value when freezes."
    }
]