[
    {
        "post_id":40124,
        "thread_id":40124,
        "title":"SSD differences between A1466  820-00165 vs 3437 (despite same physical connect) ?",
        "user_id":1524,
        "username":"Paul Daniels",
        "post_date":"2018-10-03 05:55:46",
        "message":"I just noticed something this evening, A SSD ( SanDisk 655-1837c Sd6pq4m-128g-1021 128gb ) works in my A1466 820-00165 and A1502, but doesn't show up as a device on my  A1466 820-3437 boards (either of the two working ones I have).\n\nIs there an electrical\/signalling difference of the SSD interface between the 3437 and 00165 such that the 3437 cannot use SSDs out of a 00165 board?  All I get is the blinking folder.\n\nThe SSD is fine, if I plug it in to my A1502 MBP Retina it boots up no trouble (unfortunately I do not have access to the 820-00165 any more, as I traded off my last one)."
    },
    {
        "post_id":40127,
        "thread_id":40124,
        "title":"SSD differences between A1466  820-00165 vs 3437 (despite same physical connect) ?",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2018-10-03 06:51:58",
        "message":"Already installed High Sierra APFS update? If SSD has High Sierra and the 3437 doesn't have the APFS (boot ROM ending in .B00) update, and the 00165 does, the 3437 won't \"see\" it.\n\nCheck pin out of SSD for 3437 vs. 00165; I feel like someone has asked this before and it did not work."
    },
    {
        "post_id":40128,
        "thread_id":40124,
        "title":"SSD differences between A1466  820-00165 vs 3437 (despite same physical connect) ?",
        "user_id":1524,
        "username":"Paul Daniels",
        "post_date":"2018-10-03 07:04:37",
        "message":"SSD was used on a clean-install on a 00165 with HS,  so that makes some sense.  Any way up updating the 3437 to have APFS support?  I've got a HS USB installer stick... I should answer my own question and try it.\n\nI did ask a few weeks ago about a SSD from a system that -was- from a 3437 and showed up as a no-valid-partition crossed out circle on boot; that at least was a simple case of reinstall macOS and it was fine to use."
    },
    {
        "post_id":40129,
        "thread_id":40124,
        "title":"SSD differences between A1466  820-00165 vs 3437 (despite same physical connect) ?",
        "user_id":1524,
        "username":"Paul Daniels",
        "post_date":"2018-10-03 07:20:33",
        "message":"[USER=\"515\"]SMMRepair[\/USER] you were right ( and yes, it's showing up, so looks like it just wants the update )\n\n[url]https:\/\/www.rossmanngroup.com\/boards\/forum\/board-repair-troubleshooting\/34915-820-3437-b-ssd-not-detecting[\/url]"
    }
]