[
    {
        "post_id":87751,
        "thread_id":62502,
        "title":"A1706 820-00923-A, turns on after SMC reset only",
        "user_id":33224,
        "username":"Vogelek23",
        "post_date":"2022-03-22 06:25:07",
        "message":"Hi guys, I've got the computer in title with strange issue - it only turns on after SMC reset (CTRL-ALT-SHIFT + POWER). When turned on, it works perfectly fine, passes AHT and benchmarks, all 4 TBT ports work fine, it does restart correctly every time. Once it is turned off (Shutdown under the OS) it won't back on with power button pressed or lid open - SMC must be reset in order to get it start. I have replaced the power button, reprogrammed EFI, reballed SMC - no luck. Battery is 100% charged now but it happens when battery is low as well. No single sign of spillage anywhere and all sensors are white. What else may cause such problem?"
    },
    {
        "post_id":87757,
        "thread_id":62502,
        "title":"A1706 820-00923-A, turns on after SMC reset only",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-03-22 09:31:34",
        "message":"Check the exact SMC_ONOFF_L, SMC_RESET_L, SMC_4FINGERS_RST and BUF_SMC_RESET_L level.\nClean J6100 and inspect R7090 for corrosion; you may force 33-47K in place.\nTry changing U8510..."
    },
    {
        "post_id":87849,
        "thread_id":62502,
        "title":"A1706 820-00923-A, turns on after SMC reset only",
        "user_id":33224,
        "username":"Vogelek23",
        "post_date":"2022-03-24 06:29:12",
        "message":"All the suggested voltages are OK. No signs of corrosion on J6100 and R7090 (correct value, all connections checked OK).\n\nFinally worked it out. Found unstable voltage (floating between 0V and 1.8V) on R5261 (HALL_SENSOR_RIGHT) while the lid was open and there was stable 3.4V on R5251 (HALL_SENSOR_LEFT). It was right Hall sensor fault. Replaced and MLB now works like a charm. My suspicion about lid sensor problem raised when I reconnected the battery and connected the PSU - I found that power consumption looks quite similar to the situation when the lid is closed on a working machine with battery fully charged (5V -> 20V with \"PSU connected\" beep -> 5V @20mA)."
    },
    {
        "post_id":87859,
        "thread_id":62502,
        "title":"A1706 820-00923-A, turns on after SMC reset only",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-03-24 10:24:08",
        "message":"Thanks for feedback.\nAll solutions to strange issues are welcome."
    }
]