[
    {
        "post_id":7304,
        "thread_id":7304,
        "title":"iPhone 6S - No Backlight (VCC_MAIN  == PP_LCM_BL_ANODE)",
        "user_id":289,
        "username":"smiba",
        "post_date":"2016-09-26 17:15:33",
        "message":"Hi, First time repairing an iPhone 6(s) here.\n\nI bought a iPhone 6s from a seller with what was told a broken screen, so I assumed it was just a screen replacement job or at worst replacing the backlight filter or whatever they managed to break.\nHowever from what it looks like the phone has been worked on before (some parts are pretty ugly soldered, but working though) however I think, I [B]hope[\/B] they gave up once they had to remove the shields. I can't compare it with an actually untouched 6(s) since I've never seen one with my own eyes.\n\nThe issue is that the backlight (I think) is not being boosted, PP_LCM_BL_ANODE (which should be 35V following the schematic) is exactly the same as VCC_MAIN (which was about ~3.33V, IIRC).\n\nIs it possible one of the coils decided to stop boosting and just straight on pass VCC_MAIN? Might the U4020 chip be the issue of it all? I have no idea where to look, anyone any ideas\/tips?\n\nThis is how the area looks: [URL]https:\/\/i.imgur.com\/l5qZZvJ.jpg[\/URL]\n\nThanks in advance!"
    },
    {
        "post_id":7306,
        "thread_id":7304,
        "title":"iPhone 6S - No Backlight (VCC_MAIN  == PP_LCM_BL_ANODE)",
        "user_id":76,
        "username":"Tony Tone",
        "post_date":"2016-09-26 17:57:51",
        "message":"Check FL4211, I usually just put a wire instead if no good. That's what it usually is for me. Tip: use hot air at 200 degrees to get rid of black goop and an exacto blade.\n\n(Yay! This is fucking amazing!  I used to be the one asking all the questions - Now I can help out if I can. Gimme a cookie and a brownie point !)"
    },
    {
        "post_id":7326,
        "thread_id":7304,
        "title":"iPhone 6S - No Backlight (VCC_MAIN  == PP_LCM_BL_ANODE)",
        "user_id":289,
        "username":"smiba",
        "post_date":"2016-09-27 10:30:13",
        "message":"FL4211 won't be the issue as the voltage is already equal to VCC_MAIN at the start of the powerline.\n\nThanks for the tip about getting rid of the black goop stuff thoguh, helps a lot! I just kinda poked it away at first haha."
    },
    {
        "post_id":7407,
        "thread_id":7304,
        "title":"iPhone 6S - No Backlight (VCC_MAIN  == PP_LCM_BL_ANODE)",
        "user_id":289,
        "username":"smiba",
        "post_date":"2016-09-29 12:50:42",
        "message":"After inspecting the area for a second time I noticed D4021 looked kinda shaky. I just gave it a very small touch with my tweezers and it fell right off.\n\nThere was definitely someone here before because the pads and their solder looked like crap, they were almost ripped off \/ destroyed. I removed the old solder and tried to move the pads back with success.\n\nThen I soldered D4021 back on and, done! The backlight is properly functioning again\n\nI'm unsure if D4021 would've been the actual issue though, its an important part, but would it cause the backlight not to boost? I want to make sure I actually fixed the issue not just because I applied heat in that area"
    },
    {
        "post_id":7426,
        "thread_id":7304,
        "title":"iPhone 6S - No Backlight (VCC_MAIN  == PP_LCM_BL_ANODE)",
        "user_id":76,
        "username":"Tony Tone",
        "post_date":"2016-09-29 19:43:24",
        "message":"You mean D1501? Right?\n\nEdit: Sorry.  iPhone 6S not 6 -LOL.\nI've never had one go down there yet.  But cool.  You showed me something : )"
    }
]