[
    {
        "post_id":56395,
        "thread_id":56395,
        "title":"A1534 (2015 12\" Retina Macbook) display issues",
        "user_id":22042,
        "username":"bradsprojects",
        "post_date":"2020-02-01 20:41:33",
        "message":"I have a 12\" Retina Macbook (A1534) there is no backlight (i'm not sure if anything is on the LCD) but I can get a display on an external HDMI screen however there are other issues with it:\n\n- I can only boot into osX in safe mode (normal mode will show apple logo and then go black when you think the osX desktop should be coming up)\n- I tried going through a system restore, however it again doesn't show anything after rebooting from the system restore menu\n- Apple hardware test shows reference code (VFD001 and VFD004) 'There may be an issue with the display'\n\nIs this something that anyone has encountered before?"
    },
    {
        "post_id":56400,
        "thread_id":56395,
        "title":"A1534 (2015 12\" Retina Macbook) display issues",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-02-02 05:21:07",
        "message":"I don't recommend to bother with it.\nKeep in mind, al these boards end with dead CPU.\nLooks like yours already have some problem; with CPU, or SSD at least..."
    },
    {
        "post_id":56405,
        "thread_id":56395,
        "title":"A1534 (2015 12\" Retina Macbook) display issues",
        "user_id":22042,
        "username":"bradsprojects",
        "post_date":"2020-02-02 11:21:05",
        "message":"Ok I see. Since I'm new to Macbook repair - as a learning exercise, are there any bus voltages that it would be good for me to confirm the presence of?\n\nWhen you say all these boards end up with a dead CPU - is that due to the CPU itself failing, something else on the board failing causing the CPU to fail or is it due to poor design where the CPU no longer makes a good connection with the PCB?\n\nIs it worth throwing the board in a reflow oven?"
    },
    {
        "post_id":56406,
        "thread_id":56395,
        "title":"A1534 (2015 12\" Retina Macbook) display issues",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-02-02 11:41:57",
        "message":"Poor design from Apple, no fan used.\n\nSome people report on Internet they had success with IR oven reflow.\nI cannot assure that, but you can try.\n\nSometime just broken solders under CPU; it got bent, because of overheating.\nSame thing reported for SSD chip too."
    }
]