[
    {
        "post_id":45997,
        "thread_id":45997,
        "title":"820-3588",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2019-02-11 10:36:35",
        "message":"This iMac 21,5\" 2013 hat sensor issues after Ram upgrade by user. Only thing i could find was a missing CAP for ethernet (C4004) I replaced it and also U5600 (to be sure - it had scratches - from disassembely i guess) but no change. I cheched system temperatures and attached the result. Kernel Task is ~ 400% and fan goes crazy. Without LCD the fan still goes crazy (so i guess the problem still exists without LCD) but i get 3,3V at testpoints for SMBUS_SMC_0_S0_SDA and SMBUS_SMC_0_S0_SCL...\nI cant check the links to the SMC but also see no reason why they should be broken. So here i don?t know what to do next.\nAny help appreciated."
    },
    {
        "post_id":46030,
        "thread_id":45997,
        "title":"820-3588",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-02-11 17:19:22",
        "message":"You should run corresponding ASD EFI, for better report about errors.\nIf LCD temps sensor is disconnected, this will cause high fan spin; as HDD temp sensor too.\nSo check if all the cables are properly connected.\nLCD temp sensor is connected directly to LCD."
    },
    {
        "post_id":46038,
        "thread_id":45997,
        "title":"820-3588",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2019-02-11 23:59:12",
        "message":"Unfortunately i dont have the ASD for that model yet.\nWould one of those sensors also cause the Kernel Task to be high? in the older ones just the fan goes crazy. I put an original Apple HDD in and reconnected the LCD temp sensor and with the screen connected i get the same result.\nAlso i put SSDs in a few of these \"thinner\" models but never had issues with the fan\/Kernel Task. So i am confused by this one"
    },
    {
        "post_id":46041,
        "thread_id":45997,
        "title":"820-3588",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-02-12 02:16:51",
        "message":"As you already found knocked off component, this denotes a bad manipulation and god knows what else they did on the board.\nYou have lot of high temps reported and this could be a fault for a common I2C bus.\nCheck correct voltage for AVREF_SMC?\nAlso check all temp sensors from page 50.\nI think ASD 3S155 should work with your machine."
    },
    {
        "post_id":46064,
        "thread_id":45997,
        "title":"820-3588",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2019-02-12 05:43:06",
        "message":"This is a late 2013 model and i have tryed 3S155 already bevore using HW monitor(i have all up to 3S156) but nothing works unfortunately.\nI am not sure but if the data line has 3,3V (not shorted) this would mean that every single one of those sensors with the high readings on page 50 is bad? Cause if only one would be bad only that one would read high if the data line they all are on is ok or am i missuig something here?\nAVREF_SMC is 3,3V. That rly required some measurement skills^^"
    },
    {
        "post_id":46066,
        "thread_id":45997,
        "title":"820-3588",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-02-12 05:51:49",
        "message":"Some sensors are connected directly to SMC, which converts analog value to digital one.\nBut other sensors are connected to some chips which connect with SMC through I2C bus (SCL\/SDA).\nAnd some of them have connected more than 1 sensor..."
    },
    {
        "post_id":46076,
        "thread_id":45997,
        "title":"820-3588",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2019-02-12 06:22:21",
        "message":"Ahh, thank you. How can i check if a sensor itshelf is reading fine?\nMost of the sensors (except the HDD sensors) that fail were connected to U5600 (already replaced) and the I2C from this chip (both lines) to the SMC is 3,3V. Thats why i am so confused."
    },
    {
        "post_id":46086,
        "thread_id":45997,
        "title":"820-3588",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-02-12 08:12:30",
        "message":"I2C bus communication is more complex; is not just testing DC level voltage.\nIf possible to associate HWMonitor temperatures with corresponding sensors form page 50, that can help you make an idea where to dig..."
    },
    {
        "post_id":46146,
        "thread_id":45997,
        "title":"820-3588",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2019-02-13 08:05:36",
        "message":"As fas as i can tell all these sensors are part of SMBUS_SMC_0. On this line is the PCH (chipset) U1100, LCD temp (U5690), the smc itshelf and U5600. U5600 cpmbines the temp sensors T1 (Board proximity, CPU proximity and AC\/DC- Sensor). That are all the failing sensors except for the two harddrivebay sensors (and is has a non apple 2,5\" SSD in it as many of these models do from any without problems (from my experience). Thats why i expexted some problems on that line. But its not U5600 and i got 3,3V on R5300 as well as R5301 (Pin 2).\nSo as far as i can say there are two possibilitys:\n1): All these sensors are failing at the samt time\nor 2) something is wrong with the dataline and\/or SMC.\n\nThe only thing i could imagine from here, as i have no idea from I2C communication, is to try a new SMC, as this board is completely unusable right mow with ~400% CPU usage... But i have no idea why this part of the SMC should have died, as the rest of it works fine...\nOr am i chasing the wrong rabbit hole here?"
    },
    {
        "post_id":46148,
        "thread_id":45997,
        "title":"820-3588",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-02-13 08:28:49",
        "message":"Try other OSX installation first; just to discard a software issue."
    },
    {
        "post_id":46149,
        "thread_id":45997,
        "title":"820-3588",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2019-02-13 08:54:34",
        "message":"Customer had this issue with his SSD (i did not read the sensor values from his installation but fan spon high and it was unusable slow).\nActually i am using my own SSD with external USB adaptor (as i do everytime) and get the readings i posted in the beginning (tryed multiple times)..."
    },
    {
        "post_id":46152,
        "thread_id":45997,
        "title":"820-3588",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-02-13 10:55:15",
        "message":"Check continuity from U5600 to Q5610\/13.\nAlso check integrity of R5600 and L5614\/15.\n\nPCH and SMC are both connected on that bus.\nOf course, you will try to replace SMC first..."
    },
    {
        "post_id":46221,
        "thread_id":45997,
        "title":"820-3588",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2019-02-14 00:49:48",
        "message":"Thank you. I`ll check all that, oder a new donor (incase i need an SMC) and report back in a few days."
    },
    {
        "post_id":46343,
        "thread_id":45997,
        "title":"820-3588",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2019-02-17 11:17:56",
        "message":"I checked all the things you mentioned and everything is fine. Is there anything erlse i could have missed?\nI also reflowed the SMC (I thought maybe he bend the board while disassembeling or something) but still no change. So i ordered two fresh donors with SMCs on them. It has to be the SMC now or its done for this one..."
    }
]