[
    {
        "post_id":94436,
        "thread_id":63335,
        "title":"820-2915",
        "user_id":35752,
        "username":"Anterweb",
        "post_date":"2022-12-01 15:25:56",
        "message":"Got this in a couple of weeks back for a webcam problem and battery replacement,\n\nFirst off battery problem, I replace it with a new ( Chinese ) batt and get the same problem you helped me diagnose on a different board a while back, when running from new battery the Mac goes super slow and laggy, so much so that its unusable, Pop back in original battery and its fine again,.\n\nThing is I have now tried 11 yes 11!! different batteries and they all do the same thing, ( Even tried 3 diffrent versions of OS and its the same in all of them ) reading online I see people with the same issues talking about the mac not recognizing the serial or something on the battery and putting the cpu in like a half power or throttle  mode?\nThese threads also talked about fixing this issue by using some kind of \"No battery\" mod?\n\nAt one point during trying all kinds of things with this after resetting the P ram about 5 times it booted fast and the machine ran fine of one of these new batteries for a good 20 mins, I presumed that had fixed the issue. But after looking into the webcam issue and restarting again the problem came back and trying to reset the P ram again dosent seem to fix it.\n\nThere must be something up here for it not wanting to run of anything other than original battery ( That badly needs replacing! ) any advice on this?>\n\n\nThe webcam.\n\nopening facetime I get no video is being received from the connected camera and no green light next to webcam eye,\n\nALS works when shining flashlight into it and screen brightness auto adjusts,\n\nTried known good screen with working webcam, no change.\n\nIve changed   L3407\/8 from a donor board but still does not work?\nHelp?"
    },
    {
        "post_id":94438,
        "thread_id":63335,
        "title":"820-2915",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-12-02 00:45:58",
        "message":"No need to touch L3408, if ALS works.\nL3407 fails many times and you MUST check continuity of its sections, before changing it.\nAlso check continuity from L3407 to J3402.\nAnother relevant measurment, check diode mode to ground on both sides of L3407.\nIf all good, you may need to check\/change camera connector.\n\nNothing appears under Camera section in System Report?"
    },
    {
        "post_id":94446,
        "thread_id":63335,
        "title":"820-2915",
        "user_id":35752,
        "username":"Anterweb",
        "post_date":"2022-12-02 07:47:43",
        "message":"[ATTACH alt=\"cam.jpg\"]60879[\/ATTACH][ATTACH alt=\"cam2.jpg\"]60880[\/ATTACH]\n\nSO, after not finding anything wrong on the board and spotting that it shows up in system report I suspected the AMD chip,\n\nI plug in medusa disable AMD and remove R8911 boot and boom, Webcam works! WHoop\"\nBUT I still cant get this mac to run properly of any of these batteries other than the fked original,.\n\nIt boots of the batt and it charges fine and the system sees it fine,. But the whole machine runs so slow and laggy its unusable!\n\nIs there anything I can do about this? Is there no way from stopping the mac from throttling the CPU because of the battery as there is nothing actually wrong with them?"
    },
    {
        "post_id":94447,
        "thread_id":63335,
        "title":"820-2915",
        "user_id":35752,
        "username":"Anterweb",
        "post_date":"2022-12-02 09:35:38",
        "message":"Also just read this \n[URL unfurl=\"true\"]https:\/\/www.ifixit.com\/Answers\/View\/646298\/MacBook+CPU+constantly+throttled+to+0.8GHZ+after+iFixit+battery+swap[\/URL]\n\nScroll down and read where he says, Final update found a solution. Looks like he's run a jumper wire to ground. Is this something I could try with this mac and if so where could I put that jumper on this mac?"
    },
    {
        "post_id":94448,
        "thread_id":63335,
        "title":"820-2915",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-12-02 10:42:44",
        "message":"You can find CPU current sensors at page 49.\nInspect all ISENSE output circuits.\nYou should see very high current reported by HWMonitor for some of these currents, if is the case.\nShorting C5403\/51 can fix an eventual problem, in the same manner as mentioned in the posted link.\nHowever, you should detect first which current sensor (maybe voltage, or temp sensor) is triggered."
    },
    {
        "post_id":94459,
        "thread_id":63335,
        "title":"820-2915",
        "user_id":35752,
        "username":"Anterweb",
        "post_date":"2022-12-02 14:45:32",
        "message":"[URL unfurl=\"true\"]https:\/\/ibb.co\/nnSYs6t[\/URL]\n\nImage was too large to insert, \n\nLeft side is working fine with old battery, Right side is laggy as fuck with new battery. ???"
    },
    {
        "post_id":94460,
        "thread_id":63335,
        "title":"820-2915",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-12-02 16:00:41",
        "message":"Your case seems to be related with battery issue."
    },
    {
        "post_id":94464,
        "thread_id":63335,
        "title":"820-2915",
        "user_id":35752,
        "username":"Anterweb",
        "post_date":"2022-12-03 00:52:56",
        "message":"All 11 new batteries with the same issue though? Seems crazy that not one of these 11 new batteries will work in this machine, and they was purchased from 4 different vendors. \n\nAny recommendations as to where I can buy a new battery for this mac that will actually work?"
    },
    {
        "post_id":94465,
        "thread_id":63335,
        "title":"820-2915",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-12-03 02:08:24",
        "message":"I think Apple has a SMC firmware update for your machine.\nAnd is dedicated to correct battery problems.\nTry it, even your issue is not listed."
    },
    {
        "post_id":94470,
        "thread_id":63335,
        "title":"820-2915",
        "user_id":35752,
        "username":"Anterweb",
        "post_date":"2022-12-03 03:32:15",
        "message":"[ATTACH]60881[\/ATTACH]\nI've tried on both catalina and big sur, same problem, it had to be one of these os on this machine. Any way around this?"
    },
    {
        "post_id":94476,
        "thread_id":63335,
        "title":"820-2915",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-12-03 06:17:04",
        "message":"Use another disk, with supported macOS; maybe an USB test version.\nPut back client's disk, once update is finished."
    },
    {
        "post_id":94492,
        "thread_id":63335,
        "title":"820-2915",
        "user_id":35752,
        "username":"Anterweb",
        "post_date":"2022-12-03 12:30:04",
        "message":"Did the SMC firmware update, It made no difference, Guy came to pick this up so had to give it back with the old battery put back in,."
    }
]