[
    {
        "post_id":31186,
        "thread_id":31186,
        "title":"820-3330 SMC_BC_ACOK Missing when Battery Connected",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2018-02-07 10:08:09",
        "message":"Working on an 820-3330 and can't get it figured out:\n\n1. Board originally had no green light, no power, ppbus\/dcin missing, no liquid.\n2. Replaced Q7080\/30\/35, ISL, R7021\/22 and got my green light and fan spin.\n3. Noticed that with (known-good) battery connected, board won't show green light. If I unplug battery, then connect charger, green light is present.\n3. Board has green light without battery connected, and will keep green light if I connect battery after board is powered, and board will run from battery. If I plug charger in at this point, no green light again. If I connect battery then connect charger, I get no green light and no power (SMC_BC_ACOK missing).\n\nThought this was a pretty clear damaged SMC issue, but even a replacement SMC doesn't resolve issue. What am I missing here? I figured if green light works fine without battery, issue shouldn't be with U6900\/U6990, right? \n\nAny help appreciated, as always. Thanks!"
    },
    {
        "post_id":31189,
        "thread_id":31186,
        "title":"820-3330 SMC_BC_ACOK Missing when Battery Connected",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-02-07 10:54:43",
        "message":"I would more suspect an issue with U7000, pull and inspect\/replace again. Also check ACIN voltage, R7005 and pull up resistor on ACOK line."
    },
    {
        "post_id":31191,
        "thread_id":31186,
        "title":"820-3330 SMC_BC_ACOK Missing when Battery Connected",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2018-02-07 11:18:45",
        "message":"Hey Duke! Thanks so much; you were right on as usual. I checked R7005 and it was actually showing me 18.8 [B]k[\/B]Ohm and I did not notice that at first. Replaced it, got proper ~19.7ohm, but issue persisted. Realized that with the proper resistance there, D7005 then got scorching whenever I'd have battery\/charger connected (a hint I wouldn't have had without your tip on R7005!). Replaced D7005 and all is well now.\n\nAny idea what would damage D7005\/R7005? Shit charger, or maybe proxy-damage from ISL (from shit charger), or something more? Really appreciate this one, one more for me to document! Thanks so much, Duke."
    },
    {
        "post_id":31192,
        "thread_id":31186,
        "title":"820-3330 SMC_BC_ACOK Missing when Battery Connected",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-02-07 11:43:50",
        "message":"This was done by a shit chinese charger for sure."
    },
    {
        "post_id":31196,
        "thread_id":31186,
        "title":"820-3330 SMC_BC_ACOK Missing when Battery Connected",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2018-02-07 15:18:41",
        "message":"Thanks, Duke.\n\nI actually am still having a bit of trouble with this one; it works about 80% of the time. I checked back at my D7005, and noticed some odd diode readings (machine off for 10 minutes before these taken):\n\nD7005 diode: pins 1\/2: .627; pin 3: .540\n\nD7005 on a working board: pins 1\/2: 1.80; pin 3: .548\n\nSo, pins 1 and 2 are way off of a working board. I'm not quite sure where to go from here; is this maybe an issue with Q7080?"
    },
    {
        "post_id":31199,
        "thread_id":31186,
        "title":"820-3330 SMC_BC_ACOK Missing when Battery Connected",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-02-07 16:20:40",
        "message":"Usually Q7080, U7000, R7005 die, also current sense resistor circuits are suspect so check the usual pin 17\/18, 27\/28.\nAs you said D7005 got hot, that means the ISL is possibly damaged again or C7005 is shorting."
    },
    {
        "post_id":31231,
        "thread_id":31186,
        "title":"820-3330 SMC_BC_ACOK Missing when Battery Connected",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2018-02-08 09:56:25",
        "message":"Knock-on-wood, I think I got this one resolved finally (hopefully). I ended up replacing Q7080, and noticed my diode readings were back to normal. I also replaced a few of the caps around ISL because they just looked \"dark\", like they had seen a lot of heat. Since doing so, all seems well. Hopefully this will be my last post on this one! ;)\n\nThanks duke, really appreciate the help."
    }
]