[
    {
        "post_id":67179,
        "thread_id":60239,
        "title":"820-00165: Ram chip replacement",
        "user_id":1984,
        "username":"macRepairAmb",
        "post_date":"2020-10-27 15:11:32",
        "message":"I have this board that i believe needs it's ram chips changed. I'm getting error PPM003\/004 which points to an issue with the memory. I've checked for corrosion and found none. \n\nAs this my first ever ram replacement, my question, does it matter if the chip i used is of a different manufacturer but from the same donor board (820-00165)? The board needing fixed has chips from Skhynix but my donor boards has something else, which doesn't have a manufacturer name, just a pn, SEC740. Both the donor board and the board needing repairs are 8Gb boards. Only difference is the CPU, the board needing repairs is a 2.2GHz while the donor is a 1.8GhZ."
    },
    {
        "post_id":67181,
        "thread_id":60239,
        "title":"820-00165: Ram chip replacement",
        "user_id":1057,
        "username":"piernov",
        "post_date":"2020-10-27 15:39:03",
        "message":"It's fine but you also have to match the RAMCFG strapping resistors with the donor board. Check if R1631\/R1636\/R1635\/R1611\/R2050\/R2051\/R2052\/R2053 are populated or not on the donor board and replicate on the recipient board."
    },
    {
        "post_id":67215,
        "thread_id":60239,
        "title":"820-00165: Ram chip replacement",
        "user_id":1984,
        "username":"macRepairAmb",
        "post_date":"2020-10-28 12:20:00",
        "message":"Thanks a lot. That worked perfectly. Is there a link to a document that list all the resistors, like you did, for all model boars (A1398 - all years, A1502 - all years, and so on)?"
    },
    {
        "post_id":67219,
        "thread_id":60239,
        "title":"820-00165: Ram chip replacement",
        "user_id":1057,
        "username":"piernov",
        "post_date":"2020-10-28 13:22:07",
        "message":"As far as I know they all have the RAMCFG annotation, the schematics list some configurations but I'm not sure if they are 100% accurate."
    }
]