[
    {
        "post_id":62040,
        "thread_id":59626,
        "title":"820-00281 with a possibly faulty U3900 (T1)",
        "user_id":427,
        "username":"overshoot",
        "post_date":"2020-07-08 04:58:41",
        "message":"Hi,\n\nCustomer brought a machine that started to have issues with the Touchbar.\nHe told me that it would not light up but if you press on it it would do the action.\n\nHe didn't bother and carried on using the Mac.\n\nThen one day the Mac started to act up with the screen shutting off, touchbar too, even thought you could see the laptop was on.\nIt would sometimes work, sometimes not.\n\nMy tests:\nI can confirm that sometimes I am getting a picture and the touchbar to work just fine.\nOnce I turn off the Mac, I won't be able to turn it back with the power button.\nSometimes, the Mac will turn on with no screen detected but external will work fine (as if you would close the lid)\n\nSo I thought it could be a hall sensor issue and did investigate that but my measurements were fine.\nI re-did the solder joint on both sensor and it seemed to work for a while and then I wouldn't be able to turn the machine back on with the power button.\n\nChecking the diode mode measurements on J4900 (Power button) and J4401, J4402, it seems that all the readings going to U3900 are off slightly.\nThere is minor corrosion on the edge of the board (left and right) but nothing crazy which I did clean and rework in some areas with no improvement.\n\nI believe U3900 went bad but I can'ttell if I am right.\nWhat else could I check before going the rabbit hole route and replacing U3900?\nCan the hall sensor would mess up with the power button for example? (thinking the lid is down so it is disabled)\n\nIs that going to be nightmare to replace U3900? Underfilled and bigger than the CD3215 chips.\nI guess I know the answer for my 2nd question... ;-)"
    },
    {
        "post_id":62048,
        "thread_id":59626,
        "title":"820-00281 with a possibly faulty U3900 (T1)",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-07-08 07:09:09",
        "message":"Disconnect Touch ID and see if R5226 pads turn on\/off the board.\nIf not, check for 3V presence and drop pulse at SMC_ONOFF_L."
    },
    {
        "post_id":62571,
        "thread_id":59626,
        "title":"820-00281 with a possibly faulty U3900 (T1)",
        "user_id":427,
        "username":"overshoot",
        "post_date":"2020-07-19 21:10:49",
        "message":"EDIT: Actually, it did work once and after that it didn't. I unplugged the battery and try again and could not turn on the board anymore shorting SMC_ONOFF_L.\n\nIf the machine goes to sleep, it won't wake up by opening the screen or pressing any keys on the keyboard."
    },
    {
        "post_id":62578,
        "thread_id":59626,
        "title":"820-00281 with a possibly faulty U3900 (T1)",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-07-20 02:16:49",
        "message":"You should be sure the LID signals are good."
    },
    {
        "post_id":62583,
        "thread_id":59626,
        "title":"820-00281 with a possibly faulty U3900 (T1)",
        "user_id":427,
        "username":"overshoot",
        "post_date":"2020-07-20 04:12:44",
        "message":"Are you talking about  making sure those 2 signals, SMC_LID and DFR_TOUCH_LID are good?\n\nWith the Mac off, battery plugged in and screen in open position, SMC_LID is high and DFR_TOUCH_LID is low.\nWhen trying to press the power button, nothing happens as well as if I try to short SMC_ONOFF_L.\n\nPP1V8_S0SW_DFR is low at all time unless I plug the charger in and then the Mac starts bringing to 1.8V that signal + turning on the screen.\nDFR_TOUCH_LID stays low all the time.\n\nWhen putting the Mac to sleep, MacBook will never come back to life if pressing power button, some keys or opening the LID.\nDFR_TOUCH_LID stays low whereas SMC_LID is high with the screen in opened position.\nTrackpad click works\n\nIs U4200 a possible fault?"
    },
    {
        "post_id":62584,
        "thread_id":59626,
        "title":"820-00281 with a possibly faulty U3900 (T1)",
        "user_id":427,
        "username":"overshoot",
        "post_date":"2020-07-20 04:22:24",
        "message":"DFR_TOUCH_LID seems to get high when the LID is closed.\nSo when SMC_LID is high, DFR_TOUCH_LID is low and vice versa.\n\nWhen the screen won't turn on, I am able to get an external display though. But at some point, screen will go black and later, I'll get the message that \"your computer was restarted because of a problem\"..."
    },
    {
        "post_id":62585,
        "thread_id":59626,
        "title":"820-00281 with a possibly faulty U3900 (T1)",
        "user_id":427,
        "username":"overshoot",
        "post_date":"2020-07-20 05:04:29",
        "message":"The confusing part is that sometimes the MacBook will work just fine.\nPower button,  touchbar, sleep, screen sleep... it will work as normal.\n\nRight now, I am running it, put it to sleep, woke it up, restarting, etc... no issues whatsoever."
    },
    {
        "post_id":62588,
        "thread_id":59626,
        "title":"820-00281 with a possibly faulty U3900 (T1)",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-07-20 05:30:21",
        "message":"The behviour changes if you disconnect touchbar?"
    },
    {
        "post_id":62607,
        "thread_id":59626,
        "title":"820-00281 with a possibly faulty U3900 (T1)",
        "user_id":427,
        "username":"overshoot",
        "post_date":"2020-07-20 09:48:33",
        "message":"Not really but since it's happening randomly I am unsure...\nI am currently trying the mainboard in a complete different enclosure and touchbar has always been working fine with the good known motherboard.\n\nI did transfer the power button to the enclosure to test though.\n\nI think I will start replacing U4200 first and if it doesn't change anything I will blame U3900.\nI believe resetting the SMC helps for a while and then the Mac will misbehave at some point.\nThat leads me to think U3900 is the culprit."
    }
]