[
    {
        "post_id":52304,
        "thread_id":52304,
        "title":"820-00281: Question Mark Folder. No seeing SSD",
        "user_id":1984,
        "username":"macRepairAmb",
        "post_date":"2019-09-15 20:00:01",
        "message":"Original problem was power loss, won't boot. Repaired.\nPerformed SSD reformat and reinstall of OS without issue.\nNext day, I attempted to go in to see what the size of the SSD was but now it keeps giving me the question mark folder and when I go into disk utility, the SSD isn't showing up.\nWhen I try to boot with an external driver, I get an error that say:\n\"A Critical Software update is required for you Mac...\"\nWhen I tell it to proceed, it then gives me an error saying \n\n\"A Critical Software update is required for you Mac, but an error was encountered while installing this update\"\n\nI've tried wifi and ethernet with no success.\n\nAnyone see this or have suggestion?"
    },
    {
        "post_id":52313,
        "thread_id":52304,
        "title":"820-00281: Question Mark Folder. No seeing SSD",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-09-16 03:44:59",
        "message":"The error is related with ToucBar models, but is strange to lost SSD at same time.\nHowever, read all these threads...\n[url]https:\/\/boards.rossmanngroup.com\/search?q=critical+update&searchJSON=%7B%22keywords%22%3A%22critical+update%22%7D[\/url]"
    },
    {
        "post_id":52324,
        "thread_id":52304,
        "title":"820-00281: Question Mark Folder. No seeing SSD",
        "user_id":1984,
        "username":"macRepairAmb",
        "post_date":"2019-09-16 07:38:33",
        "message":"Going through the threads now. I do have another question, this board is not the original board for the frame or Touch ID, could that be the issue?"
    },
    {
        "post_id":52325,
        "thread_id":52304,
        "title":"820-00281: Question Mark Folder. No seeing SSD",
        "user_id":1984,
        "username":"macRepairAmb",
        "post_date":"2019-09-16 07:47:57",
        "message":"Ok, so working with lack of sleep is a bad thing. After I posted the last message about the it not being the original board, it all made freaking sense. I forgot the stupid life boat on the other board. Once plugged back in, all is right with the world. I'm so sorry for wasting you time, but thanks for the assist."
    }
]