[
    {
        "post_id":80122,
        "thread_id":61705,
        "title":"820-01237 iMac going slow",
        "user_id":29109,
        "username":"Outofwhack",
        "post_date":"2021-09-13 16:22:43",
        "message":"Are schematics, boardview and diagnostics available for this board? Link appreciated if so.\nAre there any common problems with this one?\nFan is going fast and HWMonitor.app reports high temps on HDD bay 1 (249c), HDD bay 2 (129) and GPU 2 die (129)"
    },
    {
        "post_id":80124,
        "thread_id":61705,
        "title":"820-01237 iMac going slow",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-09-13 16:30:47",
        "message":"Nothing out to the public yet:(.\nAny history available?\n\nYou should check any HDD\/SSD temp sensor, if possible."
    },
    {
        "post_id":80127,
        "thread_id":61705,
        "title":"820-01237 iMac going slow",
        "user_id":29109,
        "username":"Outofwhack",
        "post_date":"2021-09-14 01:04:22",
        "message":"The temps as reported by HWMonitor.app were with the original Apple supplied spinning HDD. I do see SBBOD . I’ve replaced the HDD with a Samsung evo 960 [and a SATA extension that hopefully grounds the temp sensor pin] the 249c has now become 129c.\nFan still wants to spin fast and SBBOD still around."
    },
    {
        "post_id":80128,
        "thread_id":61705,
        "title":"820-01237 iMac going slow",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-09-14 01:47:48",
        "message":"So the error was there before someone open the machine?\nIf yhis is the case, then try disconnecting webcam.\nIf machine was opened before, check the LCD temp sensor too."
    },
    {
        "post_id":80137,
        "thread_id":61705,
        "title":"820-01237 iMac going slow",
        "user_id":29109,
        "username":"Outofwhack",
        "post_date":"2021-09-14 04:51:31",
        "message":"Yes the slowness and semi frequent SBBOD  was there before anyone opened the iMac. It is the sole reason customer has brought me it.\nI tried booting with the webcam removed - no difference sadly.\nLCD sensor reports 129c when screen disconnected and 25c when connected so no suspicion there.\n\nQUESTION: Is there a way to see the throttling back of the CPU other than the resulting slowness - a good utility perhaps?\n\nQUESTION: Also, given I've got a few sensors supposedly showing open circuit or high C values is there a certain chip that handles multiple sensor levels that might have failed?\n\nQUESTION: Do you think it could be found without aid of schematic and board view?"
    },
    {
        "post_id":80148,
        "thread_id":61705,
        "title":"820-01237 iMac going slow",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-09-14 11:41:37",
        "message":"Shouldn' be a particular sensor issue, as you get more bad values reported.\nThere should be a problem with one interface with blocks the correct communication on I2C bus.\n\nJust in case, discard a softare issue.\nDisconnect internal SSD and test it with USB macOS.\nDo PRAM reset 2-3 times also."
    },
    {
        "post_id":80161,
        "thread_id":61705,
        "title":"820-01237 iMac going slow",
        "user_id":29109,
        "username":"Outofwhack",
        "post_date":"2021-09-14 14:23:34",
        "message":"Many thanks for your help 2informaticos.\n\nI think the speed of the SSD does compensate for the suspecting slow running so they may be happy - but Im keen to find ways to debug these issues.\n\nQuestion: Is there a utility or unix command to confirm slowed processing? Throttling\nQuestion: Is it useful to view the I2C bus with a suitable scope e.g. DS1054z"
    }
]