[
    {
        "post_id":80676,
        "thread_id":61771,
        "title":"Removing Malware from Motherboard",
        "user_id":32469,
        "username":"hugohutte",
        "post_date":"2021-09-27 18:43:35",
        "message":"Hi guys,\nI have a rather unusual question for you. My friend owns a late-2013 MBP which has been infected with some pretty sophisticated malware. We've replaced the SSD with a fresh one and reinstalled Catalina to no avail, so it seems the motherboard itself has been compromised. I've also tried resetting the firmware, NVRAM, and SMC but it still persists. I guess once malware has gotten in at the hardware level it's able to prevent it's own removal.\n\nSo my question - in which parts of the motherboard would something like this be able to hide? Is it technically\/economically feasible to swap out these parts in order to avoid buying a replacement motherboard? Is there anything else I should try before resorting to this?\n\nI've asked this question elsewhere and have been met with incredulity, but we're 100% sure of the presence of the malware. It's sort of an odd story... she has a friend who is a security researcher and he infected her machine as a sort of gag. Each time we've tried to remove it he's been able to prove that he can still monitor her activity. He thinks it's hilarious but it's really driving her crazy.\n\nThanks in advance for your advice!\n\n\nModel details:\n[LIST]\n[*]MacBook Pro 15-Inch \"Core i7\" 2.3 Late 2013 (DG)\n[*]MacBookPro11,3 \/ A1398\n[\/LIST]"
    },
    {
        "post_id":80677,
        "thread_id":61771,
        "title":"Removing Malware from Motherboard",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-09-27 23:59:01",
        "message":"First of all, welcome to the forum!\n\nI can't say to much, if you didn't tell us which kind of software problem noted on the machine.\n\nFlashing BIOS and replacing SSD will erase any kind of \"persistent memory\" from the board."
    },
    {
        "post_id":80701,
        "thread_id":61771,
        "title":"Removing Malware from Motherboard",
        "user_id":32469,
        "username":"hugohutte",
        "post_date":"2021-09-28 18:52:17",
        "message":"Hey thanks, glad to be here!\n\nThere are no software symptoms. The \"attacker\" (her friend) is able to reliably tell her what she's been up to on the machine. What websites she visits, the things she's working on in Illustrator (she's a graphic designer), etc.\n\nIs there a way to flash the BIOS on a Macbook? My understanding was that firmware updates are performed by the MacOS installer, so I reverted back to an old version of MacOS (Sierra, I believe) and then upgraded back to Catalina. The idea was to revert to an old firmware, and then the Catalina installer would flash it to the latest version. Is there a way to perform firmware updates manually?\n\nOtherwise, I guess what I was asking was whether it's possible to acquire a used firmware chip and have a local repair shop replace it directly on the board. Is that even feasible?"
    },
    {
        "post_id":80702,
        "thread_id":61771,
        "title":"Removing Malware from Motherboard",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-09-29 03:34:20",
        "message":"Her ex-friend probably knows her and what she does normally on the computer.\nLike her job and most visited websites.\nI doubt he exactly can tell where she browsed at which time.\n\nHowever, flashing BIOS and erasing SSD at same time, will avoid any backdoor malware possible.\nAn upgrade to newer macOS doesn't flash entire BIOS.\n\nChanging BIOS chip is not the correct way.\nIn such case, ME region MUST be cleaned.\nThe same chip on the machine can be flashed with new file (clean ME of course).\nA good repair shop knows how to do it correctly."
    },
    {
        "post_id":80706,
        "thread_id":61771,
        "title":"Removing Malware from Motherboard",
        "user_id":1057,
        "username":"piernov",
        "post_date":"2021-09-29 05:16:00",
        "message":"Harassment should be reported to the relevant authorities, that's not a problem you solve by messing with a laptop board…\nIn any case either the laptop is enrolled in MDM or the owner of the machine uses the same set of accounts, passwords or apps after reinstalling that have been compromised by the attacker.\nOr none of that and is just being paranoid, which pretty unfortunately happens under harassment (hence why the first point is important)."
    },
    {
        "post_id":80861,
        "thread_id":61771,
        "title":"Removing Malware from Motherboard",
        "user_id":32469,
        "username":"hugohutte",
        "post_date":"2021-10-02 17:22:00",
        "message":"[QUOTE=\"piernov, post: 80706, member: 1057\"]\nHarassment should be reported to the relevant authorities\n[\/QUOTE]\nYea, that's what I told her too. She thinks it will only make things worse and we're not sure how to definitively prove it without a very expensive and lengthy forensics process. If she could afford that she'd just buy a new laptop.\n\nCan anyone recommend any openly available tools to flash a Macbook Pro firmware? Is any special equipment necessary to do this? Also, does Apple provide official firmware binaries somewhere? I can't seem to find any."
    },
    {
        "post_id":80863,
        "thread_id":61771,
        "title":"Removing Malware from Motherboard",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-10-02 17:28:05",
        "message":"Did she change all the passwords for emails and other online accounts?\n\nThe BIOS file should be already posted on the forum.\nCheck against 820-xxxx code of the board."
    },
    {
        "post_id":80977,
        "thread_id":61771,
        "title":"Removing Malware from Motherboard",
        "user_id":32469,
        "username":"hugohutte",
        "post_date":"2021-10-04 19:21:23",
        "message":"Yes, she's changed her passwords.\n\nI'll check the board code and see if I can find a firmware. Is there a tool I'll need to buy in order to flash the BIOS?"
    },
    {
        "post_id":80996,
        "thread_id":61771,
        "title":"Removing Malware from Motherboard",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-10-05 02:39:54",
        "message":"Some tools to read\/write BIOS onboard exist; like Medusa programmer.\nNot a good deal to solve one machine only.\nSimple CH341 programmer can do the job, extracting SPI chip (U6100).\n\nBIOS file is probably posted on the forum."
    },
    {
        "post_id":81055,
        "thread_id":61771,
        "title":"Removing Malware from Motherboard",
        "user_id":32469,
        "username":"hugohutte",
        "post_date":"2021-10-05 12:54:48",
        "message":"Awesome. This should be enough to get me started. Thank you!"
    },
    {
        "post_id":81109,
        "thread_id":61771,
        "title":"Removing Malware from Motherboard",
        "user_id":32599,
        "username":"Blackmambo90",
        "post_date":"2021-10-06 19:01:54",
        "message":"Just a guess... do by any chances he have maybe access to her router?"
    }
]