[
    {
        "post_id":8390,
        "thread_id":8390,
        "title":"820-3437 Works fine, but won't boot from USB drives?",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2016-10-21 11:31:17",
        "message":"820-3437 that works fine, passes ASD, and will read from USB drives, but for some reason will not boot from USB drives? I've seen this before in the past with bad ME regions, but that doesn't appear to be the case on this one. I checked closely, and there's no evidence that anyone ever messed with the chip area, and the system serial and board serial are both correct in the EFI dump, so I don't think it's been tampered with. I forced an EFI update anyway to be sure, and it still hangs when booting from any USB external drive (have tried 3 that all work perfectly\/boot normally on an identical machine). Internet recovery seems to work fine, and will complete a remote restore of OSX. Board boots to SSD normally, works fine, no issues. USB ports do work, and I transferred several files using each USB port to make sure there was no latency issue, and all seems fine. The only issue is the board will not actually boot from an external drive. No liquid damage to the board.\n\nSort of a weird one, and I'm not sure how to proceed. Anyone ever seen anything like this?"
    },
    {
        "post_id":8393,
        "thread_id":8390,
        "title":"820-3437 Works fine, but won't boot from USB drives?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-10-21 13:32:23",
        "message":"I would also suspect a ROM issue. But do you really want to mess with something that is such a minor problem? The EFI update probably does not flash the ME!"
    },
    {
        "post_id":8394,
        "thread_id":8390,
        "title":"820-3437 Works fine, but won't boot from USB drives?",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2016-10-21 13:36:30",
        "message":"Hey Duke, I cleaned the ME region myself, but yeah I was just curious if anyone had experienced similar issues. It's not a big deal, but was a complaint by a customer. Thanks!"
    },
    {
        "post_id":8397,
        "thread_id":8390,
        "title":"820-3437 Works fine, but won't boot from USB drives?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-10-21 13:43:54",
        "message":"Are you using a USB3.0 stick? Try with an older 2.0 stick. It should also be possible to boot from the SD card or thunderbolt."
    }
]