[
    {
        "post_id":7078,
        "thread_id":7078,
        "title":"Chime but no picture",
        "user_id":442,
        "username":"LaptopRepair",
        "post_date":"2016-09-21 16:37:36",
        "message":"Hello;\n\nI ve got a macbook pro model A1502 when powering it you hear the chime and the fun spins I got no picture. \nCan you please give me some hints where to begin troubleshooting?\n\nGreeting\n\nRachid"
    },
    {
        "post_id":7081,
        "thread_id":7078,
        "title":"Chime but no picture",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-09-21 16:40:50",
        "message":"No picture or no backlight? Hold a flashlight on the back of the Apple logo and see if you can see anything."
    },
    {
        "post_id":7089,
        "thread_id":7078,
        "title":"Chime but no picture",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2016-09-21 21:50:05",
        "message":"What voltage do you have on pin 1, then 28\/29\/30 of the LCD connector?"
    },
    {
        "post_id":7129,
        "thread_id":7078,
        "title":"Chime but no picture",
        "user_id":442,
        "username":"LaptopRepair",
        "post_date":"2016-09-22 11:42:01",
        "message":"It is no backlight.\nWhen pushing the power button I hear the chime. Fan spins and with a close look to the display, I see a little bit light. But I cannot decifer what I see. The lcd remains dark. Even eith a flash light I cannot see the os loading or anything else."
    },
    {
        "post_id":7130,
        "thread_id":7078,
        "title":"Chime but no picture",
        "user_id":442,
        "username":"LaptopRepair",
        "post_date":"2016-09-22 11:58:27",
        "message":"PPVOUT_S0_LCDBKLT (pin1) is 0V.\nPP5VR3V3_SW_LCD ( pin28\/29\/30) is 5V12"
    },
    {
        "post_id":7203,
        "thread_id":7078,
        "title":"Chime but no picture",
        "user_id":442,
        "username":"LaptopRepair",
        "post_date":"2016-09-23 09:23:30",
        "message":"I see that i can further follow why the PPVOUT_S0_LCDBKLT is not generated. But I faced the next problem: for example need to see if D7710 is ok. Then the L7710 then the Q7700 etc... but those components are at the other side of the board. Need to take it out of the case and test them. The problem is that those are \"S0\" signals that need to be measured on running state \"S0\". I m right?\n\nAlso need to understand how the U700 works. Important input\/output signals ?"
    },
    {
        "post_id":7245,
        "thread_id":7078,
        "title":"Chime but no picture",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2016-09-24 12:37:07",
        "message":"Yes you do have to get used to testing with the board outside the machine, which is a pain in the ass of jumbling wires around and twisting things into all sorts of weird positions. The backlight circuit will not come on without the screen plugged in so anytime we are measuring voltage we have to turn it on with a known good screen plugged in.\n\n1) What do you get at pins 4 and 3 of Q7700?\n2) What is the resistance to ground on PPVOUT_S0_LCDBKLT with a screen plugged in, and a screen not plugged in?"
    },
    {
        "post_id":7293,
        "thread_id":7078,
        "title":"Chime but no picture",
        "user_id":442,
        "username":"LaptopRepair",
        "post_date":"2016-09-26 11:03:07",
        "message":"Resistance to ground op pin 1 PPVOUT_S0_LCDBKLT 160kohm screen plugged. \nWithout plugged 163kohm. Without power.\nQ7700 PIN3 1V and PIN4 1V1.\nEven on F7700 PPBUS_G3H voltage is 1V1.\nMeans PPBUS_G3H is missing."
    },
    {
        "post_id":7378,
        "thread_id":7078,
        "title":"Chime but no picture",
        "user_id":442,
        "username":"LaptopRepair",
        "post_date":"2016-09-29 05:36:43",
        "message":"Hello;\n\nI ve done some further measurements. Please check next:\n\n[COLOR=#222222][FONT=arial]1- At F7700 PPBUS_G3H is 0V[\/FONT][\/COLOR]\n[COLOR=#222222][FONT=arial]2- L7130 pin1\/2 to GND gives short. In diode mode it gives 0.05[\/FONT][\/COLOR]\n[COLOR=#222222][FONT=arial]3- lifted L7130. Pin2 gives short only. Means short in the direction of pin2.[\/FONT][\/COLOR]\n[COLOR=#222222][FONT=arial]4- lifted F7140 pin2 only gives short.[\/FONT][\/COLOR]\n[COLOR=#222222][FONT=arial]5- Pin4 only of Q7700 gives short to GND[\/FONT][\/COLOR]\n[COLOR=#222222][FONT=arial]6- Checked the IC U7700 seems to be dammaged. Look foto:[\/FONT][\/COLOR]\n\n[COLOR=#222222][FONT=arial]Please check the image of the ic.[\/FONT][\/COLOR]\n[ATTACH=CONFIG]temp_621_1475154035223_47[\/ATTACH]\n[COLOR=#222222][FONT=arial]7- lifted the IC U7700 but short remains on pin4 of Q7700.\nBut the short still there at Pin3.\n\nAny suggestions[\/FONT][\/COLOR]"
    },
    {
        "post_id":7382,
        "thread_id":7078,
        "title":"Chime but no picture",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-09-29 05:57:47",
        "message":"Why are you messing with L7130? The system works this has nothing to do with the backlight if there was a short on L7130 there would be no PPBUS and system would be dead.\nIs F7700 blown, it must be when there is a short on pin 4 of Q7700.\n\nAt this point is the machine still working?"
    },
    {
        "post_id":7389,
        "thread_id":7078,
        "title":"Chime but no picture",
        "user_id":442,
        "username":"LaptopRepair",
        "post_date":"2016-09-29 10:12:37",
        "message":"I ve lifted the coil L7130 because I ve found a short along that line. On both pins of the coil. So to have an indication where the short can be caused is to separate that line where the short is. To get that done I had to lift the coil L7130. Like that I have separatede the U7100 from the U7700.  When testing I ve seen that there is no short is detected in pin 1 of the coil L7130, but the short remains on pin2. This means that the short can be caused from the other side of the PPBUS_G3H.\nAND PPBUS_G3H must be 8V6. But at pin1\/2 of F7700 1V1. \nF7700 is not blown and the voltage on pin4 of Q7700 is 1V1.\nI ve lifted the ic U7700 because of the blown like image it shows at the top of it like you see on the picture. \nIn my opinion there is only two ways left to be checked that can cause the short namely, ISNS_LCDBKLT_P or ISNS_LCDBKLT_N.\n\nYour latst question concerning if it is still working, I need to solder the IC U7700 back, that I think is bad, and will let you know."
    },
    {
        "post_id":7469,
        "thread_id":7078,
        "title":"Chime but no picture",
        "user_id":442,
        "username":"LaptopRepair",
        "post_date":"2016-09-30 10:36:58",
        "message":"Dukefawaks, you are right.\nThe situation is as next. We got 2 macbook air for reparation. I ve mentionned the problem of the one I ve checked. The next day my colleague moves that one from the place I ve lefted him. The next day I ve done some measurement on the wrong one that was put on same table as the day before. Thinking that it was the same one. But it wasn't.\n\nThe first one I ve checked had indeed chime but no beeld. But all the measurements I ve done were on the one that was tottaly dead.\n\nSorry guys. I ve just noticed this today.\n\nI think that we close this thread as not solved. And I will begin a new one.\n\nSorry again."
    }
]