[
    {
        "post_id":102993,
        "thread_id":64369,
        "title":"820-01521 USB-C ports cycling",
        "user_id":427,
        "username":"overshoot",
        "post_date":"2023-12-07 02:30:51",
        "message":"Hi,\n\nI have that board that was previously worked on.\nCustomer told me the laptop did shut off while working, battery was charged or at least partially charged.\nWhen I got the board, the amp meter was showing nothing.\nUpon inspection the USB-C area was reworked as well as the as the U7000 area.\nI went ahead and replaced both CD3215 from a donor board as well as U7000.\n\nNow I am getting the ports to cycle.\n5V at 0.3A then 5V at 0.15A and cycle.\nBoth ports, both ways will do that.\nSometime it goes to 5V 0.5A and stays there.\n\nUnder thermal cam I can only see the PMIC getting warm (50 degrees C)\nT2 around 40 degrees.\n\nI've reflowed the CD3215 area, checking for bad solder connections.\nI've replaced the MUX chip.\nI've checked the diode mod on the TBT ROM pins and all good.\n\nCan this be a board stuck in DFU or am I dealing with a dead T2?\nTomorrow I'll attempt the PMIC replacement but if you have any hint in the meantime, please share."
    },
    {
        "post_id":103001,
        "thread_id":64369,
        "title":"820-01521 USB-C ports cycling",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-12-07 11:14:44",
        "message":"Check diode mode to ground on all coils; from secondary power suppplies.\n\nPPBUS_G3H and 3V3_G3H_RTC fluctuating too?\nWhat about U7800's LDOs?\nALso check its SLPS2R and AWAKE voltages."
    },
    {
        "post_id":103008,
        "thread_id":64369,
        "title":"820-01521 USB-C ports cycling",
        "user_id":427,
        "username":"overshoot",
        "post_date":"2023-12-07 20:36:31",
        "message":"PPBUS_G3H is definitely fluctuating. When ampmeter is on, it seats at 12.3V and then shuts.\nHowever when the ampmeter measures 5V 0.5A, PPBUS is at 8V slowing raising up.\n\nPP3V3_G3H_RTC is definitely not stable, even when the ampmeter is on.\n\nWell I guess the CPU is toast: L7821 and L7822 measures 3 ohms to ground and L7820 and L7819 measures 27 ohms so..."
    },
    {
        "post_id":103011,
        "thread_id":64369,
        "title":"820-01521 USB-C ports cycling",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-12-08 00:28:41",
        "message":"Very likely dead CPU.\nThese readings are from good board (diode mode):\nL7819\/20    308\nL7821\/22    260\nL7823        276"
    }
]