[
    {
        "post_id":100475,
        "thread_id":64039,
        "title":"820-00165 No Power when Audio Flex Connected",
        "user_id":33944,
        "username":"PCSWILTS",
        "post_date":"2023-07-06 03:39:59",
        "message":"Hi, I have a 820-00165 board - came in liquid damaged - on inspecting the board I found minimal damage at the trackpad connector which I cleaned and replaced the trackpad cable. Mac will only switch on if the audio board flex is not connected to the logic board.  I've had this a number of times in the past and replacing the flex cable (821-1722) has always solved the issue.  On this occasion replacing the cable hasn't worked - I've  ordered another cable to make sure I don't have an issue with the replacement cable.  In the mean time wondering if anyone else has experience with this problem and can think of anything else I could be checking. \n\nTo round up - board will power on if flex cable not connected - can plug cable in after boot and the device will restart no problem - have tested every key on the keyboard, webcam, mic audio etc and everything appears to be functions correctly except powering down and then trying to turn the device back on while the audio flex is connected.\n\nThank you."
    },
    {
        "post_id":100477,
        "thread_id":64039,
        "title":"820-00165 No Power when Audio Flex Connected",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-07-06 03:54:22",
        "message":"Is the battery charging after you've connected LIO flex?\nDo you get amber light on Magsafe at least?\nRun HWMonitor and check I\/V sensors then.\n\nTest if machine turns on in SMC bypass, with LIO flex\/board connected."
    },
    {
        "post_id":100498,
        "thread_id":64039,
        "title":"820-00165 No Power when Audio Flex Connected",
        "user_id":33944,
        "username":"PCSWILTS",
        "post_date":"2023-07-07 06:45:52",
        "message":"Yes battery is charging, I get green and amber light - I think I have the issue with it not giving power on signal and providing smc_rst instead as when I press the power button the amber light turns green briefly.  HWMonitor seems to be for windows?  I've changed the trackpad - only thing left I can think of now is to change the trackpad connector on the board as this was the initial point of liquid damage - I've ordered one and I'll give that a go on Monday. Thanks for your help."
    },
    {
        "post_id":100501,
        "thread_id":64039,
        "title":"820-00165 No Power when Audio Flex Connected",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-07-07 10:55:28",
        "message":"Check SMC_LSOC_RST_L level, w\/ and w\/ trackpad flex connected.\nThis signal must be always high; until SMC reset is done."
    }
]