[
    {
        "post_id":38180,
        "thread_id":38180,
        "title":"820-3462 Aftermarket Battery Damage",
        "user_id":1092,
        "username":"Ryanlen2",
        "post_date":"2018-08-07 19:25:56",
        "message":"Computer came in very slow and laggy.  Like when aftermarket battery or no battery is being used, which in this case it was aftermarket and not being recognized. So, I ordered a new battery and a week later installed it.  Powered on the computer with the new battery and it went right into OS. Showed battery charge percentage at 78 percent and functioned completely normal. Checked sys info and it showed charging as well. I then turned off the computer and screwed everything back in, only to find out when I went to boot it back up, it again would not boot off battery and was lagging. Here is what I have after removing the board. \nI found a tiny bit of corrosion on C70221. I replaced it and checked 27\/28. Resistance was all good. Also checked 17\/18. Everything good there as well to be safe. \n\nIm getting 11.54V on  PPBUS with only battery connected. Computer will not turn on like this.\nWhen charger and battery connected. Computer boots very slowly into OS. battery icon is full black with lightning bolt in it as if its charging.\nAlso in sys info\/Power - I get this  [url]https:\/\/photos.app.goo.gl\/VsfVCp7XNKBKvzWLA[\/url]\n\nThanks."
    },
    {
        "post_id":38208,
        "thread_id":38180,
        "title":"820-3462 Aftermarket Battery Damage",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-08-08 05:55:50",
        "message":"Is the special screw that hold down the plastic cover over the main screw for the battery in place? This needs to short out 2 pads on the board to enable the battery.\n\nThese A1425 batteries are also all pulled garbage from China, there are no new ones. Could also be crap under the SMC of course."
    },
    {
        "post_id":38214,
        "thread_id":38180,
        "title":"820-3462 Aftermarket Battery Damage",
        "user_id":1092,
        "username":"Ryanlen2",
        "post_date":"2018-08-08 06:42:08",
        "message":"Reflowed\/Replaced SMC the other day. Screw is in, (found that out the hard way, couple days ago) ;). The battery I have says Apple japan on it and has the liquid indicators on it. Here is a pic. Please let me know if this is my problem. Thanks Duke. \n\n[url]https:\/\/photos.app.goo.gl\/oNN7PUWqhutyV2oq6[\/url]"
    },
    {
        "post_id":38246,
        "thread_id":38180,
        "title":"820-3462 Aftermarket Battery Damage",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-08-09 14:46:39",
        "message":"Probably just a garbage Chinese battery. There are no new batteries for these, they are all pulled trash that is reset to 0 cycles and new charge capacity."
    },
    {
        "post_id":38273,
        "thread_id":38180,
        "title":"820-3462 Aftermarket Battery Damage",
        "user_id":1092,
        "username":"Ryanlen2",
        "post_date":"2018-08-10 05:42:57",
        "message":"Ok Duke. What about like, an iFixit battery where they guarantee working?  LMK.\n\nHave a good afternoon."
    },
    {
        "post_id":38290,
        "thread_id":38180,
        "title":"820-3462 Aftermarket Battery Damage",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-08-10 11:57:34",
        "message":"They will still be pulled shit. Batteries for the older retina models are hopeless."
    }
]