[
    {
        "post_id":35017,
        "thread_id":35017,
        "title":"[SOLVED]iMac 27\" 2011 no backlight",
        "user_id":64,
        "username":"Dozer",
        "post_date":"2018-05-20 05:07:56",
        "message":"hi, i got this machine with no picture, dark screen.\n\nnow i replaced the grafik card, picture is there but after about 10min again dark screen and smelling\ni found the inverter board a blown up ZD3, in the middle between the mosfets\n\ni replaced the inverter board, picture is there but after half an hour smelling and dark screen.\n\ninverter board again blown, this time ZD2.\n\nno i still have 2 inverter boards. but i think if i replace it again will pass not long time and again it will be blown.\n\nbut i have no idea what could be the reason.\n\nthe power unit? or the screen? need a help please. any suggestion?"
    },
    {
        "post_id":35033,
        "thread_id":35017,
        "title":"[SOLVED]iMac 27\" 2011 no backlight",
        "user_id":64,
        "username":"Dozer",
        "post_date":"2018-05-21 03:57:39",
        "message":"no suggestions?"
    },
    {
        "post_id":35036,
        "thread_id":35017,
        "title":"[SOLVED]iMac 27\" 2011 no backlight",
        "user_id":64,
        "username":"Dozer",
        "post_date":"2018-05-21 05:59:02",
        "message":"No Title"
    },
    {
        "post_id":35078,
        "thread_id":35017,
        "title":"[SOLVED]iMac 27\" 2011 no backlight",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-05-22 02:22:10",
        "message":"Make sure to check for damage\/shorts on the backlight LED cable first.\nAfter that probably the usual LED strips inside the LCD. Completely rip apart the LCD, take out the 2 LED strips and reflow all LEDs and the 2 connectors. If this is the first time you will probably destroy the LCD so be prepared to buy a new one. Or find a cracked\/scratched one to practice on first!"
    },
    {
        "post_id":35122,
        "thread_id":35017,
        "title":"[SOLVED]iMac 27\" 2011 no backlight",
        "user_id":64,
        "username":"Dozer",
        "post_date":"2018-05-23 10:38:47",
        "message":"thanks duke. i tryed now the next inverter and another lcd. now it is working over hours without problems. so you was right with the lcd inside. i offered the customer that used lcd and he is happy now. if i will have a lot of time i will dissasemble the faulty one to have a look, it looks like a lot of fuddely work :-)\nthanks for help what to check first."
    }
]