[
    {
        "post_id":36194,
        "thread_id":36194,
        "title":"[SOLVED]820-3332a Breaking SSDs, No visible liquid contact or corrosion on board",
        "user_id":370,
        "username":"drewrox2009",
        "post_date":"2018-06-26 09:45:09",
        "message":"bit of a backstory on this computer. \ncomputer had light liquid on keyboard. Ordered and tested keyboard replacement, no liquid contact was found on board or drive. \ncomputer comes back a couple of days later with blown component on ssd. Looked over board again, made sure that ssd was getting 3.3v checked for any shorts. Ordered parts ssd, replaced compoennt on ssd and booted computer, created time machine backup. rebooted computer and immediately the smell of smoke. quickly disconnected battery from computer. same part fried again. but data is now safe. \n\nordered new drive, but afraid to install it in the machine, i know we don't have schematics for the ssds, but i am not certain what the motherboard is doing to fry this component. The component was labled c7h on the original drive, c7j on the parts board and c7c on the brand new drive. it is connected to the 3.3v rail. Can i find this component on any of my donor boards? \n\nI have just finished some more measuring and it looks like the 3.3v rail jumps up to 5v for a quick second when just powering up and then a steady 3.3v is this causing the failure."
    },
    {
        "post_id":36195,
        "thread_id":36194,
        "title":"[SOLVED]820-3332a Breaking SSDs, No visible liquid contact or corrosion on board",
        "user_id":370,
        "username":"drewrox2009",
        "post_date":"2018-06-26 09:56:20",
        "message":"[ATTACH=JSON]{\"data-align\":\"none\",\"data-size\":\"medium\",\"data-tempid\":\"temp_1843_1530032128891_898\"}[\/ATTACH][IMG type=\"full\" width=\"200px\"]https:\/\/www.rossmanngroup.com\/boards\/core\/image\/gif;base64,R0lGODlhAQABAPABAP\/\/\/wAAACH5BAEKAAAALAAAAAABAAEAAAICRAEAOw==[\/IMG]​ this is the ssd and the component that has failed"
    },
    {
        "post_id":36220,
        "thread_id":36194,
        "title":"[SOLVED]820-3332a Breaking SSDs, No visible liquid contact or corrosion on board",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-06-26 19:05:33",
        "message":"While it is of course possible that 3V3_s0 is going high it is not very likely. Got a scope to capture the actual voltage on this rail?"
    },
    {
        "post_id":36248,
        "thread_id":36194,
        "title":"[SOLVED]820-3332a Breaking SSDs, No visible liquid contact or corrosion on board",
        "user_id":370,
        "username":"drewrox2009",
        "post_date":"2018-06-27 08:41:01",
        "message":"I do not unfortunately. This has me puzzled. i guess i need to invest in a scope. Do you have any idea what this component is or what it does, i have scoured the internet for a datasheet and haven't been able to find one."
    },
    {
        "post_id":36278,
        "thread_id":36194,
        "title":"[SOLVED]820-3332a Breaking SSDs, No visible liquid contact or corrosion on board",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-06-27 17:12:28",
        "message":"I have no idea.\nYou could stick a decent size 3V6 zener diode on the 3V3 rail so that will kill off any spikes that may occur. It is kind of a hack, but I honestly doubt the spikes are really there to begin with."
    },
    {
        "post_id":36329,
        "thread_id":36194,
        "title":"[SOLVED]820-3332a Breaking SSDs, No visible liquid contact or corrosion on board",
        "user_id":370,
        "username":"drewrox2009",
        "post_date":"2018-06-28 13:26:06",
        "message":"Im going to do some probing, i just can't imagine what is killing these drives. I appreciate the response!"
    },
    {
        "post_id":36338,
        "thread_id":36194,
        "title":"[SOLVED]820-3332a Breaking SSDs, No visible liquid contact or corrosion on board",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-06-28 14:32:18",
        "message":"Killing \"these\" drives? If I read correctly it only killed 1 drive that you repaired. The component on the SSD could have fried again because something else is wrong with the SSD and not the board."
    },
    {
        "post_id":37478,
        "thread_id":36194,
        "title":"[SOLVED]820-3332a Breaking SSDs, No visible liquid contact or corrosion on board",
        "user_id":370,
        "username":"drewrox2009",
        "post_date":"2018-07-23 14:07:06",
        "message":"you are correct, it killed the component on the same drive twice, turns out it was a dented bottom cover, thats why i couldn't find the problem with the computer open. Remove the dent, replaced unknown component again and it is working well."
    }
]