[
    {
        "post_id":93199,
        "thread_id":63171,
        "title":"820-3332 - occasional loud fans and laggy system",
        "user_id":25485,
        "username":"it-solve",
        "post_date":"2022-10-11 17:27:24",
        "message":"This Macbook has a previous repair around U9200\/10, U8310\/50 and U8900 ICs, and a battery replacement. \nAHT is not initiating stating a missing .efi, TectoolPro 11 haven't detected any anomalies. \n\nReplaced the trackpad and trackpad cable. It worked fine for a week and suddenly start running the fans on loud again. Intermittently it would calm down and then again would blast the fans with the same lagging. Other times would work and play videos with no issues for days. \n\nCan't spot any corrosion on the board, although the customer mentioned spillage on the mac a long time ago. The keyboard works fine.\n\nWondering if anyone experienced or has points where to look for?"
    },
    {
        "post_id":93204,
        "thread_id":63171,
        "title":"820-3332 - occasional loud fans and laggy system",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-10-12 00:55:49",
        "message":"Install HWMonitor and check for strange values reported at the moment problem appears.\n\nI strongly recommend to test with known good battery, not new.\n\nDisabling GPU on this model is so easy.\nJust to check if problem comes bak again, or not.\n\nYou can also try flashing new BIOS, with clean ME.\nAnd see if ASD passes without errors."
    },
    {
        "post_id":93223,
        "thread_id":63171,
        "title":"820-3332 - occasional loud fans and laggy system",
        "user_id":25485,
        "username":"it-solve",
        "post_date":"2022-10-12 15:39:04",
        "message":"Tested battery, which works on other mac - Still loud fans\nGot gswitch software to switch between GPUs and left for a while - still fans loud\nLooking at the sensor heat pipe incoming\/outgoing air ones are off. Any idea where these sensors could be on the board (Q5502 \/ U5570 seems to be a candidate) and how to measure them in the case? Measuring without tpad\/kbd will it affect? Usually, fans go loud when run outside of the case.\n\n\n\n[ATTACH type=\"full\" alt=\"1665614340517.png\"]60820[\/ATTACH]"
    },
    {
        "post_id":93224,
        "thread_id":63171,
        "title":"820-3332 - occasional loud fans and laggy system",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-10-12 16:40:26",
        "message":"Inspect Q5501\/2\/3 and their traces.\n\nDo you get 128 indications even in normal mode (when no loud fans)?\nFans go high if trackpad is not properly detected."
    },
    {
        "post_id":93357,
        "thread_id":63171,
        "title":"820-3332 - occasional loud fans and laggy system",
        "user_id":25485,
        "username":"it-solve",
        "post_date":"2022-10-17 14:40:27",
        "message":"It seems like the Camera is playing up. Disconnected and monitoring the situation. \nProbably nothing can be done without taking up the glass and replacing the camera, right?\n\nThank you again"
    },
    {
        "post_id":93360,
        "thread_id":63171,
        "title":"820-3332 - occasional loud fans and laggy system",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-10-17 16:00:52",
        "message":"This points to ALS problem.\nReconnect camera and cutoff the traces from pins 5 & 6 of J3502."
    },
    {
        "post_id":93363,
        "thread_id":63171,
        "title":"820-3332 - occasional loud fans and laggy system",
        "user_id":25485,
        "username":"it-solve",
        "post_date":"2022-10-17 17:12:11",
        "message":"Thanks, this helped a lot."
    }
]