[
    {
        "post_id":23580,
        "thread_id":23580,
        "title":"[SOLVED]820-3536 no trackpad or mouse",
        "user_id":499,
        "username":"andrew boren",
        "post_date":"2017-07-28 13:40:13",
        "message":"computer came in claiming waterdamage and wont turn on. i unpluged the keyboard and it powered, but no trackpad in windows and was not able to use usb mouse. unpluged trackpad, usb mouse worked. pluged back in keyboard, only power button, no keys, still usb mouse. pluged back in trackpad and it still turns on, but no usb mouse no trackpad and no keys except power button. tested for keyboard power on pin 30 got 3.33 and pin 4 3.43. i see no signs of water damage anywhere. where should i look. usb ports are all working fine when trackpad is unpluged"
    },
    {
        "post_id":23592,
        "thread_id":23580,
        "title":"[SOLVED]820-3536 no trackpad or mouse",
        "user_id":499,
        "username":"andrew boren",
        "post_date":"2017-07-28 16:21:23",
        "message":"also found d4611 broken off and sitting on the board. traces removed, ran jumper wires."
    },
    {
        "post_id":23603,
        "thread_id":23580,
        "title":"[SOLVED]820-3536 no trackpad or mouse",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-07-28 16:43:13",
        "message":"First try a known good trackpad and cable. It should work without D4611. Check Both those USB lines at the connector on diode mode too, could still be bad trace."
    },
    {
        "post_id":23693,
        "thread_id":23580,
        "title":"[SOLVED]820-3536 no trackpad or mouse",
        "user_id":499,
        "username":"andrew boren",
        "post_date":"2017-08-01 13:50:15",
        "message":"sorry its taken a few days to reply. got the new keyboard in to test. still no keys. left track pad unplugged. what do you mean by both USB lines?"
    },
    {
        "post_id":23706,
        "thread_id":23580,
        "title":"[SOLVED]820-3536 no trackpad or mouse",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-08-01 19:00:00",
        "message":"Working trackpad is needed for keyboard to work, try known good one including cable."
    },
    {
        "post_id":23728,
        "thread_id":23580,
        "title":"[SOLVED]820-3536 no trackpad or mouse",
        "user_id":499,
        "username":"andrew boren",
        "post_date":"2017-08-02 11:15:55",
        "message":"oh, sorry i will order a new trackpad and cable. i thought the keyboard would work without a trackpad installed like it does on all the other macs i have worked on. i have it on its way and will get back with you when it arrives."
    },
    {
        "post_id":23852,
        "thread_id":23580,
        "title":"[SOLVED]820-3536 no trackpad or mouse",
        "user_id":499,
        "username":"andrew boren",
        "post_date":"2017-08-05 11:24:23",
        "message":"wow, that fixed it, can someone explain how a non working or not attached trackpad can kill the keyboard? and what all models this is a problem on."
    },
    {
        "post_id":23861,
        "thread_id":23580,
        "title":"[SOLVED]820-3536 no trackpad or mouse",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-08-05 11:45:27",
        "message":"The keyboard controller freaks out when there is no trackpad connected. Sometimes there is no KBD at all, sometimes if gets intermittent, sometimes it just works. This goes for any machine 2010 and up really."
    },
    {
        "post_id":23948,
        "thread_id":23580,
        "title":"[SOLVED]820-3536 no trackpad or mouse",
        "user_id":499,
        "username":"andrew boren",
        "post_date":"2017-08-08 09:41:12",
        "message":"well thank you for that explanation, i will have to keep that in mind. i guess ive just been lucky so far having them work."
    }
]