[
    {
        "post_id":46739,
        "thread_id":46739,
        "title":"820-4924 will not fully boot",
        "user_id":1744,
        "username":"PJs",
        "post_date":"2019-02-26 11:02:15",
        "message":"This one came to me not powering on at all. There was no obvious liquid damage, but I found burned U8030 and no PP3V3_S0. So I changed U8030 and the board powered on with chime. After that I installed the board back to case and once I connected the charger to an assembled laptop, U8030 burned again and left a burned hole in the board, so it was a bit tricky to replace it again (this time with C8186, R8186, D8184 and R8184 as they were burned by U8030). Also I found the original reason of this issue - PP3V3_S0 was shorted through microphone connector(J6601), because the microphone itself suffered a TINY liquid damage. With new microphone and once again repaired U8030 area it turned on, but it does not fully boot. \nOnce it should display login screen, it freezes with distorted image (see attached photo). It will do that with known good original SSD with Mojave installation, and also with Mojave\/High Sierra\/Sierra USB installers. However it can fully boot to Windows 10. I suspect this is a bad CPU issue? Or maybe some important line burned in different layer of board under U8030 (there was a hole through at least 3 or 4 layers I think). \nI would probably already thrash this board, but it's a 16GB one, so I'm already giving it more time than I should :))\nAlso it does not power on with just charger connected (without battery), but I think this already happened to me on other 2015 Pro's and they were otherwise OK, so that may be normal? However PPBUS_G3H is acting strange I think. It's at 12.54V with only the charger connected (turned off, as it does not turn on without battery), but once I connect the battery and reconnect the charger to power it on, the voltage slowly raises up to 13V in a few minutes, or immediately if I disconnect the battery and leave it on with charger only. Other lines are stable.\n\nPP3V42_G3H 3.42V\nPPVRTC_G3H 3.34V\nPPVCC_S0_CPU 1.86V\nPP1V05_S0 1.06V\nPP1V2_S3 1.20V\nPP3V3_SUS 3.33V\nPP3V3_S0 3.36V\nPP3V3_S3 3.33V\nPP3V3_S5 3.33V\nPP5V_S0 5.15V\nPP5V_S3 5.15V\nPP5V_S5 5.15V"
    },
    {
        "post_id":46741,
        "thread_id":46739,
        "title":"820-4924 will not fully boot",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-02-26 13:17:41",
        "message":"Looks like RAM, or CPU issue.\nHowever start flashing new BIOS, with clean ME."
    },
    {
        "post_id":46755,
        "thread_id":46739,
        "title":"820-4924 will not fully boot",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-02-26 18:49:30",
        "message":"Dead CPU RIP"
    }
]