[
    {
        "post_id":48198,
        "thread_id":48198,
        "title":"820-3476 no ppbus",
        "user_id":2107,
        "username":"shanenin",
        "post_date":"2019-04-05 20:06:23",
        "message":"I think I had a bad charger that killed several boards the same way. I first found a short in isl6259 on chgr_acin, which was cleared after changing the ISL. The short is gone, but I am still not getting any ppbus. I have a resistance of about 20ohms between pin 27 and 28. I have about 4ohms between pin 17 and 18. I think I have found an abnormality, I am not getting any current passed through q7180. I think the reason is the chgr_agate is passing over 16v. On a working board chgr_agate is 0v. Since q7180 is a p channel mosfet, I think it needs low voltage on the gate to turn on. It seems like ISL6259 is putting out high voltage on chgr_agate when in needs to be low. Any suggestions?"
    },
    {
        "post_id":48204,
        "thread_id":48198,
        "title":"820-3476 no ppbus",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-04-06 03:11:35",
        "message":"Check first resistance to ground at PPBUS_G3H; diode mode, red probe to ground.\nPost exact value for R7180\/81 and R7185\/86, measured onboard.\nAlso need voltages for U7100; pins 2, 3, 9, 19, 20."
    },
    {
        "post_id":48209,
        "thread_id":48198,
        "title":"820-3476 no ppbus",
        "user_id":2107,
        "username":"shanenin",
        "post_date":"2019-04-06 08:30:40",
        "message":"I will verify those reading for you when I get back to the shop. \n\nAm I correct in my reasoning that the gate, chgr_agate, needs to have a low voltage to turn on mosfet 7180 and that fact it is high is a problem? Helping me with these extra questions helps my general understanding and helps me learn."
    },
    {
        "post_id":48219,
        "thread_id":48198,
        "title":"820-3476 no ppbus",
        "user_id":2107,
        "username":"shanenin",
        "post_date":"2019-04-06 17:09:36",
        "message":"I personally find it more beneficial to help me understand concepts than fixing the actual board"
    },
    {
        "post_id":48227,
        "thread_id":48198,
        "title":"820-3476 no ppbus",
        "user_id":2107,
        "username":"shanenin",
        "post_date":"2019-04-07 11:11:05",
        "message":"As you requested:\nppbus_g2h resistance to ground   610ohm  .123 diode mode\nr7180 99k\nr7181 62k\nr7185 470k\nr7186 300k\n\nisl6259\npin2 15.1v\npin3 4v\npin9 .04v\npin19 5.46v\npin20 5.46v\n\nMay I ask a question? Is chgr_agate with its high voltage stopping q7180 from turning on? From what I think I understand about mosfets, that seems to be an issue. Is my understanding of this correct?"
    },
    {
        "post_id":48230,
        "thread_id":48198,
        "title":"820-3476 no ppbus",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-04-07 17:57:39",
        "message":"Yeah, P-channel MOSFET requires negative G-S voltage (Vgs<0).\n\n123 in diode mode (red probe to ground) is Ok for PPBUS_G3H.\nBut you cannot get 600 ohms there; kohms maybe...\nCheck for short to ground at R7120.\nAlso be sure, no short between R7120 and L7130.\nIf all OK, replace U7100.\nRemove F7140 and see if get voltage at L7130."
    },
    {
        "post_id":48256,
        "thread_id":48198,
        "title":"820-3476 no ppbus",
        "user_id":2107,
        "username":"shanenin",
        "post_date":"2019-04-08 08:35:22",
        "message":"I was double checking my resistance reading on ppbus_g3h and I got .610 kohm, which I think is equal to 610 ohms. I also get this same reading on a known good board. That seems to be a good reading, but I may be doing something incorrectly, which happens more than I would like to admit.\n\nno short between r7120 and l7130\nno short to ground on r7120\nI removed f7140 because you asked and even though I don't think we have a short. It did not help\n\nI have not yet replaced u7100 a SECOND TIME, which I can if you think it is needed. Would you like me to do that?\n\nDo you know what conditions would cause chgr_agate not to be low like we need it? To my novice understanding, this seems to be the problem"
    },
    {
        "post_id":48257,
        "thread_id":48198,
        "title":"820-3476 no ppbus",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-04-08 09:20:12",
        "message":"If ACIN is OK, ISL6259 should open Q7180; if no short at R7120, of course.\nBut Q7180 could be bad.\nResistor readings do not point to Q7180 leakage, but change it just in case."
    },
    {
        "post_id":48258,
        "thread_id":48198,
        "title":"820-3476 no ppbus",
        "user_id":2107,
        "username":"shanenin",
        "post_date":"2019-04-08 11:03:28",
        "message":"Thank you 2informaticos for spending this extra time explaining stuff. I am asking the following question to understand, not argue. Before replacing q7180 don't we first need to get the enable fixed? On a working board both chgr_agate_div and chgr_sgate_div are about 6.5 volts. On this unworking board, they are 15.8v and 12v. The specs for the mosfet are about 2v for the gate threshold. Until we figure out the gate issue, should we even worry about the mosfet? Then my logic is since we changed u7100 already it may one of its inputs causing the issue. I will change q7180 just in case"
    },
    {
        "post_id":48259,
        "thread_id":48198,
        "title":"820-3476 no ppbus",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-04-08 11:19:52",
        "message":"\"I am not getting any current passed through q7180\"\nI'm wondering how do you get 12V at CHGR_SGATE_DIV, if no voltage at R7120 available.\nUnless Q7180 is bad, or U7100...\n\n\"we first need to get the enable fixed?\"\nU7100 controls Q7180."
    },
    {
        "post_id":48266,
        "thread_id":48198,
        "title":"820-3476 no ppbus",
        "user_id":2107,
        "username":"shanenin",
        "post_date":"2019-04-08 13:24:55",
        "message":"[QUOTE=\"2informaticos, post: 48259\"]\nI'm wondering how do you get 12V at CHGR_SGATE_DIV, if no voltage at R7120 available.\n.[\/QUOTE]\n\nI think I follow you. Even if chgr_agate_div is not turning on, but with 12 volts at chgr_sgate you should get something coming out of the q7180."
    },
    {
        "post_id":48267,
        "thread_id":48198,
        "title":"820-3476 no ppbus",
        "user_id":2107,
        "username":"shanenin",
        "post_date":"2019-04-08 14:19:36",
        "message":"changed q7180, u7100, and r7185(just because). Still high voltage on chgr_agate_div.\n\nedit added later\/\/\nlet me double check all of the information I gave you. I think I may have made some mistakes"
    },
    {
        "post_id":48269,
        "thread_id":48198,
        "title":"820-3476 no ppbus",
        "user_id":2107,
        "username":"shanenin",
        "post_date":"2019-04-08 15:35:02",
        "message":"I double checked everything and the numbers I gave you seem correct. I also switched r7186. From what I can tell it seems like u7100 is not pulling the voltage down on chgr_agate."
    },
    {
        "post_id":48271,
        "thread_id":48198,
        "title":"820-3476 no ppbus",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-04-08 18:24:39",
        "message":"CHGR_AGATE should be pulled down first.\nIf not, NO voltage possible to arrive at R7120.\n\nSecond part of Q7180 is always ON, through internal diode; even if CHGR_SGATE is high.\n\nPost other voltages for U7100, apart of above mentioned.\nPins 6, 9, 12, 13, 14, 15, 17\/18, 25, 27\/28.\nIf similar board available, compare diode mode readings on all pins of U7100 and other surrounding points..."
    }
]