[
    {
        "post_id":36495,
        "thread_id":36495,
        "title":"[SOLVED]820-3435 - Cannot locate PP3V3_S5 semi short",
        "user_id":145,
        "username":"Sykulski",
        "post_date":"2018-07-02 04:58:25",
        "message":"This 3435 came in dead. Upon opening i see a burned hole in the battery. Disconnected battery but still not turning on on AC. Checking PBUS is only 0.9V. Q7560 getting extremely hot. After replacing Q7560 PBUS is 8.6V but still not turning on. Now PP3V3_S4 is missing (along with S4_PWR_EN and PM_SLP_S5_L). So checking PP3V3_S5 is 3.33V but resistance is only 18 Ohm to GND(!) I removed L7560 to see which side has this low resistance. Upon removing L7560 I see it has also been very hot because it has a little burn mark under it. The 18 Ohm resistance is on pin2 side of L7560. I injected 3.3V into this pin and ramp up bench supply to 10A. But nothing getting hot and only drawing 0.4A. So I got a \"semi\"-short and I don't know how to find it.\n\nIdeas ?"
    },
    {
        "post_id":36541,
        "thread_id":36495,
        "title":"[SOLVED]820-3435 - Cannot locate PP3V3_S5 semi short",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-07-03 14:44:27",
        "message":"Probably many thing on that rail. 400mA at 3.3V is still about 1.2W and something will get slightly warm. Use your lipt to find it. I bet it will be the PCH\/CPU."
    },
    {
        "post_id":36570,
        "thread_id":36495,
        "title":"[SOLVED]820-3435 - Cannot locate PP3V3_S5 semi short",
        "user_id":135,
        "username":"bjf",
        "post_date":"2018-07-03 22:57:21",
        "message":"It looks like you have an IR camera. Did that find anything? Throw it in the freezer for about a minute so everything is a little colder than normal and then check under the IR camera again (assuming you have one).\n\nAre there any ugly burnt areas or craters in the board? Lots of times these partial shorts are due to board damage."
    },
    {
        "post_id":36589,
        "thread_id":36495,
        "title":"[SOLVED]820-3435 - Cannot locate PP3V3_S5 semi short",
        "user_id":145,
        "username":"Sykulski",
        "post_date":"2018-07-04 04:52:23",
        "message":"Yup. PCH getting slightly hot. PPVRTC_G3H shorted to ground. Removed all caps on the line. Still 0.002V voltage drop to GND. Thanks...\n\nRIP"
    }
]