[
    {
        "post_id":32057,
        "thread_id":32057,
        "title":"820-2849-A no power 17\" macbook pro",
        "user_id":1380,
        "username":"Freedomsr40",
        "post_date":"2018-02-26 21:22:34",
        "message":"Hi all, I'm new here and hoping you guys can help me. I have this board I'm working on (info in the title above) and when I plug it in, I get a amber light for 5 or so seconds, then a green light but thats really it. I did notice once or twice the fans \"jumped\" slightly but it was for a split second and nothing further. I got the board in this condition but I have no reason to believe it has any liquid damage as there was no corrosion at all, in fact it looked pretty clean but it just won' turn on. So, I'm looking to find out where to start, I am new so I'm by no means an expert ,so if you can give me the location and the component to check and how to check I will. Thank you!"
    },
    {
        "post_id":32064,
        "thread_id":32057,
        "title":"820-2849-A no power 17\" macbook pro",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2018-02-27 11:27:15",
        "message":"Goto page 7 or 8 on the schematic where it lists the power rails. Measure and see if you can find which ones are present, which are missing, and which are \"pulsing.\" By pulsing I mean turning on then off rapidly.\n\nCheck to see if you have a short circuit on any rails. A short circuit is when you do not have the battery or power plugged in, have the multimeter in resistance mode, and measure an abnormally low number. Do keep in mind that on low voltage rails like CPU\/GPU vcore, a low number here is not indicative of a short circuit."
    },
    {
        "post_id":32076,
        "thread_id":32057,
        "title":"820-2849-A no power 17\" macbook pro",
        "user_id":1380,
        "username":"Freedomsr40",
        "post_date":"2018-02-27 16:07:04",
        "message":"Thank you! Where can i get the schematic?"
    },
    {
        "post_id":32081,
        "thread_id":32057,
        "title":"820-2849-A no power 17\" macbook pro",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2018-02-27 19:46:34",
        "message":"Just Google the number of the board and you'll find them online. We can't distribute them as this is a public forum hosted in the United States and we are already on the radar of you-know-who's lawfirms. A quick google shows laptop-schematics and notebook-schematics have a bunch available."
    },
    {
        "post_id":32112,
        "thread_id":32057,
        "title":"820-2849-A no power 17\" macbook pro",
        "user_id":1380,
        "username":"Freedomsr40",
        "post_date":"2018-02-28 13:53:12",
        "message":"Totally understand. Thank you. i will try it tonight or tomorrow"
    }
]