[
    {
        "post_id":41157,
        "thread_id":41157,
        "title":"820-00165 SMC_S4_WAKESRC_EN Missing",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2018-10-24 16:51:26",
        "message":"Got in an 820-00165 with quarter-fan spin; found U1950 had corrosion on pins 1 and 2. Replaced U1950 after cleaning up the pins a bit, but the damage was very slight. No liquid anywhere else on the board at all. After replacing, same exact issues. ALL_SYS_PWRGD pulses every few seconds; found no shorts across all major rails, but did find SMC_S4_WAKESRC_EN missing and not pulsing. PP3v3_SUS present and not pulsing either. Replaced SMC, clock and U1950 again to be sure, and no change; same exact symptoms. S5 rails and SUS rails present and NOT pulsing, but everything after is pulsing, including PM_SLP_S5_L and PM_SYSRST_L. Since my ALL_SYS_PWRGD is pulsing along with fan twitch, I'd imagine wherever the interruption is, is the only (hopefully) issue. Not finding any shorts was disappointing, but hopefully identifying SMC_S4_WAKESRC_EN missing will help narrow some things down. Have seen this same damage to U1950 sooo many times, but usually it's easily resolved. Hoping this one didn't damage the CPU, but have hopes since ALL_SYS is pulsing.\n\nI'm a bit lost on where to go from here, any help appreciated!"
    },
    {
        "post_id":41172,
        "thread_id":41157,
        "title":"820-00165 SMC_S4_WAKESRC_EN Missing",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2018-10-24 19:18:59",
        "message":"I know this might sound simple, but did you ultrasonic the board yet? Possibly corrosion under the CPU. Does CPU VCore pulse as well?"
    },
    {
        "post_id":41214,
        "thread_id":41157,
        "title":"820-00165 SMC_S4_WAKESRC_EN Missing",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-10-25 17:33:17",
        "message":"Pins 7 & 3 of U1950 pulsing too?\nCheck SPI termination resistors and all traces around U6100\/01."
    }
]