[
    {
        "post_id":18029,
        "thread_id":18029,
        "title":"[SOLVED]Asus gaming laptop no post",
        "user_id":700,
        "username":"Nick",
        "post_date":"2017-04-09 05:26:51",
        "message":"Hello, I know it's not a macbook of course but I think it fits the logic board repair (in case move please)\n\nlately I have been lucky with MacBooks, all successful fixes, now it's time to look into the \"fuck no\" bin.\n\nI have thisto gaming Asus laptop that doesn't boot or post, leds turn on, fan spin for 10 seconds then turns off. Pci express diagnostic card gives code 0. What could it be? No water damage, never dropped, it died on his own according to the customer. No warm GPU or CPU. tried cleaning CMOS. Didn't find any short to ground but without schematics I can't be 100% sure\n\nthe laptop is 2 years old"
    },
    {
        "post_id":18030,
        "thread_id":18029,
        "title":"[SOLVED]Asus gaming laptop no post",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-04-09 05:31:30",
        "message":"BIOS is first suspect. Also Asus usually has 2 year warranty, check the dates! Backup old BIOS, the ME is normally not in the Asus update."
    },
    {
        "post_id":18031,
        "thread_id":18029,
        "title":"[SOLVED]Asus gaming laptop no post",
        "user_id":700,
        "username":"Nick",
        "post_date":"2017-04-09 05:36:46",
        "message":"It's 2months out of warranty sadly, customer checked before bringing it to me. Might try to flash the bios tomorrow with my ezp2010"
    },
    {
        "post_id":18035,
        "thread_id":18029,
        "title":"[SOLVED]Asus gaming laptop no post",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-04-09 06:06:58",
        "message":"Backup the old and merge the update with the existing ME region. If it works then need to transfer serial number and Windows license."
    },
    {
        "post_id":18050,
        "thread_id":18029,
        "title":"[SOLVED]Asus gaming laptop no post",
        "user_id":700,
        "username":"Nick",
        "post_date":"2017-04-09 09:19:11",
        "message":"how do i do that? usually i save the old BIOS, copy down the UUID, mac and serial, take the new bios from the manufacturer, open it with the correct editor, add the 3 details i saved earlier and flash it"
    },
    {
        "post_id":18056,
        "thread_id":18029,
        "title":"[SOLVED]Asus gaming laptop no post",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-04-09 11:47:28",
        "message":"Post original and update somewhere and send me the link. Need to merge the original ME area, usually the first 0x180000. Compare the update to the original and see where it starts."
    },
    {
        "post_id":18096,
        "thread_id":18029,
        "title":"[SOLVED]Asus gaming laptop no post",
        "user_id":700,
        "username":"Nick",
        "post_date":"2017-04-10 02:16:44",
        "message":"[URL=\"https:\/\/drive.google.com\/open?id=0BzbaSakxY56UNGFJTTRtc2pXU1U\"]https:\/\/drive.google.com\/open?id=0Bz...GFJTTRtc2pXU1U[\/URL]\n\nnot the same laptop, that one can wait, this has the same exact problem, it's an Acer tho. old backupped bios and new one extracted from the updater exe\n\n\n\nEDIT. Flashed the bios with the new updated one without the ME region and the laptop does the POST, so once you merge them i will reflash it and call it a day\n\nwhere can i find a guide or something to learn to do it by myself in the future instead of breaking your balls Duke? also Thank you very very much for doing it for me this time"
    },
    {
        "post_id":18104,
        "thread_id":18029,
        "title":"[SOLVED]Asus gaming laptop no post",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-04-10 05:23:30",
        "message":"Acer usually supplies a full BIOS update. You'll have to Google for some BIOS tutorials, there are enough around about ME region stuff and copy\/pasting the original BIOS\/serial\/keys over."
    },
    {
        "post_id":18107,
        "thread_id":18029,
        "title":"[SOLVED]Asus gaming laptop no post",
        "user_id":700,
        "username":"Nick",
        "post_date":"2017-04-10 07:04:54",
        "message":"The New bios i nave put in the link was in an exe that ihe's extracted. The laptop boots with it so I think it is complete but of course it's missing serials and stuff"
    },
    {
        "post_id":18108,
        "thread_id":18029,
        "title":"[SOLVED]Asus gaming laptop no post",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-04-10 07:22:35",
        "message":"If the file size after extraction is the same then it is usually ok. Look at the files in HEX editor, also a good way to compare.\n\nAn Asus update will not be the original 8Mb that you read from the chip. usually it is 6Mb or 4, so you need to reuse your original ME region."
    },
    {
        "post_id":18109,
        "thread_id":18029,
        "title":"[SOLVED]Asus gaming laptop no post",
        "user_id":700,
        "username":"Nick",
        "post_date":"2017-04-10 07:26:01",
        "message":"the size is the same in this case that i have linked earlier (acer)\n\nfor the Asus it's the same as well after extracting the Intel image with UEFI tool"
    },
    {
        "post_id":18110,
        "thread_id":18029,
        "title":"[SOLVED]Asus gaming laptop no post",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-04-10 07:28:28",
        "message":"Compare in HEX editor and see if the update has the complete ME region. Should have 5A A5 F0 0F starting at byte 16."
    },
    {
        "post_id":18116,
        "thread_id":18029,
        "title":"[SOLVED]Asus gaming laptop no post",
        "user_id":700,
        "username":"Nick",
        "post_date":"2017-04-10 08:37:01",
        "message":"i completely fucking sucks at this.. i'm probably an idiot... ( windows loads fine) but it completely miss the UUID, serial etc. on asus bioses i use fd44 to recover them from the old one and write them on the new one, isn't there anything like that for other bioses like this acer one?\n\nedit: i'm a fucking idiot, this thing is AMD\n\ni give up... Duke do it for me please.. UUID, serial and MAC of the old one in the new one.. thank you so much..."
    },
    {
        "post_id":18228,
        "thread_id":18029,
        "title":"[SOLVED]Asus gaming laptop no post",
        "user_id":700,
        "username":"Nick",
        "post_date":"2017-04-12 03:46:21",
        "message":"Mark as solved. Fixed both"
    }
]