[
    {
        "post_id":64067,
        "thread_id":59887,
        "title":"820-00923 Liquid damage on CPU Phase Mosfets - 20V 0.02A",
        "user_id":25485,
        "username":"it-solve",
        "post_date":"2020-08-24 02:03:02",
        "message":"Hi Folks,\n\nGot this 13MB which had a liquid spillage mainly around U7410\/C7413 and U7210, everywhere else is OK on the board. After clean I get 20V, but no other response.\n\nWhen USB controller chips seem to be ok, where do we start from?\n\nPPBUS_HS_CPU - - 1.2Ohm seems to be affected via PPBUS_G3H or vice versa\nPPBUS_G3H - Short to the ground - 1.2Ohm on the R6907 side of the F7000\nAs there are so many places this can be is it safe to inject up to 13V here?\n\nThanks"
    },
    {
        "post_id":64069,
        "thread_id":59887,
        "title":"820-00923 Liquid damage on CPU Phase Mosfets - 20V 0.02A",
        "user_id":25485,
        "username":"it-solve",
        "post_date":"2020-08-24 05:53:29",
        "message":"Alright, replaced U7210 as a cause for the G3H short, and now turns on. Fans spinning with no picture.\n\nI am still missing CPU PH1\/2\/3 voltages on L7410\/20\/30\n\nWhat controls them?. U7410 had heavy liquid but has no short. Can PH1 being down brought others down too? Or would they still provide voltage if U7410 is faulty?\n\n\nEdit: \nOut of nowhere after, I replaced U7410 my 20V is gone down to 5V. \nSeems like PP3V3_UPC_XB_LDO \/ PP1V8_UPC_XB_LDOD are having a short. With no liquid or oxidation in the area whatsoever. \n\nPP3V3_UPC_XB_LDO - 0.0057Vdc\nPP1V8_UPC_XB_LDOA - 0.519Vdc\nPP1V8_UPC_XB_LDOD - 0.03Vdc\nPP1V1_UPC_XB_LDO_BMC - 0.55Vdc\n\nLifted up C3208 same readings. What are the odds U3200 to pack up at the same time as U7400 replacement :\/ \n\nXA_ U3100 readings seem to be ok. No shorts there.\n\nThese USB-C controllers are with underfill. What is the best way to get it cleaned?\nMeasuring remaining ones seems okay, and this one is the one which pulls less current than other 3. Must be bad?"
    },
    {
        "post_id":64073,
        "thread_id":59887,
        "title":"820-00923 Liquid damage on CPU Phase Mosfets - 20V 0.02A",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-08-24 07:58:49",
        "message":"PPVCCGT_S0_CPU only appears under high graphics load.\nYou screwed up something else on the board.\nDo NOT make more wrong assumptions on the future...\n\nYou've only checked for video before, didn't think to check USB activity?\n\nDid you inject voltage on PPBUS_G3H to find hot U7210?"
    },
    {
        "post_id":64110,
        "thread_id":59887,
        "title":"820-00923 Liquid damage on CPU Phase Mosfets - 20V 0.02A",
        "user_id":25485,
        "username":"it-solve",
        "post_date":"2020-08-24 15:34:37",
        "message":"I wonder how U3200 got affected. \n\nForgot to mention that, I have Injected 1.2V on PPBUS_G3H and noticed CPU start increasing heat. From there I suspected U7210 being short. \n\nThere were no USB activity or external video when fans were spinning. \n\nThanks for your reply."
    },
    {
        "post_id":64118,
        "thread_id":59887,
        "title":"820-00923 Liquid damage on CPU Phase Mosfets - 20V 0.02A",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-08-24 15:57:32",
        "message":"1.2V shouldn't affect CPU, but do NOT inject again in such manner.\nSo many time I explained how NOT to inject voltage on PPBUS_G3H and people still do this :mad:.\n\nU7210 could already damaged CPU, when got burnt.\nDo not expect too much from this board.\n\nProbably the heat applied on the board affected USB-C area..."
    },
    {
        "post_id":64119,
        "thread_id":59887,
        "title":"820-00923 Liquid damage on CPU Phase Mosfets - 20V 0.02A",
        "user_id":25485,
        "username":"it-solve",
        "post_date":"2020-08-24 16:08:05",
        "message":"Thanks for that. \n\nYou are absolutely right, haven't seen these treads though. Perhaps a sticky post with common mistakes we have learned will be great. \n\nI got excited when the fans spun up, but there was no activity anywhere else. Does dead CPU allows fans to spin up?\nPerhaps it doesn't worth changing U3200 and digging more if dead cpu would show such signs.\n\nI am really after the data on this board, it has a J9600 but I still cannot justify buying the data migration tool due to amount of data recovery jobs I get for these couple compatible models. \nHave you seen any other way of getting data out?"
    },
    {
        "post_id":64121,
        "thread_id":59887,
        "title":"820-00923 Liquid damage on CPU Phase Mosfets - 20V 0.02A",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-08-24 16:24:04",
        "message":"Get the board working, or the data migration tool.\n\nSometime internal SSD can be accessed starting on Target Disk mode, but depends of the fault problem on the board."
    }
]