[
    {
        "post_id":49815,
        "thread_id":49815,
        "title":"820-3115-B - unable to get rid of short",
        "user_id":612,
        "username":"Atomrepair",
        "post_date":"2019-06-07 06:42:46",
        "message":"This board came in with nasty old liquid damage. I hooked it up and smelled magic smoke. Found a short somewhere between U3890 and D3895 on T29BST_BOOST\nI got rid of the IC and all surrounding components, but that didnt remove the short. Digging around removed it, I thought, leaving the rail with ~2kOhm to ground. Thought I was good after checking with my lab supply, but its still smoking up when I attach a magsafe.\nSo I guess there is another short on another rail inside the board.. Too bad I just spent a lot of time restoring the T29BST_BOOST rail.. should've tried a magsage before doing that, hm..\nNow... do I start digging into the board again or see if it burns itself out?"
    },
    {
        "post_id":49816,
        "thread_id":49815,
        "title":"820-3115-B - unable to get rid of short",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-06-07 07:39:26",
        "message":"DO NOT repair TBT for this reason!!! Just live without thunderbolt.....now this might be junk...."
    },
    {
        "post_id":49817,
        "thread_id":49815,
        "title":"820-3115-B - unable to get rid of short",
        "user_id":612,
        "username":"Atomrepair",
        "post_date":"2019-06-07 07:57:49",
        "message":"Ah, damn. Wish I'd known that beforehand. I've removed the TB connection, but I still get an inferno if I hook it up. No time now, gone for the weekend.. Will report back tuesday.. I guess I could drill a hole through the board and see if I can repair whats missing afterwards? heh"
    },
    {
        "post_id":49819,
        "thread_id":49815,
        "title":"820-3115-B - unable to get rid of short",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-06-07 09:01:04",
        "message":"You can try but yeah if TBT shorts like that all you can do is remove TBT from the board and leave it alone."
    },
    {
        "post_id":49822,
        "thread_id":49815,
        "title":"820-3115-B - unable to get rid of short",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-06-07 11:01:15",
        "message":"Remove Q3880 and check if stays on.\nBut you may need to remove all the chips from Thunderbolt area."
    },
    {
        "post_id":50022,
        "thread_id":49815,
        "title":"820-3115-B - unable to get rid of short",
        "user_id":612,
        "username":"Atomrepair",
        "post_date":"2019-06-14 01:49:31",
        "message":"Removed all the thunderbolt stuff. Board starts up. mac os wont start fully, machine shuts off randomly and still heats up in TB area after lots of digging. Already broke and then repaired some tracesin this sinkhole... SMC has some nasty gunk around (and naturally under it); this is as far as I'm willing to see this through. Suffice to say next time I'm taking TB off, not fixing it."
    },
    {
        "post_id":50030,
        "thread_id":49815,
        "title":"820-3115-B - unable to get rid of short",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-06-14 06:00:58",
        "message":"The shutdown issue could be the SMC but yeah agreed"
    }
]