[
    {
        "post_id":103865,
        "thread_id":64470,
        "title":"A1707 Speakers Buzzing",
        "user_id":57068,
        "username":"Vonevoe",
        "post_date":"2024-01-20 09:45:21",
        "message":"Hello,\n\nFirst of all, I'm not a native English speaker, so I'll try my best to be understood. I am a first-year electronics student eager to learn, so I bought a MacBook A1707 and tried to fix it.\n\nThis MacBook had water damage.\n\nThe left USB-C ports were affected by water, so I replaced them. Both ICs 3100 and 3200 didn't work as expected, so I changed them. The battery was dead, so I bought a new one and replaced it.\n\nNow, the MacBook works perfectly, except for one issue.\n\nWhen I connect the battery and plug in the USB-C, a few seconds later, both speakers start buzzing for 1 or 2 seconds.\n\nMy Research:\n\nI found the board view and the schematic of the board.\n\nI tested the voltage on all the lines connected to J6410 and J6500 (then U6400) with the following procedure:\n\n[LIST=1]\n[*]Unplug the battery and the USB charger.\n[*]Plug in the battery, then the charger.\n[*]Connect the black lead to the ground and the red lead to the line I want to measure.\n[*]Wait for the first fans to start spinning.\n[*]Then, wait for the second fans to start spinning (when the speakers are buzzing).Repeat the process.\n[\/LIST]\nThe voltage on SPKRCONN_WL_OUT_NEG, SPKRCONN_TL_OUT_NEG, and SPKRCONN_TR_OUT_NEG dropped from 0.120V to 11.80V, then back to 0.120V.\n\nOnly SPKRCONN_WR_OUT goes from 0.130V to 0V.\n\nFor U6400:\n\n[LIST]\n[*]SPKRAMP_WL_OUT_NEG  and SPKRAMP_TR_OUT_NEG obviously 0.120V to 11.80V, then back to 0.120V.\n[*]PP1V8 is normal\n[*]AUD_I2C_1A_SCL: 1.795V\n[*]SPKRAMP_WL_LRCLK: 0V -> 0.380V -> 0V\n[*]SPKRAMP_WL_OUT_POS: 0.110V\n[*]AUD_SPRKRAMP_INT_L: 0.015 -> 0.010\n[*]SPKRAMP_WL_SDIN: 1.78V -> 1.5V -> 1.78V\n[*]SPKRCONN_WL_OUT_POS: 0.130V\n[*]VREF_AMP_WL: 0V -> 2V -> 0V\n[*]AUD_SPKRAMP_RESET_L: 0.030V -> 1.8V -> 0V\n[*]SPRKRAMP_WL_SCLK: 0.050V -> 0.875V\n[\/LIST]\nI tried to find the MAX98706 datasheet to trace back to the source of the problem, but I couldn't find it.\n\nI don't have another 820-00281-A logic board for testing.\n\nI don't want to give up, but I'm unsure where to continue to understand the problem.\n\nSo here I am, asking for help."
    },
    {
        "post_id":103868,
        "thread_id":64470,
        "title":"A1707 Speakers Buzzing",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2024-01-20 11:24:34",
        "message":"First of all, welcome to the forum!\n\nI suspect you still have components affected by corrosion.\n\nThis board has 4 speakers; two on each side.\nEvery MAX98706 drives one speaker.\n\n\"When I connect the battery and plug in the USB-C, a few seconds later, both speakers start buzzing for 1 or 2 seconds\"\nDo you have diferent behavior without battery connected (only charger)?\nBuzzing sound disappears after 2s?\nOnce logged into macOS, audio codec is recognized?"
    },
    {
        "post_id":103872,
        "thread_id":64470,
        "title":"A1707 Speakers Buzzing",
        "user_id":57068,
        "username":"Vonevoe",
        "post_date":"2024-01-21 02:36:10",
        "message":"[QUOTE]\nFirst of all, welcome to the forum!\n[\/QUOTE]\nThank you! I'm happy to be here.\n\n[QUOTE]\nThis board has 4 speakers; two on each side.\nEvery MAX98706 drives one speaker.\n[\/QUOTE]\nThis MacBook model has four speakers, with two located on each side. Each speaker is powered by a MAX98706 chip. Therefore, in reality, what is referred to as a single speaker in this model actually consists of two separate speakers ?\n[QUOTE]\nDo you have diferent behavior without battery connected (only charger)?\n[\/QUOTE]\nI'm unable to turn on the MacBook when the battery is unplugged. However, I did manage to turn on the MacBook and then unplug the battery (refer to the \"additional observations\" section below).\n\n[QUOTE]\nOnce logged into macOS, audio codec is recognized?\n[\/QUOTE]\nYes indeed.\n[ATTACH type=\"full\" width=\"490px\" alt=\"Screen Shot 2024-01-21 at 10.55.24 AM.PNG\"]61467[\/ATTACH]\n[QUOTE]\nBuzzing sound disappears after 2s?\n[\/QUOTE]\nI've uploaded a private video showcasing the issue. (Note: YouTube required me to format the video as a short.)\n[MEDIA=youtube]DHkdX0UtA7A[\/MEDIA]\n\n\nAdditional Observations:\nIt appears that the buzzing noise replaces the usual startup chime (\"dong!\"). When I attempted to play music or any audio, the speaker responded with a buzzing sound similar to what's in the video, although not as loud.\nAdditionally, when I unplugged the battery, the speaker buzzed for a fraction of a second.\n\nI initially thought this issue was unrelated and merely a result of 'flexgate', but now I'm starting to question that assumption.\n\n[ATTACH type=\"full\" width=\"479px\" alt=\"IMG_0387.jpg\"]61468[\/ATTACH]\nSometimes the display band flickers slightly, or sometimes it even disappears completely.\n\nThank you for your help"
    },
    {
        "post_id":103873,
        "thread_id":64470,
        "title":"A1707 Speakers Buzzing",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2024-01-21 05:12:41",
        "message":"Mac detects changes between speaker and headphones?\nDo you get correct sound on headphones?"
    },
    {
        "post_id":103874,
        "thread_id":64470,
        "title":"A1707 Speakers Buzzing",
        "user_id":57068,
        "username":"Vonevoe",
        "post_date":"2024-01-21 06:32:48",
        "message":"I couldn't try with headpone but i use a external speaker (bose)\nMac detect change in both way.\n\nI get correct sound in external speaker."
    },
    {
        "post_id":103875,
        "thread_id":64470,
        "title":"A1707 Speakers Buzzing",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2024-01-21 06:39:33",
        "message":"Inspect all audio amplifiers for corrosion; pages 60\/61 in schematic."
    },
    {
        "post_id":103876,
        "thread_id":64470,
        "title":"A1707 Speakers Buzzing",
        "user_id":57068,
        "username":"Vonevoe",
        "post_date":"2024-01-21 07:26:07",
        "message":"There's nothing,\nthose chips are indeed the MAX98706. I attempted to locate the datasheet. Should I consider replacing all of them?"
    },
    {
        "post_id":103877,
        "thread_id":64470,
        "title":"A1707 Speakers Buzzing",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2024-01-21 08:12:17",
        "message":"I doubt all the speakers to be damaged.\nBut just in case, test with known good speakers.\n\nWhen you play video\/audio, speakers buzzing continously?\n\nCheck diode mode to ground for AUD_SPKRAMP_RESET_L; also the voltage."
    },
    {
        "post_id":103878,
        "thread_id":64470,
        "title":"A1707 Speakers Buzzing",
        "user_id":57068,
        "username":"Vonevoe",
        "post_date":"2024-01-21 08:50:39",
        "message":"[QUOTE=\"2informaticos, post: 103877, member: 682\"]\nI doubt all the speakers to be damaged.\nBut just in case, test with known good speakers.\n\nWhen you play video\/audio, speakers buzzing continously?\n\nCheck diode mode to ground for AUD_SPKRAMP_RESET_L; also the voltage.\n[\/QUOTE]\n\nThese speakers are confirmed to be in working condition. I experimented with two sets of brand-new ones.\n\nI don't completely comprehend which parameter affects the diode mode reading's outcome yet, so I will provide a comprehensive description of the measurement procedure.\n\nI tested it with only the logic board, without any additional components connected (no power supply, no speakers, etc.). I placed the red probe on ground (GND) and the black probe on TP_AUD_SPKRAMP_RESET_L, resulting in a reading of 0.333 V.\n\nI tested the voltage in the same environment, with the only difference being the connection of J3300 connector to the USB-C port and a USB-C charger. Additionally, I switched the positions of both probes, resulting in the following readings:\n\n0.033 V -> 1.798 V -> 0.033 V.\n\nUpon retesting, the speakers emitted some faint noise, and it appears that adjusting the volume did not have any noticeable impact. Notably, the speakers became very hot when I left the Mac on for a few minutes, and there was a noticeable odor of burning."
    },
    {
        "post_id":103883,
        "thread_id":64470,
        "title":"A1707 Speakers Buzzing",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2024-01-21 12:52:14",
        "message":"Do you get 0.333, or 0.033 on reset line (diode mode)?\nBTW, do not post \"V\" after diode mode readings.\n\nPleae, don't quote an entire post, visible few centimeters above."
    }
]