[
    {
        "post_id":49205,
        "thread_id":49205,
        "title":"820 4924, no backlight",
        "user_id":423,
        "username":"Noguinfor",
        "post_date":"2019-05-15 02:03:16",
        "message":"Hey guys,\nthis one don't have any signals off liquid or corrosion!!\nI have - 0V on pin1 J8300 and 0V at L8300.\nalready replace a LVDS cable for a new one = same history! \n\nI already did a research here in the forum but did not clarify my doubt!\n\nI have 3 macs 2013-2014 same model for repair and i already test 2 off them on this board (2015) and i can see the image with a flash light! But with original one i can't get precession if it has an image without backlight because the screen is very dirty (tipical problem on this models). \n\nmy question is if i test the board 820 4924 (2015) on mac 2014 it's normally don't get backlight?? I'm a little confused because some time ago i think to do this test and the backlight work's but with a 4-5 sec delay! but i'm not sure! for otherwise i see some topics on forum that say it's not compatibility! \n\nthanks"
    },
    {
        "post_id":49206,
        "thread_id":49205,
        "title":"820 4924, no backlight",
        "user_id":624,
        "username":"Alan.L",
        "post_date":"2019-05-15 02:27:31",
        "message":"Its usually the pin1 on these. Diode mode on pin1?\n\nYou cant use 2014 screen on a 2015 logic board. It?s needs to be the same year. I suggest you order a 2015 cracked screen from ebay for testing."
    },
    {
        "post_id":49207,
        "thread_id":49205,
        "title":"820 4924, no backlight",
        "user_id":423,
        "username":"Noguinfor",
        "post_date":"2019-05-15 02:50:19",
        "message":"Thanks Alan. i have 3 macs 2014 for repair! no one is 2015! =( \n\nI think on this one it's the LCD fucked! \n\nDiode mode one pin 1 with or without LCD connected = 1.165v"
    },
    {
        "post_id":49211,
        "thread_id":49205,
        "title":"820 4924, no backlight",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-05-15 05:03:33",
        "message":"You can't be sure about backlight presence if you don't have the correct screen.\nYou can try with 2014 model and give it 1 min, to enter OSX and see if backlight appears.\n\nHowever, if you get image with other screen, means L8300 voltage is present, and maintained; DP_INT_HPD is high.\nYou told no voltage at L8300 with original screen; that is problem.\nYou must get voltage there, in the first few seconds, even no screen connected.So seems that oeiginal screen is bad.\nYou should get DP_INT_HPD high with it, when L8300 has voltage..."
    },
    {
        "post_id":49215,
        "thread_id":49205,
        "title":"820 4924, no backlight",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-05-15 06:07:35",
        "message":"No. You MUST use a 2015 screen on these 2014 will always give no BKLT."
    }
]