[
    {
        "post_id":26843,
        "thread_id":26843,
        "title":"820-3332 odd symtoms",
        "user_id":468,
        "username":"ALB-Repairs",
        "post_date":"2017-10-16 07:58:53",
        "message":"My 820-3332 has 12.1V instead of 12.6V. The only noticeable thing that doesn't function properly is the power button. if pressed when the laptops on, it instantly restarts. When off it doesn't turn the machine on, you have to unplug the battery, plug in a charger and then hotplug the battery. \nSMC_RESET_L is good.\nI have replaced the SMC with no change.\n\nSMC_ONOFF_L has 3v42 on it\nKeyboard tested. \n\nIve figured its not doing a full SMC reset when the power buttons pressed either, SMC reset circuitry has been ruled out. The only thing i can see as obvius damage is long screw damage into the board where the Fan screws in (on the webcam connector side of the board."
    },
    {
        "post_id":26854,
        "thread_id":26843,
        "title":"820-3332 odd symtoms",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-10-16 17:45:26",
        "message":"12.1V without battery connected??\nFor the SMC reset issue check corrosion around U5750."
    },
    {
        "post_id":26866,
        "thread_id":26843,
        "title":"820-3332 odd symtoms",
        "user_id":461,
        "username":"Gurmon",
        "post_date":"2017-10-16 19:55:25",
        "message":"I seen this a few times on this board, always Q8930\/Q8931. Pull the FET and check if its already burning a hole through the board."
    },
    {
        "post_id":26875,
        "thread_id":26843,
        "title":"820-3332 odd symtoms",
        "user_id":468,
        "username":"ALB-Repairs",
        "post_date":"2017-10-17 04:16:44",
        "message":"[QUOTE=\"Gurmon, post: 26866\"]I seen this a few times on this board, always Q8930\/Q8931. Pull the FET and check if its already burning a hole through the board.[\/QUOTE]\n\nHolly Shit my power button functions after replacing those fets.\n\nThe fets i put on get pretty hot now so im not sure if they are safe to leave on there. Do They naturally run hot?\n\ngobsmaked that replacing those fets restored my power button though, Good work!"
    },
    {
        "post_id":26879,
        "thread_id":26843,
        "title":"820-3332 odd symtoms",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-10-17 04:31:30",
        "message":"Those FETs have nothing to do with the original problem, use logic to figure out why. Also those FETs frying is because of bad soldering on the common problem child U8900."
    }
]