[
    {
        "post_id":54857,
        "thread_id":54857,
        "title":"820-00165 MacBook Air - Wont update Firmware",
        "user_id":19840,
        "username":"jamiecruickshank",
        "post_date":"2019-11-27 00:54:51",
        "message":"Hi, \nThis is the first post of mine, as most of the time I have always found help without needing to post. \n\nI have an 820-00165 2015 MacBook Air. I had repaired this for a friend of mine that turned out to be a faulty trackpad that was holding down the SMC Reset line. \nIt was all working until he tried to update the OS and it just crashed again. \n\nIt turns out when you try to update the Firmware, either by installing High Sierra \/ Catalina or using bless with the firmware file, the MacBook fails to boot. \nWhen it fails to boot, the Fan will spin for about 1 second then off for 3 seconds, this repeats only until the battery is removed. \nYou cannot do a PRAM or SMC reset in this state. \n\nHas anyone seen this issue before? It will boot in OS X 10.10 thats installed using the Network Recovery fine, but I cannot update it from here. \n\nThanks for your help. \nJamie"
    },
    {
        "post_id":54858,
        "thread_id":54857,
        "title":"820-00165 MacBook Air - Wont update Firmware",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-11-27 03:23:13",
        "message":"If problem occured after an update, then flash U6100 with a good file from the forum.\nSeveral links already posted, for clean ME NIOS files.\nIf will work, then you need to put back original serial number and fx the checksum."
    },
    {
        "post_id":54870,
        "thread_id":54857,
        "title":"820-00165 MacBook Air - Wont update Firmware",
        "user_id":19840,
        "username":"jamiecruickshank",
        "post_date":"2019-11-27 08:52:28",
        "message":"Hey, \n\nThanks for the reply, I have managed to write a new Firmware to the MacBook and it does boot. However it still does the same issue with the 1 second fan when trying to update. \nI hoped this would have solved the issue but it seems like there is something else a miss. \n\nThanks, \nJamie"
    },
    {
        "post_id":54871,
        "thread_id":54857,
        "title":"820-00165 MacBook Air - Wont update Firmware",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-11-27 09:26:32",
        "message":"What you try to update?"
    },
    {
        "post_id":54875,
        "thread_id":54857,
        "title":"820-00165 MacBook Air - Wont update Firmware",
        "user_id":19840,
        "username":"jamiecruickshank",
        "post_date":"2019-11-27 10:37:00",
        "message":"It's when trying to Update the Firmware. It does the same whether using bless to load the firmware file or using the macOS Catalina install USB. Anytime the Firmware update is to happen, it will always get stuck in the 1 second fan boot loop until I pull the battery.\nRefreshing the BIOS chip didn't fix the issue. \n\nThanks, \nJamie"
    }
]