[
    {
        "post_id":30053,
        "thread_id":30053,
        "title":"[SOLVED]820-4924 - Internal speakers not seen in OS X",
        "user_id":235,
        "username":"MUUK",
        "post_date":"2018-01-03 04:22:27",
        "message":"Had a 820-4924 with bad liquid damage, Replaced a lot of things (whole U7100 area etc)\n\nNow all working except that the speakers are not seen in software.\n\nMachine chimes on start but only gives me Digital Audio out as an option in software (if insert headphones audio plays through them).\n\nNo red light in socket unless i change output source in system preferences.\n\nI know on older machines you could remove R6805 but i'm struggling to find what the equivalent would be in this machine (L6607 \/ L6608 would be my best guess).\n\nThanks for any help you could give."
    },
    {
        "post_id":30055,
        "thread_id":30053,
        "title":"[SOLVED]820-4924 - Internal speakers not seen in OS X",
        "user_id":289,
        "username":"smiba",
        "post_date":"2018-01-03 08:03:49",
        "message":"You can either replace the jack or remove L6607\/L6608 (I'm not sure which one of the two, can't find a datasheet of the CS4208 either). Keep in mind that by removing the coil you will permanently remove S\/PDIF functionality from the device"
    },
    {
        "post_id":30070,
        "thread_id":30053,
        "title":"[SOLVED]820-4924 - Internal speakers not seen in OS X",
        "user_id":235,
        "username":"MUUK",
        "post_date":"2018-01-04 04:20:22",
        "message":"Hi There, i tried removing both (L6607 \/ L6608) - this set it to headphone mode in software. I then tried each individually but neither allowed the internal speaker option to show up. I then replaced the headphone jack but no change. Any further thoughts ?"
    },
    {
        "post_id":30092,
        "thread_id":30053,
        "title":"[SOLVED]820-4924 - Internal speakers not seen in OS X",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-01-04 18:06:23",
        "message":"It is in headphone or SPDIF mode. Check what is happening on AUD_TIPDET lines and compare to known good."
    },
    {
        "post_id":30109,
        "thread_id":30053,
        "title":"[SOLVED]820-4924 - Internal speakers not seen in OS X",
        "user_id":235,
        "username":"MUUK",
        "post_date":"2018-01-05 03:28:08",
        "message":"Thank you Duke. It was pin 7 of J6600 - showing diode mode of 0.2v vs 1.7 on a good board. Removed C6604, DZZ602 & L6607 - still had a short at pin 1 of L6607 - which went direct to U6201. A quick reflow of U6201 solved the problem. Thank you again, may mark as closed."
    }
]