{"post_id":29206,"thread_id":29206,"title":"820-3115-B Only Working from Battery + No Green Light","user_id":1259,"username":"victor","post_date":"2017-12-12 06:58:03","message":"Hey everyone - i've been doing this work for a few years now, but have registered because i'm totally stuck on a board.\n\nSo I had a guy come in for a battery replacement the other day - i went to plug it in and realised that it wasn't working off the charger either - he hadn't picked up that this wasn't a battery issue.\n\nI swapped in another battery out of interest and it booted up fine - no boot from charger tho, and no charging of the battery.\n\n[B]The Facts[\/B]\nNo green light on charger.\nSMC reset does nothing.\nPRAM reset did nothing either.\nTried with multiple known-good magsafe boards and chargers - all good there.\nCustomer now believes problem was caused by a knock-off charger.\nAbsolutely no sign of liquid damage.\nWith one of my 18.5 volt chargers, i get a random green light, sometimes with a faint ticking sound from the board - the charger looks 100% genuine, but i'm starting to think it is fake because both other chargers give me no green light and no ticking. All three chargers behave normally with other macbooks.\n\n[B]The diagnosis & repair work done so far[\/B]\nI have replaced r7022, r7021, r7086 & r7005 because they were all screwed with high resistance. I have replaced u7000. I also replaced u7200 for good measure.\nSince doing the above, the device now boots in SMC Bypass mode with charger, but still nothing otherwise.\n\n[B]Some helpful measurements taken[\/B]\nResistance between pins 17&18 of u7000 = 3.5Ω\nResistance between pins 27&28 of u7000 = 20Ω\nADAPTER_SENSE = 3.44v\nSYS_ONEWIRE = 3.44v\nSMC_BC_ACOK = 3.45\nPPBUS_G3H = 12.54v\nPP5V_S3 = 0.00v\n\nDevice still boots perfectly on battery, correctly identifies cycles etc and runs at full speed with normal fans - no boot on charger, and no charge. I'm starting to suspect the SMC, please tell me it's not the SMC, please...\nHALP!\n\nThanks,\nV."}
{"post_id":29207,"thread_id":29206,"title":"820-3115-B Only Working from Battery + No Green Light","user_id":2,"username":"dukefawks","post_date":"2017-12-12 07:13:22","message":"Certainly garbage Chinese charger damage. You've done all there is to do, last two options before the SMC are U6900\/01. Q7080\/85 sometimes cause issues, but my gut feelings says dead SMC."}
{"post_id":29330,"thread_id":29206,"title":"820-3115-B Only Working from Battery + No Green Light","user_id":1259,"username":"victor","post_date":"2017-12-14 08:01:44","message":"So, i replaced U6900\/01 and it made no difference. I bit the bullet and replaced the SMC - but still no difference! Exactly the same symptoms with the replacement SMC.\n\nWeirdly, with the new SMC ppbus_g3h now measures 12.57v, but i'd assume the extra 0.03v is not a problem.\n\nAny other ideas to try?\n\nEDIT: I've discovered that when the battery is plugged in too - the magsafe light is actually very dully lit green - don't know if that helps at all."}
{"post_id":29337,"thread_id":29206,"title":"820-3115-B Only Working from Battery + No Green Light","user_id":2,"username":"dukefawks","post_date":"2017-12-14 09:24:32","message":"Must be crap under the magsafe connector on the board then. There is not much else to this. I assume you are 100% sure about a good magsafe board and charger? There must be some leak resistance\/capacitance on the one_wire line that kills communication with the SMC."}
{"post_id":29342,"thread_id":29206,"title":"820-3115-B Only Working from Battery + No Green Light","user_id":1259,"username":"victor","post_date":"2017-12-14 09:45:20","message":"Yeah i just tried yet another magsafe, taken from a machine it is currently working in - still not working. I just don't understand :'(.\n\nAny suggestions of places i could check for leak resistance\/capacitance on the one-wire? i will re-solder the magsafe connector on board but im pretty sure it's not that."}
{"post_id":29369,"thread_id":29206,"title":"820-3115-B Only Working from Battery + No Green Light","user_id":2,"username":"dukefawks","post_date":"2017-12-14 22:40:59","message":"Checked R6929? Besides that and corrosion under the connector there is not much else you can do. The problem can also be inside the board.\nYou can remove U6900 and then check diode mode on SYS_ONEWIRE to see if the trace to the SMC is in tact."}
{"post_id":29405,"thread_id":29206,"title":"820-3115-B Only Working from Battery + No Green Light","user_id":1259,"username":"victor","post_date":"2017-12-15 10:39:49","message":"I've checked R6929 - it's a solid 2k\nThere's no corrosion anywhere on the board. \nI removed u6900 and used diode mode, red on ground, black on sys_onewire - i got 0.7v"}
{"post_id":29408,"thread_id":29206,"title":"820-3115-B Only Working from Battery + No Green Light","user_id":1259,"username":"victor","post_date":"2017-12-15 11:27:50","message":"I've noticed that when i start up the board with just the battery, keyboard and screen connected, that the fans seem to blare up to full speed - kinda like when SMC bypass is on, but they gradually do it during the bootup. Perhaps the other SMC i've put on is also faulty :\/. I'm guessing a replacement SMC has to come from a 820-3115-B board? I've only got one in the donor pile and i've already taken its SMC."}
{"post_id":29414,"thread_id":29206,"title":"820-3115-B Only Working from Battery + No Green Light","user_id":289,"username":"smiba","post_date":"2017-12-15 14:13:57","message":"[QUOTE=\"victor, post: 29408\"]I've noticed that when i start up the board with just the battery, keyboard and screen connected, that the fans seem to blare up to full speed - kinda like when SMC bypass is on, but they gradually do it during the bootup. Perhaps the other SMC i've put on is also faulty :\/. I'm guessing a replacement SMC has to come from a 820-3115-B board? I've only got one in the donor pile and i've already taken its SMC.[\/QUOTE]\n\nThis means you have one or more sensors failing so the SMC is running the CPU in low speed while blasting the fans on full. What does ASD tell you about the sensors? Just wondering.\nEDIT: Check duke's response\n\nYou indeed need to get a SMC from a exact identical board"}
{"post_id":29421,"thread_id":29206,"title":"820-3115-B Only Working from Battery + No Green Light","user_id":2,"username":"dukefawks","post_date":"2017-12-15 15:23:31","message":"No need to check anything, without trackpad connected the fan will run at full speed.\n\nI have no other ideas then a dead SMC or issue inside the board. I assume you replaced the magsafe board connector."}
{"post_id":29499,"thread_id":29206,"title":"820-3115-B Only Working from Battery + No Green Light","user_id":1259,"username":"victor","post_date":"2017-12-17 13:55:03","message":"Ah yes - the fan thing was indeed simply the trackpad not being connected.\n\nI haven't actually replaced the magsafe connector on the board - it looked absolutely perfect and there's no corrosion anywhere so i just re-soldered the pins on the board. I figured since it's just a dumb 5-pin connection, there ain't much that could be wrong with it?"}
{"post_id":29503,"thread_id":29206,"title":"820-3115-B Only Working from Battery + No Green Light","user_id":2,"username":"dukefawks","post_date":"2017-12-17 15:08:04","message":"It could have crap hiding under it. There are no other options besides a problem inside the board."}
{"post_id":29551,"thread_id":29206,"title":"820-3115-B Only Working from Battery + No Green Light","user_id":1259,"username":"victor","post_date":"2017-12-19 10:44:08","message":"Well, I've given up. I replaced the connector and still no luck. There doesn't seem to be a problem inside the board as each line is present in every place it's meant to be present. It's a mystery forever i guess. Maybe the other SMC i have is also faulty, i'll never know as i have no more 820-3115-B SMCS and there ain't none on eBay either.\n\nThanks a lot for your time regardless Duke, it was nice getting closer to having some form of closure with this board lol."}
{"post_id":29582,"thread_id":29206,"title":"820-3115-B Only Working from Battery + No Green Light","user_id":2,"username":"dukefawks","post_date":"2017-12-19 18:12:55","message":"Proving voltages are there does not rule out a board issue. There could be resistive\/capacitive leaks inside the board messing up the signal. It is not just a voltage on the onewire line, it is serial communication.\nYou could hook up the scope and look at the data pulses on the onewire bus and compare with a good board."}
{"post_id":29683,"thread_id":29206,"title":"820-3115-B Only Working from Battery + No Green Light","user_id":1259,"username":"victor","post_date":"2017-12-21 06:59:46","message":"Very interesting! I will do exactly that and report."}
