[
    {
        "post_id":48944,
        "thread_id":48944,
        "title":"820-3787 known video issue?",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2019-05-06 04:52:02",
        "message":"Hello,\ni have a question regarding the 820-3787 boards. I saw this a few times already so i am curious if somebody know what causes this and how to fix it. This 15\" Retina late 2013 works fine but sometimes it shows glitched video. Something like a \"splitscreen view\" of the same picture on the internal screen. Sometimes it also shows a chopped image with some parts of the picture missing. I cant really exlpain it but i guess you know what i am talking about. Actually it works but if if happens again i can take a photo and upload it if needed. The customer also tested another used board but it seems to have the same issue. But maybe the second board was also faulty... Or could this be the screen? But would a screen issue not always be present?"
    },
    {
        "post_id":48945,
        "thread_id":48944,
        "title":"820-3787 known video issue?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2019-05-06 05:34:06",
        "message":"Not really a common issue, but it is of course possible that the GPU is failing. Nvidia N14P-GT on these boards I believe.\nMake sure you check that the issue is only present on external GPU and not on Intel integrated GPU."
    },
    {
        "post_id":48964,
        "thread_id":48944,
        "title":"820-3787 known video issue?",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2019-05-07 00:39:33",
        "message":"Ok i keep testing it. I let it run tests (i tested also with external monitor attached) all night and no issues so far. Since i took apart the device, cleaned it and put it back together it seems to work - atleast for now. So i keep testing it but i can remember that i could trigger the problem by plugging an external monitor in before i cleaned it. So i think it has to do with the discrete GPU. I report back if the problem should appear again.\nThank you"
    }
]