[
    {
        "post_id":78164,
        "thread_id":61491,
        "title":"A1707 820-00928-A Bootloop",
        "user_id":30961,
        "username":"PapaRayRay",
        "post_date":"2021-07-28 21:26:43",
        "message":"Does not boot in safe mode, does not go to recovery. Loads Apple all the way and then shuts off all the way and then tries again indefinitely. I tried known good bios (sourced from here in a previous thread)  according to the software successfully, and 2 new batteries; the problem persists. The board looks healthy, no visible signs of anything problematic. I can’t think of where to begin checking for an issue. Aside from trying a different firmware chip potentially however I don’t know for sure if that’s the wisest next logical step."
    },
    {
        "post_id":78170,
        "thread_id":61491,
        "title":"A1707 820-00928-A Bootloop",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-07-29 01:42:39",
        "message":"Discard software or internal SSD issues first; boot with USB macOS.\nDisconnect J9600, if doesn't want to boot from USB."
    },
    {
        "post_id":78249,
        "thread_id":61491,
        "title":"A1707 820-00928-A Bootloop",
        "user_id":30961,
        "username":"PapaRayRay",
        "post_date":"2021-07-30 09:11:46",
        "message":"Okay, so with J9600 disconnected I can successfully boot externally every time. Disconnecting J9600 led me to discover that if I disconnect it and intentionally let it fail to boot (with “?” folder, not loop) to the internal and then plug it back in it will boot to the internal and work fine until I turn it off at which point I have to disconnect it, allow it to fail to boot once, plug it back in and allow it to boot successfully. This pattern is consistent. I also allowed it to update hoping that it was something silly this was difficult as when the computer would restart during the update I would have to go through the process of disconnecting J9600 allowing it to fail and then plugging it back in to complete the update, after the update the problem persists; still have to disconnect, connect etc."
    },
    {
        "post_id":78252,
        "thread_id":61491,
        "title":"A1707 820-00928-A Bootloop",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-07-30 09:21:20",
        "message":"Did you try fresh new installation?"
    },
    {
        "post_id":78255,
        "thread_id":61491,
        "title":"A1707 820-00928-A Bootloop",
        "user_id":30961,
        "username":"PapaRayRay",
        "post_date":"2021-07-30 09:30:42",
        "message":"[QUOTE=\"2informaticos, post: 78252, member: 682\"]\nDid you try fresh new installation?\n[\/QUOTE]\nI have not, I wasn’t able to successfully boot to anything until your suggestion lol, I will start a back up now so that I can do a fresh install tonight. Ty I’ll update after."
    },
    {
        "post_id":78330,
        "thread_id":61491,
        "title":"A1707 820-00928-A Bootloop",
        "user_id":30961,
        "username":"PapaRayRay",
        "post_date":"2021-08-01 20:38:20",
        "message":"Fresh OS is successful. Very cool to have learned that, just as things seem too simple to be true: this may or may not be related but it may have been going on alongside original issue, just unable to notice because of the booting thing; \nNow it boots successfully each time without fail, but when you shut it down it will not turn on unless you do SMC reset or just unplug it and replug it, wether battery is plugged in or not doesn’t matter. Selecting restart is also unsuccessful on the turn back on part. Idk if this should be a separate post ??"
    },
    {
        "post_id":78444,
        "thread_id":61491,
        "title":"A1707 820-00928-A Bootloop",
        "user_id":30961,
        "username":"PapaRayRay",
        "post_date":"2021-08-04 19:41:23",
        "message":"The original boot loop issue was resolved in this thread I do feel like the issue I’m experiencing now deserves a different thread for anybody who may be looking through the threads in the future. I did start a new thread. Ty ty"
    }
]