{"post_id":6488,"thread_id":6488,"title":"Getting mother boards on e-bay for learning for first time?","user_id":404,"username":"IbeSial","post_date":"2016-09-08 10:50:47","message":"I know that getting a logic board from e-bay and expecting to have it run again is not good idea, but I am getting into this for the first time and would it make sense to practice on a board that is a peace of shit from china than say the one that I may be able to salvage when my skills leave is better? To me it makes sense that I should get the shitty $25 board and burn\/trash it wile learning before I try my hand and repairing something that I know works somewhat. \n\nThoughts?"}
{"post_id":6489,"thread_id":6488,"title":"Getting mother boards on e-bay for learning for first time?","user_id":34,"username":"VirtualLife","post_date":"2016-09-08 10:59:22","message":"Where do you live? Its always best to buy from you own country faulty logic boards. You can ask Apple authorized services shops that if they sell you the faulty ones. And if you have your own countries auction or buying\/selling website you can write there that you buy water damaged\/faulty\/broken MacBooks. It works well!"}
{"post_id":6490,"thread_id":6488,"title":"Getting mother boards on e-bay for learning for first time?","user_id":144,"username":"Aldizi","post_date":"2016-09-08 11:03:25","message":"Ibe... First as a student and if possible highly recommend louis one on one training before he becomes to big and is not able to do it anymore!!! Then also i never threw away macbook boards and salvaged 4\/5 that i brought to louis's class. So if you cant afford to do or make it to his class i'd work on your own stuff.. If you don't have any stuff is it worth learning right now? Maybe wait till you get some customer stuff that are willing to wait for the repair, quote them on a working board and try to fix their board then reduce the price if successful. Customers love to hear they are going to pay less. If not replace their board and keep their old board and work on that."}
{"post_id":6494,"thread_id":6488,"title":"Getting mother boards on e-bay for learning for first time?","user_id":404,"username":"IbeSial","post_date":"2016-09-08 11:45:06","message":"So I have a good friend\/mentor who runs a local mac repair shop he has tones older macs that he has been collecting over the years but it is all older stuff. I do have a few broken HP laptops that I could try out first and go from there. My friend gave me one board that he know works (it will boot and run from it's lighting bolt conceded display) and then he gave me one that was water damaged and he was going to part it out and toss the logic board. I think he wanted me to just pull what I needed from the water damaged machine to make the other one work, but I was wondering 'why don't I get them both to work.'\n\nAm I getting ahead of myself and I should just focus on one board at a time? Fix the one that boots first and then worry about the other machine once I have one working? Also I was thinking about stating on the PC board before I try anything else. \n\nSadly I am both without the movies to fly from Northern California to New York to take a class with Louis, and my health means I cannot fly or travel. I would love to organize my life so I can take one of training classes either at his shop or at the Practica Board Repair School. Either one would be awesome, but for now I am just getting my system set up for the first time. I am as nervous as a kid before Christmas waiting for my Amscope, my Hakko FR-810, and my AmTech Flux to arrive! Not to mention my Crest  Ultrasonic (witch is replacing my shitty on frequency thing that is meant for jewelry). Lucky for me I know a jeweler who was happy to get my one. Wow I am way off topic.\n\nSorry. \nYour thoughts about how to start learning?\nI gather that I should just work with what I have, and work with the broken things that are around me.  I should not buy anything as long as I do not have to?"}
