{"post_id":75458,"thread_id":61194,"title":"{[SOLVED]}  820-3787 Won't turn \"OFF\"","user_id":30961,"username":"PapaRayRay","post_date":"2021-05-14 22:41:42","message":"Everything I could think of software I've tried; I've tried all swappable parts. Every approach to turn computer off results in the same outcome. Screen goes off, fans keep spinning and it gets as hot as a metal slide on a bright Florida summer in 1993 up around the middle F-keys. There is nothing immediately visible on the board I have tried with freeze spray as well and its hard to pin point  because it instantly dries it up from the heat. I have tried with and without the battery; amps stay around 1.5 without battery on the power supply."}
{"post_id":75465,"thread_id":61194,"title":"{[SOLVED]}  820-3787 Won't turn \"OFF\"","user_id":682,"username":"2informaticos","post_date":"2021-05-15 04:31:35","message":"First of all, welcome to the forum!\n\nSo machine works good, but doesn't properly turn off?\nCheck which of PM_SLP_S3\/4_L remains high.\nCPU core voltage still present?\nDid you try to force it off pressing power button 5s?"}
{"post_id":75600,"thread_id":61194,"title":"{[SOLVED]}  820-3787 Won't turn \"OFF\"","user_id":30961,"username":"PapaRayRay","post_date":"2021-05-20 12:09:33","message":"Thank you, I've been waiting till I felt I have enough knowledge to benefit from this forum. I've worked in electronics for a long time but am fairly new at board level repair feel free to be as forward as necessary send me to learn stuff first etc., idc my feelings wont get hurt. I can't believe I didn't hold down the power button for 5 seconds, I guess it happens (I do know to try this but apparently forgot.) I reassembled and did this and it does indeed turn all the way off like this. If this changes my original post too much I can start a new one lmk. The problem is if you turn off from OS (I've tried before and after login, different OS's and different internal drives) everything will appear to a user as if the computer was off, it logs out and screen turns off (like if it was asleep) then, when they go to turn it back on it never \"turns on\"- because it never actually turned off (no apple, no login just \"asleep.\" Inside the fans keep spinning L7310, L7320 and L7330 get very hot. If you force it off with the power button then turn it on it'll work. I've also ran apple diagnostics- everything comes back okay.\n\n[I]So machine works good, but doesn't properly turn off?[B] [\/B][\/I][B]Correct[\/B]\n[I]Check which of PM_SLP_S3\/4_L remains high: [\/I][B]Both stay at 3.3v in this state[\/B]\n[I]CPU core voltage still present? [\/I][B]I googled a lot and watched many videos to make sure I answer this correctly but I'm not confident with where I'm to check exactly. I checked with L7310, L7320, L7330; all three measure 1.7v all the way across.[\/B]\n[I]Did you try to force it off pressing power button 5s? [\/I][B]I did now. This does power off all the way.[\/B]"}
{"post_id":75601,"thread_id":61194,"title":"{[SOLVED]}  820-3787 Won't turn \"OFF\"","user_id":682,"username":"2informaticos","post_date":"2021-05-20 12:31:47","message":"Somehow power off sequence fails.\nPM_SLP_S4_l must go low in off state.\n\nDo PRAM reset first."}
{"post_id":75615,"thread_id":61194,"title":"{[SOLVED]}  820-3787 Won't turn \"OFF\"","user_id":30961,"username":"PapaRayRay","post_date":"2021-05-20 18:47:12","message":"I did try pram reset several times. It’s successful but doesn’t fix the issue."}
{"post_id":75617,"thread_id":61194,"title":"{[SOLVED]}  820-3787 Won't turn \"OFF\"","user_id":30961,"username":"PapaRayRay","post_date":"2021-05-20 20:32:11","message":"If I reset the PRAM it will properly shut off booted to OS once. If you turn it back on the problem persists unless you reset the PRAM again."}
{"post_id":75624,"thread_id":61194,"title":"{[SOLVED]}  820-3787 Won't turn \"OFF\"","user_id":682,"username":"2informaticos","post_date":"2021-05-21 03:46:54","message":"Try this BIOS.\n[URL unfurl=\"true\"]https:\/\/drive.google.com\/file\/d\/1TiQAXEFpoDdoG5UwlT-WfHpudY_ajVBB\/view?usp=sharing[\/URL]"}
{"post_id":75658,"thread_id":61194,"title":"{[SOLVED]}  820-3787 Won't turn \"OFF\"","user_id":30961,"username":"PapaRayRay","post_date":"2021-05-21 22:10:28","message":"Is that a file I’d use with something like one of those EZP Programmer type doohickeys? Within the last month I stumbled across these on YouTube videos and have been doing research on them trying to decide which one I’m supposed to get. I am definitely ordering one I just want to be sure I’m getting one that’s usable for Apple boards etc. Maybe I should make a different thread asking about these. Or see if there is already an existing one.\n\n[B][I][U]SOLUTION:[\/U][\/I][\/B]\n                     I am embarrassed to share my solution which you opened my eyes to. But in light of proper forum etiquette for someone that might need the thread;\n[I]                     The customer was using this computer with Mojave because she has programs that won’t work with newer OS’s, I booted to a different internal drive with Catalina and simply updated to Big Sur, it did get stuck restarting once, I forced it off by holding the power button for five seconds and turned it back on it returned to the update and successfully completed. Now after replacing her drive which is still on Mojave everything works perfectly. I do think that it was a firmware issue and I believe upgrading to Big Sur in turn updated the firmware correcting the issue (correct me if you think I’m wrong).[\/I]\n                   \n                      I don’t know how I missed this, outside of board level repair I have been working on computers for a long time, I think with this board level repair venture I have essentially taken on too many jobs at once while learning simultaneously and must’ve overlooked a few things that you quickly walked me through. A million thank you’s. I will try harder to make sure I have covered all my bases with any future posts. I have two more computers that have me stumped one of which I will be posting for sure. In this thread alone I feel like $30 is insanely little. Like at what point have I asked about too many jobs? I feel like I’m supposed to make a second account if I’m gonna ask enough questions for two people. Thank you so much."}
{"post_id":75663,"thread_id":61194,"title":"{[SOLVED]}  820-3787 Won't turn \"OFF\"","user_id":682,"username":"2informaticos","post_date":"2021-05-22 04:10:05","message":"When macOS is upgraded, BIOS is also updated.\nSometime BIOS gets corrupted and machine presents strange symptoms.\nYou've been lucky enough that another macOS upgrade was able to update BIOS correctly."}
