{"post_id":28978,"thread_id":28978,"title":"820-4924 aht - ppf004","user_id":612,"username":"Atomrepair","post_date":"2017-12-07 04:05:18","message":"This macbook came in not turning on. Customer tells me no liquid, no fall, bump or anything. She used it normally the day before, next day it wont switch on.\nI take it apart - logic board is completely clean and pristine both sides, all connectors\/jacks. Nothing nasty anywhere.\nBefore you ask: she didn't take it somewhere else first to have it cleaned.\n\nI test the board outside the case - works fine with external display. Put it back together.. it works.\nI did find some of those little silica balls inside the laptop, which could've ended up jamming the fan, I run AHT.\nIt gives me PPF004. Fan trouble.\nI hook up another fan, same thing. Third fan, same error.\nI'm thinking maybe the fan didnt work, causing overheat, damaging stuff and causing this thing to no longer turn on. Perhaps its only working now until it overheats again? I run HW sensor\/monitor togheter with a yes > \/dev\/null terminal command to stress the cpu and get this:\n\n[ATTACH alt=\"820-4924-PPF004-fan-pin2.jpg\" type=\"full\" width=\"320px\"]28983._xfImport[\/ATTACH][ATTACH alt=\"820-4924-PPF004-fan-pin2.jpg\" type=\"full\" width=\"320px\"]28984._xfImport[\/ATTACH][ATTACH alt=\"820-4924-PPF004-fan-pin2.jpg\" type=\"full\" width=\"320px\"]28985._xfImport[\/ATTACH]\n\nWeird symbols by the fan name and it seems to think there are two of them, but RPM seems ok.\nI ran this for an hour or so, all good.\n\nAfter this, I ran AHT again and the error is gone, I get an all clear now.\n\nWhy am I posting this? Cause I prepared this damn post before the error suddenly disappeared and I want answers! Totally prepared for no answers, but perhaps this issue will turn up more often for this board and at some point an explanation can be found.\n\nSee below for scope readouts for pin 2 and 4 of the fan whilst spinning. Pin 1 was a nice flat 3.3V.\n\n[ATTACH alt=\"820-4924-PPF004-fan-pin2.jpg\" type=\"full\" width=\"320px\"]28986._xfImport[\/ATTACH][ATTACH alt=\"820-4924-PPF004-fan-pin4.jpg\" type=\"full\" width=\"320px\"]28987._xfImport[\/ATTACH]"}
