[
    {
        "post_id":33600,
        "thread_id":33600,
        "title":"820-2936-B: seven I\/V sensors fail; mouse-juddering slow; needs long press on power",
        "user_id":1444,
        "username":"TheBloke",
        "post_date":"2018-04-12 17:19:20",
        "message":"Hi all,\n\nThanks to Louis for his great videos and this forum. Firstly, let me say that I am not a repair shop. I'm just trying to repair a single MBP 13\" late-2011 that I bought cheap with a known fault, hoping I could repair it. I've spent more than a week on this, hoping to fix it on my own from watching lots of Louis' videos. But I think I do need some advice before I try any more drastic repairs, like reflowing the SMC.\n\nApologies if this post is rather long. I can't be sure what is useful info and what isn't, so I thought I'd share everything I've already done. \n\nHere's the symptoms:\n[LIST]\n[*]Will only turn on by holding power button for about 10 seconds, until the chime is heard. Pressing it just once causes the light to flash briefly, then nothing. Therefore the device can't be woken from sleep, only a full power-on each time.\n[*]Mouse-juddering slow in the OS.\n[\/LIST]\nRunning ASD EFI shows all OK except the following seven sensor failures:\n[LIST]\n[*]Voltage: VC0C - CPU V Core - above the high limit\n[*]Voltage: VD0R - DC in Rail 0 - above the high limit\n[*]Voltage: VN0R - MCP VCore - above the high limit\n[*]Voltage: VP0R - PBUS - below the low limit\n[*]Current: IB0R - Battery - above the high limit\n[*]Current: IC0R - Computing Combined Cores - above the high limit\n[*]Current: ID0R - DC In - above the high limit\n[\/LIST]\nPut another way, all voltage\/current sensors fail except for I0OR (Other 5V, 3.3V).  \n\nOf the seven failures, five of them are heat-affected and often go OK as the temperature of the board - or just the SMC - rises.  VD0R, VN0R, IB0R, IC0R and ID0R will sometimes go OK on their own if I keep ASD running a while. And if I take my heat gun set to 100C and wave it briefly over the SMC area, on several occasions all five of these went OK immediately - though this doesn't work every time. If it's any help, I've noted that IB0R and IC0R tend to go OK at exactly the same time, and usually before the other three do.  So I guess they require less extra heat to make work.\n\nVC0C and VP0R have never gone OK. And I note that VP0R is the only sensor 'below the low limit'. So maybe these two, or just VP0R, have a different cause to the rest.  If I do the Hardware Log thing in ASD EFI, it shows VP0R reading something like -12.5V.  \n\nI've tried rebooting into the OS after some of the sensors have gone OK in ASD, and this does seem to fix the symptoms - I even had a period of about four hours where it continued working perfeclty, including powering on with a single press of the button. Which I find confusing given Louis has shown that just VP0R on its own can cause the slowness, and that sensor never goes OK for me.\n\nExamining the board under microscope does show signs of corrosion in multiple places - those little flecks of green that Louis talks about in some videos. Including around the SMC. I don't believe the board has ever had major water damage, it's just various small areas, especially around the edges.\n\nI have spent a long time measuring resistors and haven't found a single one that consistently measure wrong according to the schematic. A couple of times I've found resistors that did seem to measure low on multiple readings, but then eventually they'd always measure correct, so I assumed this was caused by it being difficult to correctly measure these tiny SMD parts. \n\nI have particularly concentrated my measuring and studying around VP0R both because it's the only 'below low limit' and because I've watched Louis fix it a couple of times. I can't find a single bad resistor anywhere in the VP0R circuit. It could be a bad cap or transistor? But as I can't measure those in-circuit, I'd just have to go replacing them one by one in random hope.  I did actually try replacing one resistor, R5303 (27.4k), because it looked a bit dodgy and it was one that often measured low.  But replacing it didn't change anything.\n\nToday I put the board in my ultrasonic cleaner. I only have a cheap Chinese 2L device that runs at 42Khz - probably the sort that Louis calls a jewellery cleaner. I bought some PCB flux\/corrosion cleaner and 99.99% pure distilled water, mixed it 10:1 according to the instructions on the label, then ran the bottom half of the board (the half with the SMC) through twice at 65C, 2 minutes per side. I did a little longer than the 1m Louis recommended as my cleaner only does a single frequency which is lower than the 60-80Khz a Crest uses. I can only fit half the board in the cleaner at a time so I figured for now I'd only clean the half that has both the SMC and the various components involved in VP0R and most\/all of the other sensors.  After cleaning I washed it with plenty of 99% IPA and dried with a hand fan.\n\nThe good news is that the ultrasonic didn't kill the board or break anything else. But nor did it fix anything.  It's possible that I needed to run it for even longer given my cleaner is much more basic than an expensive one, and if need be I can run it again.  But I wanted to get some advice before taking any more risks.\n\nBased on my very limited knowledge, one possible next step would be to reflow the SMC? Given that I know heat on the SMC fixes five of the sensors, maybe this suggests dodgy solder joints? I saw Louis do that in one video - put flux all around the SMC, run the heat gun over it for a while until the solder melts enough that the chip will move, make sure it's still aligned then let it cool, helped with a 99% alcohol wash.\n\nBelow are some pictures, taken before the ultrasonic. At the end there's two whole-board views taken at 20MP, but as I don't have a macro lens you can't see anything too closely.  Before that there are two composite images taken under the microscope: one around the SMC, one around the VP0R components.  Apologies that they look like crap.  My cheap-ass digital microscope can only see a very small area, so I had to stitch multiple snapshots together to make these images. They're at approx 40x magnification. On the VP0R composite I've labelled some components so you can see which parts of the board I'm showing.\n\nAs you can tell I'm working with shit tools on top of my complete lack of experience. But I'm broke and even if I wasn't, I can't justify spending too much more just for one laptop. I know you guys would rather help fellow professionals, but I'm hoping you might take pity and talk me through a few next steps. The one thing I do have going for me is I'm willing to spend a lot of time on this, and attempt anything!\n\nThanks in advance\n\n[B]Composite of SMC and surrounding area, at 40x magnification:[\/B]\n[URL=\"https:\/\/imgur.com\/UHepbnN\"][IMG]http:\/\/i.imgur.com\/UHepbnN.jpg[\/IMG][\/URL]\n\n[B]Composite of components in VP0R circuit, at 40x:[\/B]\n[URL=\"https:\/\/imgur.com\/Y1AD1Ri\"][IMG]http:\/\/i.imgur.com\/Y1AD1Ri.jpg[\/IMG][\/URL]\n\n[B]Board front and back:[\/B]\n[URL=\"https:\/\/imgur.com\/puyLpVL\"][IMG]http:\/\/i.imgur.com\/puyLpVL.jpg[\/IMG][\/URL]\n[URL=\"https:\/\/imgur.com\/aXq2z8J\"][IMG]http:\/\/i.imgur.com\/aXq2z8J.jpg[\/IMG][\/URL]"
    },
    {
        "post_id":33616,
        "thread_id":33600,
        "title":"820-2936-B: seven I\/V sensors fail; mouse-juddering slow; needs long press on power",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-04-12 17:46:13",
        "message":"SMC reflow would be a good start. Do not fully reflow just some flux and heat to try and clear the crap under it, about 150C."
    },
    {
        "post_id":33624,
        "thread_id":33600,
        "title":"820-2936-B: seven I\/V sensors fail; mouse-juddering slow; needs long press on power",
        "user_id":1444,
        "username":"TheBloke",
        "post_date":"2018-04-12 20:50:37",
        "message":"[QUOTE=\"dukefawks, post: 33616\"]SMC reflow would be a good start. Do not fully reflow just some flux and heat to try and clear the crap under it, about 150C.[\/QUOTE]\n\nThanks for replying so fast. OK I've tried that twice, but unfortunately no luck.\n\nSpecifically, I first ran the gun at 150C for about 4 minutes all over the SMC, including angled in around the edges. Tested, same errors. So I tried one more time, this time around 190C for another 3 minutes or so. Again, same errors in ASD. Both times I put a decent amount of Amtech NC-559 all around the chip, and afterwards sprayed it with 99% alcohol and wiped the SMC and around it with a paper towel.\n\nDo I now need to try heating it enough that the chip floats, like I saw in Louis' video? Or anything else to try before that? I must admit I'm a bit apprehensive about going too far with the SMC, as I can imagine that one slip and I'll end up merging the balls together or something, and I have no donor boards to get a replacement from (plus I've seen the video showing how much of a PITA swapping an SMC is!) But if\/when I need to do it, I'll definitely try.\n\nWhat are your thoughts on VP0R? Do you think that it might be the same cause as the others - directly SMC related? I thought given it was the only one 'below the low limit' it might be unrelated, so maybe there's more I should be checking in that area?\n\nTomorrow maybe I'll go over the resistors again, and maybe replace the NTUD3169CZ (Q5300). I bought a few 0402 resistors and caps and SOT-963 transistors and other bits in case I needed to replace anything - shipping was far more than the components themselves so I just bought a selection of components used by the failing sensors. I don't have a replacement cap for VP0R (C5025), but I thought I could try removing and re-placing it, as I thought the solder didn't look too good on one side of it.  Plus once it's out of circuit I can test its capacitance.\n\nThanks again."
    },
    {
        "post_id":33631,
        "thread_id":33600,
        "title":"820-2936-B: seven I\/V sensors fail; mouse-juddering slow; needs long press on power",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-04-13 03:25:17",
        "message":"It could possibly be a VREF issue. Check voltage on PP3V3_S5_AVREF_SMC"
    },
    {
        "post_id":33640,
        "thread_id":33600,
        "title":"820-2936-B: seven I\/V sensors fail; mouse-juddering slow; needs long press on power",
        "user_id":1444,
        "username":"TheBloke",
        "post_date":"2018-04-13 07:46:34",
        "message":"[QUOTE=\"dukefawks, post: 33631\"]It could possibly be a VREF issue. Check voltage on PP3V3_S5_AVREF_SMC [\/QUOTE]\n\n\nOK thanks. I've taken a measurement and if I did it right, I'm only getting 0.9V.   EDIT: I think this is a valid measurement, as I've measured it as 0.9V elsewhere too.\n\nThis is what I measured, with the motherboard powered but not turned on:\n[IMG type=\"full\" width=\"200px\"]https:\/\/i.imgur.com\/QDalUJh.png[\/IMG]\n \n\nEDIT: I just measured again, this time between pin 8 of U5010 and GND (screw hole), and again got 0.9V - specifically 0.9111V\n\nAnd as per my later post, I've also measured 0.9V on the PP3V3_S5_AVREF_SMC pins of C5025 and C5026."
    },
    {
        "post_id":33641,
        "thread_id":33600,
        "title":"820-2936-B: seven I\/V sensors fail; mouse-juddering slow; needs long press on power",
        "user_id":1444,
        "username":"TheBloke",
        "post_date":"2018-04-13 07:56:43",
        "message":"I notice that the area around U5010 looks pretty bad, and pin 8 looks a bit different to the other pins - not a great connection maybe?\n\n[img]https:\/\/i.imgur.com\/YIyLec5l.png[\/img]"
    },
    {
        "post_id":33643,
        "thread_id":33600,
        "title":"820-2936-B: seven I\/V sensors fail; mouse-juddering slow; needs long press on power",
        "user_id":1444,
        "username":"TheBloke",
        "post_date":"2018-04-13 08:57:50",
        "message":"EDIT: sorry, ignore this post, I misread the schematic."
    },
    {
        "post_id":33648,
        "thread_id":33600,
        "title":"820-2936-B: seven I\/V sensors fail; mouse-juddering slow; needs long press on power",
        "user_id":1444,
        "username":"TheBloke",
        "post_date":"2018-04-13 09:24:58",
        "message":"OK, more confirmation of the 0.9V reading - I measured each side of both C5025 and C5026, marked PP3V3_S5_AVREF_SMC and GND_SMC_AVSS.  I also measured them between their PP3V3_S5_AVREF_SMC pin and GND.  The highest reading I got was 0.9276V"
    },
    {
        "post_id":33654,
        "thread_id":33600,
        "title":"820-2936-B: seven I\/V sensors fail; mouse-juddering slow; needs long press on power",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-04-13 09:53:55",
        "message":"Should be 3V3, so there is the problem. U5010 is a good suspect."
    },
    {
        "post_id":33657,
        "thread_id":33600,
        "title":"820-2936-B: seven I\/V sensors fail; mouse-juddering slow; needs long press on power",
        "user_id":1444,
        "username":"TheBloke",
        "post_date":"2018-04-13 10:22:07",
        "message":"[QUOTE=\"dukefawks, post: 33654\"]Should be 3V3, so there is the problem. U5010 is a good suspect.[\/QUOTE]\n\nOK, so I guess it's worth trying removing it from the board, cleaning the pads and putting it back on? I see I can buy replacements from Louis or from China, but both involve international shipping so I'd like to see if I can get this one working first.\n\nCould you just confirm I'm OK to heat up the U5010 with the gun till I can take the chip off, clean the pads and then resolder it back on? Just want to check there's nothing special I need to know about doing htat. Also what gun temperature would you recommend for doing that?\n\nThanks again for all your help."
    },
    {
        "post_id":33667,
        "thread_id":33600,
        "title":"820-2936-B: seven I\/V sensors fail; mouse-juddering slow; needs long press on power",
        "user_id":1444,
        "username":"TheBloke",
        "post_date":"2018-04-13 17:34:17",
        "message":"I really suck at this.  I've spent ages trying to get this fucking U5010 off the board.  I've gone as high as about 350C on the gun and the damn chip just won't come off.  It looks so easy in Louis videos, he just waves the gun around and a minute later the chip comes off.\n\nI tried putting flux around it and fresh leaded solder on the pins, still no joy.  The solder on pins 1-8 seems to melt, but I guess pin 9 under the chip isn't melting properly.  My gun is cheap clone crap, but I tested its air with a thermocouple and it's definitely coming out at the set temperature.  So it must be technique rather than tools.\n.\nThe only good news is I somehow haven't yet managed to fry the chip or anything around it.    Advice much appreciated.\n\nIf this chip can't be made to work, is there any clever workaround other than replacing it with another chip?  I mean, all I need is 3.3V, is there any way I can take 3.3V from somewhere else on the board?  Like cut pin 8 off the chip, and feed 3.3V from somewher else into that pad.  It's probably a stupid idea, but is there any chance something like that can work?\n\nI might buy a faulty donor board on eBay to give me a replacement U5010 and other components, but first it'd be nice to see if there's any options that don't involve spending yet more money."
    },
    {
        "post_id":33669,
        "thread_id":33600,
        "title":"820-2936-B: seven I\/V sensors fail; mouse-juddering slow; needs long press on power",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2018-04-13 19:05:08",
        "message":"You should easily be able to blast 420C at these...."
    },
    {
        "post_id":33683,
        "thread_id":33600,
        "title":"820-2936-B: seven I\/V sensors fail; mouse-juddering slow; needs long press on power",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-04-14 04:10:40",
        "message":"I suggest you get some donor boards to practice on. Now you may destroy a perfectly fixable one. I also use bottom heat, makes it a lot easier to remove stuff."
    },
    {
        "post_id":33688,
        "thread_id":33600,
        "title":"820-2936-B: seven I\/V sensors fail; mouse-juddering slow; needs long press on power",
        "user_id":1444,
        "username":"TheBloke",
        "post_date":"2018-04-14 04:52:47",
        "message":"OK thanks JohnB, that's good to know.\n\nDuke, yeah I'm going to get a donor board. Can you explain what you mean by bottom heat? You heat from the other side of the board, under the chip, not on top of it?\n\nThanks."
    },
    {
        "post_id":33704,
        "thread_id":33600,
        "title":"820-2936-B: seven I\/V sensors fail; mouse-juddering slow; needs long press on power",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-04-15 07:03:09",
        "message":"Heat the whole board from the bottom. This reduces the amount of top heat you need to apply. It can be done without but I always heat from the bottom too to make it easier. You can get dedicated heater plates, I just use a heat gun in my lap that blows on the bottom of the board."
    },
    {
        "post_id":33710,
        "thread_id":33600,
        "title":"820-2936-B: seven I\/V sensors fail; mouse-juddering slow; needs long press on power",
        "user_id":1444,
        "username":"TheBloke",
        "post_date":"2018-04-15 07:16:38",
        "message":"OK thanks Duke, I'll give that a go.  Yeah I've seen rework stations with heater plates.  A bit outside my budget for now, but I can try two guns at once.\n\nI've bought a faulty 820-2879 off eBay, which was the cheapest board I could find that I know has the U5010. And the board I got looks to be in pretty good shape, so I can probably get other components from it if they prove to be needed - all it appears to be missing is some part of the backlight circuit.\n\nThe donor won't be here until Tue or Wed so I'll leave you in peace until then :)  Thanks again for your help."
    }
]