{"post_id":27069,"thread_id":27069,"title":"820-3023 - No Vcore, has fanspin and ALL_SYS_GOOD","user_id":289,"username":"smiba","post_date":"2017-10-20 16:15:37","message":"ALL_SYS_PWRGD high, fan spinning\n\nU7400 power on pin 15, 24, 40. CPUIMVP_VR_ON high.\nR7402\/03 within specification\n\nCPU not shorted to ground.\n\nFirst sighting of a dead U7400? Am I missing something?\nThe SMC has seen better days but since we get into S0 I don't think there is reason for concern.\n\nCheers"}
{"post_id":27079,"thread_id":27069,"title":"820-3023 - No Vcore, has fanspin and ALL_SYS_GOOD","user_id":2,"username":"dukefawks","post_date":"2017-10-20 17:31:36","message":"Could be anything as the CPU is not telling U7400 to set VID. History of the board?"}
{"post_id":27083,"thread_id":27069,"title":"820-3023 - No Vcore, has fanspin and ALL_SYS_GOOD","user_id":289,"username":"smiba","post_date":"2017-10-20 19:00:37","message":"No idea about the history\n\nIts a board I've had here for almost two years which I had totally forgotten about. It does not look water damaged because all indicators are still white and there is no corrosion to be found.\nIt looks like the SMC was replaced(, probably by me). Can this issue be caused by a bad SMC?\n\nIf you have no idea and it could be anything I'll just replace U7400 from a donor  just to confirm its not that so I can get it out of my mind.\nThanks"}
{"post_id":27098,"thread_id":27069,"title":"820-3023 - No Vcore, has fanspin and ALL_SYS_GOOD","user_id":289,"username":"smiba","post_date":"2017-10-21 08:52:37","message":"The system does not seem to fully get into S0\n\nPP0V75_S0_DDRVTT is not there. MEM_VTT_EN is low because PLT_RESET_L and ISOLATE_CPU_MEM_L is low so none of them pull MEMVTT_EN_L to ground.\n\nAs I understand the PCH is responsible for these signals, I'll keep investigating\n\nEDIT:\n\nMissing PM_PCH_SYSPWROK due to CPUIMVP_PGOOD being low.\nNot surprising since we have no CPUIMVP out of our U7400"}
{"post_id":27099,"thread_id":27069,"title":"820-3023 - No Vcore, has fanspin and ALL_SYS_GOOD","user_id":289,"username":"smiba","post_date":"2017-10-21 09:55:11","message":"Replaced U7400 (With a MAX17511 from a 2936 board which is a suitable replacement) and CPU Vcore is there :)\n\nSolved! U7400 can die apparently!\n\nEDIT: It seems to be brain dead though, no POST :(\nAnything I can do to rule out a dead CPU? All the other boards I have at the moment are on hold while waiting for parts so I have the time"}
{"post_id":27109,"thread_id":27069,"title":"820-3023 - No Vcore, has fanspin and ALL_SYS_GOOD","user_id":2,"username":"dukefawks","post_date":"2017-10-21 13:35:39","message":"Could be anything. This has been in a pile for 2 years, how much chance is there that something got knocked off?"}
{"post_id":27117,"thread_id":27069,"title":"820-3023 - No Vcore, has fanspin and ALL_SYS_GOOD","user_id":289,"username":"smiba","post_date":"2017-10-21 15:13:38","message":"Looked for quite a while under the microscope but all parts seem to be there.\n\nI flashed a new bios with clean me region but no luck with that either\n\nI'll see if there are any signals going into the CPU that might be preventing it from posting, but most likely not.\nThere is small discolouration around the CPU so maybe some liquid was into play but I can't be sure. I've seen this as well on boards without liquid\nIs there a way to reflow the CPU with a hot air station? Or will I just crack the die without pre-heating from underneath?"}
{"post_id":27119,"thread_id":27069,"title":"820-3023 - No Vcore, has fanspin and ALL_SYS_GOOD","user_id":2,"username":"dukefawks","post_date":"2017-10-21 15:46:01","message":"I doubt that U7400 was dead. Something got heated up and that is why it is working again."}
{"post_id":27120,"thread_id":27069,"title":"820-3023 - No Vcore, has fanspin and ALL_SYS_GOOD","user_id":289,"username":"smiba","post_date":"2017-10-21 15:50:16","message":"All the signals to U7400 were alright as far as I could see, at best the heat woke up the CPU\/PCH and made it send the right signals. Confident that U7400 was messed up though\nBoard is still working even after being fully cooled down again.\n\nThe last try would be reflowing the CPU at this point probably? I checked again and all S0 signals are there and solidly within specification. Would reflowing the CPU go just as I would reflow a SMC or does it require additional precaution?"}
{"post_id":27121,"thread_id":27069,"title":"820-3023 - No Vcore, has fanspin and ALL_SYS_GOOD","user_id":2,"username":"dukefawks","post_date":"2017-10-21 16:22:28","message":"Don't reflow, just heat and flux as it would only need to clear  possible corrosion."}
{"post_id":27122,"thread_id":27069,"title":"820-3023 - No Vcore, has fanspin and ALL_SYS_GOOD","user_id":289,"username":"smiba","post_date":"2017-10-21 17:07:56","message":"No luck, used a nice amount of flux and heated it up well enough to activate it\n\nStill no POST :(\n\nAny chance this might be clock related? It gets all the way to S0 though so I doubt it. Just a dead cpu?\n\nEDIT:\n\nJust gave the ugly looking SMC a reflow as well because it is somewhat involved in controlling aspects the PCH\/CPU and it was my last hope. Sadly even through I was extra nice by carefully preheating the board the SMC is now fully dead. Missing SMC_PM_G2_EN but PP3V42_G2H and everything needed to get it going within specification\n\nI'll see if I have a SMC for this one around but I'll probably just throw it back on the pile as a donor. Just wondering could there be a chance that it actually would have been the SMC messing up the CPU? I'm not sure if it has low enough access to the CPU to get it stuck before POSTing"}
{"post_id":27123,"thread_id":27069,"title":"820-3023 - No Vcore, has fanspin and ALL_SYS_GOOD","user_id":2,"username":"dukefawks","post_date":"2017-10-22 08:16:19","message":"SMC is not dead, just pull and reball and 90% sure it will work again."}
