{"post_id":26356,"thread_id":26356,"title":"macbook 12 early 2015, wont go sleep when lid closed","user_id":1101,"username":"ielectron","post_date":"2017-10-04 10:33:29","message":"red wine damage, no too serious, i think it did not reach the motherboard, i did not see any liquid damage on the mobo,  but the trackpad and keyboard, i cleaned them, keyboard is replaced and now everything working fine except that it wont go to sleep when lid is closed, screen stays on, i set it to immediately ask for password, and it wont, but if i hold the power button for 2 sec it goes to sleep and asks for password when waked, and from sleep it comes back by opening the lid, so im not sure now, seems the sensor is good, but i have no idea where is located, so it wakes up opening the lid, but wont go to sleep when closed. I want to reinstall osx but first have to get a usb-c adapter, it has like 180gb data to backup."}
{"post_id":26364,"thread_id":26356,"title":"macbook 12 early 2015, wont go sleep when lid closed","user_id":2,"username":"dukefawks","post_date":"2017-10-04 13:16:47","message":"The replacement keyboard did not have the hall sensor installed probably. It is under a small metal cover on the keyboard bottom. Or corrosion and 3V42 is not getting to hall sensor."}
{"post_id":26395,"thread_id":26356,"title":"macbook 12 early 2015, wont go sleep when lid closed","user_id":1101,"username":"ielectron","post_date":"2017-10-05 04:21:03","message":"is it a removable a component with a sleeve cable that i have to connect somewhere? or is it solder on the keyboard and i have to remove and solder to the new keyboard? there is a small black metal cover, under the \"fn\" button, there is a small 5 legged chip under it, i think that is on the new keyboard, and i replaced that small black cover on the new keyboard, do u have pictures where is that hall sensor located nad looks like exaclty? and where do i measure the 3.42v exactly?"}
{"post_id":26396,"thread_id":26356,"title":"macbook 12 early 2015, wont go sleep when lid closed","user_id":1101,"username":"ielectron","post_date":"2017-10-05 04:25:45","message":"No Title"}
{"post_id":26399,"thread_id":26356,"title":"macbook 12 early 2015, wont go sleep when lid closed","user_id":1101,"username":"ielectron","post_date":"2017-10-05 04:26:29","message":"that is the original keyboard above, the new one is installed in the laptop, i have to open it again to check"}
{"post_id":26418,"thread_id":26356,"title":"macbook 12 early 2015, wont go sleep when lid closed","user_id":2,"username":"dukefawks","post_date":"2017-10-05 09:00:47","message":"That is the Hall sensor. See if it gets 3.42V and if one of the other legs goes to SMC_LID. Also check if there is a magnet in the LCD of course, some Chinese junk LCD may not have it."}
{"post_id":26421,"thread_id":26356,"title":"macbook 12 early 2015, wont go sleep when lid closed","user_id":1101,"username":"ielectron","post_date":"2017-10-05 09:52:06","message":"i did not replace the lcd, that is the original, i will check the sensor , thx"}
