[
    {
        "post_id":6532,
        "thread_id":6532,
        "title":"820-2850-A GPU panic and green screen",
        "user_id":414,
        "username":"sztomi90",
        "post_date":"2016-09-09 10:02:22",
        "message":"Hello!\n\nI Just signed up for the forum.\nI am also fairly new to all this so I apologize in advance if I say something silly but I'll try my best.\n\nI have a 2010 mpb with this motherboard. I found the youtube channel for some months now and I was very glad when I finally saw this new complete repair video on this board....so I did scrape the board to fit a new electrolitic cap (C9560). It took several attempts until I managed to get it flat on the board I am a newbie and I had very little experience with my equipment......\n\nBut the board still does the gpu panic and a new issue too: the screen has that strong green tint instead of the blacks.\n\nSo I troubleshooted quite a lot. I suspect that these two issues are not connected.\n\nAnyway first: the green screen problem:\nChecked, cleaned the LVDS connection. It seems to be fine.\nI pushed, wigled, tapped the machine at almost at every area and the conclusion:\nWhen it comes to moving or tilting pushing the screen nothing changes.\nBut when I lightly push the motherboard at a certain areas the green goes away: Mainly at the bottom of the left fan down until on the trackpad, keyboard and battery connectors and also on the top of the ram slots.\nI rad what Louis said about this issue and how easy is to mess up the ram slots esp the bottom bga one. \nI realized that I made some mistakes when I was working: I left the ram sticks all the time in the board.\nSo I tried only using the top slot, then bottom one, trying other sticks. Nothing changed. Also the machine will not freeze when tap or push on the top of the slots. So I am suspecting that the slots are not damaged.....\nI also tried with and external tv and it works perfectly without green tint.\n\n\nAnd secondly the kernel panics.\nI did measure the power rails. (I should have done it before I started everything, but I was a careless, impaitent, stupid newbie)\nEverything seems fine, except when it comes to the gpu rails:\n\n[B]PP1V8R1V55_S0GPU_ISNS_R (on what C9560 is) is 1.5 volts[\/B]. It should be 1.8 right? (hope I understand the schematic and your video explanations about this)\n\nin the same way PP1V8R1V55_S0GPU_ISNS is 1.5V too...\n\nPPVCORE_GPU is 0.8 V instead of 1 V  (just in case this is relevant too)\n\nOkay what I am speculating is that maybe I burned that poor cap too many times and it got damaged.....or something else got burned or messed because I used the hot air improperly. I did a lot of visual checking but I could not see anything ugly or loose so far.....\nSo I am clueless now....and also kind of sad cause this is my main computer and I can barely use it this way (esp with the green tint). :(\n\nTHANKS in advance for any advice!!!"
    },
    {
        "post_id":6533,
        "thread_id":6532,
        "title":"820-2850-A GPU panic and green screen",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-09-09 11:30:17",
        "message":"The LVDS issue is the MUX U9600. They are pretty shitty to reball, so if you have little experience this is not recommended."
    },
    {
        "post_id":6611,
        "thread_id":6532,
        "title":"820-2850-A GPU panic and green screen",
        "user_id":414,
        "username":"sztomi90",
        "post_date":"2016-09-12 08:55:02",
        "message":"Thanks for the promt reply. I was suspecting that chip (that part needed the lightest touch for the screen to come back)...\nI know you guys are agains reflowing but I was speculating that if I cannot reball that chip a reflow might be my only chance....what do you think? Would this have any risk? \nWhat are the chances that I make it even worse?"
    },
    {
        "post_id":6616,
        "thread_id":6532,
        "title":"820-2850-A GPU panic and green screen",
        "user_id":36,
        "username":"aprendiz",
        "post_date":"2016-09-12 09:16:03",
        "message":"Remove perfectly well all the glue around IC and go ahead with the reflow, if you don't have practice doing this, do it in a scrap board first...."
    },
    {
        "post_id":6627,
        "thread_id":6532,
        "title":"820-2850-A GPU panic and green screen",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-09-12 11:09:29",
        "message":"We have to be real here, you have issues soldering C9560, I doubt a successful reflow of the MUX will happen. Bit of a shame to destroy a perfectly fixable machine."
    },
    {
        "post_id":7383,
        "thread_id":6532,
        "title":"820-2850-A GPU panic and green screen",
        "user_id":414,
        "username":"sztomi90",
        "post_date":"2016-09-29 08:07:24",
        "message":"Update:\n\nBeing desperate of not being to use my laptop I did find a fix: I folded a little piece of hard paper into like 1cm thickness and kapton taped it to the MUX chip then when I screw the case back on it applies enough pressure so that the chip makes pretty okay contact (sometimes if I hold in some ways it comes back sometimes but no big deal).\n\nI know, I know it is kind of a lame solution but as Louis would say \"Meh what do you want from me?\" :P :D ;))\n\nSo I had been using the mac for two weeks like that. With the nvidia gpu turned on. It did work like a charm. Even the kernel panics dissapeard. That was kind of surprising to me. I was suspecting that contact issue with the MUX chip might had been contributed to the panics as well.....well anyway I was happy that it seem to work.\n\nThen few days ago had a kernel panic again. (Also just after this upgraded to SSD with new osx). Panics still continued.....\n\nThe thing is:\nThat MUX chip reball seems way to complicated and risky to me now. Maybe in the future, when I will have more practice, and a good stencil for it I might attempt it. But till then the \"paper solution\" is fine for me....\n\nMy question is related to the kernel panics.\nSo if I got it correctly then it is NOT connected with the MUX chip issue, right?  Is that problem ONLY caused by that cap (that I probably tortured to much when I put it on)? Cause if it is then I could change that again to a new one......(now doing things the proper way)\n\nThanks for the help again.\nCheers"
    },
    {
        "post_id":7384,
        "thread_id":6532,
        "title":"820-2850-A GPU panic and green screen",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-09-29 08:41:14",
        "message":"MUX will \/usually\/ not cause kernel panics. Did you replace c9560 with a normal size(bigger) cap?"
    },
    {
        "post_id":7388,
        "thread_id":6532,
        "title":"820-2850-A GPU panic and green screen",
        "user_id":414,
        "username":"sztomi90",
        "post_date":"2016-09-29 09:57:11",
        "message":"Yes, I replaced it.\n\nAnd since it did not solve the panics I started speculating why that might be. As I wrote in my first post when I measured after that rail with that cap it was 1.5v. The schematics, if I understand it correctly says is should be 1.8v. \nSo I was speculating that the cap might have been hurt a bit since it took a few attempts to get it flat on the board (repeated hot air rework can harm a cap maybe?) \nor another thing that came to mind was that maybe some other component got hurt nearby......I have no idea what is the real issue."
    },
    {
        "post_id":7397,
        "thread_id":6532,
        "title":"820-2850-A GPU panic and green screen",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-09-29 10:37:02",
        "message":"You replaced it, BUT WITH WHAT? 1.5V is normal, it is switches between 1.5 and 1.8."
    },
    {
        "post_id":7406,
        "thread_id":6532,
        "title":"820-2850-A GPU panic and green screen",
        "user_id":414,
        "username":"sztomi90",
        "post_date":"2016-09-29 11:07:49",
        "message":"I see. I replaced it with a normal size brand new 330uf Aluminium [COLOR=#2C2B2B][FONT=Tahoma][SIZE=13px]Electrolytic[\/SIZE][\/FONT][\/COLOR] cap."
    },
    {
        "post_id":7448,
        "thread_id":6532,
        "title":"820-2850-A GPU panic and green screen",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-09-30 05:01:38",
        "message":"Like a standard electrolytic cap in the form of a can? That will not work, need to replace with a 330uf from a scrap board, the black rectangular ones."
    },
    {
        "post_id":7453,
        "thread_id":6532,
        "title":"820-2850-A GPU panic and green screen",
        "user_id":414,
        "username":"sztomi90",
        "post_date":"2016-09-30 05:40:53",
        "message":"I did with an SMD cap. This one: [url]http:\/\/au.rs-online.com\/web\/p\/aluminium-capacitors\/7269896\/[\/url]\nI did scrape the ground pad....exactly like Louis showed in that respective video. ([url]https:\/\/www.youtube.com\/watch?v=DzcgT_fiVTA[\/url])\nI also avoided the mistake to put the cap on inversed like he did :P"
    },
    {
        "post_id":7464,
        "thread_id":6532,
        "title":"820-2850-A GPU panic and green screen",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-09-30 08:10:45",
        "message":"That should be ok. It could be the MUX it could also be a bad GPU."
    }
]