{"post_id":39184,"thread_id":39184,"title":"820 3787 - Don't work wireless","user_id":423,"username":"Noguinfor","post_date":"2018-09-04 08:54:48","message":"Hey guys, \n\nFirst problem this macbook was a fuse f7005! i replace the fuse, then i noticed the machine only works with a fake charger and initially i replace a  Q7010 but don't solve the problem. One guy in this forum say's to me the problem is a  Q7180 and it was right! But in this moment the wireless don't work!! the wireless symbol on the top bar does not appear.. Any suggestions?? the problem can be related to the previous repair??"}
{"post_id":39190,"thread_id":39184,"title":"820 3787 - Don't work wireless","user_id":36,"username":"aprendiz","post_date":"2018-09-04 11:02:43","message":"Does the system see the wifi card (check in \"about this mac--- System Report)??? Voltage on pin 1 from J3501????"}
{"post_id":39221,"thread_id":39184,"title":"820 3787 - Don't work wireless","user_id":2,"username":"dukefawks","post_date":"2018-09-04 22:35:48","message":"Bad airport card\/IO board\/flat cable\/connectors."}
{"post_id":39235,"thread_id":39184,"title":"820 3787 - Don't work wireless","user_id":423,"username":"Noguinfor","post_date":"2018-09-05 04:50:31","message":"airport card it's ok! tested on 13 retina and work's! i don't have a flat cable to test... i have 0v pin 1 from J3501 when i tun it on! i compare with a 13 retina and should have there! i will try to test other board\/flat!!"}
{"post_id":39857,"thread_id":39184,"title":"820 3787 - Don't work wireless","user_id":423,"username":"Noguinfor","post_date":"2018-09-24 05:04:27","message":"OK, i already try a new board\/flat and i don't have wireless... i have 0v on pin 1 from j3501 like i said!! i have 1 retina 2012 in my store and without board\/flat disconected i have 3.3v on pin 1 from j3501!!! that is to say this is a board problem.. anyone can help me please??"}
{"post_id":39858,"thread_id":39184,"title":"820 3787 - Don't work wireless","user_id":423,"username":"Noguinfor","post_date":"2018-09-24 05:40:04","message":"Ok, i found the problem.. missing u3550!!! you can close the topic"}
