[
    {
        "post_id":75410,
        "thread_id":61188,
        "title":"820-00281 No power, PCH issues",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2021-05-13 18:59:02",
        "message":"Hello. This board has turned into a real nightmare. Originally it came in with liquid damage and minor corrosion around U7650, U3100 and U4200. Was only getting 5v and PP3V3_G3H was shorted to ground. I cleared the short by removing C3100 and got 20v but only about 30ma. Was missing PP3V3_S5 and it was not shorted, so I replaced U7650 and some components near it that were corroded and then I checked PP3V3_S5 again before powering the board and it was now shorted somehow. I went to remove U7650 again, thinking it was causing the short, and after only like 10 seconds of heating it with my hot air station, I heard a loud pop noise so I stopped heating. When I flipped the board over, I saw the PCH die actually exploded somehow and a large chunk blew off from it. Weird because I was not even heating the board in that area. I removed the damaged PCH and the PP3V3_S5 short was gone. I replaced it with a new PCH I bought on Aliexpress, but was still not turning on. I was not getting PM_SLP_SUS_L and found it was because the trace was broken. I had to run a wire under U7800 to reconnect that and now I have PM_SLP_SUS_L and all S5 voltages, but missing PM_SLP_S5_L. I have since found more broken traces on PM_PWRBTN_L and PM_DSW_PWRGD, which I ran wires to fix. I'm sure I have another broken trace somewhere but I'm not sure where to look. I checked each of the signals below and they seem normal. What else is needed for PM_SLP_S5_L?\n\nPM_SLP_SUS_L - 3.3\nPM_SLP_S5_L - 0 (Does not pulse when trigger)\nPM_SLP_S4_L - 0 (Does not pulse when trigger)\nPM_SLP_S3_L - 0 (Does not pulse when trigger)\nPM_SLP_S0_L - 0 (Does not pulse when trigger)\n    \nPM_PWRBTN_L - 3.3 (Does drop when trigger)\nPM_RSMRST_L - 3.21 (No reaction when trigger)\nPM_DSW_PWRGD - 3.3 \nRTC_RESET_L - 3.07\nPCH_SRTCRST_L - 3.07\nPCH_INTRUDER_L - 2.79\nPM_BATLOW_L - 3.3\nS5_PWRGD - 3.29"
    },
    {
        "post_id":75417,
        "thread_id":61188,
        "title":"820-00281 No power, PCH issues",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-05-14 02:43:32",
        "message":"Possibly liquid went inside board, between copper layers.\nI suspect internal broken trace.\nCan be a problem between PCH-U7800-SMC.\nPCH receives the required signals to start power on sequence."
    },
    {
        "post_id":75459,
        "thread_id":61188,
        "title":"820-00281 No power, PCH issues",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2021-05-14 20:44:10",
        "message":"Yea, this board is done for. It has a ton of broken traces. I was checking diode mode values on all the resistors on the opposite side of the board from the PCH. I found a bunch of OL values, which does not match another board I have, so these are all broken traces. Thanks anyway."
    }
]