{"post_id":47757,"thread_id":47757,"title":"820-00923, Cycling 5.14v on 3 ports, Liquid.","user_id":515,"username":"SMMRepair","post_date":"2019-03-24 15:01:26","message":"Working on a board that had liquid to some areas I'm not thrilled about, but it is what it is!\n\nObvious liquid to U7800, U7900, U4200 and U3100 (awesome, great, very excited). Board running on 5.14v that cycles every ~8 seconds or so, EXCEPT if I connect charger to the bottom right-side port, in which case it does NOT loop, but does stay at 5.14v with 0 amperage draw. I replaced U3100\/Q3100 because it had direct, obvious liquid and some resistors were burned, hoping it was the cause of my looping. Nope, ports still loop except for bottom-right port.\n\n[U]I am providing measurements with charger connected to bottom-right USB-C port, as that's the only one that does not loop:[\/U]\n\n1. PPBUS_G3H, 0v.\n2. PP3v3_G3H, 3.41v (no short, .333 diode)\n3. PPDCIN_G3H 5.2v at R7020 (no short--.517 diode)\n4. Diode on all 4 CD3215 power fuses is .120\n5. TBA_VDDA is 5.1v.\n\nNow it would seem the most immediate issue is PPDCIN_G3H being only 5.2v, which I believe is due to SMC not communicating with charger. Is this correct?\n\nAlso, since I've never seen anything like it and I'm curious--what is primary function of U7800? It almost looks like a 2nd SMC, and I'm not familiar with it. Since it take some liquid and had some visible (but minor) corrosion, I considered replacing it, but since it's a larger BGA, I figured I'd wait until I got a bit more direction. I did reflow it with no change, however.  :)\n\nAny help appreciated!"}
{"post_id":47758,"thread_id":47757,"title":"820-00923, Cycling 5.14v on 3 ports, Liquid.","user_id":682,"username":"2informaticos","post_date":"2019-03-24 19:53:16","message":"U7800 is Power Management IC (PMIC) and manage lot of power signals, including enable and power good signals for all secondary power supplies.\nIt also drives the buck-converters for several power supplies.\nRTC voltage is generated by it too.\n\nYou still have a problem with USB-C controllers and that can be enough to block SMC.\nOnly one port cycling, means the problem resides on it, before the common point (PPDCIN_G3H) of all ports.\nUnless the problem is common for the other 3 ports..."}
{"post_id":47769,"thread_id":47757,"title":"820-00923, Cycling 5.14v on 3 ports, Liquid.","user_id":515,"username":"SMMRepair","post_date":"2019-03-25 08:56:16","message":"Thank you!! I actually realized I had replaced the CD3215 with a \"B03\" version instead of \"C00\". Once I replaced it with a C00 chip, the board began working--no more cycling, etc. It boots and has passed AHT, and seems to be working well! :)\n\nThanks again!"}
