{"post_id":32077,"thread_id":32077,"title":"[SOLVED] 820-3437 No power, No green light smc issue?","user_id":1061,"username":"Don Anton","post_date":"2018-02-27 18:45:21","message":"Hi there,\nthis is liquid damaged board. So far this is what I diagnosed.\n\nPPBUS_G3H. -8.4V\nPP3V4S_G3H -3.4V\nSMC_ONOFF_L -3.4V\nSMC_BC_ACOK -3.4V\nSMC_RESET_L -3.4V\nSMC_ADAPTER_EN -0V\nPP5V_S5 - 0V\n\n\nTHERE IS NO SHORT IN PPBUS_G3H AND PP3V42 IN DIOD MODE.\n\nSMC not heating at all even if you plug for hours.\n\nHow should i check whether the SMC getting power?\n\nappriciate if you can help me out.\n\nThank you,"}
{"post_id":32085,"thread_id":32077,"title":"[SOLVED] 820-3437 No power, No green light smc issue?","user_id":1,"username":"larossmann","post_date":"2018-02-27 22:08:24","message":"Look up what U6900 and U6901 look like on any old Unibody board - 820-3115, 820-3330, 820-2936, 820-2879, 820-2915, 820-2850, etc. Then look at the DC in board of the air and find those same two ICs on the Macbook Air DC in board.\n\nThe Macbook Air has the circuitry that allows the charger to communicate with the SMC on the DC in board itself, not the board, which is why I need you to know U6900 and U6901 look like so you can spot them on the Air's DC in board. Is PP3V42_G3H making its way to the DC in board? Can you measure PP3V42_G3H on pin 5 of U6901 and SMC_BC_ACOK at 3v on pins 1\/2? If not, how do the SMC_BC_ACOK, PP3V42_G3H, and SYS_ONEWIRE pins look on J9500? How do the pins on the DC in cable, the 821-1722 look?\n\nIf that's all good, then we keep looking. One thing troubling is PP5V_S5 being low. PP5V_S5 comes from U7501. SMC_BC_ACOK tells U7501 to turn on and create PP5V_S5. Is SMC_PM_G2_EN present? If not this can point to a bad SMC."}
{"post_id":32091,"thread_id":32077,"title":"[SOLVED] 820-3437 No power, No green light smc issue?","user_id":1061,"username":"Don Anton","post_date":"2018-02-28 01:17:54","message":"Hi Louis, Thank you verymuch for getting back to me. \n\nU6900\/U6901 all the power rails are present and accurate as you described.\n\nPP5V_S5 is 0V. SMC_PM_G2_EN is 0V.\n\nPLEASE ADVICE ME. \n\nThanks Louis."}
{"post_id":32115,"thread_id":32077,"title":"[SOLVED] 820-3437 No power, No green light smc issue?","user_id":1,"username":"larossmann","post_date":"2018-02-28 16:10:44","message":"This all points to a bad SMC. Replace the SMC with one from a donor board, a 820-3437."}
{"post_id":32131,"thread_id":32077,"title":"[SOLVED] 820-3437 No power, No green light smc issue?","user_id":1061,"username":"Don Anton","post_date":"2018-03-01 01:42:56","message":"Thank you very muh louis. I will do that and update you."}
{"post_id":32276,"thread_id":32077,"title":"[SOLVED] 820-3437 No power, No green light smc issue?","user_id":1061,"username":"Don Anton","post_date":"2018-03-06 03:22:56","message":"HI LOUIS,\n\nJUst to update you after replacing SMC the macbook works fine. Thank you verymuch for your guidance. I have an small issue I bought a SMC stencil and solder paste from you. I think I'm doing something wrong way as stencil stick to the SMC and it was a nightmare to reball the SMC. I watched your SMC reball video few times and want to know do we have to put flux on the smc before attcheed the Stencil? or am i outing too much solder paste? Tried few times but everytime I screwed up and finally did with normal solder this soldering iron which is not the correct way. Anyway thank you very much for all your support louis."}
{"post_id":32295,"thread_id":32077,"title":"[SOLVED] 820-3437 No power, No green light smc issue?","user_id":1,"username":"larossmann","post_date":"2018-03-06 19:54:05","message":"The stencil sticks to the SMC. When you're done, remove the tape, add some flux, heat it at full air with the nozzle further away, and have your tweezers under the stencil. I pop it off that way. The key is to do it in the moment while the balls are slightly expanded down but not fully melted. It will take practice."}
