[
    {
        "post_id":35382,
        "thread_id":35382,
        "title":"What RTG is \"too low\" when determining a dead CPU?",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2018-06-01 17:08:29",
        "message":"I received a huge shipment of boards from a company who cleans the hell out of their boards (no board repair knowledge, they simply toss boards into a cleaner if there's *any* sign of liquid, from one drop to one gallon). I'm going through and checking for shorted CPUs first, to save some time, and was wondering what resistance to ground is considered the \"uh oh\" point. For example, on a few 820-4924 boards, I've noticed a RTG of <1ohm at the vcore regulators, which of course is not good. Working boards are around ~14-15ohm, but I have a few that are 5-7ohm. What would be the point we should start to suspect a damaged\/shorted CPU? If 5-7ohm is too low, I won't even bother, but if that means something else (maybe a regulator itself is shorted, etc), then maybe I'll spend a bit more time on them. Several of these had no sign of liquid to the CPU or power supply area, but of course I can't be sure since they were cleaned so \"well\" (thoroughly).\n\nJust curious! Thanks!"
    },
    {
        "post_id":35426,
        "thread_id":35382,
        "title":"What RTG is \"too low\" when determining a dead CPU?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-06-04 13:55:36",
        "message":"I worry if they are under 2 Ohm, but it depends on the CPU really. Even identical CPUs can vary a lot in resistance."
    },
    {
        "post_id":35447,
        "thread_id":35382,
        "title":"What RTG is \"too low\" when determining a dead CPU?",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2018-06-04 15:18:01",
        "message":"Interesting, that's good to know--thanks, duke.\n\nOn a related note (sort of): Do you have any tips for pulling CPUs on these boards? I know it's a pain in the ass, but I'm going to start playing around with a new BGA station we bought and was curious if you had any pointers about the Air\/retina boards specifically. Thanks again!"
    },
    {
        "post_id":35532,
        "thread_id":35382,
        "title":"What RTG is \"too low\" when determining a dead CPU?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-06-06 14:45:24",
        "message":"Yeah, take my advice and don't. Huge waste of time and low success rate. These CPUs are so thin they will warp. Better to try on some more beefy GPU stuff if you want practice."
    }
]