{"post_id":15335,"thread_id":15335,"title":"820-3662 charging issue returned to haunt me","user_id":615,"username":"laptopcity","post_date":"2017-02-22 08:45:31","message":"[h=2][\/h] Hi have an 820-3662 board that had liquid spill few weeks ago with charging issue, turnt out to be the battery so i thought as when replaced with new unit all was ok , well for a couple of days anyway. Here's the original post so you can see what was done\/checked and rechecked again now. Problem seems to be the same , with battery disconnected laptop will boot and run fine, with battery connected it will only boot to apple logo but what i have noticed with the battery installed the cpu gets extremly hot very fast, ive tried different chargers and 2 new batteries with same result, anyone got any clues i cant put it to the bottom of the pile anymore :-)\n\nHi i have an 820-3662 board with a charging issue, laptop will boot to login screen, shows battery percentage and charging icon but as soon as you enter the password and hit enter the laptop restarts, if i disconect the battery it will boot to os, it will not turn on by battery power either, so ive changed isl6259 checked current sensing both charging side and battery side and just out of frustration changed q7155, oh and also reset pram just incase :-( anybody got any clues"}
{"post_id":15345,"thread_id":15335,"title":"820-3662 charging issue returned to haunt me","user_id":36,"username":"aprendiz","post_date":"2017-02-22 11:50:30","message":"Voltage on pins 5 and 6 from J7050??"}
{"post_id":15486,"thread_id":15335,"title":"820-3662 charging issue returned to haunt me","user_id":615,"username":"laptopcity","post_date":"2017-02-24 12:39:09","message":"Hi sorry for the delay in replying and i appreciate the help just the flat above decided to flood out the shop so spent the last two days cleaning up, anyway voltage on pin 5 and 6 is 3.38v with or without battery connected but what i did notice while the board was out the cpu dosnt get hot without the keyboard and trackpad connected still wont boot to os though, but seams as though possibly these have something to do with the issue, although the both work fine if battery disconected."}
{"post_id":15498,"thread_id":15335,"title":"820-3662 charging issue returned to haunt me","user_id":2,"username":"dukefawks","post_date":"2017-02-24 14:12:15","message":"My best bet would still be a shitty or fake battery."}
{"post_id":15506,"thread_id":15335,"title":"820-3662 charging issue returned to haunt me","user_id":615,"username":"laptopcity","post_date":"2017-02-24 15:33:52","message":"Hi Duke ive had two new batteries and supposed to be genuine but they did come from ebay so maybe the are fake genuine ones"}
{"post_id":15511,"thread_id":15335,"title":"820-3662 charging issue returned to haunt me","user_id":461,"username":"Gurmon","post_date":"2017-02-24 17:08:04","message":"I'd side with Duke on this. I've tried a few \"new\" ebay batteries, mostly turned out to be junk."}
{"post_id":15519,"thread_id":15335,"title":"820-3662 charging issue returned to haunt me","user_id":615,"username":"laptopcity","post_date":"2017-02-25 05:16:48","message":"the more i think about it the more i think your right, ive ordered one from bookyard so hopefully that will be here tuesday, Is there anywhere you would recommend to get batteries from"}
{"post_id":15533,"thread_id":15335,"title":"820-3662 charging issue returned to haunt me","user_id":2,"username":"dukefawks","post_date":"2017-02-25 07:48:48","message":"Nope all sources are pulled hopeless crap from the China trash, Russian roulette. Apple has a fixed fee of something like $200 to replace the complete topcase. Would've been cheaper in the end I think."}
{"post_id":15538,"thread_id":15335,"title":"820-3662 charging issue returned to haunt me","user_id":615,"username":"laptopcity","post_date":"2017-02-25 09:36:02","message":"your right cost me £101 inc shipping for used battery not to mention the 3 i brought at £72.00 each but they are going back"}
{"post_id":15672,"thread_id":15335,"title":"820-3662 charging issue returned to haunt me","user_id":615,"username":"laptopcity","post_date":"2017-02-28 10:43:14","message":"Someone hates me , battery turnt up and still the same any advice would be more than appreciated :-)"}
