{"post_id":52360,"thread_id":52360,"title":"questionmark on A1425 please help","user_id":64,"username":"Dozer","post_date":"2019-09-17 04:38:08","message":"hi comunity.\n\nI got a strange problem.\n\nGot from customer an A1425 with blinking question mark\n\nI pulled out a working 256GB SDD from a A1398 (2012) and insert that in the A1425. Everything is booting and working ok.\n\nNow I take the \"bad\" 128GB SSD from the A1425 and insert it in the A1398 and there it works fine without problems\n\nput it back in the A1425 again only the question mark\n\nSo what is here the problem, need some help please. going crazy."}
{"post_id":52361,"thread_id":52360,"title":"questionmark on A1425 please help","user_id":682,"username":"2informaticos","post_date":"2019-09-17 04:51:58","message":"What OSX has the \"bad\" SSD?\nCould be an issue with APFS partition, if is not the original SSD from A1425, or board has been changed and BIOS doesn't support APFS yet."}
{"post_id":52362,"thread_id":52360,"title":"questionmark on A1425 please help","user_id":64,"username":"Dozer","post_date":"2019-09-17 07:40:54","message":"thanks. thats a posibility. on the \"bad\" SSD is installed Mojave\n\nI cleaned the SSD and installed High Sierra, not working. Then i looked with the A1398 but the intallation process has format the SSd again with APFS before installing High Sierra\n\nOk, so I cleaned again and cloned my working Disk (High sierra without APFS) on the \"bad\" disk. Now that is working in the A1425\n\nSo is there any posibility to change the BIOS for support APFS? I am now shure the client was trying to install or to update the system. In the beginning holding Alt while starting (\"bad\" SSD in A1398) there was a bootable disk named installer to see."}
{"post_id":52363,"thread_id":52360,"title":"questionmark on A1425 please help","user_id":682,"username":"2informaticos","post_date":"2019-09-17 08:30:35","message":"Do fresh install of Mojave or High Sierra, in the board with problem.\nBIOS will be automatically updated."}
{"post_id":52364,"thread_id":52360,"title":"questionmark on A1425 please help","user_id":64,"username":"Dozer","post_date":"2019-09-17 08:39:20","message":"yes, that worked, thanks a lot\n\n[SOLVED]"}
