{"post_id":24060,"thread_id":24060,"title":"[SOLVED]820-3332 Fails ASD -- ID0R & IG3C?","user_id":515,"username":"SMMRepair","post_date":"2017-08-10 09:33:49","message":"Had this board repaired and sold, but it was returned because it had \"no video\". I installed it back into the test case and video is working fine, but it does fail ASD in a few tests:\n\nID0R and IG3C sensor tests both fail with the failure listed as sensors reading below the \"low\" limit. I know that OS ASD can give a lot of false positives, but it fails reliably each time, and other boards don't have that particular failure ever, so I think it might actually be an issue with the board. Of course, we have our share of buyers\/customers who return items claiming they don't work simply because they're too ashamed to admit they ordered the wrong part, or that it did not resolve their issue(s).\n\nAnyway, was just curious what the thoughts were on these two failed sensor tests. Is there anything I could check, or would those sensors be directly related to the PCH on the board? Thanks in advance, as always."}
{"post_id":24071,"thread_id":24060,"title":"[SOLVED]820-3332 Fails ASD -- ID0R & IG3C?","user_id":36,"username":"aprendiz","post_date":"2017-08-10 11:36:17","message":"For IG3C: water damage or knocked parts around U8350 or UD280??  ID0R could be crap under SMC or a bad ISL"}
{"post_id":24093,"thread_id":24060,"title":"[SOLVED]820-3332 Fails ASD -- ID0R & IG3C?","user_id":515,"username":"SMMRepair","post_date":"2017-08-10 17:19:16","message":"Thanks, Aprendiz!\n\nThis unit had no liquid at all; I pulled it fresh from a unit that had video issues (resolved that issue). I inspected the board for missing components and didn't see any, so I replaced UD280 and that resolved the IG3C issue (passes now). The ID0R issue is still occurring, though; before I reflow or pull the SMC--is there anything else I should check besides the SMC, since the unit had no liquid damage? R5441 reads properly."}
{"post_id":24096,"thread_id":24060,"title":"[SOLVED]820-3332 Fails ASD -- ID0R & IG3C?","user_id":36,"username":"aprendiz","post_date":"2017-08-10 17:53:03","message":"It could be ISL6259 too, replace that first......."}
{"post_id":24098,"thread_id":24060,"title":"[SOLVED]820-3332 Fails ASD -- ID0R & IG3C?","user_id":515,"username":"SMMRepair","post_date":"2017-08-10 18:01:00","message":"Oops--I totally missed you mentioning the ISL in the first post, sorry about that. Yes, I'll replace the ISL first to be safe, then will look at the SMC. I'll update tomorrow! :) Thanks, Aprendiz!"}
{"post_id":24115,"thread_id":24060,"title":"[SOLVED]820-3332 Fails ASD -- ID0R & IG3C?","user_id":2,"username":"dukefawks","post_date":"2017-08-10 21:14:59","message":"Pretty sure this was liquid. ID0R will probably be bad R7021\/22 or traces to the ISL."}
{"post_id":24142,"thread_id":24060,"title":"[SOLVED]820-3332 Fails ASD -- ID0R & IG3C?","user_id":515,"username":"SMMRepair","post_date":"2017-08-11 10:35:49","message":"You guys nailed; thanks Duke--it was R7021\/R7022, both were out of spec (one 30ohm and one 980ohm). I replaced both and all is well. I don't see any signs of liquid anywhere on the board, but of course that doesn't mean much. In any event, all seems well now. Thanks guys!\n\nEDIT: I have a few questions, actually, if you don't mind Duke: (1) Is there a place in the schematics where ID0R is related to R7021\/R7022? I searched the schematics prior to posting, and didn't see anything directly related between ID0R and R7021\/22. In other words, how would someone know to check those resistors? Is it just from knowing and experience? Also, this board was one that was sold by us (passed ASD perfectly), then returned with these faults. Do these 2 things sound like something that could have resulted or popped up due to using a bad\/cheap charger? Something obviously blew those 2 resistors in the time the customer had the board. I'm just curious, so I can learn a bit and know for the future. Thank you again, Duke--always masterful assistance. Also, thank you so much Aprendiz--you've helped me dozens of times."}
{"post_id":24173,"thread_id":24060,"title":"[SOLVED]820-3332 Fails ASD -- ID0R & IG3C?","user_id":2,"username":"dukefawks","post_date":"2017-08-11 15:32:59","message":"Yes those resistors will fry from shitty Chinese chargers or some other voltage spike on the magsafe.\n\nID0R comes from AMON and AMON is an current sense output from U7000."}
{"post_id":24183,"thread_id":24060,"title":"[SOLVED]820-3332 Fails ASD -- ID0R & IG3C?","user_id":515,"username":"SMMRepair","post_date":"2017-08-11 16:02:17","message":"Awesome, thanks Duke! That helps me a lot."}
