[
    {
        "post_id":63218,
        "thread_id":59778,
        "title":"820-3209-A Sleep & EDID & USB Port",
        "user_id":26765,
        "username":"sws",
        "post_date":"2020-08-01 06:20:06",
        "message":"Hello,\n\nI have a 2012 MacBook Air A1466, motherboard 820-3209-A that randomly puts itself to sleep.  You can be actively working on something or not touching the computer at all, and the display will turn off and fan spins down.  Ran ASD and it put itself to sleep during ASD when running the EDID Checksum Test which then returned ERROR - 8000000E [Not Found] - TEST FAILED.  However, on subsequent runs it did not fail at that step but instead would put itself to sleep which then resulted in a failed test elsewhere.  Importantly, we disconnected the internal display cable and connected only to an external monitor and it did not sleep at all, even once.\n\nThe display assembly itself shows some signs of trauma.  I'm beginning to think that all MacBook Airs must come from the factory with a dent in the corner of the display.  Also a white ring shows up on the LED along with white spots, so it's a candidate for replacement.  I don't have a mid-2012 13\" display assembly for an A1466 so we will need to buy one.  They seem to go for over $200 for Grade B.  Finally to the question:  Is replacing the entire display assembly an appropriate next step or should I start with the cable?  I can fairly easily reflash and put a clean ME region on it but I'd like to order the display assembly asap so the unit doesn't sit for a simple repair.  However, a $200+ part is a tough sell on a device reaching this age.  I'm also trying to find a 2012 full A1466 in reasonable shape and just harvest the display assembly but that's somewhat difficult too.\n\nAnother issue with the motherboard is the left USB port which is somehow jammed and a USB device cannot be fully plugged into it.  Is there a standard practice for fixing these on MacBooks?  I suppose it depends on how damaged or if things can be bent back.  From my work on larger PC motherboards, these could be desoldered fairly easily but just not sure if there's a consensus on the same repair for MacBooks or if we should try to get it bent back at all costs.\n\nSteve"
    },
    {
        "post_id":63303,
        "thread_id":59778,
        "title":"820-3209-A Sleep & EDID & USB Port",
        "user_id":1057,
        "username":"piernov",
        "post_date":"2020-08-02 11:16:40",
        "message":"Did you try a known good LIO board and FFC?\nLooking at the MacBook in a normal working position, left USB port is on LIO board as well btw."
    },
    {
        "post_id":63308,
        "thread_id":59778,
        "title":"820-3209-A Sleep & EDID & USB Port",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-08-02 13:26:20",
        "message":"Check SMC_LID signal, it comes from LIO board; must be steady 3.3V.\n\nYou need to replace LIO board, solving USB port problem too.\nAlso test known good LIO flex and inspect LIO conector (MLB) pins."
    }
]