{"post_id":41158,"thread_id":41158,"title":"820-3330 no video","user_id":296,"username":"jadao","post_date":"2018-10-24 18:52:45","message":"I got this board witch has been messed with a little...It got a sticker with (bad video card\/Bios)\nHopefully GPU has not been reflowed.\nI took a look at it and here is my findings:\n\nInitially quarter fan spin...nothing to do with charging sense resistor\nL3508 completely burned...but thats not a big deal.\nWrong 2011 lcd plugged in...\nLooked for knocked off component and found R8802 in another position! between R8802 pin1 and c8823 pin 1. R8802 pin 2 was not anymore connected.\n\nCorrected all this stuff and still board with all signals power cycling...\n\nDecided to quickly test a bios from same donnor board and actually it chimes! but still no video! Usb mouse with red light.\n\nU8900 had very bad looking original solder joints. I decided let's touch up and reflow all the solder joint, It looks really great but nothing changed, still no video...\n\nTried some PRAM and checked for image but nothing.\n\nThen I thought maybe bios should have it's original ME, so I tried a backup from the original bios and it's not detected by programmer. When I solder back bad original bios chip it has same diode mode reading than the donnour testing one...\nActually it looks like it does'nt turn on but no short!! When I remove original bios it doesn't change anything, it continue power cycling.\n\nIs it worth spending time for this? If so how can I confirm if it's a bad ME bios chip causing that or a bad U8900?\n\nNote: I confirmed U8900 is receiving GPUVCORE_EN 3.3V and GPUVCORE_PGOOD at 3.3V. Found also PPVCORE_S0_AXG to be 0,89V, so it looks very likely that U8900 is working properly.\n\nThanks for any advice"}
{"post_id":41219,"thread_id":41158,"title":"820-3330 no video","user_id":682,"username":"2informaticos","post_date":"2018-10-25 19:50:34","message":"Did you test for external video.\nInstead of mouse, test with OSX pendrive; if flashes, there is USB activity for sure.\n\n\"GPUVCORE_PGOOD at 3.3V\"\nThat means GPU power supply works good.\n\nPost some voltages at J9000; correct LCD plugged in, of course..."}
{"post_id":41699,"thread_id":41158,"title":"820-3330 no video","user_id":296,"username":"jadao","post_date":"2018-11-04 02:17:50","message":"Yes I tested with external monitor, it doesn't work.\n\nHowever I am sure there is activity,, it chimes, I can PRAM the board with external kbd.\nI also see flashing activity with my usb live os hdd,\nWhen I boot holding option key, I can see Caps Lock key light on.\n\nVoltages on J9000:\nPP3V3_SW_LCD=0V I am missing LCD_PWR_EN = 0V\n\nThanks"}
{"post_id":41700,"thread_id":41158,"title":"820-3330 no video","user_id":682,"username":"2informaticos","post_date":"2018-11-04 03:12:27","message":"Try this dump as is, don't change ssn yet.\n[url]https:\/\/drive.google.com\/open?id=1F3ubzLhVcyu81ErPQWQEqhljC8RuJDmM[\/url]\nI cannot assure is good, as I got it from vinafix..."}
{"post_id":41714,"thread_id":41158,"title":"820-3330 no video","user_id":296,"username":"jadao","post_date":"2018-11-04 10:47:58","message":"Hi 2informaticos, thanks for the dumps I downloaded it, but I can't open the compressed file, it seems broken.\nThanks"}
{"post_id":41717,"thread_id":41158,"title":"820-3330 no video","user_id":296,"username":"jadao","post_date":"2018-11-04 12:01:36","message":"What is the difference between 8MB and 4MB?\nThanks"}
{"post_id":41719,"thread_id":41158,"title":"820-3330 no video","user_id":682,"username":"2informaticos","post_date":"2018-11-04 12:30:07","message":"Apart of 2x4=8???\nI didn't exactly understand you.\nTry to explain you better..."}
{"post_id":41726,"thread_id":41158,"title":"820-3330 no video","user_id":296,"username":"jadao","post_date":"2018-11-04 18:17:21","message":"Sorry, for some reason it’s missing a line,\nSince I can’t open your dump, the compressed file is reported as corrupted (maybe it’s my win xp system :), I’ve downloaded from Vinafix a bios to test. They had a 8MB version and a 4MB.\nI just took a standard 8MB version."}
{"post_id":41727,"thread_id":41158,"title":"820-3330 no video","user_id":296,"username":"jadao","post_date":"2018-11-04 18:35:03","message":"So I tested another bios (with no warranty wether clean ME or not) and samed thing...\nit chimes, it's able to PRAM but no image\/backlight...\nAny suggestiona? Thanks\n\nI notice also fans doesn't ramp up due to missing trackpad, it just run quiet as if trackpad was connected??"}
{"post_id":41876,"thread_id":41158,"title":"820-3330 no video","user_id":296,"username":"jadao","post_date":"2018-11-07 16:58:47","message":"Any suggestion about this one before I give it back? Thanks\nDon't know if on this model fan ramp up progressively to maximum when trackpad is disconnected… I think it should if TS0P is located on the trackpad…\nI don't know if this is most likely related to bad ME region or other additional issue..."}
{"post_id":41886,"thread_id":41158,"title":"820-3330 no video","user_id":682,"username":"2informaticos","post_date":"2018-11-08 03:57:02","message":"No external video discard a problem with internal LCD.\nYou must have a GPU related issue.\nChange U8900, just in case..."}
