[
    {
        "post_id":23076,
        "thread_id":23076,
        "title":"820-2915 no green light?",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2017-07-16 11:22:24",
        "message":"Hello,\ni am working on a 820-2915 that has no green light. It was water damaged an i fixed some corrosion already. Now, if i plug the charger in it shows a green light for a second but than it turns off again. Without unplugging the charger the light comes back on after a minute or so and than turns off again instantly. (actually one or two times i want to measure it it stays on and the cpu was getting warm) I measured around and saw that SMC_BC_ACOK is not there and also CHGR_DCIN (and so also CHGR_ACIN) is not there (causing The ISL6259 to stop working and SMC_BC_ACOK to be missing). I checked for a short to GND on CHGR_DCIN but there is no. CHGR_ACIN is something between 1,2V and 0,6V (slowls fading) until it peaks to 16V (when the green light appears for a second) and than fades away again. I already replaced U7000 twice (to be sure because the probepoint of CHGR_DCIN next to U7000 was corroded and not conducting anymore but the actual Pad (Pad 2) of U7000 and the rest of the line looks fine so far- i fixed that probepoint). I also had to run a wire under (to pin 3) Q7080 because there was another a no longer conducting Probepoint. Now my wire (at pin 3) is conducting connected to the metal case of Q7080 (i measured some voltages there and discovered this connecction) but as far as i understand: this in clearly not ideal and i´ll correct that if it works but for now it should not be the problem, as the case of Q7080 is only soldered to NC Pads on the board. I also followed CHGR_DCIN to F6905 and PPDCIN_G3H is also only 1,2V-0,6V. Now i don´t know hat to do. I tryed a different DCIN board already and i will try another tomorow to make sure it is fine.\nThanks for any help!"
    },
    {
        "post_id":23097,
        "thread_id":23076,
        "title":"820-2915 no green light?",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2017-07-17 03:50:59",
        "message":"I tryed a different DCIN board and still the same. But i just let it sit there plugged in and it seems as it will turn on every time if i just wait long enough. Than i can also see an apple (with no backlight - ill adress that when it works) on the screen and a normal picture on an external monitor. But it needs really long to turn the green light on. Can this be caused by the keyboard\/Trackpad connector?"
    },
    {
        "post_id":23101,
        "thread_id":23076,
        "title":"820-2915 no green light?",
        "user_id":36,
        "username":"aprendiz",
        "post_date":"2017-07-17 08:49:44",
        "message":"Check R7005, should be 20 ohm, check voltage on bothe pins should be about 16V..."
    },
    {
        "post_id":23105,
        "thread_id":23076,
        "title":"820-2915 no green light?",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2017-07-17 09:34:37",
        "message":"Both pins have 0,6V slowly going down when the light is off. Resistance is 23OHM. But after a minute or so it starts, chimes and the voltage is back up to 16V..."
    },
    {
        "post_id":23119,
        "thread_id":23076,
        "title":"820-2915 no green light?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-07-17 13:13:49",
        "message":"There should always be voltage on R7005. Measure voltage on pins of D7005"
    },
    {
        "post_id":23135,
        "thread_id":23076,
        "title":"820-2915 no green light?",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2017-07-18 02:04:59",
        "message":"I measured D7005 and it has 0,X V at all three pins slowly doing down. I followed PPDCIN_G3H back to F6905 anf there is also the same low voltage. But as it starts the voltage goes back up"
    },
    {
        "post_id":23138,
        "thread_id":23076,
        "title":"820-2915 no green light?",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2017-07-18 06:33:06",
        "message":"I noticed Q7080 getting  hot and replaced it. I also corrected my jumper so that it is no longer connected to the case of Q7080 (i measured all connections of Q7080 and they conduct only to where they should  (i also checked them the first time... maybe the Q7080 i took from a donor was slowly dying...)) and now it turns on every time. But Q7080 is still getting hot. On this machines the whole board is pretty hot so i guess that is normal for this model. I repaired the backlight and after that i noticed that it won´t boot up all the way. If i try to install an OS but it hangs after the apple disappears and it i want to boot from a drive with an OS installed.  It also stops with a white screen after the apple finished loading. I tryed differend HDDs and HDD cables but still the same. Even without the HDD cable connected it won´t get to the installation menu. Now i am stuck again"
    },
    {
        "post_id":23229,
        "thread_id":23076,
        "title":"820-2915 no green light?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-07-19 15:24:07",
        "message":"Q7080 is getting hot because it is not being told to turn on. Check the trace to the gate R7081 and trace to the ISL.\n\nIt probably hangs during boot because the GPU is also fucked."
    },
    {
        "post_id":23400,
        "thread_id":23076,
        "title":"820-2915 no green light?",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2017-07-24 10:18:13",
        "message":"I replaced R7081 and it seems to be cooler now. (but still nearly the whole board is warm\/hot. I´m pretty sure i replaced or at least measured R7081 before because the trace to the gate was burned. The trace to the ISL is fine and the trace under Q7080 (pin 3) is my jumper and should be fine as far as i can measure. Is there a way to start it using just the integrated Intel GPU for testing? Is this the model where C9560 fails often?"
    },
    {
        "post_id":23426,
        "thread_id":23076,
        "title":"820-2915 no green light?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-07-25 02:59:28",
        "message":"Why don't you just measure the gate voltage? Heat up GPU to see if it boots again. No C9560 is on 2010 boards, not on 2915."
    },
    {
        "post_id":23439,
        "thread_id":23076,
        "title":"820-2915 no green light?",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2017-07-25 04:34:11",
        "message":"Voltage to the Gate (PIN 1 of R7081) is 6,35V when turned on. Pin 1 of R7080 is 16V so i assume thats fine as Q7080 is a PMOS. I heated the GPU with my hot air until i couldnt touch it anymore but still the same. Should i heat it more? Also there is no visible issue on the picture. It just stays with a white screen after the apple finished loading"
    },
    {
        "post_id":23461,
        "thread_id":23076,
        "title":"820-2915 no green light?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-07-25 12:05:14",
        "message":"Hanging on a grey screen is 90% a GPU or VRAM issue. Heat up to 100C so a wet finger on the GPU sizzles. Also check for damaged components around GPU\/VRAM. Is the original edge bonding glue still present?"
    },
    {
        "post_id":23567,
        "thread_id":23076,
        "title":"820-2915 no green light?",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2017-07-28 02:30:35",
        "message":"No Title\n\nThe edge bonding is still there. The only corrosion around the GPU was around ISL6263. There was one trace burned - i run a wire there. I attached a picture too. Should i replace the chip as well to be sure its good? I could not get it so boot up but i´ll try heating it more slowly."
    },
    {
        "post_id":23594,
        "thread_id":23076,
        "title":"820-2915 no green light?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-07-28 16:25:48",
        "message":"So that means there was corrosion in GPU are. Could be corrosion under VRAM\/GPU or corroded trace\/resistor still in that area. It may be a good idea to replace that ISL and inspect all traces."
    },
    {
        "post_id":23618,
        "thread_id":23076,
        "title":"820-2915 no green light?",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2017-07-29 02:39:28",
        "message":"I replaced the ISL and the first time the fans won´t spin anymore. I replaced it again and now its back to the grey screen. After that i heated the GPU again very much and (unfortunately) it decided to work again. So you were right again. Failing GPU... Thank you for the help. I learned a lot anyways"
    },
    {
        "post_id":23634,
        "thread_id":23076,
        "title":"820-2915 no green light?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-07-30 05:00:45",
        "message":"In reality every 2914\/2915 board you will get that has not had the GPU replaced will need it. I cannot warranty these boards for any repair without putting a new GPU on it. So basically any liquid damaged 2914\/15 are a write off if you want to provide a warranty on it."
    },
    {
        "post_id":23646,
        "thread_id":23076,
        "title":"820-2915 no green light?",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2017-07-30 23:46:36",
        "message":"Ok, so better don´t touch these or tell the owner that there is no warramty... Thank you for the lesson. Are there actually any reliable good GPUs on the market or still only reballed crap?"
    },
    {
        "post_id":23670,
        "thread_id":23076,
        "title":"820-2915 no green light?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-08-01 04:50:36",
        "message":"GPUs are pretty much no where to be found. The ones you do find are 99% fake reballed garbage with 2016\/2017 date codes put on them."
    }
]