{"post_id":32030,"thread_id":32030,"title":"820-3330 Shuts off during Sleep\/Wake Tests","user_id":515,"username":"SMMRepair","post_date":"2018-02-25 19:42:32","message":"Got kind of a weird one. Board came in from customer stating it \"turns off after ~20 minutes\". Thinking it would be the dreaded PCH issue with these, I got to testing it, and noticed something odd. It cuts off during any of the sleep\/wake power tests in ASD. So...\n\n1. Board cut off during ASD, and when I checked where it cut off (recorded it), it cut off during the SD Card Reader sleep\/wake test.\n2. Re-ran ASD with SD Card Reader unchecked, and the board cuts off during the Product Test sleep\/wake test.\n3. Re-ran ASD with SD Card Reader and Products tests unchecked. Board then cuts off during the Thunderbolt sleep\/wake test, etc.\n4. SD slot and TBT both work fine.\n5. I ran Heaven on this board for 90 minutes and it did not stutter or cut off at all.\n6. Tested in another test case, same issue.\n7. Tested using multiple installs of ASD, to be sure. Same issue.\n8. EDIT: Just realized when I shut the lid, the unit starts to sleep, and after about 10 seconds (when it would normally hit deep sleep and pulse the light), the optical drive cycled and the unit restarted.\n9. SMC area looks fine, no damaged\/missing components. SMC original, not refurb or replaced (original factory corner-gel in place matches age of board), so I'll assume it's the original\/correct SMC.\n\nIs the SMC in charge of all sleep\/wake functions for the ASD tests above? I'm wondering if the SMC is on the way out, despite passing all other tests but those, but wanted to check in before replacing it. My second guess would be TPS-related. Thanks in advance for all the help, I really appreciate it."}
{"post_id":32037,"thread_id":32030,"title":"820-3330 Shuts off during Sleep\/Wake Tests","user_id":2,"username":"dukefawks","post_date":"2018-02-26 03:34:58","message":"Could be pretty much anything in the power sequencing, S5\/S3S0. Last thing I would suspect is the actual SMC. I'm more suspecting corrosion somewhere or some knocked off resistor. This is going to suck...."}
{"post_id":32202,"thread_id":32030,"title":"820-3330 Shuts off during Sleep\/Wake Tests","user_id":515,"username":"SMMRepair","post_date":"2018-03-02 18:44:50","message":"I wanted to come back to this one, as I got it resolved. You were right Duke; I got lucky as hell measuring resistors on the front of the board (started at U7000 and moved out a bit) just to be sure, and saw one move\/shift when I probed it. Sure enough, the solder had literally broken (cold-joint like) away from the pad, very cleanly, on only one side of the resistor (how in the world--drop?). I touched it up a bit and viola. I don't have schematic in front of me, but it was part of the S3 mem circuit, immediately to the right of the RAM slots. This wasn't damage like someone dropped a tool or clipped it with their nail; this was not visible at all, I only managed to see it when touching it with the probe point. Very odd, but better to be lucky than good sometimes I imagine.\n\nPasses ASD and manual sleep testing. Thanks, Duke!"}
