{"post_id":96549,"thread_id":63585,"title":"820-00281 A1707 Battery use -> no backlight...","user_id":28201,"username":"Mortentoft","post_date":"2023-02-09 16:11:38","message":"Hey guys. \nI have an 820-00281 A1707 15'' which teases me a lot. First of all; The logic board is in excellent condition. Absolutely clean and looks new. \nThe problem is that the machine works and runs perfectly normally when the battery is unplugged. When I have the original battery in it boots as it should, but quite quickly the backlight flashes and then goes out. It takes 20 v and charges the battery with 3.9-4.0 amp, but the backlight disappears. Without battery: normal power consumption\nI have tried three different batteries and it does the same thing.\nI think it might be U5000 (SMC problem) and will look at TCON_BKLT_PWM line tomorrow at the office. If anyone has an obvious solution, I'd like to hear it :-)\n\nThank you all and especially 2informaticos who allways gives good vibes and advices.\n\nGood night:-)"}
{"post_id":96552,"thread_id":63585,"title":"820-00281 A1707 Battery use -> no backlight...","user_id":682,"username":"2informaticos","post_date":"2023-02-09 16:39:45","message":"Same behavior with battery alone (no charger connected)?\n\nIf charger and battery both connected, backlight still stays off, if you disconnect J6951?\n\nCheck U5255 signals."}
{"post_id":96593,"thread_id":63585,"title":"820-00281 A1707 Battery use -> no backlight...","user_id":28201,"username":"Mortentoft","post_date":"2023-02-11 13:03:31","message":"Hi again. Finally Got the lb out (Damn lot of screws:-). U5255 is well… pp3v3_g3h is Stable and is 3.3 as it should. Had a tiny solderball from pin 6 (3gh). But nothing short… Could it be roastet?"}
{"post_id":96595,"thread_id":63585,"title":"820-00281 A1707 Battery use -> no backlight...","user_id":682,"username":"2informaticos","post_date":"2023-02-11 13:06:17","message":"I was expectingto get U5255 input and output voltages, when you don't get backlight.\nUse boardview to find easiest points for test."}
{"post_id":96596,"thread_id":63585,"title":"820-00281 A1707 Battery use -> no backlight...","user_id":28201,"username":"Mortentoft","post_date":"2023-02-11 13:34:25","message":"Sorry… misunderstood… i vil find it for you:-)"}
{"post_id":96601,"thread_id":63585,"title":"820-00281 A1707 Battery use -> no backlight...","user_id":28201,"username":"Mortentoft","post_date":"2023-02-12 08:51:57","message":"Hi again 2informaticos. I screwed up… I thought after unplugging all the connections between housing and LB it works with and without the battery. What is wrong with the topcase? I do not know but something interfear with the backlight. Take a look at the picture battery and screen alone works fine but when it comes into the topcase funny things happens. I will find a new topcase amd voila … should work. Sorry for all the “concerns”:) and Thank you again. All fine now🙌"}
{"post_id":96602,"thread_id":63585,"title":"820-00281 A1707 Battery use -> no backlight...","user_id":682,"username":"2informaticos","post_date":"2023-02-12 10:27:08","message":"When you have the board placed on the chassis, disconnect the cables, one by on.\nCheck which connection blocks the backlight."}
