[
    {
        "post_id":22840,
        "thread_id":22840,
        "title":"[SOLVED][820-3023] ~0.5s fan spin on loop - Keeps power cycling - CPUIMVP_TON keeps going low",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-07-11 16:30:02",
        "message":"[PLAIN][SOLVED][820-3023] ~0.5s fan spin on loop - Keeps power cycling - CPUIMVP_TON keeps going low[\/PLAIN]\n\nHey everyone\n\nGoing on a nice vacation in a few days, just want to finish this last laptop before I close off and enjoy a break\n\nLaptop has been touched by idiots before, but no signs of soldering or ultrasonic. But they managed to pull off the screw holder for the SSD (How even? You'd have to pull really hard). No short on the surrounding pads and the damage is right now mostly cosmetical.\n\nThe laptop has very localized water damage, nothing got dropped over it known but I suspect a few droplets got in with the fan. The corroded parts only affect thunderbolt which should not be needed for a POST. I removed the few corroded caps and resistors from the thunderbolt. Made sure there are no shorts. So its not the issue\n\nCPUIMVP_VR_ON turns HIGH for about 100ms before it pulled low again (Probably because the system resets?)\nCPUIMVP_TON stays 8V, but when the system powers on it turns to below 3V (Maybe even 0V, but my multimeter is slow) and then turns back to 8V when the fan starts to stop again. R7402 on pin 2 does not gets pulled down. Its the chip that does it. R7402 is within its 1% allowance\n\nPPVCORE_S0_CPU and PPVCORE_S0_AXG_R stays 0V on the multimeter. But maybe its just too fast for the multimeter to notice. There is no short to ground on these lines, although there is low resistance but thats normal\nPPDDR_S3_REG_R quickly turns to about 1.45V before it moves down to less then 0.1V, this keeps going up and down every time the CPU tries to boot. Indicating it goes back down to S4 or less\n\nAny idea's where to look? Thinking about replacing U7400 but I'm always told this chip never dies. Which makes me assume its somewhere else\nI don't remember having in any boards with this issue before haha\n\nThanks again! Let me know if you want me to measure anything"
    },
    {
        "post_id":22857,
        "thread_id":22840,
        "title":"[SOLVED][820-3023] ~0.5s fan spin on loop - Keeps power cycling - CPUIMVP_TON keeps going low",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-07-11 17:07:29",
        "message":"It's power cycling so it could be anything, the last thing would be U7400. The usual suspects apply U6100\/termination resistors\/traces\/clock chip. Also any knocked off component. Corrosion under SMC...."
    },
    {
        "post_id":22858,
        "thread_id":22840,
        "title":"[SOLVED][820-3023] ~0.5s fan spin on loop - Keeps power cycling - CPUIMVP_TON keeps going low",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-07-11 17:25:48",
        "message":"PP3V3_S5 is 2V, since it also powers U6100 makes it a obvious reason for it not working\n\nCan't believe I overlooked this, will report back"
    },
    {
        "post_id":22859,
        "thread_id":22840,
        "title":"[SOLVED][820-3023] ~0.5s fan spin on loop - Keeps power cycling - CPUIMVP_TON keeps going low",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-07-11 17:51:56",
        "message":"over 200kohm of resistance from C7811\/R7812's PP3V3_S5 (Where its still 3.3V) to C6100. Broken trace somewhere? Will pull wire and see if that solves it"
    },
    {
        "post_id":22860,
        "thread_id":22840,
        "title":"[SOLVED][820-3023] ~0.5s fan spin on loop - Keeps power cycling - CPUIMVP_TON keeps going low",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-07-11 17:58:53",
        "message":"And we have fan spin :)\n\nExplains why I didn't notice it on the initial diagnose, since it was alright on every spot except the bios\n\nEDIT: And it POSTS, solved! Thanks"
    }
]