[
    {
        "post_id":43738,
        "thread_id":43738,
        "title":"820-3435-b power up from charger cable but\/\/",
        "user_id":1308,
        "username":"lukazmac",
        "post_date":"2018-12-20 14:30:56",
        "message":"Hi. i have strange problem i dont know how to get round it.\n820-3435-b board. no water damage or things like that. \nwhen i plug charger cable its powering up also i can power in down using power button but when i press power button to power up with charger cable connected and full charged battery is not powering up at all.any idea? (i reballed smc just in case some balls would be corroded )"
    },
    {
        "post_id":43747,
        "thread_id":43738,
        "title":"820-3435-b power up from charger cable but\/\/",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2018-12-20 16:04:42",
        "message":"Are you saying it doesn’t run off of the battery? Or does it not recognize the battery in the OS?"
    },
    {
        "post_id":43754,
        "thread_id":43738,
        "title":"820-3435-b power up from charger cable but\/\/",
        "user_id":1308,
        "username":"lukazmac",
        "post_date":"2018-12-20 16:54:09",
        "message":"when i connect charger its powering up and when i disconnect charger is still running normaly. then i press power button and is powering of. when i want to power back on is not working"
    },
    {
        "post_id":43764,
        "thread_id":43738,
        "title":"820-3435-b power up from charger cable but\/\/",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2018-12-20 18:27:00",
        "message":"Hmm tried new trackpad\/trackpad flex\/keyboard?"
    },
    {
        "post_id":43774,
        "thread_id":43738,
        "title":"820-3435-b power up from charger cable but\/\/",
        "user_id":1308,
        "username":"lukazmac",
        "post_date":"2018-12-21 02:08:18",
        "message":"yes  keyboard and new trackpad changed. like i say. power button is working because i can power down machine. so its main board problem"
    },
    {
        "post_id":43783,
        "thread_id":43738,
        "title":"820-3435-b power up from charger cable but\/\/",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-12-21 02:56:20",
        "message":"Please don't use comments.\nWrite new post with your replies. We not always read previous posts, just look for new post with your test results.\nImagine what happens when your thread gets 2 pages and you comment in previous page!\n\nWith machine off, can you turn it on on SMC bypass mode?\nDoes PM_PWRBTN_L reacts when you try to start it?\nAlso run ASD EFI and see if any error appears."
    }
]