[
    {
        "post_id":18737,
        "thread_id":18737,
        "title":"HDD data recovery",
        "user_id":623,
        "username":"MaxFix",
        "post_date":"2017-04-20 04:40:15",
        "message":"Hi there,\n\nAfter watching Louis and Jason video about hdd data recovery using a donor drive I have decided to try it out myself on one of my test drives. However, it seems to be unsuccessful attempt.\nI get a nice spin but no read. The head moves on the disk half way after being connected to mac and then goes back into resting position.\n\n1. I had exactly same donor drive.\n2. Got right size plastic holder for the heads' hair not to touch each other.\n3. Used scotch tape (haha) not to mess up the alignment of the disks.\n4. Put everything perfectly back into place.\n\nDid I mess up something or do I need a nice software (PC-3000) to finish the job?\n\nThanks!"
    },
    {
        "post_id":18744,
        "thread_id":18737,
        "title":"HDD data recovery",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-04-20 06:01:58",
        "message":"Heads need adapting especially on larger size drives, so PC3000 needed. Or another 100 things could have gone wrong.\nYou don't swap heads before you check what is going on. Is it just corrupted firmware, one bad head, multiple, PCB?\nThis needs a systematic scientific approach, not a \"swap heads bro\" approach."
    },
    {
        "post_id":18769,
        "thread_id":18737,
        "title":"HDD data recovery",
        "user_id":623,
        "username":"MaxFix",
        "post_date":"2017-04-20 09:59:40",
        "message":"Hi Duke. I just did it as a test to know if it really works or not. I took out the disks from one drive and place them into identical drive. Just like Jason did in his video.\nI am not fortunate enough to have PC3000 at my disposal and it seems to cost quite a bit and there are several options. Do you know how much a good set would cost? Just thinking if this whole operation is really worth it?"
    },
    {
        "post_id":18771,
        "thread_id":18737,
        "title":"HDD data recovery",
        "user_id":316,
        "username":"G.Beard",
        "post_date":"2017-04-20 10:41:52",
        "message":"[QUOTE=\"MaxFix, post: 18769\"]Hi Duke. I just did it as a test to know if it really works or not. I took out the disks from one drive and place them into identical drive. Just like Jason did in his video.\nI am not fortunate enough to have PC3000 at my disposal and it seems to cost quite a bit and there are several options. Do you know how much a good set would cost? Just thinking if this whole operation is really worth it?[\/QUOTE]\n\nVNR and \"chip off\" recovery. No clean rooms needed. It's also a little more future proof than HDDs IMO."
    },
    {
        "post_id":18786,
        "thread_id":18737,
        "title":"HDD data recovery",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-04-20 12:23:31",
        "message":"Count on $10K in hardware needed to start. Jason swapped it on an ancient 40GB drive which is not as critical as a lets say 500GB. Also some luck is involved if the heads need adapting or not."
    },
    {
        "post_id":18842,
        "thread_id":18737,
        "title":"HDD data recovery",
        "user_id":623,
        "username":"MaxFix",
        "post_date":"2017-04-21 04:28:50",
        "message":"10K? but my wife wants a gold ring instead!\nAnyway, maybe just to get started with old school ide and sata drives recovery it needs less investment? If things start rolling then upgrade to SSD and VNR and what else not system. Clean room can be upgraded later. For now its a vacuum cleaner with big nozzle hanging on top of the drive ;)\nHow much does a basic PC-3000 bundle cost for sata and IDE drives?\n\nThanks."
    }
]