{"post_id":41084,"thread_id":41084,"title":"I know chicken soup aids in all recoveries but why feed it to your macbook!!","user_id":1879,"username":"RESQ-MYTECH","post_date":"2018-10-23 04:19:17","message":"Hey Hey!! Back again with another stooooopid question. A1398.... liquid ingress ( chicken soup). No power. Plug in charger. Green to Orange. Stays on orange. Not powering on. Did SMC reset, powers on... boots fully. everything working fine in respect of keyboard, wifi etc. However, battery indicator shows an X and as soon as the O\/S boots the charger goes green. says battery is low. stays powered on though until charger is disconnected. You can power down through the normal sequence with no issues. When powered down, the charger stays green. If the charger is disconnected with the unit powered off  and reconnected the LED goes green to orange and stays orange as though charging. Left for 30 mins powered off. Powered back on and as soon as O\/S boots it goes back to green and reports battery low, with an X. In system information it shows no battery info. In power settings says battery at 0%. Removed installed 256gb SSD and installed a new O\/S on a 128gb SSD with the same results.\n\nSo, question is, I suspect it requires a new battery as there is a little corrosion under the black cover on the battery itself. But before I obtain the battery, is there any tests\/ where I can check to see why the battery is not being detected or charging for any other reason.\n\nLogic board is clean. I can see no signs of corrosion on the board anywhere. Looks like in some respects the owner has been lucky, even down to the keyboard still working.\n\nI look forward to any assistance from you, the guru's of the apple repair world :)\n\nMarc"}
{"post_id":41086,"thread_id":41084,"title":"I know chicken soup aids in all recoveries but why feed it to your macbook!!","user_id":682,"username":"2informaticos","post_date":"2018-10-23 06:59:10","message":"Always better to test other known good battery in case like this.\nYou can waste lot of time vecause of bad battery only.\nFake chinese battery can also make you crazy, if didn't confirm it working in other machine; so be aware when you buy new chinese battery...\n\nHowever, you can check battery bus (SCL\/SDA lines) in respect with ground."}
{"post_id":41089,"thread_id":41084,"title":"I know chicken soup aids in all recoveries but why feed it to your macbook!!","user_id":1153,"username":"JohnB8812","post_date":"2018-10-23 07:50:41","message":"Easy way to check: disconnect battery and measure voltage on PPBUS_G3H. If 12.56, you have a totally dead battery. If 12.23, there is an issue on one or both of the SMBUS line which usually means corrosion near the SMC"}
{"post_id":41092,"thread_id":41084,"title":"I know chicken soup aids in all recoveries but why feed it to your macbook!!","user_id":1879,"username":"RESQ-MYTECH","post_date":"2018-10-23 08:10:15","message":"[USER=\"682\"]2informaticos[\/USER] I do not have another battery to hand. In respect of PC's, I do use Chinese imports as they are not so unruly with PC equipment, but always buy original for Apple products. Unfortunately, the cost of the battery here is £80-100 and I don't wish to buy one just yet without checking first. I will check the SCL\/SDA lines.\n\n[USER=\"1153\"]JohnB8812[\/USER] I will do the check now. I have checked around the SMC under a microscope and I can't believe how clean it is. In all honesty, if I did not know better, I would say it has gone somewhere else first and they cleaned it. But the whole inner case is clean.\n\nOnly other thing to add, which I have found out since I made the first post, I have been asked to do a clean install of the OSx. Now, as disclosed on a previous post I have a USB with multiple images on. I have tried all the images and getting the same error. It will not install as the unit is saying the charger is not connected, however I know it is because the unit is powered on without the battery connected.\n\nI will check the PPBUS_G3H lines and the SDA\/SCL now and report back."}
{"post_id":41096,"thread_id":41084,"title":"I know chicken soup aids in all recoveries but why feed it to your macbook!!","user_id":1879,"username":"RESQ-MYTECH","post_date":"2018-10-23 10:15:14","message":"OK, so\n[USER=\"682\"]2informaticos[\/USER] no short to ground tested on pins 5\/6 of the battery connector. Positive probe on the earth, negative on the pins.\n[USER=\"1153\"]JohnB8812[\/USER] I have 12.57v on PPBUS_G3H so as close as.\nMy deduction with both of your help.... battery.\nWould this also cause the no detection of the charger being connected when I tried to install the O\/S?\nThanks."}
{"post_id":41098,"thread_id":41084,"title":"I know chicken soup aids in all recoveries but why feed it to your macbook!!","user_id":1153,"username":"JohnB8812","post_date":"2018-10-23 10:56:44","message":"So you have a totally fucked battery just needs to be replaced. The OS install won't affect it the reason it isn't detected is that the battery circuit board (on the battery) is toast."}
{"post_id":41099,"thread_id":41084,"title":"I know chicken soup aids in all recoveries but why feed it to your macbook!!","user_id":1879,"username":"RESQ-MYTECH","post_date":"2018-10-23 11:09:34","message":"[USER=\"1153\"]JohnB8812[\/USER] Thank you sir. Just goes to show chicken does not cure all...LOL\nBattery ordered.\nThank you both for your help again. much appreciated."}
{"post_id":41100,"thread_id":41084,"title":"I know chicken soup aids in all recoveries but why feed it to your macbook!!","user_id":1153,"username":"JohnB8812","post_date":"2018-10-23 11:34:57","message":"You're welcome!"}
{"post_id":41102,"thread_id":41084,"title":"I know chicken soup aids in all recoveries but why feed it to your macbook!!","user_id":682,"username":"2informaticos","post_date":"2018-10-23 12:14:58","message":"\"no short to ground tested on pins 5\/6 of the battery connector.\"\nNobody asked about short...\nYou must get less than 1% difference between both lines!!!"}
{"post_id":41137,"thread_id":41084,"title":"I know chicken soup aids in all recoveries but why feed it to your macbook!!","user_id":1879,"username":"RESQ-MYTECH","post_date":"2018-10-24 02:25:08","message":"[USER=\"682\"]2informaticos[\/USER] Sorry I misunderstood. I have mentioned before I am new to the component level repair. I assumed that you meant check for short when you mentioned ground. The battery should be here later today, so going to connect it and see what happens. If I hit any issues, I will remove the logic board and re check the lines."}
{"post_id":41139,"thread_id":41084,"title":"I know chicken soup aids in all recoveries but why feed it to your macbook!!","user_id":682,"username":"2informaticos","post_date":"2018-10-24 05:20:52","message":"You don't need to remove the board.\nSCL\/SDA lines are available at battery connector..."}
{"post_id":41232,"thread_id":41084,"title":"I know chicken soup aids in all recoveries but why feed it to your macbook!!","user_id":1879,"username":"RESQ-MYTECH","post_date":"2018-10-26 03:41:48","message":"Hi, got to love great british delivery companies... 3 days for a next day delivery...LOL. Anyhoo, new battery in and all working fine. Thanks for the info [USER=\"682\"]2informaticos[\/USER] I checked the lines when I had the board out and even though it was in place, nothing was screwed down so it wouldn't have been a problem to pull it, but I know for next time. I have a lot of learning still to do, and as long as you guys are there I am sure I will be guided in the right directions. Thanks again."}
