[
    {
        "post_id":90881,
        "thread_id":62875,
        "title":"820-00923 shorting out CD3215 chip",
        "user_id":1166,
        "username":"Soji",
        "post_date":"2022-07-08 13:44:12",
        "message":"Board came in dead and was drawing 5V, discovered U3100 and UB400 were very hot, and there was corrosion on C7000, C7001 and CB214, and they were all replaced. The type-c ammeter was connected to the board and it draws 20V for about 5secs and the type-c ammeter went off, unplugged it and plugged it back, it draws only 5V again, and discovered U3100 was very hot again and there was a short on (PP3V3_UPC_XA_LDO), when the U3100 IC was removed the short disappeared, replaced it again, board draws 20V again, the computer was assembled and powered on, it worked pretty well for about 20mins, and it went off, unplugged the ammeter and plugging it back, we tested it with all ports it draws 5V again, and discovered U3100, U3200 and UB300 is getting hot again, 50 degrees C, according to the thermal camera used."
    },
    {
        "post_id":90884,
        "thread_id":62875,
        "title":"820-00923 shorting out CD3215 chip",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-07-08 14:44:18",
        "message":"Are you working with original Apple 87\/96W charger?\nCheck Q3100\/200 and QB300\/400 for internal short.\n\nOnce get the board working, check L3500 and LB700 voltages; remember to connect an USB device to enable them."
    },
    {
        "post_id":90897,
        "thread_id":62875,
        "title":"820-00923 shorting out CD3215 chip",
        "user_id":1166,
        "username":"Soji",
        "post_date":"2022-07-09 06:46:27",
        "message":"u3100,u3200 and UB300 were shorted on (PP3V3_UPC__LDO) , i removed them, short gone, i now checked  Q3100\/200 and QB300\/400 for internal short , no internal short. installed another set of cd3215, i got 20v on typec ammeter. the pc is charging and its working , so \ni got 5v on L3500,5v on LB700 respectively after inserting  a usb flash drive, but one out of the 4 ports is not working both sides"
    },
    {
        "post_id":90898,
        "thread_id":62875,
        "title":"820-00923 shorting out CD3215 chip",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-07-09 07:55:10",
        "message":"Which port doesn't work properly?\nCheck and compare diode mode on its CC1\/2 lines.\nAlso remove USB-C connector from the case and check its contacts."
    },
    {
        "post_id":90900,
        "thread_id":62875,
        "title":"820-00923 shorting out CD3215 chip",
        "user_id":1166,
        "username":"Soji",
        "post_date":"2022-07-09 09:33:51",
        "message":"the first port by the right  when screen laptop facing me or rather next port after the audio jack port.\nthere is a short on USBC_TA_CC2"
    },
    {
        "post_id":90901,
        "thread_id":62875,
        "title":"820-00923 shorting out CD3215 chip",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-07-09 09:50:29",
        "message":"Possibly suspects are CB314, DZB501 and UB300."
    },
    {
        "post_id":90903,
        "thread_id":62875,
        "title":"820-00923 shorting out CD3215 chip",
        "user_id":1166,
        "username":"Soji",
        "post_date":"2022-07-09 09:56:45",
        "message":"i replaced UB300..short gone USBC_TA_CC2,all the ports are working perfectly well, shortly after that \n u3200 got shorted again on  PP3V3_UPC_XB_LDO"
    }
]