{"post_id":42920,"thread_id":42920,"title":"MBP 13\" 820-3115 i7 2.9Ghz - runs off battery and PSU but 'battery not charging'","user_id":2106,"username":"jommoner","post_date":"2018-12-05 00:09:53","message":"So, I have a Macbook Pro mid-2012 13\" i7 2.9GHz. I have downloaded the schematic and the boardview file. I bought this secondhand over a year ago; it is a nice little machine, it has a major dent next to the magsafe connector, and the bottom aluminium panel doesn't fit, because, near the corner where the IR sensor is (near the arrow keys), the 'unibody' was bent inwards. I straightened that up with a pair of pliers used for car repair.\nIt has been fine, but I got it out from a short rest (3 months?) today, and it says 'battery not charging' 'power source : power adapter'. It runs from battery, runs from power supply, but will not charge.\nI have a number of other unibody MBPs, which I can use to recharge the battery to prevent total failure (e.g. if the battery gets too low), so this isn't too urgent. However, there is 'something wrong' with the charging system.\nI have tried two chargers - both don't work, but they do on other MBPs. The magsafe connector has no light (green, orange, or otherwise) at any time. SMC reset makes no difference. Most concerningly, U7000 has a dab of white paint on it, and it appears that this area has had 'some work done' at some stage.\nI am using this system to type this with no issues (battery at 52%, not charging, on power supply). I will be mindful to not drain the battery, and have backup 15 and 17 MBPs to charge the battery if needed manually.\nI have a known-good 13\" charge port (ordered when this laptop didn't seem to charge but then worked fine so I never fitted it...)\nAm happy for advice \/ questions as to initial tests. I have SMD rework station (fair quality), will order microscope from this website soon, and can get reasonable motherboard photos in the interim!\nI have done the 2009 MBP 17\" repair on a dead MBP - (tantalum capacitor) - it worked fine, and it is a nice computer. The cap is on a set of trailing leads - but still works fine - so can do basic soldering at least!\nThank you!"}
{"post_id":42921,"thread_id":42920,"title":"MBP 13\" 820-3115 i7 2.9Ghz - runs off battery and PSU but 'battery not charging'","user_id":682,"username":"2informaticos","post_date":"2018-12-05 02:24:55","message":"You need to measure some signals on the MLB.\nFirst check SMC_BC_ACOK; get it from pins 1\/2 of U6901, near SMC.\nNext look for corrosion on its area and U6900 too.\nTest continuity for ADAPTER_SENSE, from pin1\/U6900 to charger board.\nCharger board has one TVS diode and few small resistors to test also.\nPost diode mode value (red probe to grounde) on SCL\/SDA lines of J6950; no battery, nor charged connected."}
{"post_id":42930,"thread_id":42920,"title":"MBP 13\" 820-3115 i7 2.9Ghz - runs off battery and PSU but 'battery not charging'","user_id":1153,"username":"JohnB8812","post_date":"2018-12-05 09:36:08","message":"Resistance between pins 17\/18 and 27\/28 of the ISL6259?"}
{"post_id":44150,"thread_id":42920,"title":"MBP 13\" 820-3115 i7 2.9Ghz - runs off battery and PSU but 'battery not charging'","user_id":2106,"username":"jommoner","post_date":"2018-12-29 23:49:03","message":"Hi! Sorry for not getting round to this; I removed the board yesterday to check the voltages, connected the charger, and it gave a flashing green light (solid green with super brief orange flashes). Connecting the battery resulted in a green light that went orange. I replaced the DC-in board for good measure, but it works again - not sure for how long but will come back to this thread if it fails again!"}
{"post_id":44151,"thread_id":42920,"title":"MBP 13\" 820-3115 i7 2.9Ghz - runs off battery and PSU but 'battery not charging'","user_id":682,"username":"2informaticos","post_date":"2018-12-30 04:42:24","message":"If MagSafe board was the culprit, this can be sign of fake charger.\nSo, advise the client to get an original 60W charger...."}
