[
    {
        "post_id":91511,
        "thread_id":62950,
        "title":"820-00928, seems like brain dead",
        "user_id":29424,
        "username":"donnos",
        "post_date":"2022-07-29 08:30:24",
        "message":"Hello, got a 00928 come in as water damaged but upon checking, liquid never hit the board. most on the LCD connector. nothing seems burned. diode reading on backlight output and MUX data pins are good.\n\nright now macbook does not boot fully, no backlight or image either, using an external display i get the same black screen.\nHOWEVER, I'm able to get to the startup manager by holding the option key, after selecting the drive i get no activity after this. This is on external display, nothing on recovery and nothing on diagnostic.\n\non the LCD i get nothing(known good LCD), i'm not getting EDP_BKLT_EN for backlight enable, i do have 5v and 3v3 going into the tcon.\ni'm not sure if the no boot symptom is causing no display.\n\nupdate** SMC bypass mode gives me low battery sign"
    },
    {
        "post_id":91515,
        "thread_id":62950,
        "title":"820-00928, seems like brain dead",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-07-29 11:20:53",
        "message":"Any liquid spill on LCD assembly affects MLB also; through J8500.\n\nNo reason to search for backlight, if you don't get image first on its LCD.\nLow battery sign appeared on external monitor only?\nTest the machine with known good battery."
    },
    {
        "post_id":91554,
        "thread_id":62950,
        "title":"820-00928, seems like brain dead",
        "user_id":29424,
        "username":"donnos",
        "post_date":"2022-08-01 01:51:18",
        "message":"low battery sign appearing on known good LCD, my guess is the orignal LCD is dead. but that does not explain why it does not boot\nwill try a battery first, but i thought the a1707 did not need a battery to boot and with battery i can't do smc bypass?"
    },
    {
        "post_id":91719,
        "thread_id":62950,
        "title":"820-00928, seems like brain dead",
        "user_id":29424,
        "username":"donnos",
        "post_date":"2022-08-07 09:06:16",
        "message":"ok further updates,\nWhen nothing is connected to board only screen, SMC bypass shows  which showing low battery sign.\nbut when kb and tp is connected during smc bypass, i get high fan spin, and nothing after that.\nno different with another battery, mac is not booting.\nany ideas?"
    },
    {
        "post_id":91724,
        "thread_id":62950,
        "title":"820-00928, seems like brain dead",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-08-07 10:42:15",
        "message":"Test the board with external monitor; disconnect internal LCD.\nUsing charged battery, still get low battery sign?\n\nKB\/TP may be affected by liquid spill..."
    }
]