{"post_id":27592,"thread_id":27592,"title":"2012 MacBook Pro water damage","user_id":1174,"username":"Tingram","post_date":"2017-11-01 14:52:56","message":"I'm really hoping someone can help. Recap: small water spill. After upside down drying booted up fine but no wifi. Fine, bought wifi dongle and all good. Then couple weeks later, battery died. Replaced battery and all good. Then battery not recognized, an X thru battery icon and then computer only powers up with power button help down for several seconds then while power button pushed, plug in charger. Fan very loud. Brought it to Apple Store - told new logic board. Brought it too computer repair store, they never even booted it up and they said new logic board and MagSafe replacement. Computer wouldn't even power up using previously stated method. Took out logic board and cleaned well. After reinstall of logic board, computer powers up as previously described. Charging cord remains green, X through battery icon and no wifi except with dongle. Tried SMC and PRAM reset with no luck. Any help please? Possibly new MagSafe dc board or logo board."}
{"post_id":27593,"thread_id":27592,"title":"2012 MacBook Pro water damage","user_id":289,"username":"smiba","post_date":"2017-11-01 16:33:49","message":"Probably trouble with the ISL circuit or SMC.\n\nBefore I start do you have the right equipment and are you technically educated on doing these repairs yourself? (Soldering parts on the motherboard)\n\nAny ugly locations on the motherboard? 13\" or 15\" macbook (Preferably tell us the 820-XXXX number on the motherboard)"}
{"post_id":27595,"thread_id":27592,"title":"2012 MacBook Pro water damage","user_id":1174,"username":"Tingram","post_date":"2017-11-01 16:48:21","message":"Thanks for the reply.\ni may have signed up for a forum that is too advanced for me.  Best I can do is watch you tube videos and replace logic board or MagSafe dc board.\nTo me , motherboard looks clean."}
{"post_id":27645,"thread_id":27592,"title":"2012 MacBook Pro water damage","user_id":2,"username":"dukefawks","post_date":"2017-11-02 20:57:39","message":"Maybe you can get lucky by disconnecting the battery indicator. If that does not help it is most likely the SMC or ISL6259. Just to confirm you are using a 60W charger (13\") or 85W (15\"). a 15\" machine will not power on from a 60W or one of those fake Chinese 85W ones.\nThis could be as simple as another bad battery and a wrong charger."}
