[
    {
        "post_id":12722,
        "thread_id":12722,
        "title":"[SOLVED]820-2936 Quarter Fan Spin",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-01-11 08:17:37",
        "message":"820-2936 had liquid all centered around Q7030, Q7035, C7035, U5420 and U5421. No liquid to SMC area or clock area. No liquid to U7000 directly. Fan spins for half a second, turns off, ad infinitum. \n\n- ppbus_g3h is 14.24v\n- pp3v42_g3h is 3.45v\n- resistance between pins 17\/18 is 4.13Mohm (which is of course way too high)\n- resistance between pins 27\/28 is 19.5ohm\n- pin 3 of U7000 is 3.96v\n- board runs with battery connected (and with battery\/charger connected)\n\nR7051\/52 measure properly, but I replaced them to be safe. No change. R7050 measures properly. Replaced U7000 and Q7030\/Q7035, no change. What could be causing the resistance of pins 17\/18 to be so high? Could it be Q7055? Would the board still power on and run fine with battery if Q7055 were at fault?\n\nThanks in advance!"
    },
    {
        "post_id":12723,
        "thread_id":12722,
        "title":"[SOLVED]820-2936 Quarter Fan Spin",
        "user_id":36,
        "username":"aprendiz",
        "post_date":"2017-01-11 08:24:38",
        "message":"Check traces from ISL to R7051\/52 and from those resistors to R7050..."
    },
    {
        "post_id":12725,
        "thread_id":12722,
        "title":"[SOLVED]820-2936 Quarter Fan Spin",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-01-11 08:32:58",
        "message":"Thanks Aprendiz; I can't believe I didn't check that. I checked continuity from ISL through the resistors, but didn't from 7051\/52 to 7050. Will run those wires and check back--thanks."
    },
    {
        "post_id":12726,
        "thread_id":12722,
        "title":"[SOLVED]820-2936 Quarter Fan Spin",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-01-11 08:43:16",
        "message":"You got it, thanks Aprendiz. I didn't think the traces would be burned internally, so didn't really think to check continuity that far down. I guess it makes sense since U5420\/21 were partially burned up. Thanks, Aprendiz! You guys can close this one up."
    }
]