{"post_id":30471,"thread_id":30471,"title":"[SOLVED]macbook air 1466 strange power on behaviour","user_id":1309,"username":"Inwerp","post_date":"2018-01-16 16:03:30","message":"Hello everyone, hello Louis\ni started to work in a local repair shop and i'm trying to learn [SUB]rocket science[\/SUB] board repair\n\n2012 Macbook air a1466\nfirst condition:\nliquid damage (coffee)\ndoes not power on, orange light goes to green when the power button is pressed.\nthere is no actual liquid damage on the logic board, small spot on the touchpad board, few marks on the power board and absolutely zero sign of corrosion.\n\nsecond condition:\nafter unplugging the battery laptop works normally as if it was just repaired and Louis is happy: charger without the battery turns it on, the fan is spinning(also goes straight to boot and chimes)\nafter plugging battery back, turns only if the charger is also connected. once started, boots normally, battery charges, etc.(* the only \"strange\" thing is that i gave a short fan blast, then 2 seconds and then it goes on, but i'm not sure if it is normal or not).\n\n- if I use software shutdown from the booted OsX, goes back to the first dead condition with an orange->green light switching on power button but no fan and no fun.\n- if I hard shutdown from the second condition OR shutdown from the login screen, it goes back to the second condition: power on only with charger.\nSMC\/NVRAM reset makes no difference, there's no actual liquid damage on the board.\n\ncould someone throw some hints? I do not have much experience, and i guess it will take some time for me to check all corresponding rails but i will try to do it first thing tomorrow morning.\ni'm wild-guessing that it's missing some kind of a signal which tells SMC that battery is present\/charged, but board schematics looks a little bit hard for me at my stage so i'm asking for a little guidance here."}
{"post_id":30478,"thread_id":30471,"title":"[SOLVED]macbook air 1466 strange power on behaviour","user_id":2,"username":"dukefawks","post_date":"2018-01-16 17:09:36","message":"The light turns green because the SMC reset is triggered. This is usually a corroded trackpad cable of corrosion in the connector at either end, or just a bad trackpad."}
{"post_id":30544,"thread_id":30471,"title":"[SOLVED]macbook air 1466 strange power on behaviour","user_id":1309,"username":"Inwerp","post_date":"2018-01-17 13:14:48","message":"Thanks a lot. Here we are, 2k$ laptop, half-dead by one drop of liquid through the trackpad. Ordered a new trackpad, will update this thread later. I have checked SMC_LSOC_RST_L and it is indeed zero volts. \n\nAlso, I've found a similar question on the other forum but it looks like that guy was not lucky as I, but anyway worth adding to the discussion:"}
{"post_id":30551,"thread_id":30471,"title":"[SOLVED]macbook air 1466 strange power on behaviour","user_id":2,"username":"dukefawks","post_date":"2018-01-17 14:41:34","message":"I assume you confirmed the liquid damage on the trackpad? Once you install the new trackpad make sure to check if the function keys are working properly. There are 2 different keyboard matrixes and it is possible the trackpad is configured for the wrong type."}
{"post_id":30869,"thread_id":30471,"title":"[SOLVED]macbook air 1466 strange power on behaviour","user_id":1309,"username":"Inwerp","post_date":"2018-01-31 01:24:10","message":"Thank you! After checking SMC_RESET voltage i found that it goes low because of the touchpad. New touchpad fixed the issue like a charm. \n It was confirmed liquid damage (literally, one drop of coffee). function keys work properly, but this is so typical for Apple with two types of trackpad\/kbd controller for the same exact model :)\n\n\nalso, for anyone who reads this for education:\nIn this video, Louis talks about power button circuit and also shows how to test it with a multimeter\n[url]https:\/\/www.youtube.com\/watch?v=eg69WwtEdZQ&t=910s[\/url]"}
