{"post_id":96762,"thread_id":63613,"title":"820-01987 Power Aliases","user_id":32178,"username":"prodigy83","post_date":"2023-02-17 10:22:28","message":"I am having a difficult time troubleshooting these newer boards. The older boards had the Power Aliases page in the schematics, but these newer boards don't have this. I have been looking at the Power FET's to troubleshoot. Can someone clue me in on what is the best way to look for these Power Aliases?"}
{"post_id":96766,"thread_id":63613,"title":"820-01987 Power Aliases","user_id":682,"username":"2informaticos","post_date":"2023-02-17 10:35:55","message":"I never used such page.\nCan you give a power rail name that you can't locate where does come from?"}
{"post_id":96767,"thread_id":63613,"title":"820-01987 Power Aliases","user_id":32178,"username":"prodigy83","post_date":"2023-02-17 10:43:06","message":"Well I am not neccessarily looking for just one power rail. I just would like to know where I could go on the table of contents to start the troubleshooting process of making sure that the board has power in all the right places. I am already aware of the CD3215\/17 wiki, but after that, where do I go. Right now I am working on this board that had liquid damage. It was at 5v at first, but I reflowed both CD3217 chips (used ultrasonic cleaner too) and now the board is at 20v, but I see it pull .45 amps starting out, but goes back down to .03 amps but stays at the 20v. I run in to this often and it was easier for me to troubleshoot the older boards with the Power Aliases page from the table of contents."}
{"post_id":96772,"thread_id":63613,"title":"820-01987 Power Aliases","user_id":682,"username":"2informaticos","post_date":"2023-02-17 13:35:27","message":"Did you try DFU revive\/restore?"}
{"post_id":96777,"thread_id":63613,"title":"820-01987 Power Aliases","user_id":32178,"username":"prodigy83","post_date":"2023-02-17 15:03:46","message":"No I did not even think of that, thank you. Gotta grab the laptop from home. Could you answer my above question from today @ 11:43 AM? Or tell me where I can go to find this out?"}
{"post_id":96780,"thread_id":63613,"title":"820-01987 Power Aliases","user_id":682,"username":"2informaticos","post_date":"2023-02-17 15:30:07","message":"You have any secondary power supply in schematic and boardview.\nCan check one by one, if needed.\nPower On Sequence (POR) available for 01598 and 01055 T2 boards."}
