[
    {
        "post_id":20513,
        "thread_id":20513,
        "title":"820-3332 no video",
        "user_id":859,
        "username":"TheoGa",
        "post_date":"2017-05-18 13:13:25",
        "message":"Hello guys,\n\ni just got a 820-3332 15 inch retina MBP with no video. The Macbook suddenly went black while editing video. \nWhen you turn on the Mac you hear the chime but the screen stays black.\nCan somebody give me a hint whats the problem in most cases at this model?\n\nAlso I have kind of a very very stupid problem, I try to figure out what caused the problem but I got stuck at the beginning.\nI removed the logic board to check it and now the problem is that it won't turn on! It is the first time I work on a 15 inch retina MBP, is there a thing to do in a other way than on a 13 inch model. Why does the logic board does not have a fan spin when I attach power through the Magsafe connector and with an attached SSD to the board? \nI attached a image of my test setup!\n\nThanks a lot guys!"
    },
    {
        "post_id":20523,
        "thread_id":20513,
        "title":"820-3332 no video",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-05-18 14:51:26",
        "message":"Only power on from a REAL 85W charger! U8900 is your issue, read sticky on this. Also Louis has videos on this."
    },
    {
        "post_id":20539,
        "thread_id":20513,
        "title":"820-3332 no video",
        "user_id":859,
        "username":"TheoGa",
        "post_date":"2017-05-18 23:06:02",
        "message":"Yes, I use a 85W charger, thats the creepy thing. I don´t understand why its not working. Because this setup works with all 13 inch models. Is there something I have to turn on separately?\n\nOk great, thank you very much!!! I will look it up as soon as possible!"
    },
    {
        "post_id":20579,
        "thread_id":20513,
        "title":"820-3332 no video",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-05-19 22:29:52",
        "message":"You are using a chinese 85w i bet. Connect to working machine and check adapter wattage in power tab."
    },
    {
        "post_id":20585,
        "thread_id":20513,
        "title":"820-3332 no video",
        "user_id":859,
        "username":"TheoGa",
        "post_date":"2017-05-19 23:34:15",
        "message":"No Title\n\nNo its the real 85W one I got with my 15 Inch 2013 Retina MBP (bought from apple.com) a long Time ago and it worked with all other boards I repaired. But why the hell is the charger showing 60W when plugged in a Macbook Air??? Its the original one!"
    },
    {
        "post_id":20644,
        "thread_id":20513,
        "title":"820-3332 no video",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-05-22 11:25:24",
        "message":"I dunno man, Apple would not have shipped you a 60W. It was swapped at some point. Go get a 85W one."
    }
]