[
    {
        "post_id":89567,
        "thread_id":62724,
        "title":"820-2828 not turning on time to time (iMac 27\" A1312 2011)",
        "user_id":1427,
        "username":"Narek",
        "post_date":"2022-05-26 08:07:18",
        "message":"It's already third time this computer returns to me with the same issue. It's iMac 27\" A1312 with 820-2828 motherboard. Customer uses it for video editing. When he leaves his summer house where this computer is located, after few days computer won't power on. He has to disconnect power cord few times to make iMac turn on. When turned on it works fine. So when he brought it to me for the first time I have replaced power supply and it was working fine. After 2 weeks he brought it back for the same problem. I have replaced power supply again along with display power supply and video card (NVIDIA) and RTC battery. It was working fine for few months, but now came back again with the same issue.. When I connect power cord first diagnostic led lights up. After pressing power button led goes off and nothing happens. After many times of reconnecting power cord iMac will trun on and work fine, but after shutdown it sometimes won't turn on. I have already repalced RTC battery again, reflowed SMC, replaced RAM and HDD (I put SSD), tried another power cord. Sadly no changes..."
    },
    {
        "post_id":89569,
        "thread_id":62724,
        "title":"820-2828 not turning on time to time (iMac 27\" A1312 2011)",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-05-26 08:18:25",
        "message":"If S5 LED goes off, after pressing power button, change Q8110.\nIf still the same issue, change U7700 too."
    },
    {
        "post_id":89700,
        "thread_id":62724,
        "title":"820-2828 not turning on time to time (iMac 27\" A1312 2011)",
        "user_id":1427,
        "username":"Narek",
        "post_date":"2022-05-31 02:36:12",
        "message":"[USER=682]@2informaticos[\/USER], I have replaced Q8110 and it seems problem is solved, I'll be testing this iMac for few days to be sure. Another question: is there any replacement mosfet which I can use there instead Q8110? I'm trying to find something on my supplier website, but I can't find anything matching. For now I took it from donor board."
    },
    {
        "post_id":89701,
        "thread_id":62724,
        "title":"820-2828 not turning on time to time (iMac 27\" A1312 2011)",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-05-31 03:16:22",
        "message":"Is a P-channel MOSFET, 30V\/21A, with a classic 6x5mm package.\nSi4459, Si7137\/49 will work there.\nOr get the original from Aliexpress..."
    },
    {
        "post_id":89709,
        "thread_id":62724,
        "title":"820-2828 not turning on time to time (iMac 27\" A1312 2011)",
        "user_id":1427,
        "username":"Narek",
        "post_date":"2022-05-31 07:03:05",
        "message":"Ok, Thank you!"
    }
]