{"post_id":100848,"thread_id":64099,"title":"820-00923 20V 0A","user_id":26621,"username":"grmacs","post_date":"2023-08-04 10:17:23","message":"Hi there, this board occassionallyy will briefly take some amperage and drop just below 20V like its going to boot but 95% of the time it just sits at 0A and 20V. PPBUS is at 13V. \n\nAll S5 rails are missing when in the 20V 0A state. I have detected voltage on CPU rails on occasions when it is drawing amps. \n\nChecked with infrared and not seeing anything get hot at any time.\n\nI checked the SMBUS SMC SCL\/SDA lines related to the battery and those are good. SMC ONOFF is 3v3 and PM_BatLow is not shorted. I'm uncertain as to the power up sequence for these boards. I feel like this is something simple."}
{"post_id":100857,"thread_id":64099,"title":"820-00923 20V 0A","user_id":682,"username":"2informaticos","post_date":"2023-08-04 19:17:19","message":"Did you test with original 85W charger?"}
{"post_id":100862,"thread_id":64099,"title":"820-00923 20V 0A","user_id":26621,"username":"grmacs","post_date":"2023-08-05 03:51:09","message":"Yes. 87w"}
{"post_id":100863,"thread_id":64099,"title":"820-00923 20V 0A","user_id":682,"username":"2informaticos","post_date":"2023-08-05 04:27:43","message":"Do you get 3V3_S5\/SUS?\n\nCheck if turns on in SMC bypass mode."}
{"post_id":100890,"thread_id":64099,"title":"820-00923 20V 0A","user_id":26621,"username":"grmacs","post_date":"2023-08-07 10:14:27","message":"It was booting then suddenly I have dead short on PP3v3_G3H I have zero idea. I put some heat to SMC prior and it was up at 20V 0A and I unplugged and plugged back in and suddenly 5V 0A. I tried BPS to drive voltage through that rail and only thing getting hot is the wire and the point of attachement of my power supply where it's jumpered on board. If I jumper different spot it gets hot there instead. I pulled both CD3215's on the side where I was connected to charger when it stopped working and PP3v3_G3H is still shorted. \n\nIn summary I don't understand wtf happened, I don't understand why I'm not seeing whatever is shorted getting hot on the IR and I dont have a clue as to where to look next. haha\n\nI may just call this a no fix rather as I've managed to somehow spend way too much time on this one already"}
{"post_id":100891,"thread_id":64099,"title":"820-00923 20V 0A","user_id":682,"username":"2informaticos","post_date":"2023-08-07 10:21:01","message":"So PPBUS_G3H is shorted now to ground?\nWhat is the exact ohm value?\nCompare with all big coils; don't forget L9400.\n\nWhy touched CD3215 chips, if none is connected to PPBUS_G3H???"}
{"post_id":100898,"thread_id":64099,"title":"820-00923 20V 0A","user_id":26621,"username":"grmacs","post_date":"2023-08-07 17:46:01","message":"No, pp3v3_g3h is shorted directly to ground"}
{"post_id":100901,"thread_id":64099,"title":"820-00923 20V 0A","user_id":682,"username":"2informaticos","post_date":"2023-08-08 02:58:03","message":"If is pure short (close to 0 ohm) shouldn't be a problem to find the culprit, with voltage injection.\nWhat is the exact value, in ohm scale?"}
