[
    {
        "post_id":15522,
        "thread_id":15522,
        "title":"Macbook pro 820 2915",
        "user_id":77,
        "username":"leonattpcs",
        "post_date":"2017-02-25 04:06:35",
        "message":"Brought in not switching on, when connecting power it gave green then red light.\nOpened it up and the battery in it which is original is swollen at one end which is facing the corner of the computer, tried a none swollen battery and no change.\nI am then told by the owner that if the screen is tilted back and the computer is sort of bent up slightly it will switch on...\nI am thinking stress caused by the battery has maybe caused the issue.\nGetting board out then connecting battery and power, power is getting into the computer, have measured the voltage from the charger, now just green light on charger connector does not go red, fans start spinning then stop, then start spinning and keep spinning. Board is generating heat as you would expect it.\nI am going to be measuring voltages next, but it this issue do you think caused by the battery swelling and I should be looking for cracked solder joint or just start with looking for voltages and take it from there?\nThanks"
    },
    {
        "post_id":15523,
        "thread_id":15522,
        "title":"Macbook pro 820 2915",
        "user_id":77,
        "username":"leonattpcs",
        "post_date":"2017-02-25 04:29:32",
        "message":"More testing...\nPut the board in the computer again, but did not connect anything, but screen and battery and when connecting just power:\nFans starts to spin then stop, start again and keep spinning then usual grey screen loads then goes off, fans keep spinning then screen comes back on then goes off and keeps repeating this cycle whether power is connected or not as long as the battery is connected."
    },
    {
        "post_id":15524,
        "thread_id":15522,
        "title":"Macbook pro 820 2915",
        "user_id":77,
        "username":"leonattpcs",
        "post_date":"2017-02-25 04:32:52",
        "message":"Forgot to mention, the extra testing I did was with keyboard connected\nWithout keyboard connected the screen stays on and folder icon with question mark on flashes on screen\nI am guessing this is due to the hard drive not being connected.\nSo this looks like either a mouse or keyboard issue?"
    },
    {
        "post_id":15525,
        "thread_id":15522,
        "title":"Macbook pro 820 2915",
        "user_id":77,
        "username":"leonattpcs",
        "post_date":"2017-02-25 04:45:12",
        "message":"Mouse pad connected again, everything else as well apart from keyboard and switches on ok. Are keyboards built into the housing on this model?"
    },
    {
        "post_id":15536,
        "thread_id":15522,
        "title":"Macbook pro 820 2915",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-02-25 05:53:36",
        "message":"keyboards are screwed. I do not trust this board, be aware this could be a time waster. Also GPU will be dead in a few months and you will get blamed. Proceed on own risk....."
    },
    {
        "post_id":15553,
        "thread_id":15522,
        "title":"Macbook pro 820 2915",
        "user_id":77,
        "username":"leonattpcs",
        "post_date":"2017-02-25 16:29:03",
        "message":"No problem thanks for the tip. I am always aware that someone will blame me for everything in the world at the drop of a hat."
    }
]