{"post_id":23741,"thread_id":23741,"title":"820-2915-A no display & no ext display","user_id":1006,"username":"logictom","post_date":"2017-08-03 03:54:16","message":"I am trying to fix my significant others Macbook Pro Early 2011, water was split on the keyboard and fun ensued!\n\nThe display doesn't turn on, checked with torch, doesn't work on external display. Otherwise it seems to be working ok, boots up, hitting the esc key gets the bonk noise, can shut it down using the keyboard shortcut from built in or USB keyboard.\n\nLooks to be some water marks around U8900, checked PGOOD and this is 0V, so checked the following:\nVIN 10.95V\nPGOOD 0V\nVID0 3.3V\nVID1 3.3V\nVID2 3.3V\nVID3 0V\nVID4 0V\nVSUM 113mV\nVO 0V\n\nMeasured without display or ext display connected. Can anyone confirm if VID3\/4 should also be 3V3?\nAs this is coming from the GPU I assume if these should be 3V3 then it's the GPU that's hosed?\nI'm going to replace the ISL6263 but thought I would ask whilst waiting for them to be delivered or if there is anything else I should check?"}
{"post_id":23772,"thread_id":23741,"title":"820-2915-A no display & no ext display","user_id":2,"username":"dukefawks","post_date":"2017-08-03 15:57:25","message":"GPUVCORE_EN present? If yes then the ISL6263 could be dead but more suspect a bad trace. Check traces and resistors to pins 14\/16\/22.\nBut really if this thing has not had a replacement board from Apple the GPU will be dead soon anyway. Just a warning that this thing WILL die from the GPU issue soon anyway."}
{"post_id":23797,"thread_id":23741,"title":"820-2915-A no display & no ext display","user_id":1006,"username":"logictom","post_date":"2017-08-03 17:58:12","message":"Sorry should have mentioned the board was replaced by Apple, was around18-24 months ago.\nGPUVCORE_EN is 3.3V\nR8911 and trace to pin 22 check out. Will need to check 14\/16 later, left my pointly probes at work, can't get in with the ones I have to hand.\nWill update once I've checkout out those other 2 pins."}
{"post_id":23799,"thread_id":23741,"title":"820-2915-A no display & no ext display","user_id":1006,"username":"logictom","post_date":"2017-08-03 18:36:40","message":"Are there any other likely suspects? I may aswell order any other parts while I'm at it to make the shipping worthwhile\/bump up the order to free shipping."}
{"post_id":23803,"thread_id":23741,"title":"820-2915-A no display & no ext display","user_id":2,"username":"dukefawks","post_date":"2017-08-04 00:43:45","message":"Only thing to also check is a short to GND on L8920. It will normally be quite low like 6 Ohm but not total short."}
{"post_id":23885,"thread_id":23741,"title":"820-2915-A no display & no ext display","user_id":1006,"username":"logictom","post_date":"2017-08-06 18:12:22","message":"I'm getting 13 ohms on L8920, so assume that's ok. Traces on 14\/16 look to be ok, I'll order the ISL6263 today and get that replaced and clean up the surrounding when I replace it.\nThanks."}
{"post_id":24657,"thread_id":23741,"title":"820-2915-A no display & no ext display","user_id":1006,"username":"logictom","post_date":"2017-08-25 22:45:53","message":"Finally got the replacement ISL6263 in, fitted it and I am now getting PM_ALL_GPU_PGOOD 3.3V but I still don't get display or external display signal - I think the soldering is all good - it's been a while since I've done anything with the hot air. I'm assuming everything should be ok because I'm now getting PGOOD?\nWhat other culprits can I look at?"}
{"post_id":24676,"thread_id":23741,"title":"820-2915-A no display & no ext display","user_id":2,"username":"dukefawks","post_date":"2017-08-26 13:46:43","message":"Voltage on L8920?"}
{"post_id":24691,"thread_id":23741,"title":"820-2915-A no display & no ext display","user_id":1006,"username":"logictom","post_date":"2017-08-27 02:14:54","message":"0.1V on L8920, not exactly close to the 0.75-0.9V in the schematic."}
{"post_id":24692,"thread_id":23741,"title":"820-2915-A no display & no ext display","user_id":1006,"username":"logictom","post_date":"2017-08-27 02:37:19","message":"PM_ALL_GPU_PGOOD is now 2.7V rather than the 0V before hand but now VID0 is 0.85V, VID1 IS 2V rather than 3.3V, VID2 is still 3.3V"}
{"post_id":24699,"thread_id":23741,"title":"820-2915-A no display & no ext display","user_id":2,"username":"dukefawks","post_date":"2017-08-27 14:44:38","message":"VID should be either 0 or 3V. As PGOOD is also a weird value I believe the issue is still in the ISL6263. You did get the ISL6263C? C version is important here!"}
{"post_id":24709,"thread_id":23741,"title":"820-2915-A no display & no ext display","user_id":1006,"username":"logictom","post_date":"2017-08-27 18:44:32","message":"That would be it, (F#@k) don't know how I missed the obvious differences in the block diagrams, I was focusing on all the calculations and tables being the same and missed it.\nAre there any known good sources for the C version that don't have a high minimum order quantity?"}
{"post_id":24713,"thread_id":23741,"title":"820-2915-A no display & no ext display","user_id":1006,"username":"logictom","post_date":"2017-08-27 21:56:35","message":"I have ordered some off ebay from China, we'll see how that goes... If anyone can point me to any reputable sources then I'll also order from them."}
