{"post_id":49456,"thread_id":49456,"title":"820-3435, no TP\/KB","user_id":1466,"username":"jpadie","post_date":"2019-05-24 08:02:27","message":"Hi \n\nthis board has been working fine in a chassis after a keyboard swap a month ago.  a daily driver for a client. \n\nBrought to me again as the external display\/thunderbolt port stopped working.  This is not yet fixed although I did find U3210 literally half of its pads and a couple of passives also pushed off their pads.  I've reseated this, thunderbolt still not detected.  I will replace the chip before diagnosing that further (although there was green sticky corrosion all around  the shield over U2800 as well).  \n\nThe problem is since putting the board back in the chassis the keyboard and trackpad have stopped functioning.  Working fine when I was testing the machine yesterday.  Turn it on this morning and there was nothing.  I've tried three known good trackpads and three different cables (one known good and one new).  All exhibit the same behaviour. \n\nThere was gunk under the keyboard connector which I have cleaned out (the latest batch of amtech flux does not seem to get cleaned away by my ultrasonic, or even by brushing with alcohol); and I've verified that the connector pins are firmly seated on the board. \n\nis there something obvious to check on this?  I've got an hour later that I've slated to have a look at it.  \n\nthanks in advance.\nJustin"}
{"post_id":49459,"thread_id":49456,"title":"820-3435, no TP\/KB","user_id":1153,"username":"JohnB8812","post_date":"2019-05-24 08:29:29","message":"As far as Thunderbolt, forget that don?t even bother if U3210 is bubbling on the board that?s bad....\n\nFor the tpad, measure voltages at the trackpad connector3v42 5v 3.3 volt etc"}
{"post_id":49461,"thread_id":49456,"title":"820-3435, no TP\/KB","user_id":682,"username":"2informaticos","post_date":"2019-05-24 08:42:43","message":"Did you try to acces boot menu?\nWorking way is different in OSX than before login.\n\nCheck at least if all voltages are OK at J4800.\nTest all corresponding resistors and post voltages for U4810."}
{"post_id":49465,"thread_id":49456,"title":"820-3435, no TP\/KB","user_id":1466,"username":"jpadie","post_date":"2019-05-24 10:16:38","message":"[USER=\"1153\"]JohnB8812[\/USER]  - no bubbling on U3210.  still, most odd.   thanks re advice on voltages\n\n[USER=\"682\"]2informaticos[\/USER]  - thanks - will post back later when i've tested."}
{"post_id":49469,"thread_id":49456,"title":"820-3435, no TP\/KB","user_id":1466,"username":"jpadie","post_date":"2019-05-24 13:10:53","message":"[USER=\"682\"]2informaticos[\/USER]  - seemingly pressing any keyboard button (even alt) pushes the machine into the recovery menu.  KB and TP are not active.\nremoving the SSD and using an ubuntu drive loads ubuntu but no KB or TP either. \n\nvoltages on J4800 are as follows:\n\n\n1 From 0 to 1.02 escalating slowly then bouncing back\n2 2mv\n3 0\n4 3.06\n5 20mv\n6 0\n7 0\n8 0\n9 3.8mv\n10 3.32\n11 3.3\n12 0\n13 3.3\n14 5.1\n15 3.32\n16. 3.32\n17 3.32\n18. 3.39\n19 3.42\n20 3.42\n\nthe lid was propped about 2cm open.  R5171 is ok and when the lid is closed the value is 3.42v\n\nU4810 voltages (measured with case closed, board semi-out and kb\/tp connected to J4800)\n\nPMSLP_S4_L 3.32\nTPAD_USB_IF_EN . 3.29\nTPAD_SPI_IF_EN_CONN 0v\nGND \nPMSLP_S4_L 3.32\nTPAD_SPI_IF_EN  9mv\nTPAD_USB_IF_EN_CONN 3.32v\nPP3v3_S4 3.32v\n\nR1630 has 23mv on pin 2 and 0 on pin 1"}
{"post_id":49473,"thread_id":49456,"title":"820-3435, no TP\/KB","user_id":682,"username":"2informaticos","post_date":"2019-05-24 15:54:50","message":"SMC_LID should be high when lid is open.\nCheck that..."}
{"post_id":49476,"thread_id":49456,"title":"820-3435, no TP\/KB","user_id":1466,"username":"jpadie","post_date":"2019-05-24 16:21:06","message":"with the board out of the chassis completely SMC_LID is at 3.4v and is present at R6961 but not at the connector.  That's odd.  \n\ntime passes...\n\nThanks [USER=\"682\"]2informaticos[\/USER] - turns out that the pad under pin 1 had slightly corroded and subsequently got pushed up but the toffee remnants of the new batch of amtech flux I got delivered ten days ago.  They must have changed the formula ...\n\ncase closed ...\n\nnow on to another much more interesting 820-3435."}
{"post_id":49477,"thread_id":49456,"title":"820-3435, no TP\/KB","user_id":1466,"username":"jpadie","post_date":"2019-05-24 17:09:52","message":"Spoke too soon. \nboard back in chassis and no kB or tp.  Board only boots into recovery. \n\nWill leave it for the night and see whether any other pins are lifted in the morning."}
{"post_id":49491,"thread_id":49456,"title":"820-3435, no TP\/KB","user_id":1466,"username":"jpadie","post_date":"2019-05-25 08:53:55","message":"this board is a troll .... \n\n\nrepaired the trackpad connector and strung a jumper from smc_lid for security.  connection good now.  \n\nultrasonic for 10 mins and then plug back in - no fan spin!  \n\nvisual inspection shows that traces from U5450 to R5669 and R5667 (both no stuffed) and U5660 have burned out.  These are the current sensing lines from ppbus_g3H and PPBUS_S5_HS_COMPUTING_ISNS.\n\nno shorts on either PPBUS_G3H and PPBUS_S5_HS_COMPUTING_ISNS.\n\nThe current sense resistor R5450 has bare copper on 3 and 4.  It is measuring a little higher than I'd expect to, at 0.5Ohm.  But this is the same reading as R7320 gives, and that's supposed to be 750uOhm.  so I think this is most likely to be a limitation of my DMM.\n\nU5800 is visually fine.  \n\nI'm a little uncomfortable about just replacing U5450 and R5450 and string jumpers around the board (the via has burned out I think) without understanding what could have caused the burn out to start with, and investigating that.  I thought at first that i may have caused the short whilst testing the kb connector, but PPBUS is nowhere near there.  \n\nAll a bit confusing as this board's been working fine for a year (other than a keyboard problem which led to a direct replacement, then a mic problem and keyboard connector problem probably associated with the KB swap-out.  \n\nBut, some good news --- thunderbolt was working after I reseated  U3210 again!  \n\ntia\njustin"}
