{"post_id":40520,"thread_id":40520,"title":"820-2850-A no 1 volt rails","user_id":1901,"username":"da_muffinman","post_date":"2018-10-11 01:39:50","message":"Sorry I am still learning...\n\nSo this mb gets green light on charger but no boot \/ no fan spin.\n\nG3H present\nPP3V42_G3H present\nPP3V3_S5 present\nPP5V_S5 present\n\nPP1V05_S5 missing\n\nI see that it is linked to the cpu but what creates PP1V05_S5? \n\nIt looks like this one has not been opened before \/ I do not see evidence of liquid damage yet\n\nThanks"}
{"post_id":40521,"thread_id":40520,"title":"820-2850-A no 1 volt rails","user_id":296,"username":"jadao","post_date":"2018-10-11 02:24:50","message":"Look at U7740, it has pp3v3_S5  input on pin 3,4,6 and PP1V05_S5 on the output pin #1.\n1) if you have a break in the traces and pp3v3_s5 never reach the input of u7740 you will never have PP1V05_S5 at the output. So please check pins 3,4,6\n\n2)if pp3v3_s5 is present at pins 3,4,6 of u7740, remove power and check if there is short on pin 1 (PP1V05_S5).\nSo please check in diode mode red on ground and black on pin-1 U7749 and let us know.\n\n3) if there is no short and input signal present, it may be simply a bad chip u7740.\nin this case replace the chip."}
{"post_id":40525,"thread_id":40520,"title":"820-2850-A no 1 volt rails","user_id":682,"username":"2informaticos","post_date":"2018-10-11 04:24:38","message":"I don't remember to ever saw such chip soldered on MacBook boards...\nAs per schematic, an alternative of strong voltage divider is used.\nJust a resistor divider. However you still need to get 1V05 on its output.\nCheck for short there."}
{"post_id":40557,"thread_id":40520,"title":"820-2850-A no 1 volt rails","user_id":296,"username":"jadao","post_date":"2018-10-11 16:58:38","message":"Long time i didn't work on these boards, I simply checked on the schematic, but i don't have a board in front of me to confirm. Maybe it doesn't exist. Sorry"}
{"post_id":40605,"thread_id":40520,"title":"820-2850-A no 1 volt rails","user_id":1901,"username":"da_muffinman","post_date":"2018-10-12 20:13:37","message":"2informaticos is correct: U7740 as well as neighboring U5101 and C7741 and U3714 are not present on the board.\n\nMeasured at R1120 in the same area, PP1V05_S0 is shorted (resistance to ground 13Ω). I do have the schematic in front of me but this rail shows up so frequently I'm not sure where to measure next - 2inform, where is the resistor divider to which you are referring?\n\nOn the other side of the board, R1827, R1826 & R1825 do not show a short to ground for PP1V05_S5\n\nThere is some corrosion around the SD_D lines\nThere is also some corrosion around U6030, R6032, C6032, R6030, R6031, R6033 & C6033, all of which are not present on the board."}
{"post_id":40652,"thread_id":40520,"title":"820-2850-A no 1 volt rails","user_id":1901,"username":"da_muffinman","post_date":"2018-10-13 21:56:58","message":"Though I see the notation in the schematic, I cannot locate the voltage divider nor therefore the source of pp1v05_s5; can anyone help with this?\n\nAdditionally, I am having trouble detecting the source of the short on pp1v05_s0...I measured it in like a bazillion places and every reading was .012kΩ to ground.  I think because the the voltage to that rail is non-existent \/ insufficient to produce heat, an alcohol test proved futile.  Is injecting voltage an option, or should I measure more individual resistors, etc?\n\nThanks a bazillion!"}
{"post_id":40654,"thread_id":40520,"title":"820-2850-A no 1 volt rails","user_id":682,"username":"2informaticos","post_date":"2018-10-14 02:52:27","message":"That voltage goes to PCH, so is the first suspect...\nMany MacBook boards have the same circuit, so check other schematics and compare resistance to ground with other bosrd.\nThis in case you cannot get the same board for test.\nHowever, 12 ohms looks pretty bad."}
{"post_id":40668,"thread_id":40520,"title":"820-2850-A no 1 volt rails","user_id":289,"username":"smiba","post_date":"2018-10-14 08:03:52","message":"I might be wrong as I haven't worked on these boards for a while, but looking at the schematic tells me this voltage rail is not important and possibly not even populated.\nPP1V05_S5 is used for XDP which is only on development boards because this is not a feature needed on the boards sold to customers. Don't bother with it\n\nI don't think PP1V05_S0 is your issue either, 12 Ohms is a very normal amount for a low voltage rail supplying power to a CPU. (91mW \/ 0.087A)\n\nIs the board even trying to boot? Pulsing on S3 or even S0 lines?"}
{"post_id":40735,"thread_id":40520,"title":"820-2850-A no 1 volt rails","user_id":1901,"username":"da_muffinman","post_date":"2018-10-15 23:20:23","message":"Thank you for your responses. \n\nThis board DOES have a green light from the charger, but when I trip the Power On Points, there is no fan spin \/ no power.\n\nI am going down the list of power rails listed in the schematic in order:\n\nPPBUS_G3H 12.6V present and accurate\nPPBUS_CPU_IMVP_ISNS 12.6V present and accurate\nPPDCIN_G3H 16.5V present and quasi accurate (2V under schematic specifications)\nPP3V42_G3H 3.4V present and accurate\nPP5V_S5 5V present and accurate\n\nPP5V_S3 and PP5V_S0 are the next listed rails.  They are absent but they should be because the computer is not on, right?\n\nPP3V3_S5 is present\nPP18V5_S3 is not\n\nSMC must be on bc of charger light right?\n\nI'm following along with the video \" [h=1]2009 Unibody Macbook Pro 17\" dead out of nowhere; but why?\"[\/h] I think my assumption that PP5V_S3 should be off and therefore is not worth looking into may have been faulty.  I'm going to investigate whether PP5V_S3 is being told to turn on.  Checking first the [B]beginning [\/B]of the circuit and the [B]end[\/B] of the circuit.\n\nLooking at U7201 enable and buck converter.  \n\nU7201 TPS51125 master enable input EN0 is pin 13: [I]Master enable input. Open : LDOs on, and ready to turn on VCLK and switcher channels. EN0 13 I\/O 620 kΩ to GND : enable both LDOs, VCLK off and ready to turn on switcher channels. Power consumption is almost the same as the case of VCLK = ON. GND : disable all circuit[\/I]\n\nENTRIP1 is pin 1 and ENTRIP2 is pin 6: [I]Channel 1 and Channel 2 enable and OCL trip setting pins.Connect resistor from this pin to GND to set I\/O threshold for synchronous RDS(on) sense. Short to ground to shutdown a switcher channel.[\/I]\n\nLeft side is channel 1.  Looking for ENTRIP1 > P5VS3_EN > PM_SLP_S4_L\n\nIn Louis's video, PM_SLP_S4_L is created by MCP79 U1400 (he's on a 2009, mine is 2010).  He checks if the MCP has power to turn on.  He checks PP1V05_S5_MCP.\n\nIn my 2010 model, PM_SLP_S4_L comes from U1800 (the GPU).  I am not sure which signal tells the GPU to turn on.  In my schematic, there is also no PP1V05_S5_MCP.  My schematic references MCP79, but there is no chip with such label.  My boardview does not have a U1400.\n\nSo...is the fact that my GPU U1800 is not outputting PM_SLP_S4_L at least partially the culprit here?  I'm not sure what to do next any suggestions welcome thank you!"}
{"post_id":40736,"thread_id":40520,"title":"820-2850-A no 1 volt rails","user_id":1901,"username":"da_muffinman","post_date":"2018-10-15 23:22:20","message":"[QUOTE=\"smiba, post: 40668\"]\nIs the board even trying to boot? Pulsing on S3 or even S0 lines?[\/QUOTE]\n\nUnfortunately no and no"}
{"post_id":40737,"thread_id":40520,"title":"820-2850-A no 1 volt rails","user_id":1901,"username":"da_muffinman","post_date":"2018-10-15 23:51:40","message":"Should I be looking at the tantalum capacitors like C9560?\n\nC9560 has only 115Ω of resistance between its pins whereas other capacitors on the board seem to have much more; should this be concerning?"}
{"post_id":40747,"thread_id":40520,"title":"820-2850-A no 1 volt rails","user_id":682,"username":"2informaticos","post_date":"2018-10-16 03:51:18","message":"Your board is iCore and has PCH, not MCP.\nPM_SLP_S4_L is required by voltages from S3 state, as PM_SLP_S3_L is required to go from S3 to S0 state.\n\nBTW, C9560 is not involved in Power On Sequence.\n\nStart checking the 4 PCH's RTC signals, on page 17.\nNext, go to page 18 and check signals from System Power Management block.\nTry to post only the ones needed for start.\nAsk if you have doubts which are, is a good way to learn..."}
