[
    {
        "post_id":44667,
        "thread_id":44667,
        "title":"SSD RECALL 2016 13\" Macbook pro any fixes?",
        "user_id":416,
        "username":"brooke.j",
        "post_date":"2019-01-11 12:45:26",
        "message":"Just wondering if anyone has fixed one of the 13\" 2017 MBP with the SSD chips soldered to the board? Wanted to know if it was a solder issue and could be Re-flowed properly to get access to the data? Again Apple is screwing it's customers with this crap."
    },
    {
        "post_id":44802,
        "thread_id":44667,
        "title":"SSD RECALL 2016 13\" Macbook pro any fixes?",
        "user_id":416,
        "username":"brooke.j",
        "post_date":"2019-01-14 22:17:26",
        "message":"I know reflow-ing a chip like this rarely fixes it or if it did it's temporary but is it a solder issue just like the Nvidia graphics cards of the past or what?"
    },
    {
        "post_id":44810,
        "thread_id":44667,
        "title":"SSD RECALL 2016 13\" Macbook pro any fixes?",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-01-15 01:47:55",
        "message":"The graphics cards you mentioned suffer by internal GPU issues and less than 5% because of bad solders..."
    },
    {
        "post_id":45064,
        "thread_id":44667,
        "title":"SSD RECALL 2016 13\" Macbook pro any fixes?",
        "user_id":416,
        "username":"brooke.j",
        "post_date":"2019-01-21 12:54:49",
        "message":"[QUOTE=\"2informaticos, post: 44810\"]The graphics cards you mentioned suffer by internal GPU issues and less than 5% because of bad solders...[\/QUOTE]\n\nUh so all of the 2011's were something other than the solder under the GPU?  Really where did you get this info from cuz all I can see are loads of documentation and websites talking about the bad solder under the GPU. Also what's up with this site anymore? Where I get one answer from a Senior member and they don't even say one thing about my actual question.  I pay for this forum."
    },
    {
        "post_id":45065,
        "thread_id":44667,
        "title":"SSD RECALL 2016 13\" Macbook pro any fixes?",
        "user_id":416,
        "username":"brooke.j",
        "post_date":"2019-01-21 13:08:58",
        "message":"Even an answer like \"Not much you can do\" or \"Check out the recovery tool posted here for these MacBooks\" or even a simple \"I don't know\" about my original question instead of just some random fact about my post that is simply just arguing about semantics. Trust me I'm not ungrateful.  I can see how that info could really save me time if I was trying to do some crappy reflow of a GPU (which I never do) because it's not the solder and actually an internal issue. Great thank you for that info, seriously not being sarcastic at all really but .. I dunno just wanted anything maybe about my actual question.  Unless by saying that the GPU's I'm talking about is somehow hinting that the chips on the boards that are the SSD's are actually internally faulty and I'm supposed to figure that out then..... I guess I just did?"
    },
    {
        "post_id":45067,
        "thread_id":44667,
        "title":"SSD RECALL 2016 13\" Macbook pro any fixes?",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2019-01-21 13:29:14",
        "message":"Let's take a step back here for just a second. Your original post is confusing in several ways; first, your thread title is \"SSD Recall 2016 13\" MacBook Pro...\". The SSD recall was for non-touchbar models (A1708). You then go on to ask a random, unrelated question about fixing the 2017 13\" MBP board \"with SSD chips soldered to the board\". These are totally different models and not related at all to the SSD recall. You then go on to ask if \"IT\" (???????) \"was a solder issue\". What are you asking? If the SSDs on the Touchbar models fail commonly due to bad solder? No, they don't fail commonly due to bad solder. Do they fail? Yes. Is it because of bad solder? Possibly. Is the one you're working on failed due to bad solder? Who knows. You provided zero information about it, let alone any details of what symptoms you're experiencing or what steps you've taken to troubleshoot\/determine\/repair\/etc the issue. Then you proceed to make an incorrect assumption about the 2011 GPU failures, and someone chimed in to correct you.\n\nNo offense or anything at all, but you need to be clearer in your questions. Be direct and explain the situation with as much detail as possible. Don't be confusing and reference a recall regarding SSDs then ask a question about a totally different model\/unit\/issue. Be clear about what your question is. It sounds like you're just curious if the on-board SSD chips fail due to bad solder. The answer is no. The chips themselves are usually corrupt\/damaged, and they have custom firmware that makes replacing them an incredibly arduous task. I've never done it...I don't waste time on those yet. Too many are still under AppleCare, and can be repaired for free. If it became some huge issue that was a gold mine to repair, I'd probably attempt it. But right now it's way more trouble than it's worth, and unless someone is willing to pay very well to have their data recovered ($3XX+), I'd suggest not wasting your time.\n\n:)"
    },
    {
        "post_id":45080,
        "thread_id":44667,
        "title":"SSD RECALL 2016 13\" Macbook pro any fixes?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2019-01-21 18:09:12",
        "message":"GPUs never have solder issues. The problem is inside the chip between the silicon die and the green substrate. Anyone claiming otherwise does not know what they are talking about.\n\nIn case of the SSDs you are probably fucked. I have a stack of 2015 A1534 here with SSD issue that I have not figured out. \nReflowing the NAND and controller on your board is not possible as they are all undefilled chips. The only thing you can try is to put some heat on them but not enough to melt solder else it is 100% fucked.\nI assume you checked all voltages on the NANDs and controller are present and the \"lifeboat\" connector is installed."
    },
    {
        "post_id":45103,
        "thread_id":44667,
        "title":"SSD RECALL 2016 13\" Macbook pro any fixes?",
        "user_id":416,
        "username":"brooke.j",
        "post_date":"2019-01-22 17:26:11",
        "message":"Thank you. In retrospect and in light of your well put answers.. I agree my post was f'd. Sorry, I didn't catch the discrepancy with the title and the first question. I tried to correct it as you can see in the edit. I will in the future be more careful with my posts and be more clear with my questions and give a background with more information. Thank you for the insight.  I think I was a little hasty with what I said. Just one of those days. I think I felt like I was the guy who pays for a gym membership and then never goes. (perfect customer)  I've asked maybe 4 questions on here and have been paying for awhile and I guess I just felt unnoticed. Maybe it was the thought of thinking I'm the \"perfect customer\" (just keeps paying and doesn't wear out the equipment) and so I was hoping for a better first response but that's just my stuff to deal with and not the forum's.  My bad.  I'll do better next time."
    },
    {
        "post_id":45104,
        "thread_id":44667,
        "title":"SSD RECALL 2016 13\" Macbook pro any fixes?",
        "user_id":416,
        "username":"brooke.j",
        "post_date":"2019-01-22 17:29:58",
        "message":"Just putting this here too: Thank you. In retrospect and in light of your well put answers.. I agree my post was f'd. Sorry, I didn't catch the discrepancy with the title and the first question. I tried to correct it as you can see in the edit. I will in the future be more careful with my posts and be more clear with my questions and give a background with more information. Thank you for the insight. I think I was a little hasty with what I said. Just one of those days. I think I felt like I was the guy who pays for a gym membership and then never goes. (perfect customer) I've asked maybe 4 questions on here and have been paying for awhile and I guess I just felt unnoticed. Maybe it was the thought of thinking I'm the \"perfect customer\" (just keeps paying and doesn't wear out the equipment) and so I was hoping for a better first response but that's just my stuff to deal with and not the forum's. My bad. I'll do better next time."
    },
    {
        "post_id":45105,
        "thread_id":44667,
        "title":"SSD RECALL 2016 13\" Macbook pro any fixes?",
        "user_id":416,
        "username":"brooke.j",
        "post_date":"2019-01-22 17:36:10",
        "message":"Wow! I had no idea. I don't do BGA GPU work so when I search the net and see so much about the solder being an issue with the 2011's I just thought that that was an issue. Guess I need to search better sites... or read this forum more because I just searched \"2011 GPU not the solder\" and viola.. first hit is Rossman group.  (facepalm).  I will check the voltages with lifeboat."
    }
]