[
    {
        "post_id":56780,
        "thread_id":56780,
        "title":"820-3115B No power",
        "user_id":2358,
        "username":"max1zzz",
        "post_date":"2020-02-15 09:06:21",
        "message":"I have a 820-3115b here with no power and no green light on the charger\n\npp3v42_g3h is present as is ppvrtc_g3h, ppbus_g3h is 12.23v, pp5v_s5 & pp3v3_s5 are missing this is because SMC_PM_G2_EN is missing. Board is pulling only 13ma from the charger.  I'm guessing bad SMC.\n\nBoard was originally liquid damaged (can't remember exactly where as this was probably 2 years ago) and PPVOUT_SW_LCDBKLT was shorted to ground internally in the board, I dug the board out to clear the short and ran a jumper and the board seemed to be working fine. Installed the board in a macbook and left it installing OSX overnight, came back in to morning to find the keyboard no longer worked, replaced u5701 with no change and then decided it was a SMC issue (Can't remember why I thought this) and proceed to rip a pad off the only spare SMC I had so the board sat in a pile until recently when I had a spare SMC, reballed and installed this and still no keyboard.  Resoldered u7501, no change. Cleaned and reseated the keyboard ribbon only to find the macbook would no longer power on"
    },
    {
        "post_id":56781,
        "thread_id":56780,
        "title":"820-3115B No power",
        "user_id":637,
        "username":"TCRScircuit",
        "post_date":"2020-02-15 09:11:37",
        "message":"This is a bit confusing. You did replace the SMC on this board? With one with a ripped pad?\n\nThis is obviously SMC related. What is SMC_RESET_L?\n\nAs far as the keyboard issue goes, is PP3v3_S3_PSOC present on pin 22 and 49 of U5701?"
    },
    {
        "post_id":56783,
        "thread_id":56780,
        "title":"820-3115B No power",
        "user_id":2358,
        "username":"max1zzz",
        "post_date":"2020-02-15 09:21:24",
        "message":"No, the SMC I eventually fitted had all it's pad's intact\n\nSMC_RST_L is 3.42v\nPP3v3_S3_PSOC won't be present as the board is no longer powering on"
    },
    {
        "post_id":56786,
        "thread_id":56780,
        "title":"820-3115B No power",
        "user_id":637,
        "username":"TCRScircuit",
        "post_date":"2020-02-15 10:22:52",
        "message":"Something isn't right with the SMC install. \n\nMore flux and reflow it again. If it does not work, reball it or just grab a new one."
    },
    {
        "post_id":56787,
        "thread_id":56780,
        "title":"820-3115B No power",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-02-15 13:38:06",
        "message":"If the board doesn't turn on just after SMC replacing, then something wrong happened in this process.\nBut I'm not sure about this, as you also said\n\"Cleaned and reseated the keyboard ribbon only to find the macbook would no longer power on\"\nSo test the board alone on the desk, no TP\/KB, nor other device connected.\nJust DC board and check for voltage on the coils.\nUse R5015\/16 pads instead of power button.\nSee if you get correct PPBUS_G3H and steady SMC_RESET_L.\nAlso check PM_BATLOW_L and use original Apple 60\/85W charger."
    },
    {
        "post_id":56798,
        "thread_id":56780,
        "title":"820-3115B No power",
        "user_id":2358,
        "username":"max1zzz",
        "post_date":"2020-02-16 03:55:11",
        "message":"Yes the board did work after replacing the SMC, it only stopped working after I started looking into the keyboard issues again. I did try reflowing the SMC anyway which made no difference\n\nWith the bare board on the desk I am still getting 12.23v on PPBUS_G3H, SMC_RESET_L is a steady 3.44v. PM_BATLOW_L is 0.29v\nI'm still powering the board off the bench supply as it turns out I don't have a working original magsafe 1 charger right now, I will borrow one form work tommrow and test it with that\nNot sure which coils you mean?"
    },
    {
        "post_id":56801,
        "thread_id":56780,
        "title":"820-3115B No power",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-02-16 04:27:30",
        "message":"PCH will not start power sequence with low level at PM_PWRBTN_L.\nThis is sign of incorrect charger, or SMC issue..."
    },
    {
        "post_id":56806,
        "thread_id":56780,
        "title":"820-3115B No power",
        "user_id":2358,
        "username":"max1zzz",
        "post_date":"2020-02-16 06:45:03",
        "message":"PM_PWRBTN_L is at 0.03v\nThe cable on my bench supply works fine on another macbook, looks like it is time to order a scrap board from china as I don't have any 3115 scrap boards that still have a SMC on them"
    },
    {
        "post_id":56807,
        "thread_id":56780,
        "title":"820-3115B No power",
        "user_id":2358,
        "username":"max1zzz",
        "post_date":"2020-02-16 07:13:53",
        "message":"OK,\nPP3V3_S5_SMC_VDDA was shorted to ground and L4901 had come off the board so I wasn't seeing a short on pp3v42_G3H, Removed and cleaned the SMC  and board both show no short now so I must have had shorted balls under the chip. Will reball it and report back"
    },
    {
        "post_id":56810,
        "thread_id":56780,
        "title":"820-3115B No power",
        "user_id":2358,
        "username":"max1zzz",
        "post_date":"2020-02-16 08:36:10",
        "message":"Reballed and reinstalled SMC and macbook now powers on fine.\nNow back to the keyboard issue's Both the keyboard and trackpad work fine in EFI, neither work once the macbook has booted a OS"
    },
    {
        "post_id":56811,
        "thread_id":56780,
        "title":"820-3115B No power",
        "user_id":2358,
        "username":"max1zzz",
        "post_date":"2020-02-16 09:34:31",
        "message":"SMC_LID was missing on Q5701 & R6961 but was present on R5071. Just ran a jumper all the way across the board and now the KB and TP work fine in the OS.\nStill confused on how I had the macbook booting before when I apparently had a short under the SMC but at least it is working now."
    }
]