{"post_id":54659,"thread_id":54659,"title":"820-0152-02 Fixed PP3v3_g3h with replacing chip C03215 then no PPBUS_G3H","user_id":19508,"username":"goldminer76","post_date":"2019-11-20 19:38:22","message":"Hi,\n\nI'm new to the T2 chip Macs. I had a water damage come in and had 5v on the charger.  Got PP3V3_G3H working by replacing chips C03215. I was then getting 19.8V on the charger. I was only getting 1.8V on PPBUS_G3H though. I was looking for something similiar to ISL9239 like on Macbook Pro's but the only thing I found was a chip that looked like it was creating PPBUS_G3H. This was U7000. (i could be totally wrong) So I thought I'd reflow U7000 and after I was getting 12.4v on PPBUS_G3H. Then after 30 seconds the charger went down to 5v again. And my PPBUS_GH went down to 1.7v. One thing that is bothering me is that PPBUS_G3H will \"tone\" short to ground for a few seconds then it won't. Could this be a chip failure. Is that something that happens? Like a chip will short and then it won't so it \"tone\"s short to ground and then doesn't?\n\nI'm wondering where to look next. What makes PP3v3_G3H on this board? What makes PPBUS_g3H and I'd like to figure out the order of what comes first. I see a couple of videos by Louis but they are for the MBP. Thank you for any direction. Right now I'm back at 5v on charger again.\n\n[B]Recap:[\/B]\n\n[U][B]Started at:[\/B][\/U]\n\n5v on charger\n0v PP3v3_G3H\n\n[U][B]Replaced C03215 chip:[\/B][\/U]\n\n19.7v on charger\n3.4v on PP3V3_G3H\n1.7 on PPBUS_G3H\n\n[U][B]Reflowed U700(0?):[\/B][\/U]\n\n19.8v on charger\n3.4v on PP3V3_G3H\n12.7 on PPBUS_G3H\n\n[U][B]then it took a shit. LOL[\/B][\/U]\n\n5v on charger\n0 on PP3V3_G3H"}
{"post_id":54666,"thread_id":54659,"title":"820-0152-02 Fixed PP3v3_g3h with replacing chip C03215 then no PPBUS_G3H","user_id":682,"username":"2informaticos","post_date":"2019-11-21 02:22:36","message":"\"One thing that is bothering me is that PPBUS_G3H will \"tone\" short to ground for a few seconds then it won'\"\nAllow always 10-15s before diode mode readings (or ohm scale) after power is removed.\n\nPPBUS_G3H is controlled by U7000 (ISL9240).\nIt also send enable signal to U6960, which generates 3V3_G3H.\n\nYou probably have bad solders under CD3215, or still corrosion somewhere.\nCompare diode mode readings on power rails between CD3215 chips."}
{"post_id":54703,"thread_id":54659,"title":"820-0152-02 Fixed PP3v3_g3h with replacing chip C03215 then no PPBUS_G3H","user_id":19508,"username":"goldminer76","post_date":"2019-11-21 16:44:15","message":"Thank you.  There really wasn't too much water damage and it was localized.  After replacing CD3215 (both) I was able to get 19.8v.  But PPBUS_G3H was at 1.7v.  Then I reflowed U7000 and it got me PPBUS_G3H for about 30 seconds.  Please verify my thinking. If U7000 (ISL9240) is bad then I think that CD3215 and U6960 will not enable and not give me PPBUS or 3V3.  So maybe next time I'll look at U7000 first. \n\nFor diode and ohm I do wait awhile after powering down before testing. One weird thing is for PPBUS_G3H when I test the same CAP but switch sides (positive\/negative) with my probes it will \"tone\" every time I switch.  Wonder what that's all about?  Thx for the advice!"}
{"post_id":54704,"thread_id":54659,"title":"820-0152-02 Fixed PP3v3_g3h with replacing chip C03215 then no PPBUS_G3H","user_id":19508,"username":"goldminer76","post_date":"2019-11-21 16:50:57","message":"Is ISL9249 and ISL9240HI the same?  Can I purchase the ISL9240 on the Rossmann shop?  I didn't see it."}
{"post_id":54705,"thread_id":54659,"title":"820-0152-02 Fixed PP3v3_g3h with replacing chip C03215 then no PPBUS_G3H","user_id":682,"username":"2informaticos","post_date":"2019-11-21 19:08:13","message":"If you got reaction after reflow a chip, reball it at least.\nNo idea yet if ISL9240 has firmware; I'll be surpised if not.\n\nPlease write new post instead of a comment."}
{"post_id":54737,"thread_id":54659,"title":"820-0152-02 Fixed PP3v3_g3h with replacing chip C03215 then no PPBUS_G3H","user_id":19508,"username":"goldminer76","post_date":"2019-11-22 17:58:00","message":"Thx [USER=\"682\"]2informaticos[\/USER] just to be clear your saying that I can replace this ISL9240 with an ISL9249?"}
{"post_id":54740,"thread_id":54659,"title":"820-0152-02 Fixed PP3v3_g3h with replacing chip C03215 then no PPBUS_G3H","user_id":1153,"username":"JohnB8812","post_date":"2019-11-22 18:14:41","message":"Nope has to be ISL9240. ISL9249 will not work."}
{"post_id":54744,"thread_id":54659,"title":"820-0152-02 Fixed PP3v3_g3h with replacing chip C03215 then no PPBUS_G3H","user_id":19508,"username":"goldminer76","post_date":"2019-11-22 19:52:48","message":"Ok thats what I thought just was hoping I could find that chip but I can't.  Do you know where to get one?"}
{"post_id":54745,"thread_id":54659,"title":"820-0152-02 Fixed PP3v3_g3h with replacing chip C03215 then no PPBUS_G3H","user_id":1153,"username":"JohnB8812","post_date":"2019-11-22 19:54:31","message":"Good luck is my answer lol. Donor board if you can somehow find one or the AirPods wireless charger case has it on the circuit board. It?s like a 100 dollar case"}
