{"post_id":51841,"thread_id":51841,"title":"820-3332 kernel panic display ghosting","user_id":483,"username":"cwalex","post_date":"2019-08-29 22:32:51","message":"Hi, I have one here that would kernel panic when running ASD OS but not every time. ASD EFI passes with no errors.\n\nI removed the logic board and the only evidence of liquid I could find was a tiny spot of corrosion near the LCD backlight connector on a test point that was just surface corrosion and some residue that went under the CPU. I also noticed that there was a crackling sound coming from the left speaker that would get louder and more frequent during the part of the ASD thermal interface test where the cpu is running hard and the fans are running high. It's hard to describe but if you are familiar with what it sounds like in an audio circuit when a pot has DC on it and you turn the pot you get a crackle sound. It sounds like that.\n\nI cleaned it in the ultrasonic cleaner and ran ASD again and this time the kernel panic happened sooner. I reflowed U8900 and ran ASD OS again and it passed without a kernel panic but I noticed a kind of ghosting effect of the last ASD window in the background. The crackling wasn't as frequent either. I reflowed the speaker amp and regulator and the crackling seems to be gone but I did think I heard a tiny click sound from the speaker on occasion when the fans were running high but it could have been my imagination.\n\nI restarted and booted a test macos HD and on the login screen I could see the ghost image of the ASD window again. After logging in it went away and I ran heaven benchmark.\n\nAs the benchmark was running I watched the p-bus voltage and it dropped down at times to a little lower than 12.3V but fluctuated between there and ~12.6V. I don't know if this is normal or not.\n\nI reflowed the gmux chip and ran ASD again but the ghosting was still present during some tests. I booted into the test macos hd again and noticed the ghosting so I reset the SMC and the ghosting went away.\n\nFinally I ran the ASD OS again and got a kernel panic, after that I noticed that the ghost image of the ASD window was back again.\n\nSorry for the long winded explanation. Could this be a GPU fault? Reflowing the things like the gmux and U8900 might heat the GPU enough to make it behave better for a short while if that is indeed the fault because I did notice that it seemed to take longer to kernel panic after doing rework on the board than it did after ultrasonic cleaning."}
{"post_id":51842,"thread_id":51841,"title":"820-3332 kernel panic display ghosting","user_id":483,"username":"cwalex","post_date":"2019-08-29 22:39:01","message":"An image of the kernel panic and the ghosting. Hopefully, it's clear enough.\n\n\n[ATTACH alt=\"ghost.jpg\" type=\"full\"]51844._xfImport[\/ATTACH]"}
{"post_id":51859,"thread_id":51841,"title":"820-3332 kernel panic display ghosting","user_id":682,"username":"2informaticos","post_date":"2019-08-30 04:33:25","message":"As it passed ASD EFI first time and crashed on ASD OS, is sign of GPU issue.\nASD EFI doesn't access GPU.\n\nSame issue appears on external monitor?\nTry to replace U8900."}
{"post_id":51932,"thread_id":51841,"title":"820-3332 kernel panic display ghosting","user_id":483,"username":"cwalex","post_date":"2019-09-02 02:12:49","message":"Replaced U8900 and still get the kernel panic. I had to run the ASD OS on loop though, it passes one pass. Seems to behave better for a little while after being worked on with hot air."}
{"post_id":51933,"thread_id":51841,"title":"820-3332 kernel panic display ghosting","user_id":483,"username":"cwalex","post_date":"2019-09-02 02:43:44","message":"I just turned it off and booted it back up with a macos test hd and ran the heaven gpu benchmark for 20mins without a hitch. This time as I monitored the p-bus voltage I didn't see it move from 12.7V at all.\n\nWhen I quit the benchmark, I noticed a ghost of the istat menus drop down thing that I was using to watch the sensors. I double checked that the GPU was back at 0V so it seems to be related to switching from the GPU to the intel graphics. GMUX?\n\nIt's a bit of a pain to test for the ghosting on a monitor. If you still think that it's relevant to check I'll do the test.\n\nEdit: during the OS test it does switch the graphics a few times so that may be why it kernel panics during that test after switching enough times to trigger some kind of malfunction."}
{"post_id":51934,"thread_id":51841,"title":"820-3332 kernel panic display ghosting","user_id":682,"username":"2informaticos","post_date":"2019-09-02 03:38:27","message":"If same problem appears on external monitor, then is GPU related for sure.\nExternal monitor is always driven by GPU."}
{"post_id":51937,"thread_id":51841,"title":"820-3332 kernel panic display ghosting","user_id":483,"username":"cwalex","post_date":"2019-09-02 04:24:45","message":"The ghosting is only on the internal display. I ran the graphics test on loop for the internal graphics and 2 errors were logged but no kernel panic. I did have to reset the smc first as I was getting kernel panic every time ASD OS was loading."}
{"post_id":51939,"thread_id":51841,"title":"820-3332 kernel panic display ghosting","user_id":483,"username":"cwalex","post_date":"2019-09-02 06:03:08","message":"Since there was no ghosting on the external display but the ghosting was on the internal display while the same tests were running. Does that indicate a fault with the CPU? I'm a little confused by how I was continually getting kernel panic when loading the ASD OS until I reset the SMC. After doing that, I could load the ASD OS test, resetting the SMC also makes the ghosting on the internal display go away until I run the ASD OS test again or when a kernel panic occurs. After that happens, when I boot from a test macOS HD, I can see the ghost of whatever was on the screen before the kernel panic happened just very faintly. And only on the internal display, the external doesn't show any ghosting at all.\n\nAlso, since I ran the heaven benchmark for at least 20 mins and there were no issues at all. That would lead me to believe the GPU is just fine.\n\nThere must have been something funky with the original U8900 too since before I replaced it while running the heaven benchmark the P-BUS voltage was fluctuating constantly between 12.3V and 12.5ishV. After replacing U8900 and running the benchmark, it didn't move from 12.7V at all.\n\nDo any of these things seem worthy of consideration or am I just getting bogged down in irrelevant data points?\n\nThe reason I cleaned it ultrasonically, in the beginning, was mainly that I could see a slight residue that went under the CPU. Thanks for your help so far and apologies for so much text to read through."}
{"post_id":51940,"thread_id":51841,"title":"820-3332 kernel panic display ghosting","user_id":682,"username":"2informaticos","post_date":"2019-09-02 08:26:43","message":"If internal ghosting appears when external monitor is connected, then GPU is fine.\nYou must test with other LCD assembly.\nIf still the same, than could be GMUX issue."}
{"post_id":51958,"thread_id":51841,"title":"820-3332 kernel panic display ghosting","user_id":483,"username":"cwalex","post_date":"2019-09-03 00:35:42","message":"Tested with a different display and there was no ghosting.\n\nI tried to boot into ASD OS twice and had kernel panic both times so I booted into a test macos HD and ran the heaven benchmark for a while till it got nice and hot. Rebooted and loaded ASD OS successfully, ran it on loop and at some point it crashed with graphical glitches.\n\n[ATTACH alt=\"glitch.jpg\" type=\"full\"]51959._xfImport[\/ATTACH]"}
{"post_id":51965,"thread_id":51841,"title":"820-3332 kernel panic display ghosting","user_id":682,"username":"2informaticos","post_date":"2019-09-03 04:36:24","message":"You can have a problem with CPU, or RAM; if only fails under iGPU..."}
{"post_id":51968,"thread_id":51841,"title":"820-3332 kernel panic display ghosting","user_id":483,"username":"cwalex","post_date":"2019-09-03 05:06:35","message":"It runs just fine in macos and doesn't seem to mind stress test of the GPU. I did the same test with the heaven benchmark running while I made the CPU run really hard so the temp went over 100deg and left it doing that for more than 5 mins with no issues.\n\nI ran the memory test with ASD EFI in the beginning, I forgot to mention that. Doesn't guarantee RAM is good but I think it's probably CPU. Do you think there is any point trying to put some flux under the CPU and hit it with hot air?"}
{"post_id":51977,"thread_id":51841,"title":"820-3332 kernel panic display ghosting","user_id":682,"username":"2informaticos","post_date":"2019-09-03 11:40:13","message":"Use gfxcardstatus to switch the graphics and be sure if board fails only under iGPU, or discrete mode.\nStill gives problems under normal use, after U8900 has been changed?"}
{"post_id":52007,"thread_id":51841,"title":"820-3332 kernel panic display ghosting","user_id":483,"username":"cwalex","post_date":"2019-09-05 00:39:14","message":"It doesn't give problems during normal use other than a few graphical glitches that I managed to make happen by switching between internal and dedicated back and forth a few times. A few minor glitches appeared then on internal but went away on dedicated and I couldn't reproduce the effect again.\n\nI ran heaven for 1hr on integrated with no issues and the same on dedicated with no issues. I ran ASD OS, and this time it completed without kernel panic but I had 4 errors related to wake events. I ran it again and got the same errors. I'm letting it cool down to ambient for a while and then I'll run ASD OS again.\n\nBut I haven't had any problems in normal use since replacing U8900 other than the ghosting which seems to be specific to the lcd panel anyway."}
{"post_id":52008,"thread_id":51841,"title":"820-3332 kernel panic display ghosting","user_id":682,"username":"2informaticos","post_date":"2019-09-05 03:05:51","message":"Then you can send it out..."}
{"post_id":52009,"thread_id":51841,"title":"820-3332 kernel panic display ghosting","user_id":483,"username":"cwalex","post_date":"2019-09-05 05:26:20","message":"Cheers, I will do that. Thanks for all your advice :)"}
