{"post_id":30032,"thread_id":30032,"title":"imac A1312 2009 27inch, core2duo backlight goes away","user_id":1101,"username":"ielectron","post_date":"2018-01-02 11:22:52","message":"serial number  W894716C5PM\n\n\nI did not open this imac yet, the issue is the backlight, randomly goes away, then i press the power button to put into sleep, then press it again to wake it and the backlight comes back. When its off, like after 10-60 minutes, with a flashlight i can see the picture and mouse moving.\nThe backlight always comes back with this sleep-wake method, or by unplugging the power cable and start it again. Same if i boot from ext. hdd.\n\nFixed only few imacs before, what is the more likely to be faulty? screen? board backlight IC? \n\nI dont have another imac screen to test with."}
{"post_id":30044,"thread_id":30032,"title":"imac A1312 2009 27inch, core2duo backlight goes away","user_id":2,"username":"dukefawks","post_date":"2018-01-02 20:54:39","message":"Bad soldering on the LED strips in the LCD. Need to totally pull apart the LCD, take out the 2 LED strips and reflow each LED and the connectors."}
{"post_id":30060,"thread_id":30032,"title":"imac A1312 2009 27inch, core2duo backlight goes away","user_id":461,"username":"Gurmon","post_date":"2018-01-03 13:23:24","message":"Just to add, this is a real mission separating the display first time. can be done, but high chance it goes wrong first time."}
{"post_id":30068,"thread_id":30032,"title":"imac A1312 2009 27inch, core2duo backlight goes away","user_id":624,"username":"Alan.L","post_date":"2018-01-03 21:21:55","message":"is this an common fault on all older iMacs and Apple Cinema Display (non-thunderbolt), like the one i just repaired?\ni want to fix another one lol to improve my expertise.."}
{"post_id":30071,"thread_id":30032,"title":"imac A1312 2009 27inch, core2duo backlight goes away","user_id":1101,"username":"ielectron","post_date":"2018-01-04 06:25:39","message":"i took out the screen, and just looked around how can i reach the backlight, well it seem that i have to remove the whole metal back plate, that seems a huge job, and it not even sure the issue is there, maybe its a better idea to get another second hand screen to test with."}
{"post_id":30073,"thread_id":30032,"title":"imac A1312 2009 27inch, core2duo backlight goes away","user_id":624,"username":"Alan.L","post_date":"2018-01-04 08:25:48","message":"its actually very simple, remove the tape and any screws out of the way. then use a Metal Spudger to pry the frame out.\nthe screen cost too much. \n\n[IMG type=\"full\" width=\"200px\"]https:\/\/alexnld.com\/wp-content\/uploads\/2015\/03\/SKU157018_1.jpg[\/IMG]"}
{"post_id":30094,"thread_id":30032,"title":"imac A1312 2009 27inch, core2duo backlight goes away","user_id":2,"username":"dukefawks","post_date":"2018-01-04 20:09:59","message":"I'm sure there are a few videos on youtube as these LCDs also have the common clouding issues by dust getting in the backlight diffuser. It is 100% the LCD and very very common on all 27\" LCDs.\nThe easy way out here is to get a bad\/cracked LCD and just swap over your good \"glas\" part."}
