{"post_id":64979,"thread_id":59988,"title":"820-3115 Fan Spins, no PPVCORE_S0_AXG_REG","user_id":27551,"username":"awbower","post_date":"2020-09-10 16:47:33","message":"All S0 signals are present except for PPVCORE_S0_AXG_REG. PPVCORE_S0_CPU_REG is present, but low (~1.1V). \n\nEven though PPVCORE_S0_CPU_REG is present, U7400 is not giving me CPUIMVP_PGOOD. It is also not outputting CPUIMVP_AXG_PGOOD (obviously, since PPVCORE_S0_AXG_REG is missing). I need both of these signals to get PM_PCH_PWRGD. \n\nIn order to get PPVCORE_S0_AXG_REG, U7400 must output 4 signals to Q7550 (pg. 69 of schematic). None of these signals are present. I replaced U7400, but it did not change anything. \n\nTo try to address low voltage on PPVCORE_S0_CPU_REG, I replaced Q7510 and Q7520. This did not change anything. \n\nI checked the current sensing associated with R7510 and R7520. No problems found with resistors or traces."}
{"post_id":64992,"thread_id":59988,"title":"820-3115 Fan Spins, no PPVCORE_S0_AXG_REG","user_id":682,"username":"2informaticos","post_date":"2020-09-10 19:05:59","message":"\"I need both of these signals to get PM_PCH_PWRGD.\"\nWhy did you assume this?\nPPVCORE_S0_AXG_REG only appears under high graphics load, like playing Youtube on full screen.\n\n\"PPVCORE_S0_CPU_REG is present, but low (~1.1V)\"\nToo high in fact!\nWhen board boots, should drop to 0.8V aprox.\n\nAny history fault available?\nDid you try one RAM module at a time on each slot?\nBe aware, this board may not work with PC3-8500; not sure however, better to test faster RAM.\nDo you get PLT_RESET_L?\n\nCheck all SPI Bus Termination resistors and traces.\nYou may need to try known good working (clean ME) BIOS too."}
{"post_id":65001,"thread_id":59988,"title":"820-3115 Fan Spins, no PPVCORE_S0_AXG_REG","user_id":27551,"username":"awbower","post_date":"2020-09-10 21:58:02","message":"\"I need both of these signals to get PM_PCH_PWRGD.\" \n\nIt turns out you are right. I will explain how I know in a moment. However, please take a look at pg. 3 on the schematic. Step 27. There is an AND gate with CPUIMVP_PGOOD on one side and CPUIMVP_AXG_PGOOD plus some other PGOOD signals on the other. If all those signals are present, PM_PCH_PWRGD comes out the other side. Am I reading that correctly? \n\nStrangely, the schematic seems to contradict itself. At the bottom of pg. 24 it looks like you can get PM_PCH_SYS_PWROK with just CPUIMVP_PGOOD and ALL_SYS_PWRGD. Also worth noting:  PM_PCH_PWRGD mentioned on pg. 3 step 27 does not appear anywhere else in the schematic. It seems like they changed the name on pg. 24 to PM_PCH_SYS_PWROK. \n\nOn this board, ISL 6259 was blown. After I replaced this chip, the board powers on most of the time. However, occasionally i do lose fan spin and green light on charger. I replaced SMC to try to fix that but it still sometimes happens. \n\nI was spending my time trying to get CPUIMVP_AXG_PGOOD and didn't even test for boot. It turns out that when the fan does spin, it actually does boot. Any suggestions on why it is unstable and sometimes not power on?"}
{"post_id":65018,"thread_id":59988,"title":"820-3115 Fan Spins, no PPVCORE_S0_AXG_REG","user_id":682,"username":"2informaticos","post_date":"2020-09-11 07:05:05","message":"Need to know what happens with PPBUS_G3H and 3V42_G3H when board doesn't turn on, as you also lose Magsafe light at that moment.\nAlso monitor SMC_RESET_L.\n\nBattery is charging?\nDoesn't turn on even if battery is connected?"}
{"post_id":65031,"thread_id":59988,"title":"820-3115 Fan Spins, no PPVCORE_S0_AXG_REG","user_id":27551,"username":"awbower","post_date":"2020-09-11 12:28:30","message":"PPBUS_G3H, 3V42_G3H and SMC_RESET_L were all present when it wouldn't turn on. I got the computer running and ran MRI. CPU Core PECI (temp sensor) failed test. It read -127. This sensor works on a data line that goes between the SMC, CPU and PCH. It is associated with Q5050. I replaced Q5050 and checked all the resistors and traces associated with it. Problem remains. \n\nGiven the occasional loss of green light and failed sensor associated with SMC, would it be wise to replace the SMC at this point?"}
{"post_id":65039,"thread_id":59988,"title":"820-3115 Fan Spins, no PPVCORE_S0_AXG_REG","user_id":682,"username":"2informaticos","post_date":"2020-09-11 19:07:59","message":"Check voltage and diode mode on SCL\/SDA lines of that I2C bus.\nBe sure R5260\/61 are good.\n\nRun HWMonitor and look for strange values related with U5511."}
{"post_id":65049,"thread_id":59988,"title":"820-3115 Fan Spins, no PPVCORE_S0_AXG_REG","user_id":27551,"username":"awbower","post_date":"2020-09-12 01:38:48","message":"SMBUS_SMC_1_S0_SCL  and SMBUS_SMC_1_S0_SDA both are at 3.3V. R5260 and R5261 both read 4kOhms. Both signal lines are showing about 0,54V to ground. Everything seems ok here. \n\nWhen I ran MRI the temp readings on Fin Stack, CPU Proximity and Memory Proximity were all normal (between 26-32C). U5511 seems like it's doing its job."}
{"post_id":65070,"thread_id":59988,"title":"820-3115 Fan Spins, no PPVCORE_S0_AXG_REG","user_id":682,"username":"2informaticos","post_date":"2020-09-12 09:34:18","message":"SMC reads CPU core temp directly from CPU.\nIf U5511 does not interfere, then should be a problem with the CPU."}
