[
    {
        "post_id":96472,
        "thread_id":63575,
        "title":"820-3435-A advice needed for troubleshooting",
        "user_id":44922,
        "username":"Max7",
        "post_date":"2023-02-08 10:18:36",
        "message":"Hello,\n\n820-3435-A arrived with water damage. The water ingress indicator near J8300 is red. Two pins on J8300 corroded (disappeared) and I found some mild corrosion at Q7706 area. The latter was minimal and looks alright after cleaning with IPA. Two pins missing are pin 3 and 4. Both are PPHV pins feeding the backlight, so perhaps too much of a coincidence that these two are gone.\n\nJ8300 probably needs replacing but I am trying to establish if the rest of the board is ok before I embark on this journey.\n\nI am not paying much attention to Q7706 area at the moment as I suppose it is mostly backlight related and we seem to be far away from turning on the backlight.\n\nU5611 has some minor corrosion, pins, pads and solder look good.\n\nUpon connecting to the power supply (no SSD, no wireless, no flex cable), the board switches 3 times between 450mA and 21mA and then settles around 520mA. Fan starts normally but ends up at full spin perhaps due to the flex cable being missing. CPU warms up slightly.\n\nPLT_RESET_L is high at 3.3v\nPPVCC_S0_CPU is at 1.3v (is this too low) ? This makes me think that the board reaches S0 state successfully.\n\nThere is no USB activity after 15-20s.\n\nWhat would be your recommendation to check next trying to establish if any other issues exist other than the corroded screen connector?\n\nThanks"
    },
    {
        "post_id":96484,
        "thread_id":63575,
        "title":"820-3435-A advice needed for troubleshooting",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-02-08 13:16:44",
        "message":"Check all SPI Bus Series Termination resistors and their traces.\nInspect J6100 for corrosion.\nCheck if all voltages from pages 11 & 56 are present.\n\nPossibly accumulated crap underneath PCH\/CPU.\nYou may try heating with quality flux.\n\nBTW, this board restarts 3 times as normal behavior.\nFan goes high, if trackpad is not connected."
    }
]