[
    {
        "post_id":22043,
        "thread_id":22043,
        "title":"820-2879-B - PM_SLP4_L goes briefly low after 10 seconds and come back and stay high",
        "user_id":296,
        "username":"jadao",
        "post_date":"2017-06-21 13:28:53",
        "message":"Not really busy, so I decided to check this old board witch was sitting there since 2 years.\n\nInitial issue (2 years ago): Kernel panic crash and restart so the board have been tossed away.\n\nNow (2 years later) I plug in the magsafe, the fan spins, each time after exactly 10 seconds it stops briefly and restart. When the fan restarts spinning it doesn't cycle anymore it stays  on all the way (is it now crashing before even booting?)\n\nGreen light ok pp3v42 = 3.42V stable\nResistance to ground on pp3v42_g3h: 93K\nPPBUS_G3H 12.57V stable\nCharger and battery Sensing resistor measure good between ISL6259 pin 17-18 (3ohms) and 27-28 (20ohms)\nS5 rails stable.\nPM_SLP_S4_L goes to 0V briefly after 10seconds (at the same time when the fan cycle) so all S3 S4 S0 rails and ALL_SYS_PWRGD cycle also once after 10sec and they come back.\n\nI have PPVCORE_S0_MCP  0.9V and it goes to 0v when it hangs and come back to 0.9V when it restart. Same thing with PPVCORE_S0_CPU.\nRed light on USB mouse appear only four times: when I press power on button, when fan starts, again when fan stops 1 sec and finally when fans restarts.\nNo missing ram beep when ram stick removed.\n\nNo idea what else I can check, thanks."
    },
    {
        "post_id":22064,
        "thread_id":22043,
        "title":"820-2879-B - PM_SLP4_L goes briefly low after 10 seconds and come back and stay high",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-06-21 14:32:25",
        "message":"Yeah, look for the components that got knocked off with it being in a pile for 2 years. After that you will still be back to a crashing board which is not fixable. Trash....."
    },
    {
        "post_id":22071,
        "thread_id":22043,
        "title":"820-2879-B - PM_SLP4_L goes briefly low after 10 seconds and come back and stay high",
        "user_id":296,
        "username":"jadao",
        "post_date":"2017-06-21 15:15:32",
        "message":"I was just curious if I was missing any basic\/obvious step.\nSorry for my english by saying \"tossed\" well I meant \"discarded\" really properly.\nI made a deep visual inspection and nothing is missing, no water damage.\nI will use it as a donnour for another 820-2879.\nthanks"
    }
]