{"post_id":50847,"thread_id":50847,"title":"U8900 removal  820-3332_A","user_id":5368,"username":"tjxkeith","post_date":"2019-07-19 06:08:10","message":"Hi I am new to this but have had successes with older boards. This time is my first attempt at a retina board. I have managed to get most of the equipment Louis recommends including the Quick hot air station.\n\nI-have tried to remove the U8900 using the quick with a range of nozzles straight and bent at different settings but the chip wont budge. I thought this may be due to the heat sink on the other side sucking up the heat from chips ground plane as one of the securing screw is very close to the chip. I have removed heat sink and it still wont come off.\nI have removed a a similar package chip from a different board and it came off fine. Unfortunately I don't have a donor board to try removal on.\n\nAny sugestion would be appreciated Thanks"}
{"post_id":50848,"thread_id":50847,"title":"U8900 removal  820-3332_A","user_id":682,"username":"2informaticos","post_date":"2019-07-19 07:10:29","message":"You must practice more on scrap boards.\nAir nozzle shouldn't be too small, nor even the biggest one.\nYou should play with air flow\/temp settings.\n\nALWAYS remove heatsink when you use hot air station.\nAnd put flux around the chip."}
{"post_id":50851,"thread_id":50847,"title":"U8900 removal  820-3332_A","user_id":1153,"username":"JohnB8812","post_date":"2019-07-19 08:12:29","message":"1. You do NOT have to remove U8900 only resolder it.\n\n2. My guess is not enough hear\/airflow. What do you have your Quick set to?"}
{"post_id":50857,"thread_id":50847,"title":"U8900 removal  820-3332_A","user_id":5368,"username":"tjxkeith","post_date":"2019-07-19 13:19:43","message":"Thanks I have not had any issues removing similar packages on older logic boards thats why I was surprised it didn't want come off. tried temps from 350 to 500 and various flow rates on the quick."}
{"post_id":50858,"thread_id":50847,"title":"U8900 removal  820-3332_A","user_id":5368,"username":"tjxkeith","post_date":"2019-07-19 13:23:59","message":"Replacing U8900 as when i attempted to resolder it, I bridged 2 pins which i wicked clear but meter showed a short. Thought this would be safer than applying power and damaging the video chip."}
{"post_id":51482,"thread_id":50847,"title":"U8900 removal  820-3332_A","user_id":5368,"username":"tjxkeith","post_date":"2019-08-17 06:02:05","message":"Turned out my Quick hot air temp was improved when I calibrated it."}
