[
    {
        "post_id":72741,
        "thread_id":60896,
        "title":"00165 won't load macOS after liquid damage",
        "user_id":14193,
        "username":"daniel_andrei1996",
        "post_date":"2021-03-08 04:55:42",
        "message":"Hi!\n\nI've got a 00165 board which got liquid damaged. I've  [URL='https:\/\/drive.google.com\/drive\/folders\/1RBxhlv06pLKP2YhhDWZkPxxgXmFmbPIg?usp=sharing']attached [\/URL]screenshots of the main places I found corrosion\nThing is, after cleaning up the corrosion in these areas and putting the board through ultrasonic, it power up just fine but will crash when loading macOS, showing a black screen with the backlight still on for a while before shutting down completely\nUnfortunately, in verbose mode it seems to crash right when switching from the wall of text to the Apple logo, so I don't really get any useful info from that.\nI've tried flashing a clean BIOS, and even replacing the SMC from another 00165 board, but I get the same exact behaviour.\nFunny enough, when booting High Sierra I never get to the login screen, whereas on Catalina it seems to sometimes get to the login screen or desktop and then crash a minute later.\n\nAt first I thought this might be an iGPU problem, but I installed Windows, including the Intel HD6000 driver from Windows update, and I can run Heaven for long times without a single crash.\nI've also completed multiple runs of memtest86 without any errors. \n\nKind of running out of ideas on this one after checking it over for a few days, so would love to know if anyone has some advice?\n\nThank you"
    },
    {
        "post_id":72746,
        "thread_id":60896,
        "title":"00165 won't load macOS after liquid damage",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-03-08 07:26:03",
        "message":"Did you try SMC bypass and safe mode?\nAlso test booting USB preinstalled macOS."
    },
    {
        "post_id":72752,
        "thread_id":60896,
        "title":"00165 won't load macOS after liquid damage",
        "user_id":14193,
        "username":"daniel_andrei1996",
        "post_date":"2021-03-08 07:57:28",
        "message":"Tried SMC bypass and get the same thing, will try safe mode\nI've been testing with my external macOS SSD but it does the same with a known good internal drive"
    },
    {
        "post_id":72761,
        "thread_id":60896,
        "title":"00165 won't load macOS after liquid damage",
        "user_id":14193,
        "username":"daniel_andrei1996",
        "post_date":"2021-03-08 11:17:03",
        "message":"Got the same behaviour when booting in safe mode(shift held down)\nLaptop will show apple logo and loading bar but eventually go to a black screen with backlight still on, then later powers off completely.\n\nAny way that I can find some sort of log of what is happening? Again, laptop crashes after verbose boot changes to apple logo which is no help\n\nThanks"
    },
    {
        "post_id":72764,
        "thread_id":60896,
        "title":"00165 won't load macOS after liquid damage",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-03-08 11:37:42",
        "message":"I had similar problem with 3437 and 00165 nproblem; not fixed.\nThere is something wrong with Intel Management Engine.\nMay need to change CPU."
    }
]