{"post_id":68009,"thread_id":60348,"title":"2936 static screen after boot","user_id":26621,"username":"grmacs","post_date":"2020-11-17 14:45:41","message":"According to customer this 2010\/1 MBP 13 started going to a static screen after booting and then if it's still warm comes back almost immediately. Basically reason for this starting is unknown. Customer has been using for last year. Usually after the static screen appears the mac will shut down (approximately 30 seconds to minute after static appears). There is a decent dent in frame near mini-display connector. Underside of board was a bit dirty but no signs of liquid.\n\nI'm able to run it with the lid closed and external while taxing the GPU\/CPU with no issues. As soon as you open the screen it will then get static on the screen again and shut down.\n\nLVDS connector looks good but I did resolder it and check for shorts to be sure. Nothing noticeable on the board. Tried a different display\/cable and exact same issue.\n\nI'm looking at replacing the lvds connector. The signal lines look to go straight to U1800 so I'm guessing that is most likely where the issue is unless anything else might cause the interference?"}
{"post_id":68014,"thread_id":60348,"title":"2936 static screen after boot","user_id":682,"username":"2informaticos","post_date":"2020-11-17 17:11:42","message":"Disconnect internal LCD and check what happens on external monitor."}
{"post_id":68043,"thread_id":60348,"title":"2936 static screen after boot","user_id":26621,"username":"grmacs","post_date":"2020-11-18 07:52:22","message":"Stays running with internal disconnected and external display is good - appears to be same as results of running with lid closed."}
{"post_id":68053,"thread_id":60348,"title":"2936 static screen after boot","user_id":26621,"username":"grmacs","post_date":"2020-11-18 13:56:08","message":"I believe this may have been resolved with new bios. I'm not sure why, but everytime I reflash BIOS it turns into multiple hours. I must have unsoldered and flashed and resoldered the chip 3 times. Apparently something wrong with my BIOS files I'm getting, process of reading, clean ME, reflashing was working but things like wifi quit working. Some of the downloads I went after were wrong file size. Originally I pulled the chip and clean ME, everything worked well, file the same size as it was when I started. erase\/write\/verify>soldered it on and the board wouldn't even boot. Mind boggling. \n\nAnyway, now I'm having to reinstall high sierra on the machine to update the firmware as the customers drive was AFPS. OY!"}
{"post_id":68076,"thread_id":60348,"title":"2936 static screen after boot","user_id":26621,"username":"grmacs","post_date":"2020-11-18 20:18:06","message":"bios did not solve it ultimately. Very strange issue... it didn't come back until after I upgraded the firmware for High Sierra+ OS. Not sure if that is related or if the newer OS exacerbates a different issue.\n\nCurrently got it going by swapping Ram. Totally missed this before but RAM that was installed was 12800 NOT 10600. It doesnt give the 3 beeps regardless of what's in it.\n\nI can't believe a RAM issue could affect internal screen only?! I'm assuming the problem has temporarily disappeared and not related but it makes some sense that the firmware could bring the issue to light because firmware determines ram speed correct?"}
{"post_id":68503,"thread_id":60348,"title":"2936 static screen after boot","user_id":26621,"username":"grmacs","post_date":"2020-11-28 07:53:44","message":"AFter testing this thing and letting it run 12 plus hours with graphics benchmarking and cpu taxing, I released to customer. A week later the problem returned. I'm guessing this is GPU related... but any other thoughts?"}
{"post_id":68510,"thread_id":60348,"title":"2936 static screen after boot","user_id":682,"username":"2informaticos","post_date":"2020-11-28 11:48:04","message":"Could be CPU, but test it first with only one DDR module, each slot separately."}
{"post_id":68659,"thread_id":60348,"title":"2936 static screen after boot","user_id":26621,"username":"grmacs","post_date":"2020-12-02 08:38:33","message":"Tested both slots and have issue reoccur at both separately.\nReflowed dirty area below PCH. Cleaned board and dried and now starts no Boot. All rails present from power aliases page. no USB activity, no display, no chime\n\nI can try reflashing the bios but that was done once."}
{"post_id":68690,"thread_id":60348,"title":"2936 static screen after boot","user_id":682,"username":"2informaticos","post_date":"2020-12-02 18:03:54","message":"Something reacted to heat.\nPCH may be dead now, or damaged balls underneath."}
