{"post_id":28155,"thread_id":28155,"title":"2015 MBPr Models, Question About External Video","user_id":515,"username":"SMMRepair","post_date":"2017-11-17 11:35:44","message":"I've seen my fair share of 2015 13\"\/15\" models with bad displays. No liquid, just failed display assembly, as seems to be more common with the 2015 models. I got another one in today, and I get the same question from all my customers with 2015 models that end up having bad displays: \"Well if the display is bad, how come external video also doesn't work?\".\n\nWhat is the best answer for me to give them? I remember reading in a few threads here over the past year, that the 2015 models handle external video different on-boot; that they typically do not output external video during-boot unless the internal LCD assembly cable is unplugged. I've noticed this behavior before, but can't recall *exactly* why this is the case.\n\nCan someone please explain the exact issue with regards to 2015 units not outputting external video when the internal display\/panel fails? I've already confirmed this board works perfectly in our own test-assembly, so it's definitely just a bad panel, but I'd like to explain better to customers why this usual test (external video) is not a reliable test for 2015 models.\n\nThanks in advance!"}
{"post_id":28164,"thread_id":28155,"title":"2015 MBPr Models, Question About External Video","user_id":2,"username":"dukefawks","post_date":"2017-11-17 13:52:45","message":"It can also be the cable, have had that a few times so try that first. I didn't make the video BIOS, but somehow it needs to \"see\" an LCD to enable the external output."}
{"post_id":28167,"thread_id":28155,"title":"2015 MBPr Models, Question About External Video","user_id":515,"username":"SMMRepair","post_date":"2017-11-17 14:12:48","message":"Thanks, Duke. Yeah, I've tried the cable on several and it was never the cable for me (on ~20 units), so I stopped wasting the time. Have you noticed any unique symptoms between a bad cable and a bad panel, or do both simply manifest in a \"dead\" display (no backlight or video data)? It would be great to look for \"hints\" as to a bad cable versus a bad panel. We don't refurbish display assemblies, so if the customer wants to take the time to try a new cable, they can do that. Most of my customers are retail-level shops (not end-users), so we'll advise and they can spend the time doing that part while we focus on board repairs. I just got tired of that question, as if they don't believe our diagnoses.\n\nGood to know that my logic was correct, though; what I've been telling customers is that because of the issue with the EDID (be it cable, panel, etc), the unit does not even enable external video. Until the EDID is resolved (one way or another--either by no display being connected and cable unplugged, or by a working display being connected), there will be no external video. This is why it works when a functioning display is connected and also when no display is connected, but NOT when a bad display\/assembly is connected. I figured that's how it worked, but wanted confirmation, as I've told ~10 people this at this point.\n\nThanks Duke!"}
{"post_id":28174,"thread_id":28155,"title":"2015 MBPr Models, Question About External Video","user_id":2,"username":"dukefawks","post_date":"2017-11-17 17:22:16","message":"And in most cases it IS liquid damage to the LCD. It runs down the LCD into the hinge cover and onto the PCB."}
