[
    {
        "post_id":51837,
        "thread_id":51837,
        "title":"820-00045 Dead CPU?",
        "user_id":1464,
        "username":"Bouba148",
        "post_date":"2019-08-29 16:32:14",
        "message":"No History and NO no sign of Water Damage\n\nPPBUS_G3H:  8.59V\nPPVBUS_E85:  14.4V\nPPDCIN_G3H: 14.35V as I can also see it on the USB C Tester with the display ( I have 14.8V but Not pulling Current, 0A )\nPP3V3_G3H: 3.302V\nPP3V3R3V0_AON: 3.229V\nPPVRTC_G3H: 3.296\nPP5V_G3H_LDO: 4.996V\n[B]PP5V_S4: 5.016V[\/B]\n\nPP3V3_S5: 3.302V\nPP3V3_SUS: 3.302V\n[B]PP3V3_S4:  0V[\/B]\n\nPM_SLP_S5_L: 0V     \n\nPCH_RTCRST_L:  3.290V\nPCH_SRTCRST_L:  3.0293V\nPCH_INTRUDER_L: 3.026V\n[B]PCH_INTVRMEN: 0V[\/B]   R1302: 336 KOhms  OK\n\ntriggered  SMC_ONOFF_L and checked PM_SLP_S3_L, PM_SLP_S4_L and PM_SLP_S5_L  not pulsing\n\n\nI've had PP3V3_S4 and PM_SLP_S5_L both present after taking out the board out the chassis ( disconnected from battery ),    and mesured the next rails ( S0 all not OK ).\nAfter what I've unplugged the charger and replugged since then back to no PP3V3_S4 .\n\nI've seen another member having this same issue, but he never answer\n\nNow I have all S0 state rails but the board is getting very hot around U0500 and of course no sign of life ( no boing sound when plugging charger, no display etc....)\nMy guess is that this board is part of the many which have Dead CPU......\nI'm wondering how is it possible to pay a such expensive price for hardware having this kind of failure after only 2 years old?\nThat me think that Apple is doing that on purpose  just to sell more  garbage around the world for gold price. Why people don't do class action for this case.\n\nI'm tempted to reflow the CPU just like that for fun .....after all"
    },
    {
        "post_id":51838,
        "thread_id":51837,
        "title":"820-00045 Dead CPU?",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-08-29 17:40:15",
        "message":"You mix the information and is dificil to follow you.\nMentioned missing PCH_INTVRMEN, 5V_S4 present and missing 3V3_S4..\nThen S0 voltages present too.\nWhich is the actual state of your board???\n\nHowever I don not recommend you to waste time on it.\nAll these boards end with dead CPU.\nApple didn't put a fan for some reason; machine will not last too much after warranty ends.\nIf you really have time to spend, try to reflow entire board on IR oven."
    },
    {
        "post_id":51851,
        "thread_id":51837,
        "title":"820-00045 Dead CPU?",
        "user_id":1464,
        "username":"Bouba148",
        "post_date":"2019-08-30 00:53:49",
        "message":"Again Thank you for your answer.....\nFirst I've noticed that I didn't had the 3v3_S4 but 5V_S5 was OK: This was with the board having the battery connected\nWithoiut battery it goes to S0 state with CPU heating.....\nI've also tried to connect those USB C adapter with normal usb to see if an optical mouse lights ON: No Light"
    },
    {
        "post_id":51861,
        "thread_id":51837,
        "title":"820-00045 Dead CPU?",
        "user_id":1464,
        "username":"Bouba148",
        "post_date":"2019-08-30 04:07:45",
        "message":"Hi 2Informaticos,\nI've noticed that the PRam aera was corrupted when I read it whith the Medusa,so I've wrote a complete clean dump, injected the Fsys area and did a CRC.\nwhich didn't solved my issue but it was necessary.\nThen I did a reflow with my Quick 861DW air station at 430 deg and 90 L per minutes air flow\nThe machine turns ON now, charges and displays OS loggon screen......\n\nYou can set the topic as solved.\n\nAs we know I will not trust this fix, as I could come back in after 2 days or 2 yeards who knows.......that remind me XBox 360 issues......\n\nThanks for your help\n\nBest Regards"
    }
]