{"post_id":58774,"thread_id":58774,"title":"A1534 820-00045-a USB-C charger only works in one direction","user_id":24780,"username":"bradinboise","post_date":"2020-04-24 20:06:24","message":"Hello all,\n\nThis unit came to me with no power showing on the USB-C voltage meter, not even the 5v you normally see on these units. So ended up finding a bad power board DC jack. Replaced it.\n\nNow it will start and charge just fine but will only charge with the charger cable in only one direction. Flip the charger cable and nothing. Will not even get 5v.\n\nExternal monitor and usb doggles all work the same way. They work great in one direction but flip the cable adapter and nothing works.\n\nNo liquid damage seen at all. Very clean even. Not much dust at all.\n\nNot sure what direction to go with this one. Thanks ahead for your help."}
{"post_id":58776,"thread_id":58774,"title":"A1534 820-00045-a USB-C charger only works in one direction","user_id":682,"username":"2informaticos","post_date":"2020-04-25 03:22:57","message":"Change U4700, as it fails a lot on these boards."}
{"post_id":58782,"thread_id":58774,"title":"A1534 820-00045-a USB-C charger only works in one direction","user_id":24780,"username":"bradinboise","post_date":"2020-04-25 13:49:34","message":"Right on! Of course.\n\nReplaced U4700 and now have power in both directions.\n\nFor those out there that might run into this, before I did what 2informaticos suggested, I wanted to eliminate any other capacitors causing the issue I was having. I check both E85_CC1 and E85_CC2 for either opens or short to ground via using diode mode coming out of U4700. I'm only guessing here, but since it says \"bi\" in the schematic I think that means bi-directional communication somehow getting back to the power adapter to turn on. Since I was only getting power in one direction.\n\nAnd sure enough E85_CC1 was shorted to ground. So to eliminate C4706 capacitor, I removed it 1st before I replaced the U4700. Short was still there, and then removed U4700 and double checked E85_CC1 pin at the capacitor and the short was gone! Just like 2informaticos said. U4700 was bad. I only had one of these in stock so I wanted to make sure I didn't fry a U4700 chip. Time to order another one from Rossmann Group store!!\n\nThanks again for the information and help. I hope this will help someone else if needed!"}
{"post_id":58783,"thread_id":58774,"title":"A1534 820-00045-a USB-C charger only works in one direction","user_id":682,"username":"2informaticos","post_date":"2020-04-25 18:32:39","message":"Glad to hear you solved it.\n\nBTW, I didn't see you open the thread as new member, welcome to the forum!"}
