[
    {
        "post_id":48568,
        "thread_id":48568,
        "title":"820-00239 no keyboard after Touchbar swap",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2019-04-23 03:56:38",
        "message":"Hello,\nthis 820-00239 had water spilled on it and was dead. I cleaned sone minor corrosion and it worked again except the touchbar. It showed everything fine on the OLED but touch was not working. The cable to J4402 was burned. So i ordered a new Touchbar and replaced the entire Touchbar LCD and Touch unit.\nNow i am really confused as the device works fine (Touchbar still showing everything and now registerung touch aswell) but the internal Keyboard is not working at all. Not pre OS and also not in the OS. Non of the keys - not even Caps-Lock lights up. With external keyboard it works fine. I have no keyboard to test it but i also dont think that i killed the keyboard as i would expect some keyrows to fail if i heated it to much or something. To get the touchbar out i disassembeled everything and put the case on a heatpad set to 75?C max.\nI dont know where to start with this..."
    },
    {
        "post_id":48569,
        "thread_id":48568,
        "title":"820-00239 no keyboard after Touchbar swap",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-04-23 05:20:42",
        "message":"Does the trackpad work?\nIf yes, the problem is on the keyboard electronic circuitry.\nOn the MLB is nothing special for keyboard, apart of traces between J4500\/01."
    },
    {
        "post_id":48576,
        "thread_id":48568,
        "title":"820-00239 no keyboard after Touchbar swap",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2019-04-23 05:54:03",
        "message":"Trackpad works perfektly fine.\nSo the keyboard itshelf is dead as the ekectronics on it cant really be fixed?\nFans work normally though.\nIs it changable on these newer models same way as on the 2015+ AIR\/PRO models? I never changed just the keyboard on these..."
    },
    {
        "post_id":48579,
        "thread_id":48568,
        "title":"820-00239 no keyboard after Touchbar swap",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-04-23 09:03:01",
        "message":"Check the flex and connections on the embedded electronics from keyboard."
    },
    {
        "post_id":48584,
        "thread_id":48568,
        "title":"820-00239 no keyboard after Touchbar swap",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2019-04-24 01:46:29",
        "message":"Thank you for the answer. I did not know that there are only traces on the MLB, no intelligence. I guess thats why these keyboards are so expensive. I checked the traces on the MLB and noticed a few loose pins at J4500 even it looks fine and even i checked it after i cleaned the corrosion at the beginning (There was not really corrosion at J4501...). So i fixed those and everything works fine now."
    }
]