[
    {
        "post_id":19910,
        "thread_id":19910,
        "title":"Success Stories - 820-2850 AND 820-2936",
        "user_id":517,
        "username":"vaswaniraj",
        "post_date":"2017-05-08 15:31:08",
        "message":"Hi Louis \/ Duke and the entire Rossmann group,\n\nI would like to share 2 of my success stories with you guys.  Last week I had 2 computers which were dead.  \n\nI watched a couple of videos of Louis on the one wire circuit and very patiently and using brains went ahead with the 820-2850 checking voltages and then later I found out the U7000 was getting very hot, which I replaced and the computer came on.  I pulled out a U7000 from a donor board and put it on this board.  The only challenge in this board now I am facing is that it does not detect the battery.  So I was thinking if the U7000 has not be placed correctly that would cause the problem.  I am still watching some of Louis videos to troubleshoot why the battery is not been detected by the system.  Will do some analysis and thinking and will report back on this forum.\n\nIn reference to the 820-2936 the troubleshooting was easy because the U6901 was heavily corroded and was not getting PP3V42 on Pin 5 and also on Pin 1 and 2.  Replaced that and the computer came on normal.\n\nLouis thanks for your videos.  Today after fixing 2 boards by watching your videos feel really delighted.  Thanks for the same.\n\nI don't like to troll anyone, but just that sometimes customers pressure tends to get me to the forum and ask questions, not thinking further.  \n\nThanks once again.  Will keep posting my success stories and if any questions that I feel are not solvable by me.\n\nBye for now.\n\nRaj."
    },
    {
        "post_id":19916,
        "thread_id":19910,
        "title":"Success Stories - 820-2850 AND 820-2936",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-05-08 16:07:07",
        "message":"2850 will be a dead SMC."
    },
    {
        "post_id":19924,
        "thread_id":19910,
        "title":"Success Stories - 820-2850 AND 820-2936",
        "user_id":517,
        "username":"vaswaniraj",
        "post_date":"2017-05-08 18:00:56",
        "message":"[USER=\"2\"]dukefawks[\/USER] You are senior in this field, so may be you are correct.  But I think if the SMC is dead then the computer would not turn on.  But in my case the computer is coming on only when connected by magsafe adapter and the battery is showing a X mark.  So I think it has do do something with the data lines.  I will do more study and get back to you.  Thanks.  Raj."
    },
    {
        "post_id":19926,
        "thread_id":19910,
        "title":"Success Stories - 820-2850 AND 820-2936",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-05-08 18:36:44",
        "message":"Seems like you know what you are talking about, good luck."
    }
]