{"post_id":43876,"thread_id":43876,"title":"820-4924 Screen flashing green and pink as it boots.","user_id":135,"username":"bjf","post_date":"2018-12-21 23:31:37","message":"Any ideas about this? It appears to be a simple screen issue, but it's weird because the screen worked perfectly until I switched it to another computer. After that it did this. I changed the LCD cable. No change. And the screen that was previously on this computer worked fine and still works fine with the new computer it's on."}
{"post_id":43884,"thread_id":43876,"title":"820-4924 Screen flashing green and pink as it boots.","user_id":1495,"username":"PPVCC_S0_CPU","post_date":"2018-12-22 00:03:10","message":"Check lcd connector under microscope, i encountered same problem recently and it was corrosion on connector"}
{"post_id":43885,"thread_id":43876,"title":"820-4924 Screen flashing green and pink as it boots.","user_id":682,"username":"2informaticos","post_date":"2018-12-22 02:03:22","message":"Also look for knocked off components near LCD connector.\nCheck FL8300-03."}
{"post_id":43890,"thread_id":43876,"title":"820-4924 Screen flashing green and pink as it boots.","user_id":135,"username":"bjf","post_date":"2018-12-22 03:30:04","message":"Thanks for the tips, that helps, it's just a signal issue getting to the screen if I can find where the fault is. I did some more testing and both boards work fine with the good screen and both boards do the pink and green thing with the bad screen. After putting the bad screen back on it's original computer, it doesn't work on that one either anymore. Same thing, green and pink. Initially, this computer was tested and used for a while and the screen only failed after being swapped. It's hard to understand especially after replacing the LCD cable and having the same issue. I pulled apart the screen too and couldn't find anything wrong. The last thing I can think of is to look at the connector again on the screen. It's clean, but maybe I'm missing something."}
