{"post_id":9915,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":517,"username":"vaswaniraj","post_date":"2016-11-18 20:27:20","message":"Hi Guys,\nToday I received a Macbook Air 13\" which is not coming on.  I checked the power rails and found out that the PPBUS_G3H is showing .OL on the multimeter.  Now here is what I did.  I measured every component where PPBUS_G3H should be present, and it measured as .OL.  I understand that .OL means short to ground.  Am I correct in saying that ?  How do I troubleshoot it further and make the computer work.  Please advice.  Raj."}
{"post_id":9922,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":36,"username":"aprendiz","post_date":"2016-11-18 21:05:49","message":"Wrong, OL means Open Line...........\n\nVoltage on PPBUS_G3H??\nDo you have green\/ Orange light??"}
{"post_id":9923,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":517,"username":"vaswaniraj","post_date":"2016-11-18 21:07:50","message":"Louis, Ok here is what I am doing.  I plugged in the charger and I go on the schematic page to see all the power rails.   The first power rail I see is PPBUS_G3H.  I go to the board view by Landrex and under \"Net\" put in PPBUS_G3H, where the board view software point out all the components that has PPBUS_G3H.  I put my black probe on the ground and the RED probe on the component that shows PPBUS_G3H.  For eg. the board view software pointed on on C3080 and R3080 as one of the few components and C3080 it says there is PPBUS_G3H where i put the RED probe on the Pin 1 and the multimeter reads .OL.  I need further help.  Please advice.  Raj."}
{"post_id":9925,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":517,"username":"vaswaniraj","post_date":"2016-11-18 21:12:25","message":"[USER=\"36\"]aprendiz[\/USER].  The voltage on PPBUS_G3H is showing .OL.  I have my charger plugged in and it is giving me an orange light.  The battery is not connected to the Logic Board."}
{"post_id":9926,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":36,"username":"aprendiz","post_date":"2016-11-18 21:14:09","message":"Well, im not Louis but anyway.........\n\n​​​​​​​i'm asking voltage measurements, i guess you are measuring in resistance mode...."}
{"post_id":9928,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":517,"username":"vaswaniraj","post_date":"2016-11-18 21:20:40","message":"I replied your question as [USER=\"36\"]aprendiz[\/USER].  Louis is online and he asked me some questions, which I responded as mentioning Hi Louis.  Anyways.  Now answer to your question.  I am measuring the above by putting in VDC mode.  Is that resistance mode ?  Raj."}
{"post_id":9964,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":289,"username":"smiba","post_date":"2016-11-19 06:02:35","message":"OL means Over Load, make sure your multimeter is set to a high enough value and is on Voltage.\n\nPPBUS_G3H should be about 12.6V"}
{"post_id":9972,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":517,"username":"vaswaniraj","post_date":"2016-11-19 13:53:00","message":"Hi Smiba,  My multimeter is an Auto Ranging Multimeter which ranges up to 600V 400mA MAX.  I am not getting PPBUS_G3H as 12.6V, when I put the multimeter in VDC mode and measure the component where PPBUS_G3H is present, I get OL and not 12.6V. I would highly appreciate if anyone can point out what is wrong I am going so that I can correct myself and learn.  Duke, Louis or anyone please help.  Regards, Raj."}
{"post_id":9973,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":2,"username":"dukefawks","post_date":"2016-11-19 14:28:00","message":"PP3V42 present?"}
{"post_id":10007,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":517,"username":"vaswaniraj","post_date":"2016-11-20 16:24:13","message":"Hi Duke, Yes PP3V42 is present. But when i measure the resistor and capacitors on the PP5V_S0 I am not getting 5V on PP5V_S0. Am I going in the right direction, Also on PP5V_S5 when I measure the resistor and capacitors (C7400) and Pin 12 on U7400 the multimeter shows up .OL. I believe that the 5V rails are missing and hence the board is not coming on. Please guide me if I am going in the right direction of troubleshooting. Louis has mentioned to me a couple of times that even if my diagnosis are wrong, I should speak up. I have mentioned in this window what my findings are. Duke \/ Louis - Correct me if I am wrong"}
{"post_id":10008,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":2,"username":"dukefawks","post_date":"2016-11-20 17:56:33","message":"First need PPBUS, what voltage is there? Green light ok?"}
{"post_id":10013,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":517,"username":"vaswaniraj","post_date":"2016-11-20 19:50:14","message":"Hi Duke, when I put my black probe to ground and the red probe to one of the capacitor where PPBUS_G3H should be present the multimeter shows OL. Actually that was my question initially. What is that I am missing to check. Also your question regarding charger light, yes the light is showing Orange because battery is not connected, but if battery is connected, as battery is 100% charged, the light is Green. Please advice. Raj."}
{"post_id":10017,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":2,"username":"dukefawks","post_date":"2016-11-20 21:54:58","message":"Resistance to GND on PPBUS?"}
{"post_id":10028,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":517,"username":"vaswaniraj","post_date":"2016-11-21 01:45:19","message":"Hi Duke, could you please explain me how to measure resistance to GND for PPBUS.  Sorry, this may be the most basic question that I may be asking, but I am being honest that I don't know how to measure resistance to GND.  Regards. RAJ."}
{"post_id":10029,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":2,"username":"dukefawks","post_date":"2016-11-21 03:41:16","message":"Meter on Ohms, black to GND and red to PPBUS. No power applied of course."}
{"post_id":10031,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":517,"username":"vaswaniraj","post_date":"2016-11-21 08:27:56","message":"Hi Duke,  As advised by not connecting the power and measuring the resistance to ground on PPBUS the multimeter does not show any change.  When multimeter is turned on into Ohms, it stays at OL and on measuring the components, R7006, R5501, Pin 4 of Q5500, Pin 2 of R5450 and R5430 there is no change in the multimeter reading and it continues to stay at OL.  Please advice further.  Basically what does OL mean ?  Smiba mentioned on the forum that it mean Overload, I was told by someone it means Open Line.  Please advice what is the correct way to interpret OL, and also further troubleshooting this problem.  Regards  Raj."}
{"post_id":10046,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":2,"username":"dukefawks","post_date":"2016-11-21 14:23:00","message":"I have no idea. Read the user manual for your multimeter on how to use this."}
{"post_id":10058,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":517,"username":"vaswaniraj","post_date":"2016-11-21 15:45:15","message":"Hi Duke,  Forget the multimeter, Basically what am I supposed to check when the meter in Ohms.  Let me get this straightened and then I can probably get you a better answer.  I see that the multimeter shows 3.42 volts on PP3V42_G3H.  If I have to check PPBUS, under Volt DC mode, what voltage should I get. Please advice."}
{"post_id":10061,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":2,"username":"dukefawks","post_date":"2016-11-21 16:36:42","message":"Around 8V, but you need to know if there is a short. Learn how to use a multimeter or just stop with this."}
{"post_id":10253,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":517,"username":"vaswaniraj","post_date":"2016-11-26 13:59:31","message":"Hi Duke and Rossmanngroup team,\n\nLet me start this again.  Please be patient with me.  Here is what I am doing and now you please advice me what is that I am doing wrong.  I am trying to put everything in step form.\n1.  Connect logic board to power.\n\n2.  Measure voltage on PP3V42_G3H - All are present.  I get 3.44 V on every component where PP3V42_G3H should be present.\n\n3.  Measure voltage on PPBUS_G3H - Keeping the power connected.  Touch the black probe on Ground ( a screw hole ) and Red probe on the component where PPBUS_G3H should be present.  NOW Here I read the voltage on the Multimeter and the screen reads .OL.  Every component wherever PPBUS_G3H should be present I get .OL.\n\nNow what does this indicate.  \n\nSecondly here is what i did as well.\n\nDisconnected the power adapter from the logic board.\n\nI put the multimeter in Diode mode ( arrow pointing to the right with a small straight line ) and then keeping the RED probe to the ground ( a screw hole ) and the black probe to the component where PPBUS_G3H should be present and the multimeter reads 0.115V.  \n\nDoes my working above make sense to you.  If not please advice me what is wrong I am doing so that I can correct myself.\n\nThanks and Regards,  Raj."}
{"post_id":10257,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":296,"username":"jadao","post_date":"2016-11-26 15:17:52","message":"Hi vaswaniraj,\nAre you sure your voltmeter mode is not set to a lower range? Something like 0-5V?\nAutorange? Check with a 9v battery and see if you still have OL."}
{"post_id":10258,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":517,"username":"vaswaniraj","post_date":"2016-11-26 16:20:22","message":"Hi Jadao, Yes you were correct.  My sincere apologies, I was not setting my range correctly.  Instead of setting it to 00.00, I was setting it to 0.000 due to which any component that I was measuring I was getting .OL.  \n\nOk so now PPBUS_G3H is present and PP3V42_G3H is also present.  \n\nFurther troubleshooting steps please.  I will be very honest, in my life I have never used a multimeter, I am sorry for the errors that I have doing so far.  But after this I know that I will not make this kind of error."}
{"post_id":10264,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":2,"username":"dukefawks","post_date":"2016-11-26 22:33:04","message":"So what is the voltage on PPBUS?"}
{"post_id":10273,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":517,"username":"vaswaniraj","post_date":"2016-11-27 06:04:50","message":"voltage on PPBUS 8.60V."}
{"post_id":10275,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":2,"username":"dukefawks","post_date":"2016-11-27 08:26:05","message":"Was this liquid damage?"}
{"post_id":10277,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":517,"username":"vaswaniraj","post_date":"2016-11-27 11:27:02","message":"Yes it was liquid damaged and the customer changed the keyboard and trackpad himself, after which it worked for almost 9 months and then it shut down on him."}
{"post_id":10278,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":2,"username":"dukefawks","post_date":"2016-11-27 12:26:12","message":"Voltage on L7560 and L7520? Did you check for corrosion around U6100 and U1950?"}
{"post_id":10324,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":517,"username":"vaswaniraj","post_date":"2016-11-28 09:21:24","message":"Hi Duke,  The voltage on L7560 = 3.33V\n\nThe voltage on L7520 = 0 V\n\nI don't see any corrosion around U6100 and neither on U1950.\n\nIs L7520 supposed to be 0V ?\n\nBecause from the schematics I see it, should have 5V.\n\nPlease advice."}
{"post_id":10327,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":2,"username":"dukefawks","post_date":"2016-11-28 10:06:27","message":"Check board for corrosion, it must be somewhere."}
{"post_id":10330,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":517,"username":"vaswaniraj","post_date":"2016-11-28 10:37:28","message":"Hi Duke,  I looked over the complete board, but I don't see any corrosion.  The only green corrosion is see is by the SD Card reader.  Some of the probe points I see are dark red, few are green and most are yellowish.  Would a ultrasonic clean help ?"}
{"post_id":10331,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":2,"username":"dukefawks","post_date":"2016-11-28 10:44:23","message":"Give it a clean, won't make it any worse."}
{"post_id":10332,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":517,"username":"vaswaniraj","post_date":"2016-11-28 10:56:52","message":"Ok let me try giving a ultrasonic clean.  Will get back to you.  \n\nAround how much time should i put it into the cleaner and at what temperature.\n\nPlease advice.\n\nRaj."}
{"post_id":10336,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":2,"username":"dukefawks","post_date":"2016-11-28 12:04:52","message":"I have no idea depends on which machine you have and what liquid you're using."}
{"post_id":10341,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":517,"username":"vaswaniraj","post_date":"2016-11-28 13:39:00","message":"I have Crest CP500D and I use Branson EC with Distilled water."}
{"post_id":10342,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":2,"username":"dukefawks","post_date":"2016-11-28 13:43:17","message":"5-7 minutes or something."}
{"post_id":10343,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":517,"username":"vaswaniraj","post_date":"2016-11-28 13:49:28","message":"Ok, Thanks Duke.  But troubleshooting wise you don't see anything wrong ?  I was watching one of the videos of Louis where he has mentioned that PP5V_S0 is not present and then the computer will not come on.  I checked the voltage on U8180 and it shows 0 ( Zero Volts )  Do you think I am going in the right direction ?  Please advice."}
{"post_id":10404,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":517,"username":"vaswaniraj","post_date":"2016-11-29 20:20:29","message":"Hi Duke \/ Louis,  I Ultrasonic the motherboard, the components are all clean and shiny, but still the fan does not spin. When I connect the logic power to the magsafe adapter, the light stays orange, but the fan does not come on. I checked the following rails and here are my findings.\n\nPPBUS_G3H         =     8.59 V\nPP3V42_G3H        =     3.33 V\nPP5V_S5               =     5.02 V\nPP5V_S0               =     0.00 V\nPP5V_S4RS3        =     0.00 V\nPPVRTC_G3H       =    3.33 V\nPPDCIN_G3H        =   16.51 V\nPPDCIN_G3H_ISOL    =   16.51 V\nPPDCIN_G3H              =    16.51 V\n\nFrom the above I see that I am missing the voltages on PP5V_S0 and PP5V_S4RS3.\n\nHow can I get the 5V on these power rails.\n\nIs it because of the 5V rails as mentioned above having 0 V the computer is not coming on and the fan is not spinning.\n\nCan you please help me with the further in troubleshooting.\n\nRegards,  Raj."}
{"post_id":10413,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":2,"username":"dukefawks","post_date":"2016-11-29 23:15:30","message":"Could be anything. The usual suspects are U6100 and the resistors in the data lines, U1950 especially pin 8 and U1900."}
{"post_id":10499,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":517,"username":"vaswaniraj","post_date":"2016-11-30 19:58:14","message":"Hi Duke,  As per your advice I checked all the resistors in the data lines and none of them are short to ground.  Where else should I look for troubleshooting.  I even tried to watch some of the videos of Louis in relation to 82-3437, but still am unable to solve the motherboard and make it turn on.  Please help me troubleshoot further.  Louis, your interference is required, if you don't mind.  Thanks  Raj."}
{"post_id":10506,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":84,"username":"jessa","post_date":"2016-11-30 21:39:36","message":"Raj--I get that you are trying desperately to learn, but WHAT THE FUCK!\nThis has got to be as frustrating for you as it is for everyone else to read. You are just guessing randomly and there is no logic here at all, or even basic common sense.\n\nFixing boards is learning to use logic, and combining that logic with tools to measure and rule out possible failures to arrive at the most likely failure. You need to learn analytical reasoning, then you need to really understand the tools and how to use them.\n\nOne of the core things that everyone who has ever diagnosed and fixed a board have in common is the ability to recognize when something doesn't make sense, and then go attempt to figure out why.\nHave you ever, on this or any other forum, EVER heard anyone reporting any voltage as \"OL\"? Neither have I. This is like someone asking \"How fast is your car going?\" And you say \"24 centimeters\"\nThis MUST jump out at you as totally wrong, if not, we can't help you. If you recognize that OL doesn't make sense for a voltage reading, logic says you ask yourself \"How do I set my multimeter up to read voltage, have I done it wrong?\" Then you read about your multimeter. You come up with a test--something that does have a voltage, like an AA battery, and you use your multimeter to measure that just to see if it gives the 1.5v answer that it should. If it does not, then study your multimeter until you figure out how to set it to read 1.5v when you put the probes on either side of a battery. If you can't, then you go to the hardware store and find one that does this simple task.\n\nNo one can help you grow in your ability to understand things for yourself if you can't be trusted to post accurate answers to the most basic multimeter questions.\nIf you say \"Yes I have 3.42 volts\" on one rail, but \"OL\" on another rail---showing that you don't know how to take a voltage reading, AND that you are not capable of recognizing this and figuring out on your own how to get your tools to work---then that means that our analytical reasoning of \"Can we solve the problem of teaching Raj to fix boards\" is going to look like this.\n\"Have you explained to Raj how to take a multimeter reading?\"\nYes\n\"Does he remember this?\"\n\"Not really\"\n\"Does he at least recognize that his readings don't make sense and something is wrong with his multimeter?\"\n\"No. Someone has to point it out to him.\"\n\"When someone points it out is he able to understand\"\n\"I think so, but I doubt he will remember in a month\"\n\"Ok, then it is 90% likely that Raj will never be able to fix boards and everyone answering his questions are wasting their time.\"\n\nYou are dangerously close to alienating everyone here who is willing to help you learn this.  \n\nFrom my perspective, I think you owe the group some ANSWERS instead of QUESTIONS in order to restore faith in the hope of others that you are in fact teachable.\nI posted a Homework question for you in PBRS group which you didn't answer.   So here are some more.\n\nHomework #1 Complete three pages of a game of Sudoku. It is a simple game of logic. Your primary difficulty is in mastering the basic skill of analytical reasoning.  When it doesn't come naturally, you have to work on it. Here's a link. [url]http:\/\/www.websudoku.com\/[\/url]\n\nHomework #2 Explain for me what the heck is the difference between computer \"sleep states\"  You HAVE to figure this out YOURSELF from the resources at your fingertips--Louis's videos and the internet.\n\nAnswer these correctly and I bet you can inspire Duke or Louis to stop automatically sending your messages to trash for a few days.\n1.) Is a rail labeled s5 the same as s0?  \n2.) Do they come on at the same time?  \n3.) Does one generate the other?  i.e Do s4 rails come from s3 rails or s5 rails?\n4.) Which would be more important to troubleshoot first---a missing s4 rail or a missing s0 rail?\n\nKeep in mind that I have never fixed a MacBook beyond the most basic obvious problems, so my knowledge base of MacBook board problems is pretty limited.  If even I know what sleep states are---then this means it is BASIC STUFF.  You need to know this.  You've already been to training.  It should ring a bell somewhere in that noggin.  Look it up and figure this out and how it might be relevant to your problem.\n\nCome back when you have done your homework.\nJessa"}
{"post_id":10588,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":1,"username":"larossmann","post_date":"2016-12-02 00:01:30","message":"Also answer all questions. Duke asked about resistors around U6100. You said they weren't shorted to ground, but what about their resistance? What about U1950 pin 8? You completely ignored U1950 pin 8. You ask questions without answering the ones he already asked."}
{"post_id":11668,"thread_id":9915,"title":"[SOLVED]820-3437 - PPBUS_G3H is showing .OL on multimeter","user_id":517,"username":"vaswaniraj","post_date":"2016-12-20 14:02:07","message":"Hi Duke \/ Louis,  Can this post be closed \/ Solved, as this logic board was repaired by you.  Thanks and Regards,"}
