{"post_id":6002,"thread_id":6002,"title":"[solved]820-00164","user_id":170,"username":"rob777","post_date":"2016-08-25 21:55:55","message":"Got a 820-00164 liquid damaged laptop off eBay that I'm trying to fix now. Super close to completion but of course I'm stuck somewhere. \nLaptop was sold not booting liquid damaged as is. I have it booting again and when connected to charger it now works perfect however it will not see any battery. Whether it be new or taken from another working laptop it will not see the battery. Orange and green lights are now present on charger.\nQ7155 has the 8.6v on pins 1,2 and 3.\nPin 4 of Q7155, c6951 and c6950 don't seem to have PPVBAT_G3H_CONN and I can't for the life of me figure out why. \nPlease advise. Thanks a lot!"}
{"post_id":6003,"thread_id":6002,"title":"[solved]820-00164","user_id":36,"username":"aprendiz","post_date":"2016-08-25 22:20:17","message":"Measure resistance between pins 17 and 18 from U7100, also measure voltage on pins 4 and 5 from J6950, report values..."}
{"post_id":6004,"thread_id":6002,"title":"[solved]820-00164","user_id":170,"username":"rob777","post_date":"2016-08-25 23:18:52","message":"Thanks mate. I'm in diode mode and when put on pin 17 and 18 of U7100 I get 0.745 (that figure seems wrong so am going back to test again)\nPins 4 and 5 of j6950 both show 3.4v"}
{"post_id":6005,"thread_id":6002,"title":"[solved]820-00164","user_id":170,"username":"rob777","post_date":"2016-08-25 23:51:17","message":"Need finer tips for my multimeter I think really having trouble measuring pin 17 and 18 of u7100. I didn't trust my first reading. Haven't been able to recreate it and now it seems there is no resistance at all between pin 17 and 18."}
{"post_id":6012,"thread_id":6002,"title":"[solved]820-00164","user_id":2,"username":"dukefawks","post_date":"2016-08-26 05:17:46","message":"The battery is not recognized so there is an issue on the data bus to the SMC. Measure diode mode on SCL and SDA lines going to battery connector. There should be voltage on PPVBAT_G3H_CONN if you connect a charged battery."}
{"post_id":6221,"thread_id":6002,"title":"[solved]820-00164","user_id":170,"username":"rob777","post_date":"2016-08-30 21:19:29","message":"Siiiiick fixed it duke!! Found a track on sda line that was inconsistent in diode mode. Made a jumper voila!! Happy days! Really appreciate it again!"}
