{"post_id":83642,"thread_id":62074,"title":"MBP 820-00923A A1706 shuts down suddenly","user_id":28201,"username":"Mortentoft","post_date":"2021-12-11 12:05:11","message":"Hello. Rookie question - please tell med if further info is needed. \nI need help with mbp 2017 tb (A1706 - 829-00923-A) The story is as follows; Mbp is handed over because it shuts down in use. Takes after shut down 0.040 amp and 20 volts. If I remove the battery and start it, it boots normally and works for a while. But shuts down again. The fault is periodic and there are no short circuits. I have replaced the CD3215 controllers (thunderbolt ROM U8090…) on both sides, but the same error continues. I have measured most through, but found no errors. I have two logicboards with the same error. Does anyone know of a solution or an idea for where to start searching? CD3215 has not been reballed\/changed but this is my next attempt. Battery replaced with a new one - same problem. The mbp was handed over with af exploded battery.\nGreetings from Morten\n\n\nGre"}
{"post_id":83652,"thread_id":62074,"title":"MBP 820-00923A A1706 shuts down suddenly","user_id":682,"username":"2informaticos","post_date":"2021-12-11 18:24:57","message":"Did you test with known good battery?\nIf still shuts down, then no reason to touch USB-C area.\n\nDoes it turn off starting in SMC bypass mode?\nTry your USB test macOS too.\n\nClean ME BIOS worth to try also."}
{"post_id":83665,"thread_id":62074,"title":"MBP 820-00923A A1706 shuts down suddenly","user_id":28201,"username":"Mortentoft","post_date":"2021-12-12 06:41:56","message":"SOLVED: u7000 replaced and everything is good. Cheers fellows"}
{"post_id":83666,"thread_id":62074,"title":"MBP 820-00923A A1706 shuts down suddenly","user_id":28201,"username":"Mortentoft","post_date":"2021-12-12 06:45:13","message":"[QUOTE=\"2informaticos, post: 83652, member: 682\"]\nDid you test with known good battery?\nIf still shuts down, then no reason to touch USB-C area.\n\nDoes it turn off starting in SMC bypass mode?\nTry your USB test macOS too.\n\nClean ME BIOS worth to try also.\n[\/QUOTE]\nThank you mate…. Did your advice… turned out to be U7000 … replaced it with a new donor (was bad on pads). Thank you:-)"}
