{"post_id":46101,"thread_id":46101,"title":"820-3437-B, short on PP3v42_G3H?","user_id":2088,"username":"Hardwood T\/S","post_date":"2019-02-12 16:55:53","message":"U7090 gets 15v nice and steady on pin 6, middling around .252v on G3H_SW on pin 4. L7095 shows 0.00 on diode mode, when I remove L7095 pin 4 of U7090 shoots up to 14v and diode mode returns a normal reading of around ~.3 on L7095. When I replaced it with a good L7095 tho, the short returned. Not sure what this means or what to do from here?"}
{"post_id":46102,"thread_id":46101,"title":"820-3437-B, short on PP3v42_G3H?","user_id":1153,"username":"JohnB8812","post_date":"2019-02-12 17:04:22","message":"Resistance to ground on PP3v42 in ohms mode? Don't use diode mode it can be confusing. What voltage do you currently get on PP3v42?"}
{"post_id":46104,"thread_id":46101,"title":"820-3437-B, short on PP3v42_G3H?","user_id":2088,"username":"Hardwood T\/S","post_date":"2019-02-12 17:19:36","message":"PP3v42 is 2.3mv. Resistance to ground is .2ohms. Should I be checking out R9075, C9075, R9076?"}
{"post_id":46105,"thread_id":46101,"title":"820-3437-B, short on PP3v42_G3H?","user_id":1153,"username":"JohnB8812","post_date":"2019-02-12 17:21:50","message":"If PP3v42 is .2 ohms you have a short to ground on PP3v42. Time to inject voltage and see what heats up. Any history liquid damage etc?"}
{"post_id":46108,"thread_id":46101,"title":"820-3437-B, short on PP3v42_G3H?","user_id":2088,"username":"Hardwood T\/S","post_date":"2019-02-12 17:33:35","message":"No way to inject voltage right now, but no history of water damage.\nBoard at first wasn't turning on, just a quarter fan spin and had a green light on the charger, and since all power rails were present I decided to reflow SMC. Afterwards, green light booped away from charger.\nI started snooping around L7095 and U7090, but I suppose it's more than likely that the SMC is likely the one shorted?"}
{"post_id":46111,"thread_id":46101,"title":"820-3437-B, short on PP3v42_G3H?","user_id":1153,"username":"JohnB8812","post_date":"2019-02-12 17:39:16","message":"That sounds to me like you reflowed the SMC improperly causing a shorted SMC. That sucks lol best thing you can do is remove the SMC and see if the short clears. If so, replace it from an identical donor board and start back where you were."}
{"post_id":46114,"thread_id":46101,"title":"820-3437-B, short on PP3v42_G3H?","user_id":2088,"username":"Hardwood T\/S","post_date":"2019-02-12 17:49:43","message":"Doesn't replacing any BGA chip suck majorly? I guess I had to learn sometime! Thanks for your help! I'll keep it open in case the board decides to throw me a bone :)\n\nedit: and hey! Resoldering the SMC caused the short to go away. What do you know, the simplest explanation is usually the easiest. Still no green light on the charger, but I'll keep following that thread. Time to check what now, I wonder... stuff with the Onewire circuit?"}
{"post_id":46115,"thread_id":46101,"title":"820-3437-B, short on PP3v42_G3H?","user_id":2088,"username":"Hardwood T\/S","post_date":"2019-02-12 18:01:05","message":"1.73v on SYS_ONEWIRE, could be SMC being off again I suppose? Along with still no green light on the charger, the fan now whirs intensely after a few moments of the boards being plugged in. I'll try another I\/O cable just in case."}
{"post_id":46116,"thread_id":46101,"title":"820-3437-B, short on PP3v42_G3H?","user_id":682,"username":"2informaticos","post_date":"2019-02-12 18:51:24","message":"On the first reflow, SMC got shorted because some balls joined under it.\n\n\"Resoldering the SMC caused the short to go away\"\nDid you reball it, or just took it off and placed it back?\n\n\"the fan now whirs intensely after a few moments\"\nDo you get all voltages from the board, including CPU ones?\nCheck if pins 7 & 3 of U1950 stay high.\nAlso check for USB activity.\n\nLeave LIO flex disconnected for the moment.\nBoard still must start directly when charger is connected; keep only (5 pins) DC cable connected.\n\nPost exact voltage for PPBUS_G3H and 3V42.\n\nCheck all SPI Bus Serie Termination resistors and traces\/solders for U6100."}
{"post_id":46117,"thread_id":46101,"title":"820-3437-B, short on PP3v42_G3H?","user_id":2088,"username":"Hardwood T\/S","post_date":"2019-02-12 18:51:44","message":"Well, took off the SMC and put it back on, retinned the pads and after a lot of finagling managed to get er on and actually pop a light on the charger again. Yay!\nProblem is I'm back at square one, where the fan only quarter spins. But hey, I'm grateful for that. Now I'm just not sure where to start looking again, since all the power rails were present and the s0 rails are obviously flipping back and forth. Should I be checking for shorts on the s0 lines?"}
{"post_id":46127,"thread_id":46101,"title":"820-3437-B, short on PP3v42_G3H?","user_id":1153,"username":"JohnB8812","post_date":"2019-02-12 23:01:11","message":"Check resistance between pins 17\/18 and 27\/28 of the ISL6259. Also upload a good quality image if possible if the area near the BIOS chip and U1950"}
{"post_id":46132,"thread_id":46101,"title":"820-3437-B, short on PP3v42_G3H?","user_id":682,"username":"2informaticos","post_date":"2019-02-13 04:11:47","message":"Check if pins 7 & 3 of U1950 pulse at least.\nAny voltage tries to appear at L7310\/20?\n\nLow voltage on SYS_ONEWIRE line denotes SMC issue.\nI recommend you to reball SMC correctly.\nChange it if that signal doesn't go up to 3V."}
{"post_id":46154,"thread_id":46101,"title":"820-3437-B, short on PP3v42_G3H?","user_id":2088,"username":"Hardwood T\/S","post_date":"2019-02-13 13:36:13","message":"ISL is fine, measurements for those pins are correct.\nU1950 pulses on 7 & 3, both L7310\/20 pulse as well. I'm guessing the SMC isn't reballed perfectly--I don't have a stencil, and I'm guessing the SMC I have from a 820-00165 board won't work. Time to order a new one?"}
{"post_id":46155,"thread_id":46101,"title":"820-3437-B, short on PP3v42_G3H?","user_id":682,"username":"2informaticos","post_date":"2019-02-13 13:57:32","message":"Never use new SMC.\nYou need one from donor board, same model.\n\nStencil doesn't really needed.\nI reballed many placing balls at hand, aprox 150 only."}
