[
    {
        "post_id":50863,
        "thread_id":50863,
        "title":"3476, no PM_SLP_S4_L, SMC_DELAYED_PWRGD, SMC_CLK32K, PP3v3_SUS, etc",
        "user_id":2088,
        "username":"Hardwood T\/S",
        "post_date":"2019-07-19 15:46:58",
        "message":"Board has all G3H and s5 rails in good state, everything else is pretty much missing. Just repaired this one for a LCD connector (no backlight) and was working fine, put er in the ultrasonic for cleaning (had some minor corrosion about), alcohol bath, then dehydrator for a good 20m-30m. Tested and found green light, but no fan spin and PM_SLP_S4_L missing, which led to me finding the rest.\n\nAfraid that I didn't allow enough time for everything to dry and killed the SMC. Anything I should be looking for particularly before resigning this to an SMC replacement?"
    },
    {
        "post_id":50864,
        "thread_id":50863,
        "title":"3476, no PM_SLP_S4_L, SMC_DELAYED_PWRGD, SMC_CLK32K, PP3v3_SUS, etc",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-07-19 16:06:27",
        "message":"Do NOT use UC again for low corrosion.\nJust use toothbrush and alcohol.\nIn fact, UC is needed to remove crap underneath BGA chips.\nVisible corrosion must be cleaned with toothbrush.\nIncorrect use of UC (whitout sweep function) can generate more damage.\n\nCheck now for knocked off components and broken traces..."
    },
    {
        "post_id":50865,
        "thread_id":50863,
        "title":"3476, no PM_SLP_S4_L, SMC_DELAYED_PWRGD, SMC_CLK32K, PP3v3_SUS, etc",
        "user_id":2088,
        "username":"Hardwood T\/S",
        "post_date":"2019-07-19 16:10:15",
        "message":"So I shouldn't use UC to clean the flux residue off the board? I only kept it in there lightly, 1m each side.\nWhere do you think I should start? I'm missing basically everything after s5, but not sure which traces are absent bc of others being absent along with it. SLP_S4_L can be missing for a million different things, so since I'm getting nothing on some SMC-lines I should start there?\n\nalso, how do you dry your boards after UC? Not sure if 20m in dehydrator is enough."
    },
    {
        "post_id":50866,
        "thread_id":50863,
        "title":"3476, no PM_SLP_S4_L, SMC_DELAYED_PWRGD, SMC_CLK32K, PP3v3_SUS, etc",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-07-19 17:15:30",
        "message":"You are definitely ok to ultrasonic the board; HOWEVER, you should always reflow the areas of corrosion with flux and fix any weak solder joints. I think you should UC it again and properly dry it. I usually UC it for 2 minutes both sides, alcohol bath, then use compressed air to blow out ALL liquid from under BGA chips (CPU, RAM, SMC, Camera ICs, etc) and then use my Quick to heat dry the rest at 280 celsius no nozzle being sure NOT to heat the CPU or any flip chip such as a camera IC. Sometimes if you don't dry it properly it won't go past an S4 state. \n\nThere is of course a possibility as 2informaticos suggested that the UC knocked something off if you didn't fix corroded components as well. Inspect very closely across the board near the corroded areas and check for anything knocked off."
    },
    {
        "post_id":50867,
        "thread_id":50863,
        "title":"3476, no PM_SLP_S4_L, SMC_DELAYED_PWRGD, SMC_CLK32K, PP3v3_SUS, etc",
        "user_id":2088,
        "username":"Hardwood T\/S",
        "post_date":"2019-07-19 19:15:10",
        "message":"Quick? I'm guessing you mean hot air gun. There wasn't much corrosion at all--just a bit around Q7155 + caps, the keyboard backlight connector and some on the ssd, maybe a bit around the ISL chip (already replaced due to it shorting). I'm hoping it's just a case of it not being properly dried, so I put it in the dehydrator a bit longer and kept it up against the fume extractor for ~15m, both sides. Now it's air drying until I can get to it tomorrow. Fingers crossed!\n\nas a side note, is a dehydrator the way to go for this stuff? I feel like it's too hot of an environment and the water ends up evaporating onto the underside of the bga chips. Either way I think I'll just go the hot air gun\/air dry route going forward."
    },
    {
        "post_id":50877,
        "thread_id":50863,
        "title":"3476, no PM_SLP_S4_L, SMC_DELAYED_PWRGD, SMC_CLK32K, PP3v3_SUS, etc",
        "user_id":2088,
        "username":"Hardwood T\/S",
        "post_date":"2019-07-20 11:52:05",
        "message":"Came back today, board turned on fine :) guessing it just needed to dry out some more. Have an issue that I'm not sure was occurring beforehand now--the computer will not turn on w\/just battery connected, but will turn on with charger + battery (waits to me to press power button) and just charger. Battery is detected in OS and does charge\/reflect accurate health (Normal), is at 100%, will run fine with charger disconnected after this point. When board is restarted, the machine will still not power on just from the battery. From time to time the board will boot from the battery (seems random?) and continue to do so from shut-down, but will stop once I load the OS fully.\n\nI'm going to assume that Q7155\/some of its caps may be bad, since they had the worst corrosion on the board before the cleaning, but was wondering what you guys know about the problem\/what dataline\/chip would cause this issue particularly.\n\nalso, SYS_DETECT_L is jumping from around 20mv to 28mv up and down pretty rapidly, in one second repeatedly. Probably not normal? Don't have good board to compare. New battery does the same thing--sometimes boots without problem off battery, but once boots into OS and is shut off again does not boot from just battery. It's strange, it's not like an SMC reset or dis\/reconnecting the battery once the issue starts occurring solves the problem, it's like it just needs time before it will boot off the battery again.\n\nPPVBAT_G3H_CONN - ~12.6v\nCHGR_BGATE - ~5.8v\nPPVBAT_G3H_CHGR_R - ~12.6v"
    }
]