{"post_id":93434,"thread_id":63197,"title":"Dell XPS 15 9570 - LA-G341P - Power cycling after liquid damage and blown ISL88738","user_id":25485,"username":"it-solve","post_date":"2022-10-19 19:19:13","message":"Hi Guys, I am sorry if non-apple posts are not allowed. \n\nI am dealing with this LA-G341P, which had heavy liquid damage around the Audio board, Battery charging circuit. I went and cleaned liquid areas and left the audio board disconnected.\n\nIt had blown PQ1900\/02\/3 as well as a trace on PU1900. I replaced all 4, and now it turns on and switches off. With a connected battery, it turns on and stays on for a while, even loading the system, then cuts off suddenly. \n[ATTACH type=\"full\"]60838[\/ATTACH]\n\nCharger only - without a battery, the PQ201\/PD200 area gets hot. I can see the chipset and CPU also warm up for a second trying to pull up to 2A, then cust off. The Realtek chip gets up to 50*C before the board switches off. I have removed it to ensure no internal short is causing the fault, but it's the same. The customer already waited a month for ISL and Mosfets, wont be able to wait another month for Audio IC\n[ATTACH type=\"full\"]60832[\/ATTACH][ATTACH type=\"full\" width=\"396px\"]60833[\/ATTACH]\n\nWith only the battery connected, it turns on and off and cycles, although the Audio still heats up. \nI have removed the Audio IC again and with battery only turns on for a while and cuts off again. Battery indicator LEDs show that it's empty, though. That may explain cutting down.\n[ATTACH type=\"full\" width=\"422px\"]60834[\/ATTACH][ATTACH type=\"full\" width=\"466px\"]60835[\/ATTACH]\n\nWith Battery and Charger - It turns on and stays on for couple minutes and I get these high spikes of 0.9 - 4A - 0.9A, similiar to a battery charging spikes and perhaps detects that the battery is also faulty. I can see that PQ1905 gets sizzling hot to 60*C and makes sizzling sound with alchochol on it. That whole PQ1905\/200\/208 area gets boiling on short second spikes.\n\n[ATTACH type=\"full\" width=\"655px\"]60836[\/ATTACH][ATTACH type=\"full\" width=\"402px\"]60837[\/ATTACH]\n\n[URL='https:\/\/1drv.ms\/u\/s!AqUpFIbofx3HkORjfjezhUsp6CETxQ?e=nakWDf']Dell XPS 15 9570 LA-G341P Schematic and Boardview here[\/URL]\n\n\nAll that said, is there a way to test further without ordering a new battery and audio chip? Just cant hold the customer off for another month. \n\nThanks"}
{"post_id":93438,"thread_id":63197,"title":"Dell XPS 15 9570 - LA-G341P - Power cycling after liquid damage and blown ISL88738","user_id":682,"username":"2informaticos","post_date":"2022-10-20 03:09:40","message":"Start checking resistance between pins 1\/2 and 14\/15 of PU1900.\n\nWhat is B+ voltage?\nMeasure with charger only, battery only and also charger and battery connected."}
{"post_id":93443,"thread_id":63197,"title":"Dell XPS 15 9570 - LA-G341P - Power cycling after liquid damage and blown ISL88738","user_id":25485,"username":"it-solve","post_date":"2022-10-20 04:10:31","message":"PU1900\n1-2 - 2.37Ohm\n14-15 - 4.65Ohm\n\nIt cycles on each of these every sec, so I added both measures before and during the cycle\nCharger Only - B+   13.56V\/0A - 13.6V\/1.4A\nBattery Only - B+   9.5V - 8.3V\nCharger & Battery  - B+   13.34V\/1.5A - 11.5\/4.8A"}
{"post_id":93446,"thread_id":63197,"title":"Dell XPS 15 9570 - LA-G341P - Power cycling after liquid damage and blown ISL88738","user_id":682,"username":"2informaticos","post_date":"2022-10-20 06:31:05","message":"You may have bad battery, but machine should work correctly without battery.\n\nThere must be something else affected by corrosion, on the charger circuit.\n+SDC_IN is stable?\nPQ1900-04 should be good, if you get 13.5V aprox.\nHowever check all theyr traces and related components."}
{"post_id":93452,"thread_id":63197,"title":"Dell XPS 15 9570 - LA-G341P - Power cycling after liquid damage and blown ISL88738","user_id":25485,"username":"it-solve","post_date":"2022-10-20 16:55:29","message":"+SDC_IN - 18.8V while off 18.4V while on without battery\n\nPQ1900-04  Fluctuates 14.7 - 15.1 without battery and not turning on while I am measuring it\nIf I measure after it turns on 18.6V\n\nCouple 2R2 looks bit corroded, but they all measure fine including their traces\n[ATTACH type=\"full\" alt=\"1666300577522.png\"]60839[\/ATTACH]\n\nSeems something is drawing to much current and causing the\n\n[ATTACH type=\"full\" width=\"615px\" alt=\"1666300776320.png\"]60840[\/ATTACH]\n\nSomething on VBUS_DC_SS seems to pull so much current that causes PQ208 to glow to 60*\nSame with DC_IN_SS for PQ200\n\nBut seems like only the chipset is heating, it seems to work on a battery and charger for awhile and I saw Dell logo and startup screen. SHould not be busted chipset"}
