{"post_id":94221,"thread_id":63302,"title":"820-00165-A","user_id":35752,"username":"Anterweb","post_date":"2022-11-20 14:20:31","message":"This came in 3 days ago as a \"It wont turn on\" repair, after removing the back cover I find its very dusty, I take out the board and give it all a good clean. put the board back together and it boots and runs perfectly.\n\nThe next day I try to turn it on ,,,nothing . I remove the battery connector and connect magsafe nothing, I I try SMC bypass and it boots. I close down the mac and the for the entire day when checking at random times it turns on and switches off perfectly both from battery alone or with magasafe connected.\n\nI try it this morning and its working perfect. I call for them to come and collect and moments before they arrive I hit the power button for one last test and nothing, wont power on. I had to once again remove battery, start in SMC bypass then shutdown now its fine again.. \n\nI've held onto it to try and figure this out but cant seem to see anything wrong on the board. could this be battery related? Ive checked the battery status and its reading as GOOD and only 350 cycles. \nran diagnostics and it came up good. \n\nhave you seen this behavior before?"}
{"post_id":94222,"thread_id":63302,"title":"820-00165-A","user_id":682,"username":"2informaticos","post_date":"2022-11-20 15:31:16","message":"We need some readings when the board doesn't want to turn on.\nSMC_ONOFF_L steady high and drops when pressing power button?\nIf not, can disconnect trackpad and try with R5116 pads.\nAlso be sure 3V3_S5\/SUS are present, as SMC_RESET_L too.\n\nYou may need to reball SMC..."}
{"post_id":94224,"thread_id":63302,"title":"820-00165-A","user_id":35752,"username":"Anterweb","post_date":"2022-11-20 16:17:38","message":"I'll try and get the voltages tomorrow if I can get it into its \"won't turn on\" state.\nReball the smc! :eek:\nNot something I've had the balls to try yet, but I'm sure I could, \n\nWould a reflow be worth a try first? Or can I buy a per balled smc chip?"}
{"post_id":94225,"thread_id":63302,"title":"820-00165-A","user_id":682,"username":"2informaticos","post_date":"2022-11-20 16:20:42","message":"Reflow may also work.\nI still recommend reball, in case reflow fix the issue (temporarily)."}
