[
    {
        "post_id":44227,
        "thread_id":44227,
        "title":"MacBook Pro 2015 15\" 820-00138, no backlight\/LVDS cables get pin 1 ruined?",
        "user_id":2088,
        "username":"Hardwood T\/S",
        "post_date":"2019-01-01 12:52:08",
        "message":"Got a Mid-2015 15\" retina board here, everything works fine except for the backlight on the screen. LVDS connector had corrosion on pins 2\/3\/4, LVDS cable had corrosion similarly on both LB and screen side in the same areas. Connector cleaned nicely, but the LVDS cable had pin 1 basically broken off of the plastic that holds it, along with the plastic itself. Decided to swap the cable with a known good one, but after inserting and seeing the same issue, I removed it and found it also now had it's LVDS cable's pin 1 broken off with the plastic.\n\nSpitballing, but seems like this connector needs replacing, yes? Every cable I put in has it's end chewed off by something inside--can't get a good enough look with my microscope lenses. The connector itself looks fine on it's pins connected to the LB after cleaning, but it'd be good to replace it anyway.\nI'm not sure what I'm supposed to be reading on the capacitors connected to pins 3\/4, I don't have the boardview or schematic right now, but they look off--both diode mode and resistance mode show endlessly climbing values."
    },
    {
        "post_id":44228,
        "thread_id":44227,
        "title":"MacBook Pro 2015 15\" 820-00138, no backlight\/LVDS cables get pin 1 ruined?",
        "user_id":1832,
        "username":"bcherdak",
        "post_date":"2019-01-01 14:14:34",
        "message":"Replace the connector, might be melted plastic\/metal contacts inside causing a short."
    },
    {
        "post_id":44229,
        "thread_id":44227,
        "title":"MacBook Pro 2015 15\" 820-00138, no backlight\/LVDS cables get pin 1 ruined?",
        "user_id":660,
        "username":"chicocomputerclinic",
        "post_date":"2019-01-01 15:12:53",
        "message":"No brainer, replace the lvds connector.\n\npin 1 is PPVOUT_S0_LCDBKLT"
    },
    {
        "post_id":44238,
        "thread_id":44227,
        "title":"MacBook Pro 2015 15\" 820-00138, no backlight\/LVDS cables get pin 1 ruined?",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-01-01 16:48:49",
        "message":"You must change onboard connector and video cable.\nNext, connect LCD, but do NOT power up the machine.\nCheck resistance to ground on pin 1\/J8300.\nIf bad, disconnect LCD and check again. If good after, that means LCD screen has problems.\nIf all OK, then you can try the board."
    },
    {
        "post_id":44262,
        "thread_id":44227,
        "title":"MacBook Pro 2015 15\" 820-00138, no backlight\/LVDS cables get pin 1 ruined?",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-01-02 07:08:30",
        "message":"Yep exactly as 2informaticos explained."
    },
    {
        "post_id":46249,
        "thread_id":44227,
        "title":"MacBook Pro 2015 15\" 820-00138, no backlight\/LVDS cables get pin 1 ruined?",
        "user_id":2088,
        "username":"Hardwood T\/S",
        "post_date":"2019-02-14 09:27:58",
        "message":"Changed LVDS cable and LVDS connector, without cable connected I got a small 6.5mv on PPVOUT_S0_LCDBKLT. Took off C8300, still getting OL on diode mode and 167kilohms resistance to ground on PPVOUT_S0_LCDBKLT, except this time I'm getting no voltage (0.0v) when testing PPVOUT_S0_LCDBKLT.\nEven though I have the 'right' boardview, some capacitors are in different places, and next I'd remove those capacitors near the bottom of the fan slot connected to PPVOUT_S0_LCDBKLT looking for the short but mine are in different places and I don't want to randomly start plucking components I don't need to.\nThat would be the next step tho, no?"
    },
    {
        "post_id":46265,
        "thread_id":44227,
        "title":"MacBook Pro 2015 15\" 820-00138, no backlight\/LVDS cables get pin 1 ruined?",
        "user_id":2088,
        "username":"Hardwood T\/S",
        "post_date":"2019-02-14 15:18:05",
        "message":"Well, I took off all associated capacitors on PPVOUT_S0_LCDBKLT looking for that short and, nadah. Still getting a big fat OL on diode reading. I replaced U7701 and D7701 just in case one of those had been shorting, but nope. I get a reading of around .780 in diode mode on LCDBKLT_PWR_SW side of D7701 and OL on the other side, PPVOUT_S0_LCDBKLT.\nWhen plugged in I don't actually have 0.0mv anymore on voltage for S0_LCDBKLT, but it's just very low, from 1mv to 6mvs. Not sure where else this could be shorting, other than the LVDS connector itself? I can try running a wire from pin 1 to C8300 and seeing if that helps, but I have a feeling that it will not."
    },
    {
        "post_id":46269,
        "thread_id":44227,
        "title":"MacBook Pro 2015 15\" 820-00138, no backlight\/LVDS cables get pin 1 ruined?",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-02-14 15:58:30",
        "message":"Short where???\nYou have OL indication, NO short at all.\nAlso cannot find any voltage on backlight output if LCD is not connected...\n\nCan you confirm image for sure, only missing backlight?"
    },
    {
        "post_id":46270,
        "thread_id":44227,
        "title":"MacBook Pro 2015 15\" 820-00138, no backlight\/LVDS cables get pin 1 ruined?",
        "user_id":2088,
        "username":"Hardwood T\/S",
        "post_date":"2019-02-14 16:04:23",
        "message":"To test for continuity, I ran a wire from pin 2 of R7708 (BKL_FB) to the S0_LCDBKLT of D7701, and got that associated vdrop (~.670mv) throughout the entire line, including C8300 and pin 1 of the LVDS connector.\nSo, I'm pretty dern stumped right now. Wouldn't that voltage drop being reflected throughout the whole line suggest that nothing is shorting to ground, and also that nothing in the circuit is open?\nWhy am I still getting next to nothing on S0_LCDBKLT, and also on BKLT_SENSE_OUT, BKLT_EN_R and PPBUS_SW_BKLT? I guess that implies that something with U7701 and it's associated components is screwy, but I'm not sure where to begin, or how that reflects the OL reading for S0_LCDBKLT."
    },
    {
        "post_id":46273,
        "thread_id":44227,
        "title":"MacBook Pro 2015 15\" 820-00138, no backlight\/LVDS cables get pin 1 ruined?",
        "user_id":2088,
        "username":"Hardwood T\/S",
        "post_date":"2019-02-14 16:10:11",
        "message":"@2informaticos... screen turns on fine. Guess I should actually test my work before assuming it's wrong! Thread on standby until I can say something else is wrong with the image, so we'll see."
    }
]