{"post_id":95252,"thread_id":63433,"title":"Dealing with NLBA1 laptop battery tester and MacBook Air batteries","user_id":682,"username":"2informaticos","post_date":"2023-01-03 14:45:06","message":"I wanted to post this 3 months ago, but is better later than never.\nI hope some members find it usefull.\n\nI got two Air batteries for tests.\nOne A1965 (for A1932\/2179) and other A2389 (for M1 A2337).\nBoth are identical, only cable length different.\nUse the same BQ24Z451, like any older MacBook battery.\n\nBattery pack's V+ and GND connect to battery board (820-01654-A) with powerful copper strips (fig. 03).\nVL and VG connect with low power rails, through the same flex where thermistors are placed (fig. 06).\nFor this reason, do not charge independent cells with high current using the points marked on the board; preferible less than 0.5A, only to revive hard discharged cells.\nHigher current can be applied directly on the cells terminals.\nIs possible (may need) to charge the pack directly between V+ and GND with higher current; not sure if this helps with heavy unballanced cells.\nBad\/poor ballance usually denotes a bad cell, which should be replaced.\n\nBattery pack uses 10K\/25 degrees thermistors, in 0402 format (fig. 04).\nThey are protected against humidity.\nHowever, I found one corroded in the A2389 (M1) battery.\n\nResults that A1965 battery has one bad cell.\nJust for test, I connected one small cell from an A1398's battery (fig. 07).\nNLBA1 left me reset the battery; cleared errors and Locked changed to Unlocked then.\nI was able to charge\/discharge battery with NLBA1 normally.\nI even tested few weeks later with an A1932 machine; worked good.\n\nThe M1's battery has problems with the electronics board (liquid spill); but seems to have good cells.\nI then decided to interchange the boards.\nOnce connected the M1 battery with the electronics from A1965 battery, NLBA1 reported a bad ballance, with 2.5V on second cell and 3.5V (aprox) on the other two cells.\nIn such case, the reset function is disabled; requires at least 3V on every cell.\nI forced the pack charge starting with 10V, going untill 11.6V.\nVoltmeter showed all cells to aprox 3.6-4.2V and I reconnected the battery to NLBA1.\nIt allowed me to reset the battery then.\nI started the calibration procedure and I got 97% healthy battery!\n\nTo use it in the same M1 Air A2337, it requires to replace the cable.\nOr just use it as is, in Air A1932\/2179.\n\nAll pictures in rar here:\n[URL unfurl=\"true\"]https:\/\/drive.google.com\/file\/d\/1MjsL5FaCgpaPZw7YlKkOmhjV-XaCY7YV\/view?usp=share_link[\/URL]\n[ATTACH]60916[\/ATTACH][ATTACH]60917[\/ATTACH][ATTACH]60918[\/ATTACH][ATTACH]60919[\/ATTACH]"}
