{"post_id":59627,"thread_id":59340,"title":"820-00244 Boots, slows to a halt, freezes and doesn't boot successfully for ~2\/3 hours","user_id":26252,"username":"macdude101","post_date":"2020-05-15 12:28:21","message":"Got an 820-00244 in that the customer explained boots to the login screen, or occasionally to the prohibitory symbol, but then very quickly slows down until it freezes and stops responding. Customer mentioned getting the \"the computer restarted because of a problem\" alert if they're able to log in quick enough. Once it's unresponsive the caps lock key no longer illuminates and there's no USB activity if an optical mouse is connected.\n\nAt this point if it's rebooted, it draws power, the trackpad becomes clickable but nothing further occurs (no logo\/chime, no USB activity, caps lock light or external display output).\n\nIf left powered off and connected to power for ~2\/3 hours it will then boot successfully again and the cycle repeats.\n\nBoard looks clean, no signs of liquid damage. Originally thought this was going to be another bad CPU but symptoms seem a little different from what I've seen before."}
{"post_id":59628,"thread_id":59340,"title":"820-00244 Boots, slows to a halt, freezes and doesn't boot successfully for ~2\/3 hours","user_id":26252,"username":"macdude101","post_date":"2020-05-15 13:09:10","message":"Upon further testing its looks like the amount of the it needs to 'recover' and boot successfully is related to how long it was left powered 'on' before. \n\nWondering if this perhaps could be a sensor issue."}
{"post_id":59635,"thread_id":59340,"title":"820-00244 Boots, slows to a halt, freezes and doesn't boot successfully for ~2\/3 hours","user_id":682,"username":"2informaticos","post_date":"2020-05-15 15:57:41","message":"Bad CPU, like all these bullshit boards...\nIt can revive with reflow, but that is not a serious solution."}
{"post_id":59637,"thread_id":59340,"title":"820-00244 Boots, slows to a halt, freezes and doesn't boot successfully for ~2\/3 hours","user_id":26252,"username":"macdude101","post_date":"2020-05-15 16:45:39","message":"Disconnecting the top case seems to have resolved the issue with it not booting consistently.\n\nReach the FileVault login screen however there are graphical glitches (as attached).\n\nLogging in kernel panics. Recovery mode kernel panics. Internet recovery mode kernel panics. Booting from an external drive kernel panics. Very consistent."}
{"post_id":59653,"thread_id":59340,"title":"820-00244 Boots, slows to a halt, freezes and doesn't boot successfully for ~2\/3 hours","user_id":26252,"username":"macdude101","post_date":"2020-05-16 04:02:32","message":"Got further with verbose mode, looks like an incomplete macOS installation. \n\nIt began installation process again, ETA 24 mins, after ~30 seconds logs appeared on-screen noting launchd assertion failure and all processes would be killed.\n\nRebooted to Apple logo & progress bar, reached end of progress bar and rebooted\/shutdown, unable to boot subsequently. \n\nNo USB activity, does not respond to power input, base of laptop warm.\n\nBack to square one. Seems like this might be a combination of a software & hardware issue (maybe the former caused by the latter)."}
{"post_id":59654,"thread_id":59340,"title":"820-00244 Boots, slows to a halt, freezes and doesn't boot successfully for ~2\/3 hours","user_id":682,"username":"2informaticos","post_date":"2020-05-16 05:09:40","message":"Software and internal SSD easy to discard.\nBoot USB macOS.\nTry to recover any data, if you get logged in."}
{"post_id":59671,"thread_id":59340,"title":"820-00244 Boots, slows to a halt, freezes and doesn't boot successfully for ~2\/3 hours","user_id":26252,"username":"macdude101","post_date":"2020-05-16 09:02:06","message":"Unable to boot from USB drive. Kernel panics.\n\nManaged to capture a kernel panic whilst in verbose mode though so got some logs:\n\n[ICODE]panic(cpu 2 caller 0x…): Kernel trap at 0x…, type 13=general protection[\/ICODE]\n\nWondering if this is perhaps bad RAM."}
{"post_id":59678,"thread_id":59340,"title":"820-00244 Boots, slows to a halt, freezes and doesn't boot successfully for ~2\/3 hours","user_id":682,"username":"2informaticos","post_date":"2020-05-16 10:17:11","message":"More likely CPU.\nThis board is hopeless.\nYou can try to reflow the board entirely; do note expect to last..."}
