[
    {
        "post_id":26022,
        "thread_id":26022,
        "title":"USB works for mouse and other devices but will not power external disk drive",
        "user_id":371,
        "username":"nate8organic",
        "post_date":"2017-09-27 18:12:45",
        "message":"Got a 2850 board, USB works for mouse and other devices but will not power external disk drive.  its like this for both usb inputs, works for mouse but will not power on the external ssd.  tested the external ssd and everything works on other rigs.  any ideas?\nThanks"
    },
    {
        "post_id":26029,
        "thread_id":26022,
        "title":"USB works for mouse and other devices but will not power external disk drive",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-09-27 18:36:57",
        "message":"Using the double power connector? USB HDD could draw over the 500mA limit. Some boards may be picky and cut off power right at 500mA, but this is the USB 2.0 spec. Most boards will tolerate a bit more, but that is not to be expected."
    },
    {
        "post_id":26036,
        "thread_id":26022,
        "title":"USB works for mouse and other devices but will not power external disk drive",
        "user_id":371,
        "username":"nate8organic",
        "post_date":"2017-09-27 18:51:15",
        "message":"Its my test drive uses a single usb and running a samsung evo. i use it on every macbook that comes in and i have never seen this before without the usb not working for other devices.  when the mouse worked i was actually amazed and i tested the sata to usb device many times and the lights will not come on even without the ssd in it, so it shouldn't be pulling more than 500ma.  i just repaired another macbook and the device worked perfectly fine.  the board was heavy liquid damaged and i have done a bunch of work on it but it boots up fully and works fine other than this strange issue."
    },
    {
        "post_id":26083,
        "thread_id":26022,
        "title":"USB works for mouse and other devices but will not power external disk drive",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-09-28 15:59:32",
        "message":"Is it even a power issue? Measured 5V present? Q4690 suspect."
    },
    {
        "post_id":26252,
        "thread_id":26022,
        "title":"USB works for mouse and other devices but will not power external disk drive",
        "user_id":371,
        "username":"nate8organic",
        "post_date":"2017-10-02 12:21:57",
        "message":"Im not sure if its. i have 5v present and i tried replacing q4690 with no change.  also i noticed wile testing, that one usb port i have to wiggle the plug for it to connect. should i replace the entire usb plug on that one? the other one i plug in my mouse and it turns on just fine.  still not sure why it wont work for my sata connector, it works on every computer and on this one the lights wont even turn on on the sata connector.  strangest thing"
    },
    {
        "post_id":26268,
        "thread_id":26022,
        "title":"USB works for mouse and other devices but will not power external disk drive",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-10-02 20:57:46",
        "message":"Why don't you check if the 5V is present when HDD plugged in. Just swapping components is not the way to go, diagnose the problem."
    },
    {
        "post_id":26295,
        "thread_id":26022,
        "title":"USB works for mouse and other devices but will not power external disk drive",
        "user_id":371,
        "username":"nate8organic",
        "post_date":"2017-10-03 09:30:56",
        "message":"I have 5v present with hdd plugged in. and i have 3v42"
    },
    {
        "post_id":26296,
        "thread_id":26022,
        "title":"USB works for mouse and other devices but will not power external disk drive",
        "user_id":193,
        "username":"Glenn",
        "post_date":"2017-10-03 09:39:56",
        "message":"Have you checked the filter for usb?"
    }
]