{"post_id":23073,"thread_id":23073,"title":"820-4924 5v_s3 & pm_slp_s3_l issues","user_id":90,"username":"ytesfay80","post_date":"2017-07-16 01:49:31","message":"This board I received had liquid damage and after replacing some components and ultrasonicing the board it would power cycle, pm_slp_s4_l would pulse for one second on startup and there was no 5V_S3\/0 voltages.\nI had to search around for a long time and ended up seeing that L4605 and C4695 were not looking great so I replaced them and pm_slp_s4_l came back.\nPin 4 is now present on U7501 but there is no voltage on Pin 5(PGood)\n\nI ended up seeing PM_SLP_S3_L was missing and when I went to R8178 I saw it was only hanging on to Pin 2 as if it was knocked away from Pin 1(not sure how that happened). I pulled R8178 completely off the board, plugged in the charger and measured Pin 1 where it showed 3.3v and Pin 2 was around 1.3v. I put another resistor on there and Pin 1 and 2 would both measure 0v and there was no short to ground in diode mode.\nI removed R8178 again and measured and again the pad on Pin1 measured 3.3v and when I put another resistor on there it went back to 0v on both sides.\nI replaced U8180 thinking that was the issue but still there is no voltage on R8178.\n\nThe resistance of R8178 is 100ohms.\nDiode Mode of R8178 is around 0.47v and Pin 1 of U8180 is around 0.52v"}
{"post_id":23084,"thread_id":23073,"title":"820-4924 5v_s3 & pm_slp_s3_l issues","user_id":1,"username":"larossmann","post_date":"2017-07-16 19:14:29","message":"There must be something short circuiting once power is applied on PM_SLP_S3_BUF_L\n\nIt can't be P1V5S0_EN\/P5VS0_EN\/P3V3S0_EN\/P1V05S0_EN, or C8188\/C8187\/C8186 because they are all after other resistors. So cross those out.\n\nPin 2 of R8178 connects directly to U3310 which is for thunderbolt. That's the only likely cause.\n\nYou said L4605 and C4695 were corroded. They are right next to U3310 which means U3310 was likely hit by liquid as well. U3310 is the only component that could be shorting your PM_SLP_S3_BUF_L to ground, AND it likely got wet.  Remove it and see what happens."}
{"post_id":23093,"thread_id":23073,"title":"820-4924 5v_s3 & pm_slp_s3_l issues","user_id":90,"username":"ytesfay80","post_date":"2017-07-16 22:10:25","message":"U3310 didnt look like it had any liquid damage to it. I removed it and still made no difference and I also removed U3210 but that didnt solve anything either.\nR8178 isn't showing as shorted to ground in diode mode.\n\nDiode Mode: Pin 1 of R8178 is around 0.47v and Pin 2 is around 0.53v\nC8186-88 all look fine visually and aren't shorted to ground.\n\nWhat else do you think it could be?"}
{"post_id":23118,"thread_id":23073,"title":"820-4924 5v_s3 & pm_slp_s3_l issues","user_id":2,"username":"dukefawks","post_date":"2017-07-17 15:09:19","message":"It is just power cycling. Do I need to repeat the usual offenders?"}
{"post_id":23131,"thread_id":23073,"title":"820-4924 5v_s3 & pm_slp_s3_l issues","user_id":90,"username":"ytesfay80","post_date":"2017-07-18 01:26:39","message":"Yes I checked all of the usual and everything looks and measured fine. I even went ahead and replaced the clock chipU1900 but that didn't do anything.\nEventually I ended up noticing that L7630 didn't look too well so I removed it and plugged the charger in.\nNow I get 3.3v on PM_SLP_S3_L, PM_SLP_S0_L, PP3V3_S0, and 5v on PP5V_S0.\nThere was no voltage on Vcore and ALL_SYS_PWRGD was around 0.06v which I assume is because L7630 ties to the 1v05 rail.\nFor some reason though when I put another L7630 from a donor(tried from 2 different boards) it goes back to the usual power cycling.\n\nDiode mode of the pads when L7630 removed from board is around 0.13v on Pin 1 and 0.16v on Pin 2\nVoltage mode of the pads is 0.08v on Pin 1 and 0.19 on Pin 2."}
{"post_id":23227,"thread_id":23073,"title":"820-4924 5v_s3 & pm_slp_s3_l issues","user_id":2,"username":"dukefawks","post_date":"2017-07-19 17:18:55","message":"It is power cycling, the question is is CPU Vcore pulsing too? See if you can even measure the other rails pulsing."}
{"post_id":23254,"thread_id":23073,"title":"820-4924 5v_s3 & pm_slp_s3_l issues","user_id":90,"username":"ytesfay80","post_date":"2017-07-19 18:14:42","message":"With L7630 removed from the board all the PM_SLP rails, 5v_S0 and 3v3_s0 rails are present but no Vcore.\nI put L7630 on the board and I got a pulse of around 1v on CPU VCORE, 5v_S0 pulses\nFor some reason PP3V3_S0 pulses quickly at 3.3v then stays around 2.5v."}
{"post_id":23291,"thread_id":23073,"title":"820-4924 5v_s3 & pm_slp_s3_l issues","user_id":2,"username":"dukefawks","post_date":"2017-07-20 18:22:41","message":"Could be absolutely anything. U1950 inspected? PCH_SYS_PWROK pulsing too?"}
{"post_id":23306,"thread_id":23073,"title":"820-4924 5v_s3 & pm_slp_s3_l issues","user_id":90,"username":"ytesfay80","post_date":"2017-07-20 19:35:44","message":"Yes. PM_PCH_SYS_PWROK on R1962 pulsed as high as 2.1v and Pin 1 of R1950(PP3V3_S0) is a stable 2.5v while PP3v3_S3 is only at 0.4v which I don't know how that could be because I thought the S0 rail will come on when S3 is high.\n\nU1950 looks great and liquid was never in that area. Most of the liquid damage was from the SMC down to the TPS51980 area and I replaced the components in those areas that looked damaged.\n\nHow could it be that it doesn't power cycle once I remove L7630 from the board but it does when I put another one on there?"}
{"post_id":23330,"thread_id":23073,"title":"820-4924 5v_s3 & pm_slp_s3_l issues","user_id":2,"username":"dukefawks","post_date":"2017-07-22 05:40:09","message":"ALL_SYS will never come high and there will never be and CPU Vcore if you remove L7630. You create a totally different condition.\n\nI have no idea besides to tell you that there must be a corroded resistor or trace somewhere. SMC replaced?"}
{"post_id":23353,"thread_id":23073,"title":"820-4924 5v_s3 & pm_slp_s3_l issues","user_id":90,"username":"ytesfay80","post_date":"2017-07-22 13:12:31","message":"I haven't replaced the SMC but I'll check around for any damaged resistors."}
