{"post_id":18267,"thread_id":18267,"title":"[SOLVED]820-2610 Draining Battery during Sleep","user_id":515,"username":"SMMRepair","post_date":"2017-04-12 14:16:32","message":"I have a customer who sent me a unit they're having trouble with. It's a 2009 17\", and they reported that it drains batteries even when sleeping. I checked it, and it does seem to drain quicker than normally (~8% over 1 hour while asleep). I tried several known-good (genuine) batteries, and the issue persists. The unit has an SSD installed, but I'm not sure if that could be related to the battery drain issue.\n\nHaving never really encountered this issue yet, I'm not sure where to start on this one. System profiler shows amperage at -252 mA and voltage at 7798 mV. Unit works fine otherwise. They did report that the unit will shut down under heavy load, but I'm fairly certain that's a C7771 issue, and not related to the battery drain.\n\nAny ideas?"}
{"post_id":18293,"thread_id":18267,"title":"[SOLVED]820-2610 Draining Battery during Sleep","user_id":2,"username":"dukefawks","post_date":"2017-04-13 07:15:53","message":"8% over an hour? Does it even really go to sleep? White light pulsing?"}
{"post_id":18332,"thread_id":18267,"title":"[SOLVED]820-2610 Draining Battery during Sleep","user_id":515,"username":"SMMRepair","post_date":"2017-04-13 12:00:12","message":"Hey Duke, yeah the white light did pulse. It was definitely asleep the whole time. I actually figured this one out after some testing...and it was interesting. There were 2 things causing issues:\n\n1. There was actually a bent pin in the battery connector. This was a customer's machine, and the pin had clearly been bent a long while--it was bent in such a way that it had formed to the shape of the connector (like a hard \"U\" shape). It was pressing up against another pin, and I doubt that pin was making contact due to this. I got those pins straightened out, then things improved.\n\n2. The machine also had an SSD installed, and after some Google'ing, a lot of people have reported issues with this specific SSD. They all experienced increased battery drain overnight or when the machine was asleep. I checked, and sure enough this laptop had that exact SSD. I swapped in a traditional drive and the drain issues are completely gone. Maybe the SSD continued to draw power when the computer went to sleep? Not sure, but with a regular hard drive, it works just fine. I let it sleep overnight and it dropped from 81% to 80%. Much better.\n\nSo it was one of the above, or a combination of the two. You can mark this one as solved--thanks, Duke!"}
