[
    {
        "post_id":19997,
        "thread_id":19997,
        "title":"820-2523 Kernel Panic?",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2017-05-10 09:46:34",
        "message":"Hello\nthis 820-2523-B boots up normally until it nearly finishes loading. Then it shows the attaches picture, shuts off, turns automatically back on and repeats this process. If i want to install OSX with an usb drive it works until i go to the \"disk utility window\" where i normally can create partitions or wipe the drive. In this window, before i can see any drive information, it keeps spinning the \"colored wheel\" - with different drives ans drive cables same thing. The strange thing is that it will boot up normally with a drive from another Macbook with OSX already installed. I´m really not sure what to do with this one but my guess is Kernel Panic and C9560 but i´m confused because it works just fine with the other drive. Or could it be a to new version of OSX for this machine on the original drive? Thanks for any help."
    },
    {
        "post_id":20010,
        "thread_id":19997,
        "title":"820-2523 Kernel Panic?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-05-10 12:44:06",
        "message":"Bad RAM? Make sure only to use PC8500 RAM. Also issues with 8GB in these boards."
    },
    {
        "post_id":20229,
        "thread_id":19997,
        "title":"820-2523 Kernel Panic?",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2017-05-15 03:49:09",
        "message":"I tryed different ram but its doing the same thing with 2x1GB PC8500 too. Also it sometimes displays the \"Your computer restarts because of a problem....\" message that i attached after shutting off and back on."
    },
    {
        "post_id":20233,
        "thread_id":19997,
        "title":"820-2523 Kernel Panic?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-05-15 04:12:20",
        "message":"Tried one slot at a time? Could be 1 bad slot. Besides bad RAM\/slot there is not much to do about this antique. Disconnect everything not needed, especially airport cable can cause issue."
    },
    {
        "post_id":20235,
        "thread_id":19997,
        "title":"820-2523 Kernel Panic?",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2017-05-15 04:29:03",
        "message":"Ok, thank you. I tryed both slots and nothing else plugged in. No success. Any idea why it starts with one drive from another Macbook?"
    },
    {
        "post_id":20241,
        "thread_id":19997,
        "title":"820-2523 Kernel Panic?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-05-15 11:40:08",
        "message":"No idea, run ASD and see if anything comes up."
    },
    {
        "post_id":20250,
        "thread_id":19997,
        "title":"820-2523 Kernel Panic?",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2017-05-15 12:32:43",
        "message":"OK, Thank you. I´ll see what ASD says here and if there are no issues i´ll leave this board alone."
    }
]