{"post_id":66306,"thread_id":60154,"title":"A1502 No Backlight, No Keyboard Backlight","user_id":27947,"username":"riyadh144","post_date":"2020-10-08 14:07:56","message":"Hi, \nI am usually not a technician, but work as an Electrical Engineer, and I do believe I know my way around a soldering iron and a DMM.\n\nAnyway I am here to get some help from experts.\n\nI have a A1502 13\" early 2015 model 820-4924-A\n\nSymptoms\n[LIST=1]\n[*]I can see output on the screen when I shine some light  on it, and it outputs to the monitor.\n[*]The board is very clean, no signs of any corrosion\n[*]I am getting voltage on enable pin for U7700 not getting voltage on pwm_keyb. \n[*]There is no short on the power output to the display, I believe the cable and the connector are fine, unless one of the other pins are shorted.\n[*]Q7700 has no output the gate and source are high.\n[*]None of the fuses are blown, I have checked most of the resistors they all seem fine.\n[*]Replaced U7700, it wasn't at fault.\n[\/LIST]\n\nNow the first thing I would like to know how do you power up the device without plugging in the battery as it is making my life hard plugging in the battery to power up and then removing it after it is on. \n\nPlease give me thy knowledge, I have searched around the website, checked all what was suggested, everything seemed fine. \nI have read Louis's guide, it is pretty good, but still didn't help my stupid self figure this out.\n\nAlso you guys are doing great work helping out the community standing for the corrupt man."}
{"post_id":66328,"thread_id":60154,"title":"A1502 No Backlight, No Keyboard Backlight","user_id":682,"username":"2informaticos","post_date":"2020-10-08 16:31:58","message":"First of all, welcome to the forum!\n\nU7700 controls both LCD and keyboard backlight.\nTry 2-3 times PRAM reset as first step.\nDisconnect the webcam, to prevent an ALS issue and test the machine again.\n\nThis board should start automatically when charger is plugged in.\nHowever, I remember few members complained that board didn't turn on without battery; never faced myself with this issue.\nYou can use R5115\/16 pads instead of power button."}
{"post_id":66332,"thread_id":60154,"title":"A1502 No Backlight, No Keyboard Backlight","user_id":27947,"username":"riyadh144","post_date":"2020-10-08 17:28:43","message":"I just tried resetting PRAM a few times, sadly that didn't do it.\nSorry for the noob question but to reset the pram I followed this guide? Is that satisfactory?\n[URL unfurl=\"true\"]https:\/\/support.apple.com\/en-us\/HT204063[\/URL]\n\nThanks for the quick response"}
{"post_id":66336,"thread_id":60154,"title":"A1502 No Backlight, No Keyboard Backlight","user_id":682,"username":"2informaticos","post_date":"2020-10-08 17:59:56","message":"Did you test the machine without webcam connected?"}
{"post_id":66339,"thread_id":60154,"title":"A1502 No Backlight, No Keyboard Backlight","user_id":27947,"username":"riyadh144","post_date":"2020-10-08 18:09:31","message":"Yes I do believe I have the right connector disconnected. \n\nI should do the PRAM reset after disconnecting the camera right?"}
{"post_id":66342,"thread_id":60154,"title":"A1502 No Backlight, No Keyboard Backlight","user_id":27947,"username":"riyadh144","post_date":"2020-10-08 19:13:07","message":"Also I just ran a diagnostic test, and with shining flash light on it said that there might be a problem with the camera which is expected\nBut it isn't mentioning any problem with the display. \n\nI removed the display connector and did the test again while connected to external display, it said there might be a problem with the display code VFD001"}
{"post_id":66362,"thread_id":60154,"title":"A1502 No Backlight, No Keyboard Backlight","user_id":682,"username":"2informaticos","post_date":"2020-10-09 04:41:55","message":"Display error must be due to missing it on the test.\n\nDid you try known good compatible LCD assembly?"}
{"post_id":66369,"thread_id":60154,"title":"A1502 No Backlight, No Keyboard Backlight","user_id":27947,"username":"riyadh144","post_date":"2020-10-09 06:19:07","message":"I don't have any other displays sadly. So that won't be easy."}
{"post_id":66383,"thread_id":60154,"title":"A1502 No Backlight, No Keyboard Backlight","user_id":682,"username":"2informaticos","post_date":"2020-10-09 12:35:57","message":"LCD backlight is controlled through I2C bus, from LCD itself.\nLCD receives EDP_BKLT_PWM from PCH and send I2C information to U7700.\nCheck at least if you get some voltage at EDP_BKLT_PWM; DC voltmeter should be able to show something."}
