{"post_id":99768,"thread_id":63953,"title":"820-02016 completely dead","user_id":1427,"username":"Narek","post_date":"2023-06-07 11:19:33","message":"Working on M1 Air with 820-02016 board. Customer turned it off in the evening and in the morning couln'd turn it back on. Board has no signs of damages, corrosion or so. It doesn't switch to 20V, stuck at 5V and fluctuating between 0,038A to 0,13A. Trackpad doesn't click, can't get into DFU mode. Some power lines are pulsing (more info below).\n\nSome basic measurements: \n\nPPBUS_AON - 12,3V\nPP1V8_AON - 1,79V\nPP1V8_S2 - 1,78V -> pulsing\nPP3V8_AON - 3,8V\nPP3V3_UPC_LDO - 3,3V\nPP3V3_S2 - 3,3V -> pulsing\n\nI have measured lines around U8100\/U7700 comparing with another good board. Found out, that PP1V0_S2SW_DRAM has 13,6ohm resistance to ground (0,006V in diode mode) compared to 69ohm and 0,039V in diode mode on good board. I'm asuming, that the RAM is damaged. If I connect the power there is 1V present on this line, but it's pulsing. Can it be the problem anyway? Another question - can I replace RAM chips P&P from another board without programming or so? I have plenty of these board for parts."}
{"post_id":99769,"thread_id":63953,"title":"820-02016 completely dead","user_id":682,"username":"2informaticos","post_date":"2023-06-07 11:35:48","message":"The RAM is soldered on top of M1 processor.\nM1 is also powered from the same rail; it may be the culprit in fact."}
{"post_id":99774,"thread_id":63953,"title":"820-02016 completely dead","user_id":1427,"username":"Narek","post_date":"2023-06-07 13:24:30","message":"Yes, I know, that RAM is soldered on processor. Just wondering if I can take the chips from donor and solder to this board p&p? If I apply voltage to this rail one of the RAM chips starts to slightly warm up and board takes ~0,080A compared to 0,005A on working board."}
{"post_id":99775,"thread_id":63953,"title":"820-02016 completely dead","user_id":682,"username":"2informaticos","post_date":"2023-06-07 16:02:43","message":"Yeah, not sure if RAM is \"married\" with CPU.\nSearch on Internet, if someone left a feedback."}
