{"post_id":6542,"thread_id":6542,"title":"[SOLVED]Macbook air 820-3476 can't power on from keyboard(not keyboard)","user_id":383,"username":"roy.ruan","post_date":"2016-09-09 19:39:52","message":"hi Guys,\nI'm having a 820-3476 that is having strange problem. everything of the machine works when it powers on EXCEPT it can't power on from keyboard.\nit only can turn on when you connect the charger( the automatic turn on thing) . and yes I checked the keyboard, and tried with another known good one already. sure it's not the issue with the keyboard.\n\nso far I checked\n1.smc_on\/off_l 3.4v  ,when power button is pressed, it drops and back to 3.4,which should be normal\n2. checked PM_PWRBTN_L, same story as smc_on\/off_l\n\nand like to mention, when the machine powers on, after you click shut down in the OS, it shuts down. then there is no way you can press power button to turn on again. only way to power on again is to disconnect the charger and battery, then reconnect the charger to let it power on automatically.\n\nchecked around the board, can't see spill or anything, just one single point with a bit green stuff that can tell what it is, but i did solder it to good condition again already,it's pin 1 on r1905, after that i checked the conductivity and it's good. so it probably has nothing to do with the problem.but still like to mention.\n\nany advice would be appreciated!"}
{"post_id":6543,"thread_id":6542,"title":"[SOLVED]Macbook air 820-3476 can't power on from keyboard(not keyboard)","user_id":383,"username":"roy.ruan","post_date":"2016-09-09 19:42:41","message":"oh also tried 1:P+R+COMMAND+OPTION  TO RESET 2.REFLOW SMC"}
{"post_id":6546,"thread_id":6542,"title":"[SOLVED]Macbook air 820-3476 can't power on from keyboard(not keyboard)","user_id":2,"username":"dukefawks","post_date":"2016-09-09 21:38:55","message":"SMC_LID, PM_BATLOW_L, SMC_ADAPTER_EN all high?"}
{"post_id":6552,"thread_id":6542,"title":"[SOLVED]Macbook air 820-3476 can't power on from keyboard(not keyboard)","user_id":383,"username":"roy.ruan","post_date":"2016-09-10 08:25:39","message":"SMC_ADAPTER_EN is low, i think that's the cause?\nwhen standby and no power on, the voltage would change from 1.0-1.7,it's changing when you mesure\nwhen it's on, it's 0.2-0.5\n\nIt looks like it only goes to two place ,the CPU and the SMC. can you explain a bit what does the signal does and can we modify the circuit to make it work rather than replacing the SMC?\nfrom what it says,it should be a signal to enable the adapter? but we have 3v42 and one wire is all good ,why we need that to \"enable\" the adapter?\n\nthanks!"}
{"post_id":6554,"thread_id":6542,"title":"[SOLVED]Macbook air 820-3476 can't power on from keyboard(not keyboard)","user_id":2,"username":"dukefawks","post_date":"2016-09-10 11:29:56","message":"Are you using a 45W instead of a 60W charger, it must be 60 or 85W."}
{"post_id":6575,"thread_id":6542,"title":"[SOLVED]Macbook air 820-3476 can't power on from keyboard(not keyboard)","user_id":383,"username":"roy.ruan","post_date":"2016-09-11 11:04:20","message":"Duke! you are the man!\n\nlol I was just being an idiot, I actually know there is a difference between different W chargers long time ago, just didn't think it can be the charger since I WASN'T USING A CHARGER TO SUPPLY POWER.\nI modified a cable from a mac charger and connect to the DC power supply unit to supply power so i know the AMP it's running to determine issue.\ngreat stuffs for fixing liquid spill and no video boards.. it works with all voltage below 16.5(a1278,all airs)...i just didn't realize for this model of air, even it's 14.8, it can't power on when power button pressed(although it can still power on when connected!that's the tricky thing). and it works perfect even with buttons for a1278 ..\n\nanyway, problem solved, original issue was just no power, probably fixed it in 20 mins already at that time, i was just playing with this stupid charger thing for quite a long time man.\n\nthanks a lot DUKE,real appreciation here."}
