{"post_id":59118,"thread_id":59118,"title":"820-3437 no backlight boost","user_id":5081,"username":"sbergin","post_date":"2020-05-04 13:55:13","message":"I have an 820-3437 that had some liquid damage. I have replaced a few components and now have normal behavior (fan-spin, image, proper rails, etc). Only issue is that backlight starts out at about 25V and slowly drops down to the non-boosted voltage as I measure it. I've tried multiple screens, and I replaced LP8550. I confirmed that the feedback line has continuity from Pin 5 on LP8550 to the other side of the board near D7701. Any thoughts? Thanks!"}
{"post_id":59122,"thread_id":59118,"title":"820-3437 no backlight boost","user_id":682,"username":"2informaticos","post_date":"2020-05-04 16:21:23","message":"\"Pin 5 on LP8550 to the other side of the board near D7701\"\nNot near; do you have contact with p?n K of D7701?\n\nWhat happen with BKL_EN\/PWM?\nDid you try PRAM reset?\nDid you try known good LCD assembly?\n\nCheck all traces, resistors and resolder all them (around U7701); pay atention to R7704 and the 6 return resistors."}
{"post_id":59388,"thread_id":59118,"title":"820-3437 no backlight boost","user_id":5081,"username":"sbergin","post_date":"2020-05-11 16:14:20","message":"Sorry, yes. I have continuity between pin 5 on D7701 and the boost side of D7701. BKL_EN is 2.85, BKL_PWN is 0.00 (both values are when screen is attached). All resistors measure within spec and traces look good"}
{"post_id":59389,"thread_id":59118,"title":"820-3437 no backlight boost","user_id":5081,"username":"sbergin","post_date":"2020-05-11 16:17:53","message":"I've also tried PRAM zap and multiple known-good LCD assemblies"}
{"post_id":59397,"thread_id":59118,"title":"820-3437 no backlight boost","user_id":682,"username":"2informaticos","post_date":"2020-05-11 18:50:11","message":"\"BKL_PWN is 0.00 \"\nNot normal at all, check R7704.\nIf good, remove it and run a wire from R7715 to C7704.\nTest if backlight appears."}
{"post_id":59520,"thread_id":59118,"title":"820-3437 no backlight boost","user_id":5081,"username":"sbergin","post_date":"2020-05-13 11:55:50","message":"yes, that gives us backlight with the jumper in place. R7704 tests fine... OK so what does this tell us? BKL_PWN is the source of the problem? Which means I have a CPU issue? I'm assuming I can't leave this jumper in place full time...\n\nFWIW with R7704 removed EDP_BKLT_PWM measures 2.1M ohms to ground (no short), and I get about 2.4v on that line for a split second during POST. But then it quickly drops to 1.4v and then 0.0v."}
{"post_id":59525,"thread_id":59118,"title":"820-3437 no backlight boost","user_id":5081,"username":"sbergin","post_date":"2020-05-13 13:12:13","message":"I just read the sticky on this topic, sorry for not finding it sooner. I see now why you suggested a PRAM zap...to reset what might have been a fully lowered brightness setting. So I guess I could leave the jumper in place if the owner approves the loss of brightness control. I am curious where the issue with BKLT_PWM actually lies, at least now I can dig a bit more on my own. Thanks SO MUCH for your guidance!"}
{"post_id":59530,"thread_id":59118,"title":"820-3437 no backlight boost","user_id":682,"username":"2informaticos","post_date":"2020-05-13 15:39:11","message":"Try again 2-3 PRAM resets.\nThen put back R7704 and test.\nBe sure to have good solders on its pins!"}
