[
    {
        "post_id":29220,
        "thread_id":29220,
        "title":"Ultrasonic Problems",
        "user_id":1092,
        "username":"Ryanlen2",
        "post_date":"2017-12-12 07:05:20",
        "message":"Can someone shed some light on this. For some reason 8 out of 10 times after a board comes out of ultrasonic, it seems to be in worse shape then it was. Meaning, its clean and looks the same. Nothing missing. Just doesn't work. No fan spin. Most of the time after about a day it might start working again. Makes be crazy. For example, last night I took it out after 10 mins and let it sit in alcohol for about 20 mins. Then I dried it with my hot air station and let it sit overnight. When I came in this morning and tried to power it on, it was dead. After about a half hour, now the fan spins. No chime... just spins. Im guessing in about an hour from now it will start working again. Maybe not. \n\nIm using 4oz of EC to 1 gallon distilled. \n\nThanks. Have a good day."
    },
    {
        "post_id":29223,
        "thread_id":29220,
        "title":"Ultrasonic Problems",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-12-12 07:08:38",
        "message":"Corrosion under something would cause that, nothing special just the usual. U\/S cleaning does not get rid of crap under the SMC and such."
    },
    {
        "post_id":29227,
        "thread_id":29220,
        "title":"Ultrasonic Problems",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2017-12-12 07:28:28",
        "message":"This originally happened to me too. What I do now is fix what has to be fixed, run it through, alcohol bath for 2 minutes or so, heat it with heat gun since I don’t have small oven BUT keep it away from CPU\/GPU, and then take air can and blow out remainingalcohol underneath BGA chips. Haven’t had one issue since I started blowing out the alcohol under chips"
    },
    {
        "post_id":29230,
        "thread_id":29220,
        "title":"Ultrasonic Problems",
        "user_id":1092,
        "username":"Ryanlen2",
        "post_date":"2017-12-12 07:42:37",
        "message":"Ok... I do usually dry entire board including BGA chips with heat gun. Im putting fully functioning boards in and they keep coming out dead. I will soak again in alcohol and try your method. Thank you."
    },
    {
        "post_id":29249,
        "thread_id":29220,
        "title":"Ultrasonic Problems",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-12-12 13:11:30",
        "message":"Uhm, what kind of machine do you use?"
    },
    {
        "post_id":29253,
        "thread_id":29220,
        "title":"Ultrasonic Problems",
        "user_id":1092,
        "username":"Ryanlen2",
        "post_date":"2017-12-12 13:15:55",
        "message":"Hey Duke. trusonik TS-5L. Nothing but problems so far. lol. But I dont have anything to compare it to either. Still trying to get last board working, that was pretty much working except for video before I cleaned it. Flowing flux under BGA's to see if that helps."
    },
    {
        "post_id":29272,
        "thread_id":29220,
        "title":"Ultrasonic Problems",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-12-12 19:32:37",
        "message":"Yeah, $125 with free shipping, I think you already know what is wrong there.\n\nThe U\/S probably killed that 2915, it probably cracks resistors and rips up traces, who knows what happens."
    },
    {
        "post_id":29273,
        "thread_id":29220,
        "title":"Ultrasonic Problems",
        "user_id":1092,
        "username":"Ryanlen2",
        "post_date":"2017-12-12 19:37:59",
        "message":"Ok, ok! It had ok reviews...  Well kinda. Definitely nothing stated about killing boards. Can you recommend something thats not $800! Later man. :)\n\nOr do I really need to drop the cash on a Crest?\n\nPretty sure I know the answer to this question too. Lol."
    },
    {
        "post_id":29274,
        "thread_id":29220,
        "title":"Ultrasonic Problems",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-12-12 20:40:29",
        "message":"I have no idea, I do not own a U\/S cleaner. Tooth brush and some soft scrub is my way."
    },
    {
        "post_id":29281,
        "thread_id":29220,
        "title":"Ultrasonic Problems",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-12-13 02:18:31",
        "message":"$800 is cheap for a good Ultrasonic cleaner. You need one that can properly heat and have a sweep frequency. Just brush corrosion away manually if you don't want to pay it, but don't break boards with bad cleaners. Personally I always just brush manually, the only reason why I would get a cleaner is to easier get rid of the flux on the board, but thats mostly just cosmetic..."
    }
]