[
    {
        "post_id":1791,
        "thread_id":1791,
        "title":"820-2936-a quarter fan spin",
        "user_id":111,
        "username":"dragon4ce",
        "post_date":"2016-04-20 11:21:12",
        "message":"Hi guys,\n\nfirst of all, thanks for taking a look at this. I've watched a lot of Louis's video's, but this is my first actual board I'm fixing. there was heavy liquid damage near the LCD connector, so i first replaced U9000, q7920 and c9009. The onewire circuit worked because i had\/have a green light on the magsafe, but no fan spin. I diagnosed pp5v_s5 not being present, so i replaced u7200. now I do have pp5v_s5, and my fan spins for a second before it stops, then starts again. that continues in a cycle. I also replaced c6601 because I knocked the original off the board. Now the next signal that is not present is pp5v_s3. (I'm also missing pp3v3_s3) and the corresponding s0 rails but that seems logical to me since i dont have the S3 rails. \n\nThe part where I am stuck is this: \n\nfrom what I understand from the schematic, u7200 creates pp5v_s3, but something has to happen with Q7260 and Q7261. Now what exactly that is, I don't know. I vaguely remember Louis has a video describing what an N channel mosfet is, I can't find the specific video anymore though. \n\nI do have 12.5v on pin 5 of q7260. Some additional measurements: \nrail    should be   is    diode mode\nppbus_g3h    12.8    12.5    \nppbus_s5_hs_computing_isns    12.8    12.5    \nppbus_s5_hs_other_isns            \nPP3V42_G3H    3.42    3.47    \nppvrtc_g3h    3    3.30    \n            \nPP5V_S5    5    5.01    \nPP5V_SUS    5    5    \npp5v_s3    5    0    0.100\npp5v_s0    5    0    \nPP3V3_S5    3.3    3.3    \npp3v3s4    3.3    3.3    \npp3v3_s3    3.3    0    \nPP3V3_S0    3.3    0    \n            \nPPVCORE_S0_CPU    1.25    0    \nPPVCORE_S0_AXG    1.05    0    \nPP1V5_S3_CPU_VCCDQ            \n\n\nCan anyone please point me in the right direction? Or knows what the video is where Louis explains the mosfets? Wikipedia and the likes only talk about substrates and chemical blablabla, which is all way above my college dropout mind. Thanks in advance!"
    },
    {
        "post_id":1793,
        "thread_id":1791,
        "title":"820-2936-a quarter fan spin",
        "user_id":111,
        "username":"dragon4ce",
        "post_date":"2016-04-20 11:23:00",
        "message":"Forgot something: I also replaced U5010 because the pins were corroded. shielded the SMC ofcourse :p"
    },
    {
        "post_id":1794,
        "thread_id":1791,
        "title":"820-2936-a quarter fan spin",
        "user_id":111,
        "username":"dragon4ce",
        "post_date":"2016-04-20 11:34:46",
        "message":"update: pin 2 of q7221 has 3.44 volts when the fan doesn't spin. when the fan starts spinning it drops to 0v, and then back to 3.44"
    },
    {
        "post_id":1795,
        "thread_id":1791,
        "title":"820-2936-a quarter fan spin",
        "user_id":111,
        "username":"dragon4ce",
        "post_date":"2016-04-20 11:43:23",
        "message":"also [COLOR=#333333][FONT=Verdana][SIZE=13px]PM_SLP_S4_L is 0v at q7911. hmm, that signal comes from the PCH. does that mean my PCH is bad? [\/SIZE][\/FONT][\/COLOR]"
    },
    {
        "post_id":1810,
        "thread_id":1791,
        "title":"820-2936-a quarter fan spin",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2016-04-20 17:34:00",
        "message":"Check resistance between pins 17 and 18 of U7000. If it measures 2.203 ohms or something close, move on. If it doesn't, fix it!\n\nIf U5010 was corroded that means water got near U2800. Replace U2800 as any amount of water, even amounts tiny enough to not cause visible corrosion, will destroy it.\n\nThese are the two most common causes of quarter fan spin on 2936\/3115 boards."
    }
]