{"post_id":24305,"thread_id":24305,"title":"820-3662-a","user_id":1028,"username":"spidey","post_date":"2017-08-15 10:26:57","message":"Hi, \n\nI am attempting my first board repair.\n\nThe PP20V_DCIN_FUSE was blown and removed by another tech company. \n\nThey sent it back with the message \"It keeps blowing the Fuse\"\n\nI have been doing basic soldering repairs and would like to give this a go.\n\nAs there are no schematics for this board (that I was able to find) could you please assist me with the specification of correct replacement fuse.\n\nThank you in advance."}
{"post_id":24318,"thread_id":24305,"title":"820-3662-a","user_id":2,"username":"dukefawks","post_date":"2017-08-15 17:27:57","message":"First find out why the fuse is blowing. Check for short to GND on both side of the fuse, check for a short to GND on PPBUS_G3H."}
{"post_id":24329,"thread_id":24305,"title":"820-3662-a","user_id":1028,"username":"spidey","post_date":"2017-08-16 00:25:50","message":"Thank you I will have a look, do you perhaps have proper schematics for Boardview for this model?"}
{"post_id":24844,"thread_id":24305,"title":"820-3662-a","user_id":1028,"username":"spidey","post_date":"2017-08-30 09:08:32","message":"Hi Duke,\n\nHerewith I humbly request a bit of patients as I am really new to this.\n\nSo here goes:\n\nI checked for short to ground on both sides of the (missing) fuse:\n\nF7005 - Pin 1 to GND - No Short\nF7005 - Pin 2 to GND - No Short\n\nPPBUS_G3H - F7700 Pin 1 to GND - No Short\n\nThank you \n\nSpidey"}
{"post_id":24868,"thread_id":24305,"title":"820-3662-a","user_id":2,"username":"dukefawks","post_date":"2017-08-30 17:36:46","message":"Replace the fuse and see what happens."}
{"post_id":24921,"thread_id":24305,"title":"820-3662-a","user_id":1028,"username":"spidey","post_date":"2017-09-01 02:37:46","message":"Hi Duke,\n\nThank you for your assistance, I am in the process of acquiring all necessary equipment. I am not able to send a message to Louis will it be possible to pass the message below to him or perhaps have a read and advise if this will be possible?\n\nHi Louis,\n\nMy name is Spidey Knepscheld I own a computer store a the rural part of South Africa. Our store is offering IT services for over 30yrs and in an, all change world need to constantly diversify to stay current and relevant in a demanding marketplace. \n\nI have been doing iPhone repairs as a side line but merely part replacement, not logic board repairs.\n\nI have watched your channel for some time and subscribed to this forum to learn and understand. I am quite confident that with the available information and this forum I will be able to do this.\n\nThe problem I am facing is due to my location and the limited availability of replacement components and donor boards.\n\nI am in the process of making a substantial investment by acquiring all the equipment as specified by you.\n\nSome of these are not available for shipping to South Africa and some are locally available.\n\nNo my request for possible assistance?\n\nThe equipment not available for shipping or locally I will buy directly from you, will International shipping to South Africa be possible?\n\nThen this is the difficult bit, components!!\n\nWill you be able to propose a list of common components that you would suggest I buy to start off with?\n\nMy apologies I would really appreciate your assistance.\n\nKind Regards\n\nSpidey Knepscheld\nSouth Africa"}
{"post_id":24978,"thread_id":24305,"title":"820-3662-a","user_id":1,"username":"larossmann","post_date":"2017-09-02 20:13:51","message":"I don't do any type of forwarding of purchases of equipment. Components is donor boards for most popular models plus LP8550\/ISL6259."}
{"post_id":25042,"thread_id":24305,"title":"820-3662-a","user_id":1028,"username":"spidey","post_date":"2017-09-05 02:17:27","message":"Hi Louis,\n\nThank you, my question for the equipment was merely to know if products I purchase directly from your site will be shipped to South Africa?"}
{"post_id":25055,"thread_id":24305,"title":"820-3662-a","user_id":1,"username":"larossmann","post_date":"2017-09-05 20:07:32","message":"Yes they will"}
