{"post_id":27747,"thread_id":27747,"title":"820-00165-A short on PP3V3_S4","user_id":812,"username":"Kalemaroni","post_date":"2017-11-06 19:41:23","message":"There is a short on PP3V3_S4 and when I put power into the circuit heat is coming from the area of C2953. I removed all the capacitors on that side of the board and the short is still there so I'm assuming it's coming from U2800 on the other side of the board.\n\nCan anyone please give me any info on this chip, like tips on how to remove it, is it replaceable from donor only or can I buy it somewhere, if so part number?\n\nMany thanks in advance for responses."}
{"post_id":27750,"thread_id":27747,"title":"820-00165-A short on PP3V3_S4","user_id":289,"username":"smiba","post_date":"2017-11-06 19:59:06","message":"I don't think I have ever seen U2800 die.\n\nAt what kind of short are we looking at? What is the resistance to ground in Ohms on PP3V3_S4? How many amps and volts are you injecting?\nI assume you have removed all the PP3V3_S4 capacitors in that area? (C2950\/51\/52\/53)\n\nIf the chip is really what gets hot you should also feel heat on the shield a little"}
{"post_id":28292,"thread_id":27747,"title":"820-00165-A short on PP3V3_S4","user_id":812,"username":"Kalemaroni","post_date":"2017-11-20 18:24:43","message":"Thanks for the response Smiba. I've been away a few days so sorry for the delay. Resistance to ground on PP3V3_S4 starts at about 3 ohms and drops steady to about 1 ohm before dropping very slowly. I injected 3.3v and 2a. Yes I removed all caps in that area."}
{"post_id":28294,"thread_id":27747,"title":"820-00165-A short on PP3V3_S4","user_id":289,"username":"smiba","post_date":"2017-11-20 18:46:10","message":"If you really think its U2800, remove the shield and check its temperature directly at the chip. You can de-solder the shield by pulling it up with your tweezers while heating up the sides where its attached to the board with. I assume its very similar to removing shields on iPhone motherboards, because I have never removed a shield from a macbook\n\nIf its indeed getting awfully hot when injecting voltage, remove it and see if the short goes away.\nIf there is corrosion in that area and the chip does not get very warm you could try a reflow with some nice flux first, you might have corrosion bridging some traces to ground.\nIf the chip is just at room temperature its most likely not the chip but internally inside the board"}
{"post_id":28301,"thread_id":27747,"title":"820-00165-A short on PP3V3_S4","user_id":812,"username":"Kalemaroni","post_date":"2017-11-20 21:27:54","message":"Confirmed it's U2800. Short on the actual chip."}
{"post_id":28308,"thread_id":27747,"title":"820-00165-A short on PP3V3_S4","user_id":2,"username":"dukefawks","post_date":"2017-11-20 21:45:27","message":"U2800 can be removed of course thunderbolt won't work anymore but it should be able to boot."}
{"post_id":28350,"thread_id":27747,"title":"820-00165-A short on PP3V3_S4","user_id":812,"username":"Kalemaroni","post_date":"2017-11-21 16:48:32","message":"Do you have any tips on buying a replacement chip? Are the ones on Ebay generally good? I also need to source a Wifi board connector - is there anywhere I can get that from?"}
{"post_id":28354,"thread_id":27747,"title":"820-00165-A short on PP3V3_S4","user_id":2,"username":"dukefawks","post_date":"2017-11-21 19:25:19","message":"Does the board work without U2800? I wouldn't replace the chip, just live without thunderbolt. WiFi connector needs to come from a donor board"}
{"post_id":28360,"thread_id":27747,"title":"820-00165-A short on PP3V3_S4","user_id":289,"username":"smiba","post_date":"2017-11-22 02:42:45","message":"I think you can get the chips from aliexpress or eBay, no idea about the quality though as I never had to replace this chip before. Its densely packed with solder balls so make sure to align it properly\nIf thunderbolt is no big requirement just go without it as its not worth spending time and money on"}
{"post_id":28379,"thread_id":27747,"title":"820-00165-A short on PP3V3_S4","user_id":812,"username":"Kalemaroni","post_date":"2017-11-22 11:02:13","message":"Thanks both of you - I appreciate your help."}
