[
    {
        "post_id":33886,
        "thread_id":33886,
        "title":"820-3332 Computer Shut Down Because of Problem Message.",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2018-04-19 15:31:04",
        "message":"Ok so this seemed like a simple U8900 issue fix, and after touching it up two days ago, the issue of it crashing on boot went away and for an entire day, the Mac was working fine would boot normal then shutdown normal no issue at all. NOW, it's not good. The battery, for one, says service battery, but that is not the issue as it does this even with no battery installed. What it seems to constantly do is boot about 60%, crash give me the error saying it restarted because of a problem message, hit a key try to boot, CRASH at the same point give SAME message, then on the third try boot and work fine. I have touched up U8900 again just to be safe and the joints are perfect, but the issue persists. I also noticed that if the computer hangs or pinwheels, closing the lid does not put the Mac to sleep as in the backlight and image stay on. The only thing I have not tried yet is a known good SSD. Could this be as simple as an OS problem\/SSD problem? SSD is not full has 60 GB's free, but it is on 10.13.4 the newest OS. I'm definitely going to try another drive to rule it out, but I'm officially stumped on this one. \n\nHistory btw: just started doing this out of the blue NO liquid damage period like very very clean and no drop damage that I can visibly see."
    },
    {
        "post_id":33887,
        "thread_id":33886,
        "title":"820-3332 Computer Shut Down Because of Problem Message.",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2018-04-19 15:44:48",
        "message":"Also resetting PRAM or SMC does nothing.\nBooting off my ASD disk externally never fails once."
    },
    {
        "post_id":33888,
        "thread_id":33886,
        "title":"820-3332 Computer Shut Down Because of Problem Message.",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2018-04-19 15:51:40",
        "message":"And one other thing, when I close the lid in the OS, the computer won't sleep BUT it also freezes and locks up at times.\n\nAnd the CPU and GPU get fairly warm when booting I have noticed that."
    },
    {
        "post_id":33906,
        "thread_id":33886,
        "title":"820-3332 Computer Shut Down Because of Problem Message.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-04-19 16:54:06",
        "message":"Booting off my ASD disk externally never fails once.\n\nSo isn't this just a corrupted OS? Enough shit with APFS that even a reinstall will not fix. Need to wipe and start over.."
    },
    {
        "post_id":33910,
        "thread_id":33886,
        "title":"820-3332 Computer Shut Down Because of Problem Message.",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2018-04-19 16:59:12",
        "message":"Ok that’s likely what I’m going to do. I got a test SSD running an older OS and it has yet to fail to boot once even though I have noticed it takes a while to shut down fully or at all without holding the power button down at some point. Also seems to have fixed lid issue too with the other SSD. I’m going to make sure customer wants to wipe it and go from there."
    },
    {
        "post_id":33913,
        "thread_id":33886,
        "title":"820-3332 Computer Shut Down Because of Problem Message.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-04-19 17:01:12",
        "message":"You can save the User folder and Library folder and copy that back on a clean OS to get everything back."
    },
    {
        "post_id":33915,
        "thread_id":33886,
        "title":"820-3332 Computer Shut Down Because of Problem Message.",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2018-04-19 17:04:21",
        "message":"Ok gonna have to snag a few externals for that but i will def try thanks Duke!"
    },
    {
        "post_id":34031,
        "thread_id":33886,
        "title":"820-3332 Computer Shut Down Because of Problem Message.",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2018-04-23 12:32:32",
        "message":"Ok so sounds like this one might still be giving issues. Have tried OS installers and it wants to hang on the loading bar 50% of the time or so, and the other 50% of the time it loads and says it can't install the OS. Also trying known good drive, it tends to hang at boot sometimes and freeze. Any ideas? Would replacing U8900 help anything? This seems like it's going to suck"
    },
    {
        "post_id":34037,
        "thread_id":33886,
        "title":"820-3332 Computer Shut Down Because of Problem Message.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-04-23 17:11:42",
        "message":"Cant install issue is probably the date\/time being wrong.\n\nHanging on boot is likely a GPU\/VRAM issue. It is the screw hole right next to the VRAM that causes cracked solder under VRAM. Pull and reball VRAM and have fun removing the glue..."
    },
    {
        "post_id":34041,
        "thread_id":33886,
        "title":"820-3332 Computer Shut Down Because of Problem Message.",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2018-04-23 19:19:07",
        "message":"Ughhh I kinda figured that’s the issue. That sucks :("
    }
]