[
    {
        "post_id":13201,
        "thread_id":13201,
        "title":"[SOLVED]820-3115-b no video",
        "user_id":499,
        "username":"andrew boren",
        "post_date":"2017-01-18 14:37:09",
        "message":"what should i check first? i know the machine is powered on, and i have back-light, just a white screen. the screen will dim if i remove the power cable telling me it is booted up into the os. i have no history with this board so im not sure what happened to it. if i wanted to see if the gpu is putting out video what line do i check? can i check it with a volt meter or do i need an oscilloscope?"
    },
    {
        "post_id":13210,
        "thread_id":13201,
        "title":"[SOLVED]820-3115-b no video",
        "user_id":558,
        "username":"arghhh",
        "post_date":"2017-01-18 20:04:30",
        "message":"History of the device? Voltage on L9004? Is there image on the external?"
    },
    {
        "post_id":13217,
        "thread_id":13201,
        "title":"[SOLVED]820-3115-b no video",
        "user_id":557,
        "username":"MDY",
        "post_date":"2017-01-19 00:44:08",
        "message":"Mouse light on? Pram reset? Did you tried working lcd cable and screen?"
    },
    {
        "post_id":13230,
        "thread_id":13201,
        "title":"[SOLVED]820-3115-b no video",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-01-19 03:22:06",
        "message":"This is usually no 3V getting to the LCD. Check 3V on both sides of L9004 and check connector\/cable for damage. Could also just be a bad LCD, test with known good assembly."
    },
    {
        "post_id":13266,
        "thread_id":13201,
        "title":"[SOLVED]820-3115-b no video",
        "user_id":499,
        "username":"andrew boren",
        "post_date":"2017-01-19 08:41:45",
        "message":"im getting 1.3v on pin 2 on pin one i read 0 for l9004 and yes tested with good screen as well as pram reset 3 times. and im not sure what a mouse light is. and yes on an external without a screen plugged in, i get apple logo and boot, but only if the lcd is unplugged of course."
    },
    {
        "post_id":13272,
        "thread_id":13201,
        "title":"[SOLVED]820-3115-b no video",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-01-19 09:23:47",
        "message":"Replace U9000 and L9004. But test first if there is no short to GND on pin 2 of L9004 with the LCD plugged in or it will be fried again."
    },
    {
        "post_id":13339,
        "thread_id":13201,
        "title":"[SOLVED]820-3115-b no video",
        "user_id":499,
        "username":"andrew boren",
        "post_date":"2017-01-20 13:31:12",
        "message":"how would i have noticed l9004 if i hadnt asked? maybe im not asking that right. i could tell i had power, and boot, but had no screen, tested with working screen. if you hadnt told me to look for l9004, what would have made me look there? trying to get batter at self diag. but i never thought to look there because the backlight was kicking on. i figured the lcd had to be seen for the boost circuit to power the backlight.\n\nps u9000 seams to be fine, looks like just l9004 was bad"
    },
    {
        "post_id":71803,
        "thread_id":13201,
        "title":"[SOLVED]820-3115-b no video",
        "user_id":29844,
        "username":"Shashi",
        "post_date":"2021-02-18 03:32:19",
        "message":"820-3115-b backlight ok but no video j9000 connector pin 2&3 are 3.3v what is aprob"
    },
    {
        "post_id":71804,
        "thread_id":13201,
        "title":"[SOLVED]820-3115-b no video",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-02-18 03:49:37",
        "message":"First of all, welcome to the forum!\n\nPlease, open new thread with your problem..."
    }
]