{"post_id":10445,"thread_id":10445,"title":"Mac Mini 820-3059-A (2011) 3 Beeps","user_id":468,"username":"ALB-Repairs","post_date":"2016-11-30 08:28:23","message":"Hey guys this ones got me stumped, Bit of history.\n\nThis was my personal machine before lending it to a co worker. It was ran for 6 months before GPU failure, i fitted a new GPU to it (AMD 216-0810005) and it ran well.\nMaybe a couple of months later it started freezing and i thought - Oh great, the GPU is going to die again, bad\/fake chip.ect\n\nAfter i had a fiddle it stopped freezing, this was after removing ram from the top slot. I tried cleaning out the top slot but the more i messed with it the worse it got, Eventually the top slot was giving 3 beeps.\n\nAfter this i threw in 1x8GB stick and carried on, again the mac was fine for a good amount of time, before i lent it to a co-worker. He went home one evening and the bottom slot is now giving 3 beeps aswell. \n\nIve checked the voltage for the Ram and 1V5 is present. This seems to be a degenerative issue based on the timeframe it took for both slots top give up.\n\nIm scratching my head but having a guess that its something to do with the CPU because of its close proximity to the GPU on this model.\n\nAnyone got any ideas, things to check\/try?\n\nThanks."}
{"post_id":10449,"thread_id":10445,"title":"Mac Mini 820-3059-A (2011) 3 Beeps","user_id":2,"username":"dukefawks","post_date":"2016-11-30 08:49:27","message":"Test slots with a RAM slot tester. As these slots are BGA there is not much to fix on this though......"}
{"post_id":10455,"thread_id":10445,"title":"Mac Mini 820-3059-A (2011) 3 Beeps","user_id":468,"username":"ALB-Repairs","post_date":"2016-11-30 09:40:15","message":"Will update when i have one. something i should have purchased years ago. \nThanks"}
{"post_id":17020,"thread_id":10445,"title":"Mac Mini 820-3059-A (2011) 3 Beeps","user_id":735,"username":"theodore","post_date":"2017-03-20 15:34:29","message":"I have a similar problem with a 2.7Ghz i7 820-3059-A Mac Mini, With no RAM in ether slot the system will do the ram beep, however when I put ram into ether slot the system does not chime, no video, fan spins and that it. Any idea what this might be?"}
{"post_id":17065,"thread_id":10445,"title":"Mac Mini 820-3059-A (2011) 3 Beeps","user_id":2,"username":"dukefawks","post_date":"2017-03-21 05:44:42","message":"Bad GPU, these have the same shitty GPU as the 2011 macbook pros."}
{"post_id":17083,"thread_id":10445,"title":"Mac Mini 820-3059-A (2011) 3 Beeps","user_id":735,"username":"theodore","post_date":"2017-03-21 08:21:33","message":"Thanks for the info."}
