[
    {
        "post_id":103328,
        "thread_id":64417,
        "title":"A1707 Power Button \/ KB Backlight \/ Touchbar non functional after water damage",
        "user_id":57285,
        "username":"miccodan",
        "post_date":"2023-12-27 14:11:58",
        "message":"Hello everyone, this is my first post here and I was hoping to get some help with a macbook that I will post the details for below. I have been attempting to teach myself component level board repair over the past month and do own all the main tools required for this type of work. I also feel confident in being able to complete any of the micro soldering or bga work required as I do have a fair amount of experience. I have been using the resources provided by Louis and others online but my knowledge in regards to fault finding \/ reading and tracking power using a schematic is very limited. Let me explain the problem I have with this specific laptop below, thanks to anyone able to offer their time and assistance. Very grateful for all the help you guys provide.  \n\nMake\/Model: Mid 2017 Macbook Pro with Touchbar A1707 (EMC 3162)\nMotherboard Number: 820-00923\n\nSymptoms\/Background: Laptop had water spilt on it, board was removed and everything was cleaned, all of the corrosion was on the side of board where U2800 is, the other parts still have white stickers and appeared clean under microscope. Laptop was reassembled and upon plugging the charger in it does power on and begin to boot, battery is also being charged succesfully. However touchbar, keyboard backlight and power button do not function. The power button does not power on or off the laptop and eventually the OS loads to the point where it requests wifi and after connecting will give a update error with the only option to shut down.\n\nI have learnt that this sequence and error will happen when the touchbar is not functioning via the repair wiki. I do not have a another touch id button \/ touchbar to try. I took all measurements of voltage and resistance to ground which I will post below.  I also checked SMC_ONOFF_L level which is 3.4v and does not change upon pressing the power button. \n\nThanks to anyone able to offer their knowledge or assistance with this.\n\n[ATTACH type=\"full\"]61439[\/ATTACH]"
    },
    {
        "post_id":103329,
        "thread_id":64417,
        "title":"A1707 Power Button \/ KB Backlight \/ Touchbar non functional after water damage",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-12-27 16:20:57",
        "message":"First of all, welcome to the forum!\n\nVery likely touch ID and touchbar are both affected by liquid.\nMachine should start in safe mode without touchbar connected; try that."
    },
    {
        "post_id":103331,
        "thread_id":64417,
        "title":"A1707 Power Button \/ KB Backlight \/ Touchbar non functional after water damage",
        "user_id":57285,
        "username":"miccodan",
        "post_date":"2023-12-27 16:51:04",
        "message":"[QUOTE=\"2informaticos, post: 103329, member: 682\"]\nFirst of all, welcome to the forum!\n\nVery likely touch ID and touchbar are both affected by liquid.\nMachine should start in safe mode without touchbar connected; try that.\n[\/QUOTE]\nHello!\nYes, that is indeed correct. It will start in safe mode and I should add that I previously tried starting in safe (with touchbar still connected) and it also started fine."
    },
    {
        "post_id":103336,
        "thread_id":64417,
        "title":"A1707 Power Button \/ KB Backlight \/ Touchbar non functional after water damage",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-12-28 03:38:02",
        "message":"You should test with known good accessories.\n\nChanging touch ID will lose fingerprint reading option.\nPeoples open it and clean the button contacts.\nSome videos should be available on Internet."
    },
    {
        "post_id":103345,
        "thread_id":64417,
        "title":"A1707 Power Button \/ KB Backlight \/ Touchbar non functional after water damage",
        "user_id":57285,
        "username":"miccodan",
        "post_date":"2023-12-28 19:49:19",
        "message":"[QUOTE=\"2informaticos, post: 103336, member: 682\"]\nYou should test with known good accessories.\n\nChanging touch ID will lose fingerprint reading option.\nPeoples open it and clean the button contacts.\nSome videos should be available on Internet.\n[\/QUOTE]\nThanks, I have ordered a new touchbar and power button flex. You were correct in your diagnosis and upon further inspection they were indeed damaged. Thanks for your help haha."
    },
    {
        "post_id":103347,
        "thread_id":64417,
        "title":"A1707 Power Button \/ KB Backlight \/ Touchbar non functional after water damage",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-12-28 22:51:52",
        "message":"Thanks for feedback.\n\nPlease, write directly into reply box, instead of clicking Reply button.\nI don't see any reason to quote an entire post, visible few centimeters above.\nWe all try to maintain forum aesthetic..."
    }
]