{"post_id":8583,"thread_id":8583,"title":"No boot from battery, A1465 Early 2015, boots from adapter and charges","user_id":390,"username":"ereddekopp","post_date":"2016-10-24 20:51:53","message":"This system came in for liquid damage...was not turning on. It powered off the power pads. I replaced the keyboard and trackpad....they took the bulk of the liquid spill damage. There wasn't much on the board itself, but ran it through the ultrasonic (setup per Louis' instructions) just to make sure. So after repair and reassemble all was perfectly and working normally. Customer came to pick it up and system would not power on. In the back it goes again, another trip to the ultrasonic, works fine again and is booting from the battery. Guy comes back in again and again it won't power up.\n\nWhere I seem to be at is, the system powers fine connected to the magsafe, it also sees, charges and will run off the battery...but will not boot from the battery...not even a second battery I tried.\n\nJust was wondering where to start with this to track the issue down?"}
{"post_id":8584,"thread_id":8583,"title":"No boot from battery, A1465 Early 2015, boots from adapter and charges","user_id":2,"username":"dukefawks","post_date":"2016-10-24 21:33:39","message":"Is it really charging and the percentage going up?"}
{"post_id":8587,"thread_id":8583,"title":"No boot from battery, A1465 Early 2015, boots from adapter and charges","user_id":390,"username":"ereddekopp","post_date":"2016-10-24 23:38:11","message":"It is. You can watch the percentage increase, I also have a diagnostic I run that reads and tests the battery, which comes back fine. Once the system is up you can also unplug it and it will run with no issue. It just won't power up from the battery. After the second trip through the ultrasonic it did boot from the battery. I kept testing that specifically. But then you walk away and it sits a day or two and nothing until I plug it in."}
{"post_id":8598,"thread_id":8583,"title":"No boot from battery, A1465 Early 2015, boots from adapter and charges","user_id":1,"username":"larossmann","post_date":"2016-10-25 13:53:04","message":"This is going to come down to this question, where was the corrosion on the board originally?"}
{"post_id":8609,"thread_id":8583,"title":"No boot from battery, A1465 Early 2015, boots from adapter and charges","user_id":390,"username":"ereddekopp","post_date":"2016-10-25 16:07:33","message":"Yeah I am admittedly feeling stupid for not examining the board under the microscope prior to the ultrasonic. On a quick side note, I forgot to mention I did try a different I\/O magsafe board and also a different keyboard cable.  \n  Louis the bulk of the liquid was under the battery on the trackpad and by the fan, so also around the logic board by that I\/O connector."}
{"post_id":8610,"thread_id":8583,"title":"No boot from battery, A1465 Early 2015, boots from adapter and charges","user_id":390,"username":"ereddekopp","post_date":"2016-10-25 16:28:49","message":"I just looked at the I\/O connector on the logic board under the microscope and two of the pin's backs...the exposed area...are discolored and corroded in appearance. Could that connector cause this kind of behavior? It wouldn't seem it would have any influence on the logic board using the battery for booting."}
{"post_id":8626,"thread_id":8583,"title":"No boot from battery, A1465 Early 2015, boots from adapter and charges","user_id":2,"username":"dukefawks","post_date":"2016-10-26 00:02:28","message":"I suspect corrosion under SMC or J9500"}
{"post_id":8675,"thread_id":8583,"title":"No boot from battery, A1465 Early 2015, boots from adapter and charges","user_id":390,"username":"ereddekopp","post_date":"2016-10-26 14:42:39","message":"Ok, I will check both of those and report back. Thank you all for the ideas and guidance!"}
{"post_id":9845,"thread_id":8583,"title":"No boot from battery, A1465 Early 2015, boots from adapter and charges","user_id":390,"username":"ereddekopp","post_date":"2016-11-17 14:12:52","message":"A quick addition to this, just in case it triggers any ideas...if I fully disassemble the system...then reassemble it, it works perfect initially. Powers and boots on the battery. On the cable. I did this last night. But then I closed the lid and let it sit powered off until today. Came in and tried to power it up on the battery...nothing. Plug the cable in...it powers up. Unplug it and try to power it up, nothing. Will pull back apart today to check SMC and J9500"}
