{"post_id":33820,"thread_id":33820,"title":"820-3330 - no image (dropped laptop)","user_id":461,"username":"Gurmon","post_date":"2018-04-18 07:23:31","message":"Okay, I’m properly stuck on this one. In fact it’s the second board which I've failed to fix with the same symptoms.\nBoth of these boards are the result of being dropped.\n\nThe issue is I cannot get an image out, either externally or the LCD.  (SMC_LID is 3.3V)\n\nThe board powers up, chimes, can be PRAM reset.\nI get All_EG_PGOOD, so the power side of the GPU is ok.\nI’m basically missing LVDS_IG_PANEL_PWR. Which is generated by U1800.\nI know its not the PCH, I swapped this out on the 1st board. I also replaced the GPU.\n(I usually dont start swapping stuff out)\n\nYou can see I’m out of ideas, its probably hopeless, as I’m beginning to think this issue is inside the board.\nI thought I’d try here to see if anyone has solved this.?"}
{"post_id":33847,"thread_id":33820,"title":"820-3330 - no image (dropped laptop)","user_id":2,"username":"dukefawks","post_date":"2018-04-18 21:00:48","message":"I would more suspect GPU is not initialized. If this was after a drop I think you already know it is most likely a ripped trace under the CPU\/GPU. Check diode mode on all the caps in the PCIE lanes from CPU to GPU. Could also be balls\/traces under the MUX."}
{"post_id":33873,"thread_id":33820,"title":"820-3330 - no image (dropped laptop)","user_id":461,"username":"Gurmon","post_date":"2018-04-19 02:15:16","message":"I replaced GPU, MUX and PCH, only leaves CPU and traces inside board. I checked PCIe lines with a known good board and they are all fine. \n\nI might as well re-ball the CPU, what have i got to loose, already about 4-5 hours deep into this."}
{"post_id":33895,"thread_id":33820,"title":"820-3330 - no image (dropped laptop)","user_id":2,"username":"dukefawks","post_date":"2018-04-19 18:38:13","message":"I honestly wouldn't bother with a board that had a known impact damage."}
