{"post_id":16342,"thread_id":16342,"title":"820-4924 2015 rMBP diagnostics error (PPF004)","user_id":90,"username":"ytesfay80","post_date":"2017-03-11 00:51:03","message":"I initally received this 2015 MBPR as having liquid damage and it was running slow and the system showed as using about 60% which was way too high.\nThe diagnostics test failed in these areas as well. PPN001, PFM006 (SMC - no liquid damage around SMC), and NDC001 (Camera).\n\nThere wasn't damage in many areas but I cleaned the liquid damage and replaced one component. Below is a list of areas that had corrosion\nu7820\nc7522\ncamera connector (corrosion inside connector - fluxed and heated and camera works now.)\nq1840 (replaced)\n\nNow the machine runs fine and the system runs at like 4% and the fans aren't spinning fast. The issue is now on the diagnostics I am getting the error for the fan (PPF004). I tried plugging in multiple different fans, another trackpad+tpadcable, an SMC reset but they all gave the same error code.\nDuring the diagnostics test the fan will be spinning on high but while logged in and using the machine the fan doesn't even spin at all for the most part and the heatsink is not very hot to touch.\nI'm wondering if this is something I should worry about or should I send this back to the person like this"}
{"post_id":16343,"thread_id":16342,"title":"820-4924 2015 rMBP diagnostics error (PPF004)","user_id":682,"username":"2informaticos","post_date":"2017-03-11 02:26:18","message":"4924 starts with no fan spining, as normal.\nIt wil spin when CPU gets hot.\nIf not, then you have a problem..."}
{"post_id":16345,"thread_id":16342,"title":"820-4924 2015 rMBP diagnostics error (PPF004)","user_id":90,"username":"ytesfay80","post_date":"2017-03-11 02:51:50","message":"I'm aware that it only spins when it gets hot and it looks like it is functioning properly but I was just concerned about the fact that the diagnostics test says there is an issue with the fan."}
{"post_id":16379,"thread_id":16342,"title":"820-4924 2015 rMBP diagnostics error (PPF004)","user_id":90,"username":"ytesfay80","post_date":"2017-03-11 14:06:25","message":"Any ideas on this? [USER=\"2\"]dukefawks[\/USER] [USER=\"1\"]larossmann[\/USER]"}
{"post_id":16381,"thread_id":16342,"title":"820-4924 2015 rMBP diagnostics error (PPF004)","user_id":726,"username":"jason_microsoldering","post_date":"2017-03-11 14:09:25","message":"Launch HWSensors\/HWMonitor and see if anything is reading abnormally."}
{"post_id":16384,"thread_id":16342,"title":"820-4924 2015 rMBP diagnostics error (PPF004)","user_id":90,"username":"ytesfay80","post_date":"2017-03-11 16:14:49","message":"Okay I installed it and it doesn't look like anything is reading abnormally except maybe for Airport Proximity.\n\nI attached pictures of the readings so you may be able to see something."}
{"post_id":16396,"thread_id":16342,"title":"820-4924 2015 rMBP diagnostics error (PPF004)","user_id":2,"username":"dukefawks","post_date":"2017-03-11 19:21:36","message":"Fan RPM is not displayed so something up with the tacho signal from the fan maybe. Run CPUTEST and see if the fan starts when the machine heats up."}
{"post_id":16400,"thread_id":16342,"title":"820-4924 2015 rMBP diagnostics error (PPF004)","user_id":90,"username":"ytesfay80","post_date":"2017-03-11 21:32:32","message":"The fan wasn't spinning when I took that picture of the reading. I guess the cpu wasn't hot enough to make the fan turn on. I've used 2 other fans so the fan isn't an issue.\n\nI installed CPUTest for Mac but it wouldn't work so I found an article that said to use the command \"yes > \/dev\/null\" for each cpu core so I just opened two windows in the terminal and the cpu got really hot and an alert came from \"HWMonitor\" telling me the cpu was about to overheat.\n\nThe fan began spinning but not on high like I thought it would. Here is another image of the readings."}
{"post_id":16403,"thread_id":16342,"title":"820-4924 2015 rMBP diagnostics error (PPF004)","user_id":732,"username":"peterfixit","post_date":"2017-03-11 22:13:12","message":"is the cpu really that hot? or is it just reporting incorrectly?"}
{"post_id":16404,"thread_id":16342,"title":"820-4924 2015 rMBP diagnostics error (PPF004)","user_id":90,"username":"ytesfay80","post_date":"2017-03-11 22:40:20","message":"When I did that test the CPU heatsink was really hot to touch. I could only keep my finger on there for 1-2 seconds.\n\nThe second image was right after I turned off the cpu test. The fan still kept spinning afterwards until it cooled back down.\n\nI did the test again and the fan didn't start spinning until the cpu core temperature got to 90 Celsius."}
{"post_id":16410,"thread_id":16342,"title":"820-4924 2015 rMBP diagnostics error (PPF004)","user_id":2,"username":"dukefawks","post_date":"2017-03-12 04:35:34","message":"90 is fine for the CPU. No idea what it could be at this point. If the machine seems to work OK just forget about it."}
{"post_id":16426,"thread_id":16342,"title":"820-4924 2015 rMBP diagnostics error (PPF004)","user_id":90,"username":"ytesfay80","post_date":"2017-03-12 14:44:47","message":"Okay thanks."}
