[
    {
        "post_id":100969,
        "thread_id":64117,
        "title":"820-3437 dont turn on",
        "user_id":64,
        "username":"Dozer",
        "post_date":"2023-08-11 06:20:57",
        "message":"got this macbook air with liquid damage\n\ncleaned it in ultrasonic, after visual inspection dont found anything what immediately catches the eye\n\norange\/green light on macsafe\n3.42V present\nPPBUS_G3H is 1.5V\n\nopen the F7140 is 8.52V \n\nthere is no short to ground in PPBUS_G3H but i can measure only 0,110 in diode mode, should be about 0,165\n\npulles out F7700 but same result\n\nmeasured resitance on L7130, about 150 ohm, a good board shows about 500\n\nwith thermal camera i found Q7630 goes about 45 Grad Celsius\n\nAfter replacement of Q7630 I go 500 ohm resistance and a fan spin :-)\n\nbut seems still like brain death, measured on the U6100 pin 5, 6,7 got in diode mode high value (more than 1.04...\n\nTryed another u6100 from 820-3437 programmed it with the clear me , now, diode values are good. starting the board fan is spinning, after about 8 sec it turns off and start again\n\nsoldered back the \"old\" u6100, now here the values pin 5,6,7 are good as well \nbut board starts and thats it fan spins, after a while with full power, nothing happens and no cycling.\n\n\nneed some help please"
    },
    {
        "post_id":100970,
        "thread_id":64117,
        "title":"820-3437 dont turn on",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-08-11 06:47:18",
        "message":"This board should restart 2 times before turns on.\n\nIf Q7630 was bad, there is a big chance to have bad PCH.\n\nCheck all SPI Bus Termination resistors and their traces.\nClean J6100, if looks uggly; remove it, if not possible to clean properly.\n\nDid you reball SMC?"
    },
    {
        "post_id":100976,
        "thread_id":64117,
        "title":"820-3437 dont turn on",
        "user_id":64,
        "username":"Dozer",
        "post_date":"2023-08-11 07:14:28",
        "message":"ok. before i replaced Q7630 the PCH was heating up quick to about 45C\nJ6100 removed already\nSMC not reballed"
    },
    {
        "post_id":101213,
        "thread_id":64117,
        "title":"820-3437 dont turn on",
        "user_id":64,
        "username":"Dozer",
        "post_date":"2023-08-27 00:28:32",
        "message":"found no problems with SPI Bus Termination resistors\nso i decided to replace the mainboard, i think you are right, PCH is bad"
    }
]