[
    {
        "post_id":14025,
        "thread_id":14025,
        "title":"820-3115 Wifi Issues (shuts down at boot options unless wifi card is unplugged)",
        "user_id":468,
        "username":"ALB-Repairs",
        "post_date":"2017-02-01 10:58:01",
        "message":"Never seen this before- As stated in the title, the machine hates wifi cards, if i hold ALT it just shuts off again, unless no wifi hardware is present. \n\nWas liquid damaged but fairly minimal. Ive tried a new card and cable to no avail. When the wifi card is unplugged the machine runs solidly."
    },
    {
        "post_id":14031,
        "thread_id":14025,
        "title":"820-3115 Wifi Issues (shuts down at boot options unless wifi card is unplugged)",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-02-01 11:12:49",
        "message":"The 3rd one that is posted on the forum now. I have never seen this myself and the 2 other ones were never solved I think. Use the search to find them."
    },
    {
        "post_id":14091,
        "thread_id":14025,
        "title":"820-3115 Wifi Issues (shuts down at boot options unless wifi card is unplugged)",
        "user_id":468,
        "username":"ALB-Repairs",
        "post_date":"2017-02-02 02:32:51",
        "message":"This is certainly an odd issue, ive tested the shell with a spare board and the issue is not present. Ive followed your suggestion on one of the other threads and removed U3540- im assuming this is to determine weather the cause was wireless or bluetooth. \n\nWith u3540 removed the issue does not persist. So that puts it down to wireless i guess? Do you have any suggestions on things to check\/replace?"
    },
    {
        "post_id":14097,
        "thread_id":14025,
        "title":"820-3115 Wifi Issues (shuts down at boot options unless wifi card is unplugged)",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-02-02 03:34:58",
        "message":"Same as the other cases, I have no idea."
    },
    {
        "post_id":14105,
        "thread_id":14025,
        "title":"820-3115 Wifi Issues (shuts down at boot options unless wifi card is unplugged)",
        "user_id":468,
        "username":"ALB-Repairs",
        "post_date":"2017-02-02 06:00:54",
        "message":"Niether do i, Ive tried a light PCH reflow, removed and replaced the connector encase of corrosion, replaced allot of other stuff like u3900, SPI rom, other wireless support stuff.ect\nMay go in my 'rainy day' pile for me to waste time with later. \nReflown the SMC aswell, checked under a microscope thoroughly, theres really not clues on the board for suggesting where the fualt lies.\n\nill replace the board with my stock."
    }
]