[
    {
        "post_id":75769,
        "thread_id":61236,
        "title":"MacBook Pro 15\", A1398 screen connector corroded",
        "user_id":29198,
        "username":"Esmon",
        "post_date":"2021-05-25 04:30:40",
        "message":"Hello there,\n\nI could use some advise \/ tips & tricks \/ do's & don'ts \/ confirmation with following:\nI have an A1398 with no backlight, the LCD works properly. The motherboard is ok, a spare screen lights up as usual.\n\nThe probable cause is a short under the connector at the display side. I spotted corrosion on the connector. I assume the user spilled too much cleaner on the screen in the assumption she\/he could wipe off the staingate issue...\n\nThere is quite some corrosion on pins 1-5 being PPVOUT LCDBKLT, I2C BKLT SCL and SDA, so it is logical this is the cause. \n\nThere is a cap underneath the LCD PCB - what should this measure? \n\nHow do I repair this in the most safe way? I thought of following:\n-Put a heat buffer below LCD print (alu-foil or so)\n-Pre-heat to max 60 degrees Celsius\n-Remove connector with wide soldering pin\n-Clean residue with alcohol\n-Solder new connector\n-How do you remove the flux (standard Amtech) that gets in the connector while soldering???\n-Measure for shorts\n-Give it a try\n\nAny experiences with this kind of issue would be very welcome because it is either a fix of 10 or 300 € if I screw up...\n\nBest regards,\nStijn\n\n\n[ATTACH type=\"full\"]59898[\/ATTACH][ATTACH type=\"full\"]59899[\/ATTACH]"
    },
    {
        "post_id":75778,
        "thread_id":61236,
        "title":"MacBook Pro 15\", A1398 screen connector corroded",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-05-25 08:00:28",
        "message":"First of all, welcome to the forum!\n\nGet 138 degrees solder paste and will help you to remove the connector, without applying too much heat.\n\n58 degrees alloy bars available on eBay (ChipQuik); much better in your case.\n[URL unfurl=\"true\"]https:\/\/www.ebay.es\/itm\/182437753933?hash=item2a7a23344d:g:iGgAAOSwoVZcBxZf[\/URL]"
    },
    {
        "post_id":75829,
        "thread_id":61236,
        "title":"MacBook Pro 15\", A1398 screen connector corroded",
        "user_id":29198,
        "username":"Esmon",
        "post_date":"2021-05-26 00:12:55",
        "message":"Thank you so much, I didn't know the existence of ChipQuick. \nCould have avoided a lot of misery with this...\n\nTo understand correctly: the 138 degrees solder paste and the ChipQuik are alternatives to get the job done right? It is or the one, or the other.\n\nIf soldering a new connector on and Flux like the Amtech 559 gets inside the connector, is treating it with alcohol removing it all in your opinion. \nI realise this is a very basic question, but couldn't find a proper answer online, while I have some difficult experiences with it (and I do not have an ultrasonic cleaner)."
    },
    {
        "post_id":75830,
        "thread_id":61236,
        "title":"MacBook Pro 15\", A1398 screen connector corroded",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-05-26 01:59:21",
        "message":"Alcohol is good enough to clean the connector.\nI recommend you the 58 degrees alloy version, instead of 138.\nYou don't even need to apply hot air in this case."
    },
    {
        "post_id":77975,
        "thread_id":61236,
        "title":"MacBook Pro 15\", A1398 screen connector corroded",
        "user_id":29198,
        "username":"Esmon",
        "post_date":"2021-07-20 12:55:58",
        "message":"Thanks for the good advice! I managed to replace the connector and fix it."
    }
]