[
    {
        "post_id":37444,
        "thread_id":37444,
        "title":"A1278 820-2936-B USB short to ground",
        "user_id":1690,
        "username":"RepairGuy101",
        "post_date":"2018-07-21 20:13:35",
        "message":"For some reason I can't post pictures, format not working or something.\n\nAnyway, liquid damage everywhere but SD and a USB port not working.\n\n​​​​​​​I'm getting 3.3v (a bit less but nothing like a short) at EN and output. D9410 is getting 3.3v, so what the hell is dragging this thing down to ground?\n\nU9410 and the resistors and caps around it were replaced. Pin, 7, 6, 5 are still shorted and getting nothing at C9412, R9410 and R9411 but about 2mA at C9410 and very slowly climbs up a little."
    },
    {
        "post_id":37446,
        "thread_id":37444,
        "title":"A1278 820-2936-B USB short to ground",
        "user_id":1690,
        "username":"RepairGuy101",
        "post_date":"2018-07-21 20:25:06",
        "message":"U9310 is getting 0.5v as well. Not sure if I'm just using crappy parts from the damaged boards I'm using as donors."
    },
    {
        "post_id":37451,
        "thread_id":37444,
        "title":"A1278 820-2936-B USB short to ground",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-07-22 03:20:14",
        "message":"U9410 gets input power from PPBUS_G3H, via R0960.\nU9310, U9410 are used for dispay port and T29 connector, not for USB.\n\nWhich USB por is shorted?\n\nAs you have corroded board, check L4600\/10 and L4605\/15 first.\nAlso check around D4600\/10 and U4650."
    },
    {
        "post_id":37468,
        "thread_id":37444,
        "title":"A1278 820-2936-B USB short to ground",
        "user_id":1690,
        "username":"RepairGuy101",
        "post_date":"2018-07-22 18:50:46",
        "message":"Thanks for the reply. I spent way too much time on this board and got things mixed up. Had to replace about 30 components. I meant display port and actually completely forgot about checking USB circuitry cause of this annoying short that seems to be in the board. I'll have to see if the USB port is grounded to the same spot. It's J4600. I've fixed this problem before but this board is pretty bad."
    },
    {
        "post_id":37471,
        "thread_id":37444,
        "title":"A1278 820-2936-B USB short to ground",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-07-23 03:21:18",
        "message":"The board doesn't need display port and T29 circuitry to start.\nIf you have a short there, just isolate it; remove Q3880, I think R0960 is not stuffed.\nIf client doesn't need these connections, rip off U3810\/15\/16 too. You can use them as spare parts for other repairs."
    },
    {
        "post_id":37511,
        "thread_id":37444,
        "title":"A1278 820-2936-B USB short to ground",
        "user_id":1690,
        "username":"RepairGuy101",
        "post_date":"2018-07-24 11:21:24",
        "message":"Nope. Removed those and I double checked the USB circuitry and they weren't getting power from U2600 and  U2650 (USB hubs). I reflowed the SMC very gently and now the board shuts down when I touch ground with the ground probe. I give up for now, spent too much time on this. Appreciate the help."
    }
]