{"post_id":8177,"thread_id":8177,"title":"[SOLVED]Late 2012 13\" Retina Only one fan spins","user_id":61,"username":"wrbailey","post_date":"2016-10-16 22:33:35","message":"I have a late 2012 13\" retina 820-3462 board.\n\nLiquid damage.\n\nAll this machine seemed to need was a good cleaning and a new battery. \n\nAll was working well. Passed all ASD tests and BOTH fans were spinning. Machine was completely acting normal. All power rails present and accounted for. I was just waiting for a new battery...\n\nAfter a couple of days, I got a new battery in and opened the bottom to install, when (before installing, battery still not installed) I noticed that only the left fan, the one closest to the the LCD connector was spinning. \n\nIs there a reason that only one fan would not be spinning? I tried a different fan, and the \"right\" fan still does not spin. I did take measurements, but it's been a couple days. \n\nI have the machine in front of me again and I am going to take it out of the housing and check Q5660 (though it looks like it is shared between both fans... and if one works, then Q5660 should be fine. \n\nAnyone have an answer as to why one fan would go and not the other?\n\nI'll take measurements at the fans and get back to you... but in the meantime, if anyone has any ideas, please let me know!\n\nThanks!"}
{"post_id":8178,"thread_id":8177,"title":"[SOLVED]Late 2012 13\" Retina Only one fan spins","user_id":61,"username":"wrbailey","post_date":"2016-10-16 22:52:50","message":"Left (spinning high speed, due to not plugged in to track pad\/keyboard etc...)\n\npin  measurement\n1   5.05\n2   3.5\n3   0\n4   1.65\n5   0\n\n\nRight (Not spinning)\n\n\n1   5.04\n2   1.03\n3   0\n4   3.31\n5   0"}
{"post_id":8180,"thread_id":8177,"title":"[SOLVED]Late 2012 13\" Retina Only one fan spins","user_id":2,"username":"dukefawks","post_date":"2016-10-17 00:51:48","message":"Pin 1 and 4 of Q5660? Probably crap under SMC."}
{"post_id":8182,"thread_id":8177,"title":"[SOLVED]Late 2012 13\" Retina Only one fan spins","user_id":61,"username":"wrbailey","post_date":"2016-10-17 08:11:31","message":"Looks like the two fans I tried in place were also bad... I put one from a 2012 15\" retina and it spins. I then tried the left side fan into the right side and it also spins (and the 15\" retina and the left side fan also spin together.)\n\nLooks like it is just a bad fan... not sure how that happens, but oh well. Ordered a new fan.\n\nThanks!"}
