{"post_id":94382,"thread_id":63327,"title":"A1534 emc 2746","user_id":35752,"username":"Anterweb","post_date":"2022-11-28 11:41:11","message":"History on this, \n\nIt came to me in April this year for a new battery, Got a call from them yesterday saying the battery had failed and the keyboard wasn't working due to the battery swelling,\n\nI get the Air today and open it up the battery looks perfect no swelling at all, but not seen in OS and wont run off batt, I then notice that the keyboard works fine on the login screen but as soon as OS boots keyboard does not  work ( Trackpad does! ) (( Also noticed there is no keyboard back light and pushing the keyboard brightness buttons on keyboard causes the mac to hang! ))\n\nI then notice that the charger that was in the bag with this air was very badly frayed with bare wires exposed, \n\nI've installed a new battery and now it charges and runs off new battery but still no Keyboard or backlight , Keyboard works fine in login screen and in internet recovery setup it just stops as soon as OS loads, \n\nI'm thinking something has caused the keyboard backlight to blow and as soon as the OS is telling the machine to turn on the keyboard backlight its killing the keyboard?\n\nIs this possible? have you experienced this issue before? what should I do from here?>\n\nThanks in advance"}
{"post_id":94384,"thread_id":63327,"title":"A1534 emc 2746","user_id":682,"username":"2informaticos","post_date":"2022-11-28 15:02:30","message":"Once macOS loaded, KB\/TP run in SPI mode.\nSeems that KB only works in USB mode, before loading macOS; strange that TP still works then.\n\nFor no KB backlight issue, be sure first the ALS works properly.\nUse flashlight directed to webcam and check the screen backlight reaction.\nKB backlight keys are disabled?\n\nWhat is the 820-xxxxx code of your board; always must to post in title."}
{"post_id":94385,"thread_id":63327,"title":"A1534 emc 2746","user_id":35752,"username":"Anterweb","post_date":"2022-11-28 16:01:19","message":"Tested again both with internal hdd and my USB bootabel os, same deal keyboard works in login screen not at all when os loads, \n\nALS seems fine, screen dims and brightens when moving a flashlight into webcam, \n\nKeyboards lights are enabled and turned up max, no kb back light working at all. \n\nI've tried my best to see where the kb backlight connects to unplug it but can't figure it out. \n\nAs for the 820 x'x code this logic board is fkin small! I can't see it anywhere, where on earth is it on these tiny ass boards?"}
{"post_id":94386,"thread_id":63327,"title":"A1534 emc 2746","user_id":682,"username":"2informaticos","post_date":"2022-11-28 17:57:09","message":"Near the battery connector?\nMaybe under some plastic foil...\n\n820-00045 (2015), 00244 (2016), 00687 (2017)."}
{"post_id":94407,"thread_id":63327,"title":"A1534 emc 2746","user_id":35752,"username":"Anterweb","post_date":"2022-11-29 15:13:08","message":"found it, Under a sticker!\n\n[ATTACH type=\"full\"]60874[\/ATTACH]"}
{"post_id":94408,"thread_id":63327,"title":"A1534 emc 2746","user_id":35752,"username":"Anterweb","post_date":"2022-11-29 15:18:13","message":"Just spotted someone selling a bottom case with track pad and keyboard quite cheap on ebay for this mac, £20 -\n\nIts listed as fully working but it has the space bar missing, I messaged the guy and he said he's an experienced IT guy and these space bars are impossible to change, I find this hard to believe? \n\nWorth taking a punt on getting this and trying it then swapping the space bar over if it works?"}
{"post_id":94409,"thread_id":63327,"title":"A1534 emc 2746","user_id":682,"username":"2informaticos","post_date":"2022-11-29 16:14:47","message":"For 20 pounds, is a good way to discard KB\/TP issue.\nOnly trackpad flex is more expensive on Aliexpress."}
{"post_id":94581,"thread_id":63327,"title":"A1534 emc 2746","user_id":35752,"username":"Anterweb","post_date":"2022-12-06 00:58:12","message":"Keyboard arrived and this fixed this problem, Works perfectly and with backlight,\n\nBut spacebar is missing, I did try to swap over the one from the original keyboard but it just keeps dropping off, This seems impossible! Have you any tips on swapping a spacebar on one of these butterfly keyboards?"}
{"post_id":94582,"thread_id":63327,"title":"A1534 emc 2746","user_id":682,"username":"2informaticos","post_date":"2022-12-06 03:05:11","message":"No idea really.\nI don't have such model here for test.\nTry searching on Internet, maybe someone uploaded videos."}
