[
    {
        "post_id":35256,
        "thread_id":35256,
        "title":"A1226 \/ A1260 GPU worth repairing?",
        "user_id":1596,
        "username":"gevans91",
        "post_date":"2018-05-29 15:51:39",
        "message":"Im new to all this board\/component level repair, been watching a lot of Louis' videos on youtube and feel confident enough to start trying it for myself, struggling to find old donor machines to work on though!\n\nI have managed to get my hands on 2 Macbook Pro's  1x A1226 and 1x A1260, I have not collected them yet but the description for them is just \"dead\", you plug in the magsafe and nothing happens. Now I am familiar with the GPU failure rates on these machines, would you recommend these machines as good machines to start board repairs (if it is gpu failure) or am i better hunting for something else, and where is a good place to look? Ebay is probably not the best place as 90% of listings the machine has probably already been opened and tampered with?\n\nThanks guys!"
    },
    {
        "post_id":35259,
        "thread_id":35256,
        "title":"A1226 \/ A1260 GPU worth repairing?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-05-30 02:18:52",
        "message":"They will probably power on once you use a REAL 85W charger. The GPUs for these are easy to get but I really see no reason to fix this old crap anymore. Do you have any experience with replacing BGAs and equipment?"
    },
    {
        "post_id":35261,
        "thread_id":35256,
        "title":"A1226 \/ A1260 GPU worth repairing?",
        "user_id":1596,
        "username":"gevans91",
        "post_date":"2018-05-30 03:17:15",
        "message":"Was thinking of fixing them more for the practice on some older hardware before attempting more expensive stuff, I can pick up the complete machines for $20 each since he was going to be trashing them anyway. Could probably re-sell them for a bit more than that if I get them working\n\nNot a lot of BGA experience but have done a few micro usb \/ hdmi ports. Should be able to learn BGA replacement without a lot of difficulty, I'm normally a quick learner with this sort of stuff"
    },
    {
        "post_id":35357,
        "thread_id":35256,
        "title":"A1226 \/ A1260 GPU worth repairing?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-06-01 13:53:36",
        "message":"You will need to invest $750+ in a BGA rework station for a start. If you have no other uses then just for practice on these machines it is a bit expensive experiment."
    }
]