{"post_id":91973,"thread_id":63011,"title":"820-00850-A BIOS chip","user_id":30214,"username":"BuntyK","post_date":"2022-08-22 17:06:05","message":"Hi all,\n\nI was hoping you guys can help me please, i have a 2019 MacBook Pro A1989 EMC 3358.\nThis MacBook has a firmware password on it, it belongs to a customer and they have forgotten their password having not used it for a period of time.\n\nI was hoping to either, buy a new firmware chip and replace it, or read the old firmware chip and remove the password from it.\n\ntwo problems:-\n\n1) I cannot for the life of me find the chip on the board. I have no idea where it is, i have Paul Daniels Flexboardview and still am unable to locate it, does anyone know where it is please?\n\n2) If i go down the path or reading the chip and removing the password segment, this will be the first time i have done this so will require some help with this please. I have a TL866 programmer will this work?\n\nhoping someone can please help, i have repaired many MacBooks in the past but never tampered with programming of chips before. This would be amazing to add to my skill set..\n\nAny help would be greatly received.\n\nThank you\n\nBunty"}
{"post_id":91975,"thread_id":63011,"title":"820-00850-A BIOS chip","user_id":682,"username":"2informaticos","post_date":"2022-08-22 19:11:55","message":"First of all, welcome to the forum!\n\nYou talk about T2 board, which doesn't have a classic BIOS chip.\nThe BIOS is stored inside T2 and no way to flash it.\n\nPut the machine in DFU and restore it.\nOf course, this will erase entire SSD (data lost)."}
{"post_id":92015,"thread_id":63011,"title":"820-00850-A BIOS chip","user_id":30214,"username":"BuntyK","post_date":"2022-08-23 16:49:59","message":"Hi,\n\nThank you for the advice, i have spent a lot of time trying to find the firmware IC, glad to know that i can stop looking for it now.\n\nI have never performed a wipe via DFU mode, are there any instructions i can use to wipe this machine please?\n\nthank you once again for your help."}
{"post_id":92016,"thread_id":63011,"title":"820-00850-A BIOS chip","user_id":682,"username":"2informaticos","post_date":"2022-08-23 17:52:38","message":"[URL unfurl=\"true\"]https:\/\/boards.rossmanngroup.com\/threads\/how-to-collection.60974\/[\/URL]"}
