{"post_id":33450,"thread_id":33450,"title":"[SOLVED]820-3662 dont turn on","user_id":64,"username":"Dozer","post_date":"2018-04-09 14:53:40","message":"hello, got this machine as liquid spill around the battery connector\n\n\n\nthe board dont looked nasty or something like that , only on the battery connector on battery side the markers are red and that one on the left top corner of the board, on that side where battery connector is\n\n\nafter press power button comes the red battery on the sceen, hats all.\n\ni connected a good battery and it is working and charging , everything fine.\n\nso i cleaned the board only with alcohol and set it back in the unit. after that it dont turn on. i heated with 100 grad celsius the area of the battery connector, after that it turn on one time.\n\nnow it dont turn on. no green light\n\ni found 2 wholes in u7100, replaced that,\n\nat first i found F7005 blown, after replaceing and blown again i found Q7130 and Q7135 are bad, replaced now.\n\nnow i have almost back my green\/orange light.\n\nbut only 12.20V on L7130\n\nso i checked the SDA and SCL lines of the smc, SDA line has 3.3V changing on oszyloscope it shows trafic\n\non the SCL line are only 1.7V, resistor ok and before resistor are 3.3V\n\n\nthe lines both have in diode mode somthing of .487\n\nso i replaced D7050 ad have now on SCL 3.03 V but in oszyloscope only a flat line.\n\nsmc_reset_l is 3.3V\n\nreplacing SMC needfull? or some other ideas? need help please"}
{"post_id":33476,"thread_id":33450,"title":"[SOLVED]820-3662 dont turn on","user_id":2,"username":"dukefawks","post_date":"2018-04-10 08:08:49","message":"SMC or ISL are dead. ISL has been replaced so that leaves the SMC. Make sure there is no corrosion under the battery connector that can destroy another SMC."}
{"post_id":33488,"thread_id":33450,"title":"[SOLVED]820-3662 dont turn on","user_id":64,"username":"Dozer","post_date":"2018-04-10 10:44:05","message":"thanks duke.\n\nso would that a good idea for testing to lift off the ISL and check the i2c lines on the smc with the scope? ar that would be working without ISL?\n\nthe ISL was replaced before replacing D7050, could be damaged again?"}
{"post_id":33492,"thread_id":33450,"title":"[SOLVED]820-3662 dont turn on","user_id":2,"username":"dukefawks","post_date":"2018-04-10 11:25:06","message":"Nah, if you believe the ISL and D7050 are ok then there is only 1 option left and that is the SMC. Again make sure there is no crap under the battery connector!"}
{"post_id":33523,"thread_id":33450,"title":"[SOLVED]820-3662 dont turn on","user_id":64,"username":"Dozer","post_date":"2018-04-11 06:31:18","message":"ok, thanks. so i ordered now 2 junk boards in the hope one of them have a good smc and i will report back in about 2 weeks"}
{"post_id":36053,"thread_id":33450,"title":"[SOLVED]820-3662 dont turn on","user_id":64,"username":"Dozer","post_date":"2018-06-22 06:10:50","message":"so back on work with this board.\n\ni replaced the smc from the donar board and now it is working good. i2c is comunicating, L7130 has 12.54V now.\n\ni replaced the accu to be shure that it will not fail again.\n\nSOLVED, thanks duke for your help."}
