{"post_id":28619,"thread_id":28619,"title":"820-3437 no chime no video","user_id":1092,"username":"Ryanlen2","post_date":"2017-11-28 22:02:26","message":"Computer came in after red wine was spilled on it the night before. Inspected the board and replaced all corroded components. Then applied power and got a spinning fan without chime or video. Fan went high and stayed high. Then after cleaning a bit I noticed that traces from R5177\/78 to SMC were shot. I repaired the traces here and still had the same issue. Figured if the traces to SMC were that badly burnt that the SMC was most likely fucked as well. I then replaced the SMC and the board booted normally with chime and video but no backlight. Upon troubleshooting that backlight circuit I noticed a small white dot in F7700. Tested for continuity and found the fuse was dead, as this was one of the areas hit with liquid so it wasn't a surprise. After replacing the fuse and checking for short I applied power I got very faint backlight for a split second then it went off. This caused F7700 to go dead again or maybe the fuse was bad, Im not sure. Replaced F7700 again and I now have 8.56V on both sides. Only problem is now I am back to no chime and no video.\n\nPPBUS -8.58V\nPP3V42 -3.42V\nPPBUS_S5_HS_COMPUTING_ISNS - 8.58V\nPPDCIN_G3H - 16.5V\nPPVRTC_G3H - 3.34V\nAll_SYS_PWRGD - 3.3V\nSMC_RESET_L - 3.34V\nSMC_Wake_L - 3.3V\nCPUVCORE - 1.6V\nUSB Mouse lights up.\nWas able to PRAM with external KB before but now I cant really tell.\nIs not doing 1,2,3 fan spin at the moment.\n\nDamaged areas were U3210 area, Bottom of SMC, Q3025 area, U7090 & Q7010 area, Q7155 area and F7700 area.\nConfused because everything was working before I replaced the fuse and I have a really hard time with \"No video, no chime. Coincidence?\n\nThanks in advance. Have a good one."}
{"post_id":28620,"thread_id":28619,"title":"820-3437 no chime no video","user_id":2,"username":"dukefawks","post_date":"2017-11-28 22:08:09","message":"Corroded traces\/resistors to U6100? J6100 corrosion? U1900 and traces to Xtal?"}
{"post_id":28636,"thread_id":28619,"title":"820-3437 no chime no video","user_id":1092,"username":"Ryanlen2","post_date":"2017-11-29 11:25:22","message":"Hi Duke. \nTraces\/Resistors look good although on U6100, pins 5&6 are stuck at 3.3V. Shouldn't the fluctuate, then land at 0? J6100 itself didnt have any corrosion but probe points under Q5830 were red so I replaced it as well as C5830.  \n\nU1900\npin 1 - 3.3\npin 2 - 3.3\npin 3 - .931 ( I checked with known good working and got 0.20- 0.45.\npin 4 - 0.8 - 1.1\npin 5 - 3.3V\npin 6 - 1.184\npin 7 - GND\npin 8 - .564\npin 9 - 0\npin 10 - GND\npin 11 - GND\npin 12 - .438\npin 13 - 3.44\npin 14 - 3.3\npin 15 - 1.66\npin 16 - GND\n\nTraces to XTAL from u1900? I dont see, please advise. \n\nThanks Duke."}
{"post_id":28639,"thread_id":28619,"title":"820-3437 no chime no video","user_id":2,"username":"dukefawks","post_date":"2017-11-29 11:55:52","message":"U1900 to Y1905 traces. Replace U1900 if in doubt cause pin 3 should match a working board of course."}
{"post_id":28708,"thread_id":28619,"title":"820-3437 no chime no video","user_id":1092,"username":"Ryanlen2","post_date":"2017-11-30 23:19:45","message":"Sooooooooo. I think I know what the issue is but, unfortunately I dont think its a repairable one. LOL.\n\nAfter not really getting anywhere with this board (mainly because I suck when it comes to anything to do with clock\/bios) I decided to put it in the cleaner to get a better look at it. Well that did help because I found a tiny hole I didnt see before in (TP) PCH_CLK32K_RTCX1. I checked for continuity back to U1900 but there isn't any. The TP is too frail and I cant seem to get a wire on it. So I think Im Fucked seeing that this is the only way to access this line. Thanks anyway for your help Duke. Have a good one."}
{"post_id":28735,"thread_id":28619,"title":"820-3437 no chime no video","user_id":2,"username":"dukefawks","post_date":"2017-12-01 09:39:54","message":"Dont solder a wire. Expose the via copper \"dot\" and put a 0.3mm solder ball on it and try if it wants to flow onto it. Then put another ball there to create some more \"flesh\" and flow a really fine wire into it."}
