{"post_id":24078,"thread_id":24078,"title":"820-2850. Video problem after short on PPBus","user_id":651,"username":"RyanLEN","post_date":"2017-08-10 12:40:20","message":"Hi. This board had a short on PPBUS from Q7530. I have replaced it and computer now turns on but with this little problem.\n\n[url]https:\/\/goo.gl\/photos\/Zqmf2aU3hzkwQ3C7A[\/url]\n\nThanks. Have a good one."}
{"post_id":24088,"thread_id":24078,"title":"820-2850. Video problem after short on PPBus","user_id":1,"username":"larossmann","post_date":"2017-08-10 14:24:58","message":"Either one of two things occurred.\n\n1) You injected voltage to find the problem and whatever voltage you injected was too high and killed the CPU.\n\n2) Q7530 sent 12v to the CPU before PPBUS_G3H could enter protection and killed the CPU.\n\nEither way, CPU replacement time."}
{"post_id":24094,"thread_id":24078,"title":"820-2850. Video problem after short on PPBus","user_id":651,"username":"RyanLEN","post_date":"2017-08-10 17:46:56","message":"LOL. I plead guilty to the 1st offense. I had bought the Wanptek KPS305D a while back, but never had to use it. Only tested with multi-meter. When I attempted to actually use it for a repair to find the short on PPBUS I had ground attached to a screw hole and voltage on pin 2 on F7040. I was not able to set voltage. Voltage knob didn't do anything. Even with AMP knob slightly turned up. Only way to get voltage to go up was to up the amperage all the way. Even then voltage wouldn't go past 3V. So I then tried the same on pin 1 one F7040. I knew that this was gonna happen, because shit got REAL hot pretty quickly. LOL. As much as I would like to blame my sparkly new Wanptek KPS305D Bench Power Supply, knowing my luck I have to assume I was the main suspect in this tragedy. Oh well... RIP 2850. Thanks, take care."}
{"post_id":24113,"thread_id":24078,"title":"820-2850. Video problem after short on PPBus","user_id":2,"username":"dukefawks","post_date":"2017-08-10 21:09:50","message":"CPU is fucked. Fixable, but kind a PITA."}
{"post_id":24134,"thread_id":24078,"title":"820-2850. Video problem after short on PPBus","user_id":651,"username":"RyanLEN","post_date":"2017-08-11 07:54:55","message":"Hi, If you can please advise on the steps needed to carry out repair. Also if you can give me any insight on my fail to help prevent in the future. Much appreciated. Have a good one."}
{"post_id":24170,"thread_id":24078,"title":"820-2850. Video problem after short on PPBus","user_id":2,"username":"dukefawks","post_date":"2017-08-11 15:28:12","message":"Remove CPU, pull good CPU from donor, reball CPU and put it back.\nYou can prevent having to do this work in the future by never repairing Apple boards any more......"}
{"post_id":24184,"thread_id":24078,"title":"820-2850. Video problem after short on PPBus","user_id":651,"username":"RyanLEN","post_date":"2017-08-11 16:03:23","message":"LOL. Your probably right. But if you could tell me why the amperage had to be jacked up to get a small voltage output it would be helpful. Is the power supply bad. Because I tried it on a dead board that I dont care about and same shit happened. Also, I meant is it possible to do this repair without a BGA rework station. Thanks man."}
{"post_id":24190,"thread_id":24078,"title":"820-2850. Video problem after short on PPBus","user_id":2,"username":"dukefawks","post_date":"2017-08-11 17:23:04","message":"You don't jack up amperage. The only way to get current to flow is to up the voltage. You should always check if there are any shorted \"high\" side FETs before injecting voltage to PPBUS to avoid getting 12V on a secondary rail.\nNo you need a rework station or be very proficient with a pair of heat guns ;)"}
