{"post_id":64056,"thread_id":59885,"title":"A2159 display compatibility","user_id":21359,"username":"Fanfwe","post_date":"2020-08-23 12:45:36","message":"Hi,\nI've got a display that comes from a dead A2159 and I don't have another machine of that kind to test it.\nPhysically it looks similar to the display of an A1708.\nAre they compatible parts ? Can I put it in an A1708 in order to test it ?\n\nAnd then, for the sake of completeness, same question but the other way around: will an A2159 accept a display that comes from an A1708 ?"}
{"post_id":64057,"thread_id":59885,"title":"A2159 display compatibility","user_id":682,"username":"2informaticos","post_date":"2020-08-23 13:07:28","message":"A2159 should have True Tone display, and older model are not True Tone.\nIt may work for test, if LCD layout is the same.\nBut quality image will be lower and client will not (supposedlly) accept it.\n\nYou can get LCD assembly for good price from Aliexpress.\nJust be sure to get True Tone version..."}
{"post_id":64061,"thread_id":59885,"title":"A2159 display compatibility","user_id":21359,"username":"Fanfwe","post_date":"2020-08-23 14:30:42","message":"There's no client. It's just me collecting dead macbooks from here and there and messing arround with them on my spare time. So nobody will \"not accept it\" in this case (besides myself) ;)\nYeah, I was also thinking about that True tone thing, which is why I asked the question both ways. I think there's a good chance that an A2159 display would work in an A1708, but the other way around can be more of a challenge.\nBut yeah, I was basically trying to see if some people already tried those swaps and if they were successful or not. I assume, based on your response, that you have never tried this yourself ?"}
{"post_id":64062,"thread_id":59885,"title":"A2159 display compatibility","user_id":682,"username":"2informaticos","post_date":"2020-08-23 17:47:37","message":"I didn't try such interchange myself.\nIf I correctly remember, dukefawkes spoke about them few months ago on the forum."}
{"post_id":64079,"thread_id":59885,"title":"A2159 display compatibility","user_id":21359,"username":"Fanfwe","post_date":"2020-08-24 12:37:13","message":"Ah ok. I did try to search for this in the forum before posting but didn't manage to find anything useful. I'll try again, targeting specifically duke's posts.\nAnd if nothing, I'll cross check one more time the connector pinout to check that signals are indeed compatible, and if so, I'll just give it a try. If the screen works then I know I have a good screen. If it doesn't, then I don't know if that's a bad screen, or just that it's not compatible, or both."}
{"post_id":64081,"thread_id":59885,"title":"A2159 display compatibility","user_id":21359,"username":"Fanfwe","post_date":"2020-08-24 12:45:29","message":"I think I found the post you were referring to:\n[URL unfurl=\"true\"]https:\/\/boards.rossmanngroup.com\/threads\/820-01700-05-a2141-lcd-issues.58546\/post-58568[\/URL]\nIt's not about the same model, in that case it's a A2141. But basically duke was saying that the display from a non-true tone machine would work in a machine that has true tone, but with brightness issues. He didn't say if a true tone display would work in a non true tone machine though.\nSo there's only one way for me to find out now. I'll report back later on with my results."}
