[
    {
        "post_id":97032,
        "thread_id":63643,
        "title":"820-00840 A1708 PP3V3_G3H pulled down",
        "user_id":296,
        "username":"jadao",
        "post_date":"2023-02-26 17:59:47",
        "message":"Liquid damage on this one, I found it difficult and time consuming.\n\n1) It had a full short on C6990 PPVIN_G3H_P3V3G3H, replaced the cap and short gone.\n\n2)Next, it had PP3V3_G3H low voltage around 2.2V. Diode mode was showing 0.340 very similar to other working boards however resistance to ground was reading 1.9KOhm.\nThis was pointing to a 2kohms resistance with other end shorted to ground, indeed I found R5381-pin2 SMBUS_SMC_5_G3H_SCL full shorted to ground. Turned out to be D6950 shorting the signal.\n\n3)SMBUS_SMC_5_G3H_SCL was still reading a low short this time 0.041 in diode mode, additionnaly PP5V_LDO5V was shorted to ground, this time it turned out to be U7800 PMIC witch I replaced.\n\nNow on PP3V3_G3H I have normal readings compare to other boards 0.340 in diode mode and 21kOhm to ground\nPP5V_LDO5V is also 0,425 diode mode\n\nMy issue: I still have 2.29V on PP3V3_G3H.\nIf I remove R6999 I can see U6990 outputing 3.4V If I put back R6999 it is pulled down to 2,29V. R6999 measures fine 0 ohm.\nIf I inject 3,4V on system side I have 14mA draw exactly same with working board.\n\nCan I assume U6990 and U7000 are ok since I get  3,4V on PP3V3_G3H when R6999 is removed? Or I am wrong as I perhaps get 3,4V only because there is no load?\n\nPM_EN_P3V3_G3H is 4,8V and ppbus_g3h is 30mV with no short at all.\n\nI am out of idea and thats why I am here!\nThanks"
    },
    {
        "post_id":97037,
        "thread_id":63643,
        "title":"820-00840 A1708 PP3V3_G3H pulled down",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-02-27 01:15:12",
        "message":"U7000 needs to talk with SMC, in order to generate PPBUS_G3H.\n0.340 in diode mode at 3V3_G3H looks good, but you should check reverse way measurment too.\n\n\"SMBUS_SMC_5_G3H_SCL was still reading a low short this time 0.041\"\nWas this problem solved?\nMust get very similar readings on both SCL\/SDA lines."
    },
    {
        "post_id":97076,
        "thread_id":63643,
        "title":"820-00840 A1708 PP3V3_G3H pulled down",
        "user_id":296,
        "username":"jadao",
        "post_date":"2023-02-27 17:13:11",
        "message":"Reverse diode mode reading on 3V3_G3H is normal 1.240 and comparable with other working boards.\n\nYes diode mode 0.041 on  SMBUS_SMC_5_G3H_SCL  was solved it was D6950 shorting partially to ground.\n\nI decided to inject 5V on U6990 Vin and enable. It produced 3,4V when 5V was applied after D6905, I mean pin 3 of D6905.\nIt produced 2.2V when 5V was applied before D6905 (D6905-Pin2).\n\nAt that point I knew something was wrong upstream from D6905-Pin2.\nI found out odd diode mode reading on D6905.\n\nBlack probe on pin3 Red proble on pin 1: Diode mode reading 0.201 ok\nBlack probe on pin3 Red proble on pin 2: Diode mode reading 0.569 -> should be 0,201 compared to other boards\n\nReverse diode mesurement was ok.\nReplaced D6905 and got stable 3.4V on PP3V3_G3H and nice 13,5V on PPBUS_G3H. didn't know this would affect ppbus_g3H at that point!\n\nAfter that: I had to replace TPS51980 because it simply never produced 5V_LDO...\n\nNow board fully boots, I have to solve battery detected but not charging...\n\nThis is a very nice nightmare practice board with almost 6 different faults completely unrelated on each other..."
    }
]