{"post_id":21815,"thread_id":21815,"title":"820-3332, No Audio","user_id":515,"username":"SMMRepair","post_date":"2017-06-16 11:52:57","message":"Working on an 820-3332 board with no audio; headphones do work, but when headphones are NOT plugged into the board, the audio icon is greyed out and I get the prohibitory sign when attempting to adjust volume. I've had this issue (or a similar one) before, and removing R6895 resolved (or bypassed) the issue.\n\nI removed R6895 on this board, and it did not resolve the issue, but instead made it more odd; now, I get no audio (still), however when I plug the headphones in, I DO get audio through the speakers but NOT the headphones. No audio whatsoever through the headphones when they are plugged in. As soon as I unplug the headphones, then I get no audio through the speakers again. So, I've replaced R6895 and I'm back to square one.\n\nAll surrounding resistors are measuring fine, and there's no sign of liquid. Does this sound like a bad U6201? Headphone jack is part of a known-good test case, so I don't think that's the issue. All help appreciated."}
{"post_id":21818,"thread_id":21815,"title":"820-3332, No Audio","user_id":515,"username":"SMMRepair","post_date":"2017-06-16 12:14:48","message":"I got this one solved; I removed R6895, but needed to remove R6896. Once I removed R6896 (and replaced R6895), all is well. Disabling SPDIF works again; but I am curious--what is the ultimate cause of this specific failure, where disabling the SPDIF works to resolve the issue? Is it U6201 that's faulty, or one of the transistors on that circuit? Is it better to repair the actual root cause (one would think yes), rather than simply disabling a feature (albeit used by hardly anyone)? Just curious.\n\nMark this one as solved!"}
{"post_id":21830,"thread_id":21815,"title":"820-3332, No Audio","user_id":2,"username":"dukefawks","post_date":"2017-06-16 19:31:54","message":"Simple bad headphone jack."}
{"post_id":21913,"thread_id":21815,"title":"820-3332, No Audio","user_id":515,"username":"SMMRepair","post_date":"2017-06-19 12:14:15","message":"Thanks, Duke--glad to see you!\n\nOn the 3332, the headphone jack is not part of the board, though, and I'm sure the one in my test case works fine (tests fine with tons of other boards previously); so would the headphone jack still be the cause on this particular 3332 board? \n\nThanks!"}
{"post_id":21945,"thread_id":21815,"title":"820-3332, No Audio","user_id":2,"username":"dukefawks","post_date":"2017-06-19 17:44:41","message":"Probably not then, connector on the board may be fucked. Look at TIPDET circuit."}
