[
    {
        "post_id":45534,
        "thread_id":45534,
        "title":"820-2850 No image",
        "user_id":2316,
        "username":"Naevius",
        "post_date":"2019-02-01 12:06:03",
        "message":"I have a 820-2850 board that doesn't display an image (checked with a flashlight from the back). Backlight also doesn't work.\n\nThere was liquid damage on the LCD connector, replaced connector, but still no image. Currently don't have a mini-displayport convertor, so can't check image externally.\nDevice seems to boot, since I hear the chimes and PPVCORE_S0_CPU is present.\n\nSMC_LID = 3.4V\nPPVCORE_S0_CPU = 1.38V\n\nPPVOUT_S0_LCDBKLT is not present (no short), BKLT_EN is also not present. Traced this down to LCD_BKLT_EN which is not present. Since LCD_BKLT_EN comes from U9600, I've reach a dead end here.\n\nSo it's not being told to turn on the LCD\/backlight, while it is booted and the lid is open. Since I have limited experience with macbook repairs, I'm kind of at a dead end here. Where to look for next?"
    },
    {
        "post_id":45597,
        "thread_id":45534,
        "title":"820-2850 No image",
        "user_id":2316,
        "username":"Naevius",
        "post_date":"2019-02-03 08:22:48",
        "message":"*Subtle kick*\nAnyone has an idea where to look for the issue?\n\nI've ordered a mini-displayport->HDMI convertor, but I have this feeling it's not going to display anything externally also."
    },
    {
        "post_id":45598,
        "thread_id":45534,
        "title":"820-2850 No image",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-02-03 08:57:53",
        "message":"I bet you still have something bad around LCD connector, maybe video cable.\nDid you try known good LCD assembly?\nCheck all traces from LCD connector pins to corresponding components.\nPost voltage for J9000, pins 4, 6, 7.\nBe sure R9010\/11 and L9000\/10\/11 are all OK."
    },
    {
        "post_id":45617,
        "thread_id":45534,
        "title":"820-2850 No image",
        "user_id":2316,
        "username":"Naevius",
        "post_date":"2019-02-03 13:21:16",
        "message":"I'm not sure if I have a compatible known good working LCD. I have a donor A1278 and A1465 with known good LCD assemblies for example. Any easy way to check compatibility?\n\nVisually the traces coming from J9000 seem fine. I measured those on the same side of the board, and seem fine.\n\nVoltages:\nPin 4 (PP3V3_S0) = 3.27V\nPin 6 (LVDS_DDC_CLK) = 3.26V\nPin 7 (LVDS_DDC_DATA) = 3.26V\n\nVoltages are the same with and without the LCD connected.\n\nR9010\/11 are 65k-75k in circuit, so seem fine. L9000\/10\/11 also seem fine. Coils in L9010\/11 are 1.5\/2 ohm each, L9000 is 0.5 ohms.\n\nI used the connector to replace from a donor board. Even tho it seems ok even with 40x magnification under the microscope, I've ordered some new connectors just to be 100% sure.\n\nBut even without a LCD connected I should be getting (a relatively high) voltage on PPVOUT_S0_LCDBKLT, right? Or should there be a connection with the LCD before U9600 turns it's LCD_BKLT_EN output on?"
    },
    {
        "post_id":45623,
        "thread_id":45534,
        "title":"820-2850 No image",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-02-03 18:49:15",
        "message":"If LCD is not properly recognized, forget about activating video, or backlight.\nYou need compatible LCD..."
    }
]