{"post_id":83139,"thread_id":62018,"title":"820-02987 MBP 2020 No charge.","user_id":28201,"username":"Mortentoft","post_date":"2021-11-28 13:23:18","message":"Hi’ good fellows…\nI am new and apology my rookie questions. Do you need further info – let me know.\nMacbook pro 820-01987 without drops or fluid damage - smooth and clean. The history of the device; sent in because it couldn’t charge anymore. Charges if you take the charger out and in many times. Takes 19.2 volts and boots normally to .0600-0.700 amp (without battery), shows logo but crashes. circles (.100-.500amp )around until... Ends after 40 sek. It stops at 0.053 amp. Can’t find a short – maybe a IC short? I want to hear if anyone knows of the boot row? it looks like the device is hitting something wrong through the boot process. Can anyone help me? I have a video of the bootprocess – I will try to post it here (not possible:-)."}
{"post_id":83140,"thread_id":62018,"title":"820-02987 MBP 2020 No charge.","user_id":682,"username":"2informaticos","post_date":"2021-11-28 15:49:28","message":"First of all, welcome to the forum!\n\nYou can't have a short on the board if get even image.\n\nAs always with T2 machines, start with DFU.\nTry revive and go to restore, if no important data on SSD.\nIf need to recover data, check if you can access the SSD starting in Target Disk mode; before doing DFU restore.\n\nRead below thread, for more information.\n[URL unfurl=\"true\"]https:\/\/boards.rossmanngroup.com\/threads\/how-to-collection.60974\/[\/URL]"}
{"post_id":83175,"thread_id":62018,"title":"820-02987 MBP 2020 No charge.","user_id":28201,"username":"Mortentoft","post_date":"2021-11-29 14:30:38","message":"Thank you 2informaticos🙏. I will try it tomorrow and let you know what happened☺️. I do not need to recover anything so… DFU It will be😅"}
{"post_id":83266,"thread_id":62018,"title":"820-02987 MBP 2020 No charge.","user_id":28201,"username":"Mortentoft","post_date":"2021-12-02 11:12:17","message":"Hello 2informaticos. Follow-up on my problem ... After DFU and reinstalling\/bridge ... it works 100% again. Unbelievable that a device can not boot due to a T2 chip :-). Many thanks for your advice and help!"}
{"post_id":83271,"thread_id":62018,"title":"820-02987 MBP 2020 No charge.","user_id":682,"username":"2informaticos","post_date":"2021-12-02 12:37:57","message":"Glad to hear is solved now.\nThanks forsolution feedback; it helps a lot with such kind of weird problems..."}
