[
    {
        "post_id":15336,
        "thread_id":15336,
        "title":"Early 2011 17\" Macbook Pro power issues 820-2914-A",
        "user_id":61,
        "username":"wrbailey",
        "post_date":"2017-02-22 06:54:02",
        "message":"I have an early 2011 17\" MacBook pro.\n\nWhen I plug a legit (brand new as of a week ago) 85 watt charger in, light turns green, fans start spinning, can hear the DVD drive initialize, but then powers off and tries to power on again and then kicks off. Green light stays on charger.\n\nI figured it was old and didn't really bother with it for a while. Randomly, last night, while waiting for ASD to run on another machine, I grabbed a battery from a 15\" and plugged it in, and BAM, it powered on (albeit after seemingly powering on twice, as you could hear the DVD drive initialize twice.)\n\nI plugged the charger in, and the light turned amber and the BIL flashed, showing it was charging. I could even unplug the battery at that point and it would stay on using only the charger.\n\nI ran ASD with the battery removed (no specific reason other than the battery wasn't secured and was just flopping around) and it passed all ASD (didn't have it test the RAM, as that takes a while.)\n\nI am going to measure all the rails when I get home, but has anyone run into this scenario before? Maybe something specifically I should focus my attention on?\n\nThanks!\n\nI'll follow up with power rail measurements tonight."
    },
    {
        "post_id":15362,
        "thread_id":15336,
        "title":"Early 2011 17\" Macbook Pro power issues 820-2914-A",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-02-22 16:26:01",
        "message":"Bad power button on keyboard? Check PPBUS too. When that is fixed the GPU will die next month, be prepared for that too."
    },
    {
        "post_id":15384,
        "thread_id":15336,
        "title":"Early 2011 17\" Macbook Pro power issues 820-2914-A",
        "user_id":61,
        "username":"wrbailey",
        "post_date":"2017-02-23 06:15:32",
        "message":"Might be the bad keyboard\/power button. I disconnected the keyboard ribbon cable and it boots from the charger. I am going to test a keyboard from a 15\" model."
    }
]