{"post_id":9389,"thread_id":9389,"title":"820-3437 shadows on bottom corner of screen","user_id":90,"username":"ytesfay80","post_date":"2016-11-08 17:40:08","message":"Okay so I received this board originally and it had no backlight. Pins 3\/4 on the connector were burned on the board so I replaced the connector. Also, the feedback pad was gone and areas around the LP8550 were burned so I replaced the area and ran a wire for feedback. \n\nI have received a display assembly from Powerbook Medic and I returned one after it had this shadow on the bottom right corner of the screen but when I received another one it is doing the same thing so I don't believe the displays they are sending are doing this.\n\nHere is a picture of the issue"}
{"post_id":9392,"thread_id":9389,"title":"820-3437 shadows on bottom corner of screen","user_id":2,"username":"dukefawks","post_date":"2016-11-08 17:44:25","message":"Obviously a bad LED return line, measure them on diode mode. Bad soldering on connector or LP8550 or bad resistor in the line."}
{"post_id":9408,"thread_id":9389,"title":"820-3437 shadows on bottom corner of screen","user_id":90,"username":"ytesfay80","post_date":"2016-11-08 20:59:24","message":"Every resistor measured around 0 ohms except R7720. It was measuring around 3.5ohms so I replaced that and 3 other resistors but the shadow is still there. \nIn diode mode(red on ground black on resistor - with lvds cable plugged in) I got 0.615v on each resistor except  R7718\/R7719 showed OL on both sides before and after replacing them. When I checked on a donor board those resistors measured around 0.6v in diode mode  \n\nThere was continuity from all resistors to the connector so I don't believe it's the connector. This is likely the LP8550 which I had troubles putting on especially since the fb pad was missing.\n\nWhat would be the best way to get the feedback wire under the LP8550 because I soldered the chip on first then I pushed the wire into the ball."}
{"post_id":9411,"thread_id":9389,"title":"820-3437 shadows on bottom corner of screen","user_id":2,"username":"dukefawks","post_date":"2016-11-08 21:22:40","message":"Bad solder under LP8550 then. Try and reflow it again. I usually have a  short very fine strand of wire taken from an LCD cable. Tape it in position with kapton and then solder LP8550. Once it is stuck under the 8550 I solder a thicker insulated wire to the short strand to where it needs to go."}
