{"post_id":71029,"thread_id":60710,"title":"820-01598  FROM HELL!!!   Backlight problems","user_id":5210,"username":"KC Micro Tronix","post_date":"2021-02-02 13:17:02","message":"This is a rush repair I will probably get to pass on as I am totally stuck.   I am new to these boards.\n\nLots of things were damaged on this LB.\nU8500 LCD  PP5V_GS3_ALSCAM   was damaged.   Replaced\nU7710 totally smoked and sense resistors smoked\nU8110 smoked and eating R8147\n\nAfter all that was fixed the machine boots but no backlight. I can see the apple logo with a flashlight\n\n\nI detect a short on the drive to Q8401 LCDBKT_FET_DRV_R\nreplaced U8400 to resolve the short.   Still didn't work  but my short was gone. so I changed again because I am real stupid and lazy.   No help\n\nBack light EN is present on Pin 17 of U8400 at 3.2V\nVDD is present at pin 18 of U8400\nU8400 is not pulling down the 12v on R8402 so Q8400 is not getting turned on.  Both R8401 and R8402 are good.\nU8400 is not attempting to drive Q8401.\nPreformed PRAM reset\nusing a monitor flex adaptor to turn on back light circuit.   Tested on another LB know that J8500 is good\n\nWhat has to be present to turn on BLKT_SD so it pulls down the 12v to turn the thing on?  What am I missing here?\n\n\"I answered that question by following other threads on the channel\"  The SCL\/SCA data lines. Thanks to \"\n[B][USER=682]2informaticos[\/USER]\" [\/B]comments on another backlight thread related to this LB.  My data lines are good and diode check \/ voltage check normal against a working LB.\n\nFIred up the Tektronix TDS scope and inspected the data lines.\nNo data activity is present on 12C_BKLT_SCL\/SDA lines.   They do Ohm out to the pins on J8500\nused known good flex and known good monitor interface board.   Verified with working LB\n\nThese boards sure have come quite a ways since the old A1466 macbooks.  I guess burning a entire day to learn one is worth it."}
{"post_id":71031,"thread_id":60710,"title":"820-01598  FROM HELL!!!   Backlight problems","user_id":5210,"username":"KC Micro Tronix","post_date":"2021-02-02 15:45:31","message":"I kept hoping for a reply to this thread while I was working on the board.  I ended up answering my own questions and digging deeper and deeper into the problem as the day went on.  \n\nThis was the only machine I worked on today.  I had no idea how complex the backlight circuit was until today on these.   I did make a test jig using a totaled screen.  Ripped off the screen board to test communication with the LB so I can enable and test the back light without having to put the stupid board back into the computer or use a awkward test screen.\n\nI think this machine was the victim of some sort of ESD strike that came in through the monitor.  Not sure.   I have no idea how so many systems could be affected at the same time like this.  I do not know and may never know why the SCL\/SDA data lines are not communicating with this back light driver IC.  I do know the monitor interface board and ribbon are good and communication is present with a known board.   Now I am more than confident I can burn my way through these backlight problems on these newer boards with ease and in very little time.\n\nThis LB was a total board from hell.  It taught me quite a bit about how these boards work even though I failed and gave up.  If anyone has experience with the BKLT_SCL \/SDA lines please add to this thread.   I will be watching in for the next few days."}
{"post_id":71036,"thread_id":60710,"title":"820-01598  FROM HELL!!!   Backlight problems","user_id":682,"username":"2informaticos","post_date":"2021-02-02 18:40:46","message":"So, PCH sends EDP_BKLT_PWM dimming signal to LCD display, through J8500.\nThe LCD display resend dimming signal coded through I2C_BKLT bus to U8400."}
{"post_id":71103,"thread_id":60710,"title":"820-01598  FROM HELL!!!   Backlight problems","user_id":5210,"username":"KC Micro Tronix","post_date":"2021-02-03 11:25:32","message":"It doesn't look like there is much to that signal other than a tie down resistor.   So from what I saw here it looks like the PCH was damaged on that data line ?"}
{"post_id":71108,"thread_id":60710,"title":"820-01598  FROM HELL!!!   Backlight problems","user_id":682,"username":"2informaticos","post_date":"2021-02-03 12:45:53","message":"Check output PWM signal from PCH.\nDoes it react pressing backlight control keys?"}
{"post_id":71113,"thread_id":60710,"title":"820-01598  FROM HELL!!!   Backlight problems","user_id":5210,"username":"KC Micro Tronix","post_date":"2021-02-03 13:33:54","message":"There is no data stream what so ever.  Its totally blank no pulses of any kind.    I no longer have the machine.  I only had hands on it for one day.   I may get it back but looks like the PCH is toast.    The air's were controlled by the smc.  I guess these new ones are different."}
