[
    {
        "post_id":40982,
        "thread_id":40982,
        "title":"820-2330 No Backlight",
        "user_id":1464,
        "username":"Bouba148",
        "post_date":"2018-10-20 09:42:07",
        "message":"Hi Team,\n\nI Have a 820-2330 that has no backlight:\n\nF9800 is OK\nat Q9807:\nPin 2 BKLT_PLT_RST_L, I have 3.298V\npin 5 LVDS_BKL_ON I have 0V that's why it can't provide a gnd for the Div bridge to be able to close Q9806.....\n\nNow the LVDS_BKL_ON line is directly provided by U9600, I've checked for eventual broken trace, but no........\n\nSo what would be the next step please? replace the U9600 or there is something else to check before doing that replacement as I'm not sure to have an U9600 is stock \/ donor board.....\n\nQuestion: should I plug the screen for the U9600 to send that signal?\n\nThanks, Gracias"
    },
    {
        "post_id":40984,
        "thread_id":40982,
        "title":"820-2330 No Backlight",
        "user_id":1464,
        "username":"Bouba148",
        "post_date":"2018-10-20 10:24:15",
        "message":"Hi\nOK I plugged the screen and I have LVDS_BKL_ON , Q9706 is closing to send the enable signal to U9701.\nR9730 is 61KOhms but should be 0.1 Ohms\nWill replace it and let you know"
    },
    {
        "post_id":40986,
        "thread_id":40982,
        "title":"820-2330 No Backlight",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-10-20 10:46:06",
        "message":"Backlight and LVDS\/eDP circuitries always need LCD to be connected!!!\n\nIf R9730 is bad, check for any short on PPVOUT_S0_LCDBKLT_SW and PPVOUT_S0_LCDBKLT.\nProbably nothing, if R9730 is only corroded.\nIf is burnt, that will point to a short somewhere..."
    },
    {
        "post_id":40987,
        "thread_id":40982,
        "title":"820-2330 No Backlight",
        "user_id":1464,
        "username":"Bouba148",
        "post_date":"2018-10-20 11:01:20",
        "message":"Hi,\nI replaced R9730, but Honnestly i'm suspecting the lcd screen that kills the backlight  because it' does not have the locking latch, also the client reported backlight issue after replacing the original screen with this one (used one)\n​​I will check for any short Last week i've already replaced F9800 and tested the board with another screen and it was OK. \nBut this time i don't have that spare screen to test the board and as i'm suspecting the client used screen i will not plug it to test it. \nAt least i'll have a look for any short and wait next week to get a known good screen. \nGracias"
    },
    {
        "post_id":40993,
        "thread_id":40982,
        "title":"820-2330 No Backlight",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-10-20 12:20:14",
        "message":"Don't close the LCD connector, or at least check if the closing latch has the plastic protector in good condition.\nCompare resistance to ground from backlight rail w\/ and w\/o screen connected..."
    }
]