{"post_id":27263,"thread_id":27263,"title":"820-2610 - Weird behaviour","user_id":289,"username":"smiba","post_date":"2017-10-25 07:40:03","message":"I had this 2610 board in a while ago, did the MCP capacitor replacement as every one of these need and the device was booting again.\nEnd of story, happy customer.. Or so I thought.\n\nThe device has a couple of issues I can't really figure out:\n\n- It takes about 10 seconds before it moves from the white screen after posting to boot from the SSD drive installed\n- On battery it randomly shuts down sometimes\n- Sometimes it has periods where it will not post\/chime, usually if you let it stay for a couple of minutes on the white screen it will still continue booting even though it never chimed. The system works fine after it booted from this\n- The battery temperature sensor in ASD gives a readout of 128C with all batteries I tried\n\nAll External GPU tests pass in ASD and no graphical glitches can be detected\nAll Tests (*Except battery temprature) pass in ASD\n\nThe battery indicator module connected over J6995 has been abused and does not work.\n\nNot sure what it could be, on AC power once it booted it will work fine no matter what you throw at it. Where to start looking?\n\n(Also I know this is a really old device, but if someone wants to pay I'm cool)"}
{"post_id":27266,"thread_id":27263,"title":"820-2610 - Weird behaviour","user_id":2,"username":"dukefawks","post_date":"2017-10-25 08:15:48","message":"PRAM reset will solve the first issue.\nBad battery likely\nDid you use hot air to replace the cap and messed with the MCP?\nDoes it have 2x4GB in there, these machines are very picky with anything 8GB"}
{"post_id":27273,"thread_id":27263,"title":"820-2610 - Weird behaviour","user_id":289,"username":"smiba","post_date":"2017-10-25 09:53:00","message":"PRAM reset solved the issue of the system taking a while to boot from the SSD\nI used Hot Air to replace the cap, but on a lower air speed and tape to somewhat shield the MCP.\nThe system does have 2x4GB in there, but I think the customer has had it in there for years without issues.\nI have not been able to reproduce the POST issue any more so hopefully it will stay away.\n\nI figured out that the system crashes when using the External GPU on battery. You can run furmark and everything and it won't glitch or do anything unexpected, but when you remove the AC power it will power off almost right away. I used Gfxcardstatus to forceably switch GPUs. Using the External GPU but without load will allow you to keep using the system up to a couple of minutes.\nPossibly two bad batteries? Both are fairly new, but not from my trusted supplier so to be fair I can't say for sure. But the issues really seem to indicate it\n\nBoth batteries give a Above limit warning on TB3T (Battery temperature), but I don't think this impacts the system because it seems to be running at full speed. With the battery removed all battery sensors read above the high limit. So they're possibly just missing that sensor\n\nWhat do you think? I'm feeling like its just a bad battery at the moment, I am definitely not buying the cheapest ones but with China you never really know what to expect"}
{"post_id":27292,"thread_id":27263,"title":"820-2610 - Weird behaviour","user_id":2,"username":"dukefawks","post_date":"2017-10-25 16:48:59","message":"A1309 batteries are crap. Last one I needed in a hurry came from topmedia and it died within a few days."}
{"post_id":27469,"thread_id":27263,"title":"820-2610 - Weird behaviour","user_id":289,"username":"smiba","post_date":"2017-10-28 09:43:11","message":"I decided to take a look at this like it was a device I just received by starting from the beginning again\n\nPPBUS_G3H is around 8.6V and 7.4V on battery, which sounds a bit low. PPBUS_G3H stays like this even with the battery removed so its not that. The power aliasses page tells me its 6V which sounds low for such a power hungry device. Is PPBUS_G3H supposed to be around 7\/8V or 12.6V like on most macbook pros?"}
{"post_id":27474,"thread_id":27263,"title":"820-2610 - Weird behaviour","user_id":2,"username":"dukefawks","post_date":"2017-10-28 10:31:44","message":"Of course PPBUS will go down to battery voltage when it is connected, 7.4V is fine for a discharged battery. You just have a crap battery....."}
{"post_id":27479,"thread_id":27263,"title":"820-2610 - Weird behaviour","user_id":289,"username":"smiba","post_date":"2017-10-28 12:23:30","message":"The ~8.6V PPBUS is with the battery disconnected.\n\nIts just that I tried 3 different batteries, all new, production date of within this year from different manufactures and they all show the exact same behaviour.\nObviously it can still be the batteries, but I'm at the point where I'm having to start thinking of other reasons why this can be happening.\nOnly thing that comes to mind that would make the battery drop out under high load could be issues with (or the controlling of) Q7055-Q7058 or R7050 carrying more resistance resulting in voltage drop, which I don't notice happening, the voltage is pretty stable.\n\nI'll probe around that area tomorrow for a bit see if anything comes up"}
{"post_id":27503,"thread_id":27263,"title":"820-2610 - Weird behaviour","user_id":289,"username":"smiba","post_date":"2017-10-29 11:33:53","message":"Q7055-Q7058 area looks fine, R7050 within specification.\n\nOnly thing I noticed that on the charger Pin 1 and Pin 2 of L7030 have a ~0.3V difference to ground between the two. But when I put a probe on Pin 1 and on Pin 2 there is 0V difference. Probably just the switching that confuses my multimeter.\n\nI'll see if I can get a battery from a supplier I know that will be good"}
{"post_id":27505,"thread_id":27263,"title":"820-2610 - Weird behaviour","user_id":2,"username":"dukefawks","post_date":"2017-10-29 13:03:00","message":"Bridge or replace Q7055 and see if it still shuts down."}
{"post_id":27610,"thread_id":27263,"title":"820-2610 - Weird behaviour","user_id":289,"username":"smiba","post_date":"2017-11-01 19:26:59","message":"Bridged Q7055, the system crashed as soon as I switched to the dedicated GPU.\n\nBridge Q7056 as well to rule out that part of the chain being wrong? Obviously while these two are bridged do not connect the charger"}
{"post_id":27647,"thread_id":27263,"title":"820-2610 - Weird behaviour","user_id":2,"username":"dukefawks","post_date":"2017-11-02 21:00:20","message":"No idea. Some rail is going down cause of the lower battery voltage. Just put it on the 9400M card, no one actually uses the 9600 anyway."}
{"post_id":27751,"thread_id":27263,"title":"820-2610 - Weird behaviour","user_id":289,"username":"smiba","post_date":"2017-11-06 20:09:14","message":"Sorry for the late response but what is your recommended way of disabling the 9600? The laptop is owned by someone at least three times my age so I'm looking for the most robust solution."}
{"post_id":27757,"thread_id":27263,"title":"820-2610 - Weird behaviour","user_id":2,"username":"dukefawks","post_date":"2017-11-06 23:15:48","message":"You have to go out of your way to even enable it. You have to specifically go into power settings and enable it. Do a PRAM reset and never enable it in OSX, 99% of users don't even know it is possible."}
