{"post_id":61946,"thread_id":59612,"title":"820-4924-A PPVCC going ON and OFF","user_id":26859,"username":"clothos","post_date":"2020-07-06 16:48:44","message":"Hi,\n\nI'm new to board repair, so would appreciate some help.\n\nI've got this liquid damaged A1502 which is dead. I investigated and found a heavily corroded section, a nice board to test my brand new Crest P1200 on. :) After 3 minutes of ultrasonic on each side, a distilled water bath, an isopropanol bath and some playing with my heat gun, the board looks brand new. Still dead though. \n\nLet's see...\n\nNo light on charger, so no power on PP3V42.\n\nChecked PP3V42 and found a resistor sitting on a corroded pad. Resistor replaced and now I've got PP3V42. Cool.\n\nTried to power it on, no luck.\n\nBack to work.\n\nMacbook is in S0 state. All rails present, except PPVCC goes ON (1.866V) and OFF(0.000V) every 4 seconds or so. To be clear, it is ON for 4 seconds, and OFF for another 4 seconds, and so on.\nMultimeter on continuity mode: Short circuit every 4 seconds.\n\nGoogle doesn't seem to know a lot about intermittent short circuits when in comes to Macbook board repairs, so here I am.\n\nMy newbie guess? A bad capacitor? A bad transistor? Dunno...\n\nI've got a thermal camera: U3900 goes hot and cold every 4 seconds. Not sure if that's Cause or Effect.\n\nWhat can it be? And what's the best way to approach this issue?\n\nThank you."}
{"post_id":61949,"thread_id":59612,"title":"820-4924-A PPVCC going ON and OFF","user_id":682,"username":"2informaticos","post_date":"2020-07-06 19:14:54","message":"First of all, welcome to the future!\n\n\"Multimeter on continuity mode: Short circuit every 4 seconds.\"\nContinuity mode on powered board???\nSTOP doing that.\n\nCheck pins 7 & 3 of U1950.\nYou should have other areas affected by corrosion.\nAlso UC can knock off components, or break traces if no sweep funcion used."}
{"post_id":61997,"thread_id":59612,"title":"820-4924-A PPVCC going ON and OFF","user_id":26859,"username":"clothos","post_date":"2020-07-07 15:47:25","message":"Hi, \n\nThanks for your reply. \n\nContinuity issue taken on board, thank you.\n\nCrest uses sweeping frequency, so that shouldn't be a problem. To be honest, I cleaned a few boards with it before and they work just fine.\n\nPins 7 & 3 of U1950 are acting the same way as PPVCC:\n\n3.393V for 4 seconds\n0V for 4 seconds"}
{"post_id":61998,"thread_id":59612,"title":"820-4924-A PPVCC going ON and OFF","user_id":26859,"username":"clothos","post_date":"2020-07-07 16:00:34","message":"Is there a known component on that circuit that is meant to go on and off every 4 seconds or so? Or am I just overthinking and asking the wrong question?"}
{"post_id":62000,"thread_id":59612,"title":"820-4924-A PPVCC going ON and OFF","user_id":682,"username":"2informaticos","post_date":"2020-07-07 16:30:34","message":"All the other voltage, apart of VCORE, are steady?"}
{"post_id":62002,"thread_id":59612,"title":"820-4924-A PPVCC going ON and OFF","user_id":26859,"username":"clothos","post_date":"2020-07-07 16:33:36","message":"No. I've just realised they are not. \n\nI checked PPBUS_G3H and it goes from 9.47V to 3.8V - 3.4V.\n\nAnd I believe the closer I get to PPVCC, the lower the voltage when shorted, which kinda makes sense."}
{"post_id":62015,"thread_id":59612,"title":"820-4924-A PPVCC going ON and OFF","user_id":682,"username":"2informaticos","post_date":"2020-07-07 17:29:49","message":"Ooops, you must get correct PPBUS_G3H first.\nCheck resistance between pins 17\/18 and 27\/28 of ISL6259,"}
{"post_id":62022,"thread_id":59612,"title":"820-4924-A PPVCC going ON and OFF","user_id":26859,"username":"clothos","post_date":"2020-07-07 20:19:51","message":"Finally sorted. You was right regarding ISL6259. Nn close inspection, I found out that traces for pins 17, 18, 27 and 28 were damaged by corrosion. 4 wires later, and this A1502 is happy again. Thanks for your help. Highly appreciated."}
