[
    {
        "post_id":17325,
        "thread_id":17325,
        "title":"820-4924-A no image , no backlight",
        "user_id":23,
        "username":"mrjoeham",
        "post_date":"2017-03-25 15:33:03",
        "message":"MacBook Pro  no image, no backlight 820-4924-A. The board barely had water damage on the corner where LCD connector was located from a water bottle in back pack. I cleaned the area up with flux and reflowed the bad looking solder joints. Connector J8300 pin 38,39,40,41 - Connector J4915 pin 4, U8300 and on the reverse side of board the only thing I saw that had corrosion was C7778, check for short here and none.. I cleaned it all up and reflow with new solder. It boots up and chimes and also with the external screen via with HDMI output I got image and can use the laptop. The LCD male connector on the display looks clean and solid. I took measurements at the board connector and only have 5.1v at pin 3 and 5.1v on pin 4 and all other pin is 0v. I check C8320- C8328 all is present ... I don't have extra display to test. I verified no image with flashlight on backside thru apple logo. Am I on the right track."
    },
    {
        "post_id":17334,
        "thread_id":17325,
        "title":"820-4924-A no image , no backlight",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2017-03-25 15:50:16",
        "message":"Connector J8300 has 30 pins. Also you need a known good LCD with something like this. What voltage do you have on both sides of R8319? What voltage on pins 28\/29\/30 of the LCD connector?"
    },
    {
        "post_id":17439,
        "thread_id":17325,
        "title":"820-4924-A no image , no backlight",
        "user_id":23,
        "username":"mrjoeham",
        "post_date":"2017-03-27 15:34:02",
        "message":"Luis, I was able to find another good screen.  With good known screen, it works so the old LCD assembly is bad.  The LCD assembly is a straightforward circuit, have you ever had to fix the LCD assembly itself?  What's your recommendation, I am going to try to fix the LCD assembly with already confirming with the customer that he will also need New assembly.  Where can I buy a new one in case this one isn't repairable.  Thanks for your help."
    },
    {
        "post_id":17448,
        "thread_id":17325,
        "title":"820-4924-A no image , no backlight",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-03-27 17:46:49",
        "message":"Swap the LCD, besides that there is nothing you can do."
    },
    {
        "post_id":17466,
        "thread_id":17325,
        "title":"820-4924-A no image , no backlight",
        "user_id":23,
        "username":"mrjoeham",
        "post_date":"2017-03-28 09:40:54",
        "message":"ok, thanks Duke, going to go ahead and get new LCD, but im going to see if I can tinker with the other one anyway, will post what I find out.  thanks you"
    }
]