[
    {
        "post_id":15383,
        "thread_id":15383,
        "title":"Power-related issues with MXL SPI ROM chip on 3437 boards?",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-02-23 04:47:30",
        "message":"Tried to ask this question in a related thread (after the thread's OP had solved his problem), to keep information relevant to his problem in one thread, but will post a separate thread:\n\nLouis mentioned in the thread that, \"Remove the diagnostic port and I bet my domain name an MXL6406E is BIOS chip on this board\", implying that there is some inherent issue with the MXL6406E issue with regards to functionality, in some way. \n\nCan you please expand on this? Is there some set of known-issues related to this particular BIOS chip? I'm asking because I have a large number of boards that all suffer from the exact same power-related issue. I've posted threads for several of these boards months ago, and no one was able to figure out the issue. I'm curious if the issues could possibly be related to them using the MXL6406E BIOS chip. Wasn't trying to \"hijack\" the other thread...since the OP had his issue resolved and this information was related to the solution.\n\nThanks."
    },
    {
        "post_id":15394,
        "thread_id":15383,
        "title":"Power-related issues with MXL SPI ROM chip on 3437 boards?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-02-23 10:21:42",
        "message":"MX chips are more prone to data corruption than any other brand. Nothing special to this. In most cases they will react to heating them up. Only seen the issue on SOIC8 devices, so not on 3437."
    },
    {
        "post_id":15404,
        "thread_id":15383,
        "title":"Power-related issues with MXL SPI ROM chip on 3437 boards?",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-02-23 10:59:23",
        "message":"Thanks, Duke. Louis mentioned it in a thread specifically about a 3437, that's why I referenced it. Good to know--thank you."
    }
]