{"post_id":79632,"thread_id":61658,"title":"iMac A1419","user_id":20112,"username":"iFix","post_date":"2021-09-01 10:29:28","message":"Hi Guys.\n\nI'll update the exact board model later but in the meantime the iMac has high fan speeds which i managed to slow it down with software but it's also very very slow...\n\nThanks"}
{"post_id":79633,"thread_id":61658,"title":"iMac A1419","user_id":682,"username":"2informaticos","post_date":"2021-09-01 10:38:06","message":"Any history available?\nLike LCD replacement, or HDD\/SSD upgrade..."}
{"post_id":79773,"thread_id":61658,"title":"iMac A1419","user_id":20112,"username":"iFix","post_date":"2021-09-03 03:26:54","message":"Yes the iMac was splashed with water long time ago i removed all there was no damage inside besides the audio jack but that i solved there was a capacitor shorted removed and stopped the beeps. The client decided to sell it for parts 2years ago and it stayed like that since then :D I tried with a new SSD cause the old the client took it"}
{"post_id":79776,"thread_id":61658,"title":"iMac A1419","user_id":682,"username":"2informaticos","post_date":"2021-09-03 04:26:46","message":"Did you bypass HDD thermal sensor?"}
{"post_id":79786,"thread_id":61658,"title":"iMac A1419","user_id":20112,"username":"iFix","post_date":"2021-09-03 08:54:09","message":"No i didn't bypass haven't done it before on these models i've upgraded SSDs many times didn't had to. How can i do the Bypass? You think that's the reason why it's very slow? \n\nThanks :D"}
{"post_id":79795,"thread_id":61658,"title":"iMac A1419","user_id":682,"username":"2informaticos","post_date":"2021-09-03 11:33:02","message":"We have recent threads about similar problem, in the last two days.\nYou lose lot of important information \"bypassing\" other threads than your ones.\n\nI have no idea what board you have there (secret good kept) and I cannot make any component reference.\nTalking about SATA SSD connector (not on MLB), tie pin 11 to 10, or 12 (ground)."}
