{"post_id":3434,"thread_id":3434,"title":"[SOLVED]A1278 2009 (820-2530-A) No Video Via LVDS","user_id":210,"username":"samwigman","post_date":"2016-06-09 19:11:10","message":"Hello Board Repair People\n\nI've got a customer A1278 2009 with neither video nor backlight response on the built in display. After reading various things that apparently weren't credible I decided to order a new display on the basis that the board was fine if I could get video via thunderbolt, which I can. I do not get any video on the new display. So now I've taken the board out like I should have done in the first place, and it appears I have some liquid damage. I'd like to know what would be involved in the repair, or whether it's something I should recommend to the customer. It looks like working boards for sale start at 180, which to me would total a C2D laptop of any sort.\n\nThanks\nSam\n\n[url]http:\/\/imgur.com\/a\/w0g1m[\/url]"}
{"post_id":3437,"thread_id":3434,"title":"[SOLVED]A1278 2009 (820-2530-A) No Video Via LVDS","user_id":1,"username":"larossmann","post_date":"2016-06-10 00:11:01","message":"You're covering everything I need to see. :(\n\nFirstly put it through an ultrasonic cleaner, that looks like shit!\n\nSecondly check voltage on each side of L9004 and L9008, which probably are corroded, under the speaker."}
{"post_id":3543,"thread_id":3434,"title":"[SOLVED]A1278 2009 (820-2530-A) No Video Via LVDS","user_id":210,"username":"samwigman","post_date":"2016-06-13 07:45:55","message":"I get 0V across each resistor. But I'm not confident that's what you asked for. I don't know if you mean voltage across each of these two resistors or voltage between one side of each and ground on a screw hole or what have you. I'm also not confident I'm turning the board on correctly. I googled two answers as to how to do that. One was to short pin 5 to pin 29 on the keyboard connector. The other is to short the nearby lower right long rectangle pad to the upper left short rectangle pad. Five to 29 will make the CPU and GPU heat up. The rectangle pad method does nothing but turn off the magsafe light, as far as I can tell. Neither makes the fan spin, which confuses me. Maybe doing one of these two broke it further? I didn't notice the heat on the chips the first time until I smelled the cooking silicon or PCB."}
{"post_id":3624,"thread_id":3434,"title":"[SOLVED]A1278 2009 (820-2530-A) No Video Via LVDS","user_id":210,"username":"samwigman","post_date":"2016-06-15 05:55:17","message":"I'm updating to say that cleaning alone solved this, although I do not have an ultrasonic cleaner. Alcohol and a toothbrush cleared it up sufficiently I guess. There's still some somewhat concerning green stuff around U4900, U7750, and Q7620. I suppose I need to tool up better for the next job."}
