{"post_id":18936,"thread_id":18936,"title":"[SOLVED]820-00164 power issue","user_id":451,"username":"jgraffis","post_date":"2017-04-22 19:00:11","message":"I'm looking at this 820-00164 that came in today. customer states that her daughter spilled a little bit of water near the power button. upon opening it up there is no noticeable signs of liquid damage what so ever. I mean this thing is clean but has the usual dust and fuzz that most do have. i get a green\/red light on the charger. noticed it is trying to do quarter fan spin. i can here the fan motor trying to turn over about every 3-5 seconds. i did some checking around with the multimeter and found that all of the s4 rails were pulsing from 0.347v to 3.3v. i also found that pm_slp_s5_L is also pulsing the a same 0.347v to 3.3v. PM_SYSRST_L is also pulsing. \n\nnot sure where to go from here or if i should look somewhere else on the board first?\n\nany ideas?"}
{"post_id":18939,"thread_id":18936,"title":"[SOLVED]820-00164 power issue","user_id":2,"username":"dukefawks","post_date":"2017-04-22 19:48:55","message":"The usual, is CPU Vcore pulsing too? U6100 area? U1950?"}
{"post_id":19033,"thread_id":18936,"title":"[SOLVED]820-00164 power issue","user_id":451,"username":"jgraffis","post_date":"2017-04-24 14:16:27","message":"cpu vcore is pulsing u6100 area is in excellent shape but pin 6 and 7 are also pulsing, u1950 pins 1,2,5,6,7 also pulse."}
{"post_id":19035,"thread_id":18936,"title":"[SOLVED]820-00164 power issue","user_id":451,"username":"jgraffis","post_date":"2017-04-24 14:27:17","message":"i found short to ground on pin 1 of C1031 ppvcc_s0_cpu."}
{"post_id":19046,"thread_id":18936,"title":"[SOLVED]820-00164 power issue","user_id":2,"username":"dukefawks","post_date":"2017-04-24 18:35:06","message":"What is resistance to GND on S0_CPU, not diode."}
{"post_id":19051,"thread_id":18936,"title":"[SOLVED]820-00164 power issue","user_id":451,"username":"jgraffis","post_date":"2017-04-24 19:17:00","message":"on pin 1 of r7310 resistance to GND was 14.4ohms and dropped to 11.3ohm after about 5min. i did remove r7310 and r7320 to see which side the short to ground was on. and its on pin1 of r7310 and pin 2 of r7320. I'm thinking short on cpu but really it could be anything on this line? i think."}
{"post_id":19054,"thread_id":18936,"title":"[SOLVED]820-00164 power issue","user_id":2,"username":"dukefawks","post_date":"2017-04-24 20:13:09","message":"So 14.4 Ohm is a short? SYS_PWROK also pulsing at R1962? Inspect board for corrosion everywhere"}
{"post_id":19115,"thread_id":18936,"title":"[SOLVED]820-00164 power issue","user_id":451,"username":"jgraffis","post_date":"2017-04-25 17:36:09","message":"i went to plug the machine in to measure the voltage at r1962 and found that when my hand touch the cpu the machine turned on. i unplugged it\/plugged it back in and same thing. so i pressed not hard on the cpu and it powered on again. i let it run for a bit. unplugged it\/plugged it back in and it powered up like on its own a few times. i decided to throw it in the ultrasonic to clean the flux mess i made around r7310, and now no power on on quarter fan spin. \n\ni do get a green light and am missing pm_slp_s4_L now. (guess i shouldn't have put in for cleaning). \n\ni suck at cpu_vcore obviously. not really sure where to start over now. seems like the original issue was something to do with the cpu or at least a bad solder joint.\nany ideas?"}
{"post_id":19116,"thread_id":18936,"title":"[SOLVED]820-00164 power issue","user_id":2,"username":"dukefawks","post_date":"2017-04-25 17:53:52","message":"Pretty sure it is just back to power cycling. Check 5V bus for pulses. But if this was really working when pushing on CPU it is not a board you want to mess with anyway."}
{"post_id":19121,"thread_id":18936,"title":"[SOLVED]820-00164 power issue","user_id":451,"username":"jgraffis","post_date":"2017-04-25 19:32:11","message":"i did check everywhere and i mean everywhere for corrosion. no signs of corrosion. Some one has dropped it at some point as the corner is bent but not enough to even break the screen so i past on that idea until it started turning on when i pressed on the cpu. I'm thinking i might just call this one unfixable and replace the board. \n\nWas just wondering if the pm_slp_s4_L and pm_slp_s4_L signal comes from the cpu or the smc?"}
{"post_id":19126,"thread_id":18936,"title":"[SOLVED]820-00164 power issue","user_id":2,"username":"dukefawks","post_date":"2017-04-25 19:48:05","message":"They come from a complicated combination of CPU\/PCH\/SMC\/RTC, so yeah. I doubt this board is worth the effort as it was probably damaged by the drop."}
{"post_id":19128,"thread_id":18936,"title":"[SOLVED]820-00164 power issue","user_id":451,"username":"jgraffis","post_date":"2017-04-25 20:02:58","message":"im leaning to the idea that maybe a solder ball was cracked under the cpu. so yea new board time. i don't have the stuff to reball these types of chip nor the desire. Good to know about the the PM_SLP_S?_L signals.\n\nThanks again. mark as solved or closed."}
