{"post_id":5077,"thread_id":5077,"title":"820-3209  ppvcore_s0_axg","user_id":316,"username":"G.Beard","post_date":"2016-08-04 19:08:09","message":"Hi. I'm trying repair an 820-3290. All rails ok except for PPVCORE_S0_AXG and sub rails.\n\nHistory \"it worked then one day would not turn on\".\nNo corrosion no signs of liquid and nothing visibly bad.\n\nHere is what I have done so far:\n\n\nShort somewhere on PPVCORE_S0_AXG\nRemoved R7550 (4 lead)\nRemoved R7554 (2 lead)\n\nOf 4 pin R7550:\nPin 1 to PPVCORE_S0_AXG_R == no short\nPin 2 to PPVCORE_S0_AXG_REG == SHORT\nPin 3 to CPUIMVP_ISNS1G_P == no short\nPin 4 to lead 1 on R7554 CPUIMVP_ISNS1G_N == no short\n\n\nDead short to ground somewhere between CPU_AXG_SENSE_P and PPVCORE_S0_AXG_REG\nI have done some more desoldering - resoldering to eliminate top side board caps.\n\nAny known common cause for the sudden falure and short on this rail?"}
{"post_id":5082,"thread_id":5077,"title":"820-3209  ppvcore_s0_axg","user_id":2,"username":"dukefawks","post_date":"2016-08-04 21:01:03","message":"What are you calling a short. This bus will have a low resistance <5 ohm. This bus will also not be powered when no LCD is connected or recognized."}
{"post_id":5083,"thread_id":5077,"title":"820-3209  ppvcore_s0_axg","user_id":316,"username":"G.Beard","post_date":"2016-08-04 22:00:51","message":"..... Oh. :o How is screen detected?\n\nWith screen connected, PPVCORE_S0_AXG  = milliVolts. All other rails there, no backlight, no image, no chime, fan spin constant speeds up to full."}
{"post_id":5085,"thread_id":5077,"title":"820-3209  ppvcore_s0_axg","user_id":2,"username":"dukefawks","post_date":"2016-08-04 23:08:32","message":"First it needs to chime. These boards I have seen issues with the PCH. Try and press on it and power on and see if it works. Can also give it some heat 150C."}
{"post_id":5097,"thread_id":5077,"title":"820-3209  ppvcore_s0_axg","user_id":316,"username":"G.Beard","post_date":"2016-08-05 09:44:48","message":"Ok so at this point I know there is no chance of [I]me [\/I]fixing this board so I'll dump it and pick it up when I know more.\nWhat I would like to ask about is order \/ sequence. Aside from the schematics, can anyone recommend online resources that will help me better understand?....\nI can use gooogle (or I would not already have a business in tech) but if there are any sites that stand out as particulary usefull any links would be very much appreciated."}
{"post_id":5100,"thread_id":5077,"title":"820-3209  ppvcore_s0_axg","user_id":2,"username":"dukefawks","post_date":"2016-08-05 10:11:50","message":"Your best resources are here, youtube and google, but above all practice. Giving up on something cause you think you cannot fix it will not advance your skills in fixing these."}
{"post_id":5101,"thread_id":5077,"title":"820-3209  ppvcore_s0_axg","user_id":316,"username":"G.Beard","post_date":"2016-08-05 10:48:54","message":"Good point!"}
{"post_id":5103,"thread_id":5077,"title":"820-3209  ppvcore_s0_axg","user_id":1,"username":"larossmann","post_date":"2016-08-05 12:04:37","message":"What I do is put things on the shelf to figure out later. It's ok to give up today and come back to it in 2 weeks, 2 months, or even a year once you're better. My best revelations came when I Was fully defeated, bored, had nothing better to do, and picked up something that had kicked my ass six months ago with fresh perspective and new knowledge. If you are buying these to refurbish them you are in a much better position than someone like me who has to learn within the 24-48 hours I have to fix it before the customer has a temper tantrum!"}
{"post_id":5108,"thread_id":5077,"title":"820-3209  ppvcore_s0_axg","user_id":316,"username":"G.Beard","post_date":"2016-08-05 13:37:20","message":"Fortunately my obssesive tendencys mean I can't stop working or studying and if I don't learn something new or make some money or progress in some way that day, I don't go to bed until I have. So, no doubt I'll have another go but definately once I have gone over the blackbox style power system architectiure page on the schematic and look at the blocks in detail on the schematic.\n\nYou think it would serve to read up on sandy, ivy and haswell and the various series chipsets (QM77, etc) a bit too?.\n\nGood encouragement guys thank you"}
