{"post_id":7050,"thread_id":7050,"title":"820-2915-a a1286 Intermittent Mouse\/Performance Issues","user_id":370,"username":"drewrox2009","post_date":"2016-09-21 13:53:09","message":"This board shows no obvious liquid damage.\nHard drive was replaced by ssd. \nRunning new os install.\nasd showed 2 errors Error 28 mux switching failed and battery not sealed\ncustomer previously replaced battery with generic battery, I do not have a genuine test battery for this macbook.\nRunning genuine 85w power adapter.\n\nThe issue that i am facing is that on occasional boots, the mouse is very jumpy and the performance of the computer seems to be very poor. I am aware of the touchpad sensors and did try a known good touchpad and the issue was the same, i also got no asd errors related to sensors in asd. \n\nThe issue will go away completely for a couple of hours even while under stress. However replacing ram with test ram will immediately bring back the issue. \n\nI am at a bit of a loss on this one, Any suggestions of where to look would be very helpful. \nThanks in advance."}
{"post_id":7052,"thread_id":7050,"title":"820-2915-a a1286 Intermittent Mouse\/Performance Issues","user_id":2,"username":"dukefawks","post_date":"2016-09-21 14:10:01","message":"If R8430 were not present or damaged, this might qualify for the GPU recall program. The issue could however also be the SSD. Does this also happen when booting from USB drive?"}
{"post_id":7056,"thread_id":7050,"title":"820-2915-a a1286 Intermittent Mouse\/Performance Issues","user_id":370,"username":"drewrox2009","post_date":"2016-09-21 15:51:36","message":"Sorry if i am misunderstanding,\n\nI removed r8430 and it tests within spec.\nThis issue was present on the previous hard drive, present on new ssd, also happens in boot menu, and asd.\n\nWould this computer be covered under the gpu recall program even though there are no graphics issues?\n\nor are you suggesting i remove r8430 permanently. and bring it in to the apple store with that component missing?"}
{"post_id":7069,"thread_id":7050,"title":"820-2915-a a1286 Intermittent Mouse\/Performance Issues","user_id":2,"username":"dukefawks","post_date":"2016-09-21 17:42:37","message":"If R8430 were not present, video corruption might ensue, which would cause it to have GPU defects.This is a last resort though. It may be best to test a known good original battery first."}
{"post_id":7082,"thread_id":7050,"title":"820-2915-a a1286 Intermittent Mouse\/Performance Issues","user_id":370,"username":"drewrox2009","post_date":"2016-09-21 19:09:00","message":"Thanks for the tip! I will get my Hands on a test battery.\n\nIt should be left off, or just powered up once without the resistor?"}
{"post_id":7085,"thread_id":7050,"title":"820-2915-a a1286 Intermittent Mouse\/Performance Issues","user_id":2,"username":"dukefawks","post_date":"2016-09-21 19:35:31","message":"Without the resistor you will have video garbage. Put it back if you want to boot and test another battery."}
