[
    {
        "post_id":5583,
        "thread_id":5583,
        "title":"820-3787 - Fan spins for a second.",
        "user_id":135,
        "username":"bjf",
        "post_date":"2016-08-17 13:11:53",
        "message":"I have n 820-3787 with pretty minor spill damage (see pics.) There was a short on PPVIN_S5_HS_COMPUTING_ISNS at U7330. I replaced U7330 and the short is gone. Fan spins once for about a second and that's it. Magsafe light is on. Normal green to orange switch. SMC reset is normal, turns green for a few seconds.\nPPBUS_G3H:   12.56V\nPP3V42:   3.4\nPPVRTC_G3H:   3.4\nPP3V3_S5:   3.3V\nPP3V3_SUS:   3.3V\nPP3V3_S4:   0\nPP5V_S5:   5V\nPP5V_S4:   0V\n\nSLP_S3 and SLP_S4 are both 0V\n\nWhen I check 3V3_S4 it will start at 3.3 while fan is spinning and then slowly work it's way down to about 0.20V. Same goes for PP5V_S4. Drops down from 5V after fan stops. Not sure where to go from here. Let me know if there's any other information that would help."
    },
    {
        "post_id":5642,
        "thread_id":5583,
        "title":"820-3787 - Fan spins for a second.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-08-18 08:39:37",
        "message":"Yeah high side CPU FET was shorted so pretty likely the CPU is dead."
    },
    {
        "post_id":5658,
        "thread_id":5583,
        "title":"820-3787 - Fan spins for a second.",
        "user_id":135,
        "username":"bjf",
        "post_date":"2016-08-18 16:56:41",
        "message":"On the topic of shorts, I'm measuring 0.001 in diode mode on PPVCC_S0_CPU. On a 2015 15\" board I'm measuring about 0.014. Is it possible I still have a short? It's always a little tricky to tell if there's a short on the CPU lines because the resistance to ground is always so low, but this seems too low."
    },
    {
        "post_id":5763,
        "thread_id":5583,
        "title":"820-3787 - Fan spins for a second.",
        "user_id":135,
        "username":"bjf",
        "post_date":"2016-08-20 13:52:40",
        "message":"Does anyone have any thoughts on this? Is this the way a CPU would go bad? Would it most likely be internally shorted? I've removed R7300, R7310 and R7320 to isolate the issue down to the PPVCC_S0_CPU line. The top left corner (with pictures above as reference) of the CPU gets hot when viewed through infrared camera when I send 1V through the PPVCC_S0_CPU line."
    }
]