[
    {
        "post_id":81163,
        "thread_id":61821,
        "title":"(SOLVED) 820-3437 a1466 intermitent power",
        "user_id":28596,
        "username":"Jeffotskie26",
        "post_date":"2021-10-07 23:50:42",
        "message":"only can  turn on when reconnect the battery. once u shutdown cant turn on again the charging indicator turns green \nand then orange once u press power button. tried change battery still same\nboard is clean no sign of corossion\nrun diagnostics no issues found.\n\nPPBUS_G3H  8.6V"
    },
    {
        "post_id":81164,
        "thread_id":61821,
        "title":"(SOLVED) 820-3437 a1466 intermitent power",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-10-08 02:20:56",
        "message":"Remove battery and get it working properly with charger first.\nOnce charger is connected, Magsafe light MUST switch from green to amber; before pressing power button.\nIf not, try another LIO board\/flex, as first stept.\nConfirm if you are in this case."
    },
    {
        "post_id":81167,
        "thread_id":61821,
        "title":"(SOLVED) 820-3437 a1466 intermitent power",
        "user_id":28596,
        "username":"Jeffotskie26",
        "post_date":"2021-10-08 02:38:44",
        "message":"same issue with or without battery replaced LIO board\/flex,\ncan on but once u shut it down cant turn on again.\nafter trying to turn again after pressing power button from orange light it will turn to greenlight for 1sec then orange again \nno fan spin no chime you must to reconnect the battery again if battery removed u must to reconnect the charger. \nanyway, once u turn on 1stime after battery reconnection everything is normal and working fine. \nno idea what to check from here."
    },
    {
        "post_id":81171,
        "thread_id":61821,
        "title":"(SOLVED) 820-3437 a1466 intermitent power",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-10-08 04:17:23",
        "message":"If LED flashes pressing power button, seems that SMC reset is done instead.\nDisconnect keyboard and use R5116 pads tu control power.\n\nPost U5110 voltages, w\/ and w\/o keyboard connected."
    },
    {
        "post_id":81521,
        "thread_id":61821,
        "title":"(SOLVED) 820-3437 a1466 intermitent power",
        "user_id":28596,
        "username":"Jeffotskie26",
        "post_date":"2021-10-18 06:33:39",
        "message":"solved this issue found corroded from trackpad connector. thanks"
    }
]