{"post_id":16507,"thread_id":16507,"title":"Macbook A1707 With Touchbar repair help","user_id":468,"username":"ALB-Repairs","post_date":"2017-03-14 09:57:06","message":"Real long shot as i cant find a schematic or BRD for this (820-00281-A) \n\nI have an A1707 with liquid damage, a resistor is open circuit. It was pretty badly corroded. The pad underneath it was gone, There is no traces, the pad connected straight to a tiny Via that goes through the board, i have no way of knowing the value of the resistor or what it was connected to.\n\nAnyone got one of these i could compare measurements with?\nThanks"}
{"post_id":16526,"thread_id":16507,"title":"Macbook A1707 With Touchbar repair help","user_id":1,"username":"larossmann","post_date":"2017-03-14 15:49:11","message":"I only have a 13\" here. :( maybe it is the same circuit? Can you take a picture of the area with the resistor, and then the resistor itself?"}
{"post_id":16680,"thread_id":16507,"title":"Macbook A1707 With Touchbar repair help","user_id":468,"username":"ALB-Repairs","post_date":"2017-03-16 07:50:30","message":"No Title\n\nIts right by the audio jack flex and another flex (maybe TouchID or something) \n\nThing is everything seems to work, USB C, Touchbar, Audio, TouchID.ect"}
{"post_id":16866,"thread_id":16507,"title":"Macbook A1707 With Touchbar repair help","user_id":135,"username":"bjf","post_date":"2017-03-18 11:36:38","message":"The A1706 13\" board is different in that area so it might not be much help. On the 15\" board I'm measuring 0.5Ω with the resistor on the board. Measured with a Fluke 115. The top pin is ground. The bottom pin is measuring .502 voltage-drop to ground in diode mode. That should help you find which line it's on. It's not connected to anything in the area that I can find. It might be the other side of the board."}
{"post_id":17091,"thread_id":16507,"title":"Macbook A1707 With Touchbar repair help","user_id":468,"username":"ALB-Repairs","post_date":"2017-03-21 11:49:29","message":"Thanks for the info BJF\nIve figured out the dead part, somehow the power button not working slipped by me.\nI believe its the SMC_ON_OFF_L line, Im going to poke around the macbook 12\" schematics see if i can find anything interesting.\nIm hoping its the same 10K resistor and cap to ground (it seems to have the cap to ground) used on older models.\n\nIm looking for some debug pads, that could be a quick fix rather than looking for SMC_ONOFF_L.\n\nEdit for quick update:\nI was correct, that is the power button resistor, ive found debug pads, ran a quick ugly jumper and retested the button, All good now!\n\nWill post pictures when ive given it a cleanup."}
