[
    {
        "post_id":45220,
        "thread_id":45220,
        "title":"820-3332-a - Video problems when on dedicated GPU (high power mode)",
        "user_id":906,
        "username":"Joesipaq",
        "post_date":"2019-01-25 07:25:28",
        "message":"Hello all,\nI wanted to know if anyone has seen this issue before. A client came by with video problems. My first thought was the GPU Vcore, but how i have seen that is Video or No Video, not a glitchy video.\n\nI have not poked around yet, as if it is a breaking solder joint, i know i could make it worse by probing it, or just the flex of taking the board out.\n\nMy other thought, is a RAM issue... I say this because just last week I cleaned out an older MBP that has most the plastic retainer worn off of the RAM slots (how i dont know) That computer had the same pixily issues from the moment of bootup (the white apple logo had some pixels out of place) and i am seeing that being a similar problem as to this one, but the screen taring and weirdness was not experienced on the other ram issue mbp.\n\nHere is a link to what the screen is up to now. [URL]https:\/\/youtu.be\/q4rptvKRiT4[\/URL] and [URL]https:\/\/youtu.be\/uA4FfXsFg-s[\/URL]\nHere is a closer picture of the screen funkieness  [ATTACH type=\"full\"]45221._xfImport[\/ATTACH]"
    },
    {
        "post_id":45222,
        "thread_id":45220,
        "title":"820-3332-a - Video problems when on dedicated GPU (high power mode)",
        "user_id":906,
        "username":"Joesipaq",
        "post_date":"2019-01-25 07:31:01",
        "message":"FYI i am waiting on an approval for a flat rate motherboard repair from the client, when it is approved, I will really start to dig into the board starting with resoldering our friend GPU_Vcore chip. gmux? its been a while since ive seen one of these so i might have just assumed the gender of gpu vcore"
    },
    {
        "post_id":45224,
        "thread_id":45220,
        "title":"820-3332-a - Video problems when on dedicated GPU (high power mode)",
        "user_id":906,
        "username":"Joesipaq",
        "post_date":"2019-01-25 08:04:23",
        "message":"I just verified that it is not an OS issue, I booted off of a clean install external SSD. When running Google earth Pro, artifact is present, when closing it and unplugging the power cord (automatic video card switching is enabled) the artifacts go away 100%"
    },
    {
        "post_id":45228,
        "thread_id":45220,
        "title":"820-3332-a - Video problems when on dedicated GPU (high power mode)",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-01-25 09:17:34",
        "message":"Reflow (resolder), change U8900, in this order.\nReflow should be good enough...\nIf no result, then reflow GMUX too."
    },
    {
        "post_id":45241,
        "thread_id":45220,
        "title":"820-3332-a - Video problems when on dedicated GPU (high power mode)",
        "user_id":906,
        "username":"Joesipaq",
        "post_date":"2019-01-25 15:57:06",
        "message":"I have reflown U8900, no difference, will now change it. Need to go find a doaner board. Just to verify, the GMUX is U9100?"
    },
    {
        "post_id":45242,
        "thread_id":45220,
        "title":"820-3332-a - Video problems when on dedicated GPU (high power mode)",
        "user_id":906,
        "username":"Joesipaq",
        "post_date":"2019-01-25 16:57:00",
        "message":"okie dokie, U8900 Replaced, same thing going on."
    },
    {
        "post_id":45243,
        "thread_id":45220,
        "title":"820-3332-a - Video problems when on dedicated GPU (high power mode)",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-01-25 18:06:30",
        "message":"U9100 is DPMUX and U9150 is the Analog MUX.\nDo you get same issue on external screen?"
    },
    {
        "post_id":45244,
        "thread_id":45220,
        "title":"820-3332-a - Video problems when on dedicated GPU (high power mode)",
        "user_id":906,
        "username":"Joesipaq",
        "post_date":"2019-01-25 18:25:35",
        "message":"What is the difference between the Analog MUX and the DPMUX? besides one is or analog lol.\nI honestly have not tried an external monitor yet as when switching video cards i can reproduce the error every time. Tomorrow i will give it a try though."
    },
    {
        "post_id":45247,
        "thread_id":45220,
        "title":"820-3332-a - Video problems when on dedicated GPU (high power mode)",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-01-26 02:09:52",
        "message":"U9150 switches only video lines between iGPU and Nvidia GPU for internal LCD.\nBacklight is still controlled by DPMUX however.\nDPMUX also controls all power rails for Nvidia GPU."
    },
    {
        "post_id":45253,
        "thread_id":45220,
        "title":"820-3332-a - Video problems when on dedicated GPU (high power mode)",
        "user_id":906,
        "username":"Joesipaq",
        "post_date":"2019-01-26 08:58:29",
        "message":"I just tested it on an external monitor and yes, i get the same issue.\n\nSo when you suggested to reflow the GMUX which one should i reflow?"
    },
    {
        "post_id":45256,
        "thread_id":45220,
        "title":"820-3332-a - Video problems when on dedicated GPU (high power mode)",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-01-26 11:09:40",
        "message":"In this case looks like GPU\/vRAM issue.\nHowever, reflow U9100 and see if helps."
    },
    {
        "post_id":45317,
        "thread_id":45220,
        "title":"820-3332-a - Video problems when on dedicated GPU (high power mode)",
        "user_id":906,
        "username":"Joesipaq",
        "post_date":"2019-01-28 06:00:35",
        "message":"I have not re-flown U9100 yet, as practicing i havn't gotten the temp right yet, and pop-corned a chip... Oops. Got 2 more boards to learn on before this one. I am thinking though, it it is a nVRAM issue, and i see results, most likely wouldnt it be a temporary solution due to just heating the SNOT out of the nvram by proximity? If this is a temp solution, id rather not offer it to my client.\n\nHas there been a bypass created for this board yet? Or is that something i should try to crunch out of the schematics to copy the other ones floating around?"
    },
    {
        "post_id":45326,
        "thread_id":45220,
        "title":"820-3332-a - Video problems when on dedicated GPU (high power mode)",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2019-01-28 09:21:16",
        "message":"VRAM, GPU or trace issue inside the board. Inspect GPU VRAM area for knocked off components too. This has nothing to do with any of the MUXes. Don't reball\/reflow VRAM or GPU, just replace them."
    },
    {
        "post_id":45332,
        "thread_id":45220,
        "title":"820-3332-a - Video problems when on dedicated GPU (high power mode)",
        "user_id":906,
        "username":"Joesipaq",
        "post_date":"2019-01-28 13:07:10",
        "message":"Thanks for the heads up Duke. VRAM i think would be simple enough to change out, but the GPU, i haven't done that before and have seen the videos of that east machiene to do bga on gpus, do i need soething like that to correctly change out the gup?\nWhere would you source the vram and gup from?"
    },
    {
        "post_id":45336,
        "thread_id":45220,
        "title":"820-3332-a - Video problems when on dedicated GPU (high power mode)",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2019-01-28 15:25:29",
        "message":"GPU would need a decent rework machine yes. VRAM are not something that normally goes bad so getting them off Ebay\/Ali from China should be ok. I would try the VRAM first as these GPUs don't tend to go bad.\n\nYou did make sure the problem only exists when using the NVIDIA GPU? Problem should not be there when on Intel of course. Run a 3D test like \"heaven\" to test."
    },
    {
        "post_id":45337,
        "thread_id":45220,
        "title":"820-3332-a - Video problems when on dedicated GPU (high power mode)",
        "user_id":906,
        "username":"Joesipaq",
        "post_date":"2019-01-28 15:28:04",
        "message":"I would say the odd video issues are consistent with what i have seen in bad ram. Thanks Duke.\nI know there is a sub fourm for Tools, but to ask you directly, do you have any experience with what would be a decent rework machine 240v for casual stuff? I don't think ill get hardcore into bga rework - but who knows"
    },
    {
        "post_id":45338,
        "thread_id":45220,
        "title":"820-3332-a - Video problems when on dedicated GPU (high power mode)",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2019-01-28 15:41:42",
        "message":"Check if the issue is on Intel or Nvidia! Two very different problems....."
    },
    {
        "post_id":45353,
        "thread_id":45220,
        "title":"820-3332-a - Video problems when on dedicated GPU (high power mode)",
        "user_id":906,
        "username":"Joesipaq",
        "post_date":"2019-01-28 19:11:26",
        "message":"The system does have an Nvidia GeForce GT 650M GPU in it"
    },
    {
        "post_id":45454,
        "thread_id":45220,
        "title":"820-3332-a - Video problems when on dedicated GPU (high power mode)",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2019-01-30 19:09:46",
        "message":"I can't help you if you don't answer my question."
    },
    {
        "post_id":45458,
        "thread_id":45220,
        "title":"820-3332-a - Video problems when on dedicated GPU (high power mode)",
        "user_id":767,
        "username":"pws6074",
        "post_date":"2019-01-30 19:27:19",
        "message":"[url]https:\/\/electronics.stackexchange.com\/questions\/335866\/what-is-the-difference-between-an-analogue-multiplexer-and-digital-multiplexer[\/url]"
    },
    {
        "post_id":45578,
        "thread_id":45220,
        "title":"820-3332-a - Video problems when on dedicated GPU (high power mode)",
        "user_id":906,
        "username":"Joesipaq",
        "post_date":"2019-02-02 17:49:05",
        "message":"[QUOTE=\"Joesipaq, post: 45353\"]The system does have an Nvidia GeForce GT 650M GPU in it[\/QUOTE]\n\nI don't understand what you mean by not helping if I don't answer your question?"
    },
    {
        "post_id":45579,
        "thread_id":45220,
        "title":"820-3332-a - Video problems when on dedicated GPU (high power mode)",
        "user_id":906,
        "username":"Joesipaq",
        "post_date":"2019-02-02 17:51:56",
        "message":"Or are you asking if it happens on the integrated video card vs the dedicated? If thats your question, then the dedicated only, hence why the problem exists on the external monitor as mentioned earlier. Or how the problem goes away when I unplug the computer with automatic video card switching is enabled."
    },
    {
        "post_id":45582,
        "thread_id":45220,
        "title":"820-3332-a - Video problems when on dedicated GPU (high power mode)",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-02-02 20:01:12",
        "message":"You've been asked if on internal LCD, the problem appears only with Nvidia GPU, or with Intel graphics too."
    },
    {
        "post_id":45722,
        "thread_id":45220,
        "title":"820-3332-a - Video problems when on dedicated GPU (high power mode)",
        "user_id":906,
        "username":"Joesipaq",
        "post_date":"2019-02-05 12:11:31",
        "message":"OK, here we go.\nPost #1 I showed the issue was on the internal LCD.\nPost #7 you asked me if the same problem happened on an external monitor.\nPost #10 I tested on an external monitor and said it is present on external monitor\nThe TITLE of my post - I THOUGHT was VERY CLEAR. \"Video Problems when on dedicated GPU (high power mode)\" It clearly states that this problem is not happening with the Integrated intel GPU.\n\nPost #3 I said that it only happens when the computer is plugged in and has auto video card switching enabled - and when unplugged there is no more artifact.... I thought that this would be the information for you to deduct that when running on the intel graphics, there was no problem, and when running in High power mode using the Nvidea card, it did have the issue.\n\nPost #18 I confirmed if it had nvidia graphics in it - I havne't seen enough to know if there is a model with an ati or something like that.\n\nPlease, can we continue to troubleshoot this issue. Really, any questions about this system I am more than willing to answer. But if you ask me if PPBUS_G3H is present, or if it has a green light - I'll go apeshit. I thought that we could start this fourm from where I left off in my troubleshooting. I had it down to 3 major possibilities when I posted.\n\nU8900 which i though not likely because that causes NO video\nNVRAM - never changed them before\nGPU - never changed one before\n\nI want other technicians profesional ideas and opinions before I proceed with special ordering parts or brick a mbp that is mostly operational for touching something that had no chance at being the problem.\n\nPlease read the full post, descriptions and titles. I know the fourm doesn't cost much a month and many volunteer to help - really Pay to help others, but this is just a bad experience that i have been having\n\nThanks for reading if you are still here - and really, if you need any more info, please ask before the client comes and gets their computer back because it is taking such a time with no solution yet."
    },
    {
        "post_id":45730,
        "thread_id":45220,
        "title":"820-3332-a - Video problems when on dedicated GPU (high power mode)",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2019-02-05 13:07:20",
        "message":"ok, if this happens with an external LCD connected then it is indeed the Nvidia GPU.\nFirst inspect for damaged components around GPU\/VRAM. If that seems good then replace VRAM. If that does not help replace GPU.\n\nI usually replace the GPU and VRAM all together just to make sure it will work. But if you have no BGA machine or experience this is probably not going to happen."
    },
    {
        "post_id":45733,
        "thread_id":45220,
        "title":"820-3332-a - Video problems when on dedicated GPU (high power mode)",
        "user_id":906,
        "username":"Joesipaq",
        "post_date":"2019-02-05 14:27:49",
        "message":"Alright,\nIll pick up a few VRAM to swap out and look into a BGA machine.\n\nWould you recommend i pick up some old working video cards or such that i would learn my BGA machine and profiles on as well as technique, as i can easily plug them into a pc and see if i fried them or not - as well as being budget?\n\nWhat price point from your experience would you say i should be looking into for a bga rework machine? Ill dive into the equipment sub form and look around there too as im sure it has been a topic before."
    }
]