[
    {
        "post_id":60058,
        "thread_id":59395,
        "title":"820-00239: Backlight Issue (Backlight goes out when adjusted)",
        "user_id":1984,
        "username":"macRepairAmb",
        "post_date":"2020-05-24 13:27:46",
        "message":"I have this unit that is having a backlight issue. It boots up completely to OS and runs, but when i attempt to adjust the backlight intensity, i then loose backlight and can't get it back. I still have image on the screen (can see the image when i shine a light on the screen). On other occasions, if i don't mess with the backlight intensity, it will eventually start to flicker out and then go out completely. \n\nI've checked for corrosion or liquid spill\/damage and found none\n\nI'm at a loss as to where to start with this one. Any suggestions?"
    },
    {
        "post_id":60059,
        "thread_id":59395,
        "title":"820-00239: Backlight Issue (Backlight goes out when adjusted)",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-05-24 14:44:17",
        "message":"Check if the machine can get screen replaced free by Apple first.\nIf not, then try known good compatible LCD assembly.\nDisplay itself is involved in backlight (PWM) adjust..."
    },
    {
        "post_id":60068,
        "thread_id":59395,
        "title":"820-00239: Backlight Issue (Backlight goes out when adjusted)",
        "user_id":1984,
        "username":"macRepairAmb",
        "post_date":"2020-05-24 18:13:08",
        "message":"I replaced the display twice. At First when i got the machine in, it powered up but with no backlight. So i ordered a replacement display after I tested the unit with another display. The first display that arrived i thought was defective due to the flickering backlight. But had the same issue on the second display. So i reinstalled the original display and the backlight worked until I then attempted to adjust the intensity, then it dropped out. Upon power cycling the unit, the display worked again, until i reattempt intensity adjustment."
    },
    {
        "post_id":60077,
        "thread_id":59395,
        "title":"820-00239: Backlight Issue (Backlight goes out when adjusted)",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-05-25 03:52:50",
        "message":"Did you change only the LCD display, or LCD assembly entire?"
    },
    {
        "post_id":60081,
        "thread_id":59395,
        "title":"820-00239: Backlight Issue (Backlight goes out when adjusted)",
        "user_id":1984,
        "username":"macRepairAmb",
        "post_date":"2020-05-25 05:10:19",
        "message":"Replaced the whole assembly both times. I try to avoid doing just the lcd on these models."
    },
    {
        "post_id":60148,
        "thread_id":59395,
        "title":"820-00239: Backlight Issue (Backlight goes out when adjusted)",
        "user_id":1984,
        "username":"macRepairAmb",
        "post_date":"2020-05-27 10:41:48",
        "message":"Would you happen to know what chip sets the backlight intensity when we adjust it on the laptop? Whenever the backlight drops out,\nPPVIN_S0SW_LCDBKLT drops from 13v to down to about 1v.\nI've replaced U8400, and Q8400. with the same result."
    },
    {
        "post_id":60149,
        "thread_id":59395,
        "title":"820-00239: Backlight Issue (Backlight goes out when adjusted)",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-05-27 11:12:32",
        "message":"CPU talks with LCD display and this one send final info to U8400.\nSMC is somehow involved too.\nJust search for BKLT_PWM in schematic..."
    }
]