{"post_id":8470,"thread_id":8470,"title":"[SOLVED]820-3476 No display","user_id":517,"username":"vaswaniraj","post_date":"2016-10-22 13:17:26","message":"Hello,  I got a 13\" Retina Display computer that does show anything on the display.  The logic board is 820-3476.  When the adapter is plugged in the light on the adapter comes on and the fan spins.  On inspecting the logic board I see that Q8150 is corroded.  Other than that the logic board looks just fine.  Can anyone advice as to what troubleshooting steps I should look for in order to make this working."}
{"post_id":8471,"thread_id":8470,"title":"[SOLVED]820-3476 No display","user_id":2,"username":"dukefawks","post_date":"2016-10-22 13:33:12","message":"Does it chime? Does a USB mouse light up when plugged in? If yes then hold a flashlight to the back of the Apple logo to check if there is an image without backlight."}
{"post_id":8474,"thread_id":8470,"title":"[SOLVED]820-3476 No display","user_id":517,"username":"vaswaniraj","post_date":"2016-10-22 14:17:22","message":"Hi Duke,  Yes it does chime.  In reference to the mouse light, when the mouse is plugged in to the left side USB port ( next to the DC in board ) the mouse light flashes rapidly and when the same mouse is plugged in to the right side ( next to the HDMI ) port it does not light up at all.  When a flash light is put on the back of Apple Logo it does not show any image.  Please advice further."}
{"post_id":8476,"thread_id":8470,"title":"[SOLVED]820-3476 No display","user_id":2,"username":"dukefawks","post_date":"2016-10-22 14:20:50","message":"Can you do a PRAM reset on the keyboard?"}
{"post_id":8477,"thread_id":8470,"title":"[SOLVED]820-3476 No display","user_id":517,"username":"vaswaniraj","post_date":"2016-10-22 14:27:08","message":"I tried doing a PRAM reset, but I don't think that worked.  Also one thing i observed is that the computer only comes on when connected with the adapter.  On battery power it does not come on.  I am not sure what %age of battery is charged as I cannot see anything on the screen."}
{"post_id":8478,"thread_id":8470,"title":"[SOLVED]820-3476 No display","user_id":517,"username":"vaswaniraj","post_date":"2016-10-22 14:31:01","message":"Wow i see a folder with a question mark on the screen.  The hard drive is out of the system, so i Understand that the folder will go away, when a hard drive is installed.  Looks like the problem is solved.  But let me put the logic board and all the cables together and test the system to see if i see further issues."}
{"post_id":8481,"thread_id":8470,"title":"[SOLVED]820-3476 No display","user_id":517,"username":"vaswaniraj","post_date":"2016-10-22 14:40:34","message":"The computer came on normal.  That means it was just an issue with the PRAM.  Thanks for your help Duke."}
