{"post_id":60321,"thread_id":59430,"title":"820-01041 Short on PP2V5_NAND_SSD1","user_id":2508,"username":"No-Clean","post_date":"2020-06-01 16:53:02","message":"Board tries to startup but U9850 gets hot and board turns off.\n\nThis board had a full short on C9589 removed it and installed a new U9850, but that the new chip got fried too after I powered on the MacBook after that PP2V5_NAND_SSD1 is measuring 0.060 in diode mode, I removed the U9850 checked it and its now shorted-fried.\n\nI then checked each pad for U9850 on the board and found no shorts, PP2V5_NAND_SSD1 measured 0.340 in diode mode after removing U9850, I also removed C9586\/88\/89\/93 as they were a little rusted, and saw that the coil L9580 looks a little rusty, I do not have same coil from other board, schematics tell me that it is 1UH-20%-3.8A-0.035OHM out of those numbers what is the important one so I can find a coil that works is it 1UH-20% or 3.8A or 0.0350HM I assume the later one.\n\nAnyway with all that I put a new U9850 (second one) and same thing, it gets hot and becomes shorted after trying to power the MacBook, PP2V5_NAND_SSD1 gets shorted, I remove U9850 and short is gone.\n\nI have spent some time with this board now, very frustrating...\n\nThanks!"}
{"post_id":60323,"thread_id":59430,"title":"820-01041 Short on PP2V5_NAND_SSD1","user_id":682,"username":"2informaticos","post_date":"2020-06-01 18:37:56","message":"Did you inspect J8500 for liquid sign?\nLook at its pins 1 & 43 first.\nI cannot understand how can you burn two chips.\nIf you find burnt chip, think first WHY; before applying power to the board with replaced chip!\n\nAnd we talked many times about analog mux, named U9850 in all recent boards..."}
{"post_id":60328,"thread_id":59430,"title":"820-01041 Short on PP2V5_NAND_SSD1","user_id":2508,"username":"No-Clean","post_date":"2020-06-01 19:20:14","message":"Will try as suggested, can you please help me here: I do not have same coil from other board, schematics tell me that it is 1UH-20%-3.8A-0.035OHM out of those numbers what is the important one so I can find a coil that works is it 1UH-20% or 3.8A or 0.0350HM I assume the later one."}
{"post_id":60329,"thread_id":59430,"title":"820-01041 Short on PP2V5_NAND_SSD1","user_id":682,"username":"2informaticos","post_date":"2020-06-01 19:31:57","message":"That code means the coil impedance is 1uH (microhenry) with 35 miliohm as internal resistance, designed for 3.8A as nominal current.\nYou should choose one coil with closest value possible for all these parameters.\nThe impedance is the most important property of a coil, but not always sufficient to work properly.\nThe design of a buck-converter will consider all these parameters..."}
{"post_id":60336,"thread_id":59430,"title":"820-01041 Short on PP2V5_NAND_SSD1","user_id":2508,"username":"No-Clean","post_date":"2020-06-01 22:04:27","message":"Thanks for the great explanation on inductors, I will make note of it.\n\nJ8500 is perfect, diode on pin 1 is 0.443 and pin 43 1.234 not shorts wither on all other pins, surrounding area looks clean too.\n\nWhen you get frustrated and desperate you make stupid decisions, that's how I burned 2 new chips..."}
{"post_id":60343,"thread_id":59430,"title":"820-01041 Short on PP2V5_NAND_SSD1","user_id":682,"username":"2informaticos","post_date":"2020-06-02 04:29:54","message":"Compare diode mode readings between all data lines of U9850; w\/ and w\/o LCD connected."}
{"post_id":60637,"thread_id":59430,"title":"820-01041 Short on PP2V5_NAND_SSD1","user_id":2508,"username":"No-Clean","post_date":"2020-06-08 16:56:36","message":"So sorry, this whole time I mean U9580... I will start a new thread..."}
