{"post_id":30730,"thread_id":30730,"title":"[SOLVED]820-3437 Backlight for one second then nothing\/ screen goes off once at login screen","user_id":1153,"username":"JohnB8812","post_date":"2018-01-25 11:00:59","message":"[PLAIN][SOLVED]820-3437 Backlight for one second then nothing\/ screen goes off once at login screen[\/PLAIN]\n\nThis board was definitely liquid damaged at some point and then run through an ultrasonic cleaner. No green light no matter what DC in board or I\/O cable I use BUT fans spin and board boots. The backlight on a known good screen stays on for 1 second then shuts off but shows image. The board boots to the login screen then after about a second or two it shuts off but the fans still spin. I ran flux under the SMC after removing the edge bonding to see if maybe there was crap under it giving me no green light or the shutdown but no dice. The only other thing on the board that looks burned are pins 19,21,23,25,27, and 29 on J9500. How do I approach this repair do I remove J9500 and clean the pads\/run jumpers or is there a different way to fix this? Is this even fixable at all?"}
{"post_id":30734,"thread_id":30730,"title":"[SOLVED]820-3437 Backlight for one second then nothing\/ screen goes off once at login screen","user_id":36,"username":"aprendiz","post_date":"2018-01-25 13:00:29","message":"Replace connector and repair traces, pin 27 is SMC_LID, this is why backlight shut off and pin 19 is SYS_ONEWIRE, this is the reason of no green light..."}
{"post_id":30735,"thread_id":30730,"title":"[SOLVED]820-3437 Backlight for one second then nothing\/ screen goes off once at login screen","user_id":1153,"username":"JohnB8812","post_date":"2018-01-25 13:03:14","message":"Ok will do and yeah I kinda figured on both of those. Will do then gonna be a fun one lol"}
{"post_id":30754,"thread_id":30730,"title":"[SOLVED]820-3437 Backlight for one second then nothing\/ screen goes off once at login screen","user_id":1153,"username":"JohnB8812","post_date":"2018-01-26 12:35:47","message":"Replaced J9500 and ONLY had to jump SMC_LID got green light and the backlight issue fixed! Now gonna run ASD to finish this sucker off! (fingers crossed)"}
{"post_id":30758,"thread_id":30730,"title":"[SOLVED]820-3437 Backlight for one second then nothing\/ screen goes off once at login screen","user_id":1153,"username":"JohnB8812","post_date":"2018-01-26 13:25:14","message":"Passed ASD good to go! Mark as solved and thanks for the help!"}
