[
    {
        "post_id":314,
        "thread_id":314,
        "title":"No backlight \/ Display 820-3787 after wrong LCD installed",
        "user_id":76,
        "username":"Tony Tone",
        "post_date":"2016-03-23 19:20:27",
        "message":"[COLOR=#000000][FONT=Roboto][SIZE=13px]Q7706 pins 3&4 have 11V.\nU7701 pin 11 has 11V\nNo output on Q7706 Change Q7706?\n\nD7701(1) 0.851 D7701(2) 1.140\nC7717 0V[\/SIZE][\/FONT][\/COLOR]"
    },
    {
        "post_id":328,
        "thread_id":314,
        "title":"No backlight \/ Display 820-3787 after wrong LCD installed",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2016-03-23 22:22:26",
        "message":"Ignore backlight, we need display first. What voltage is on either side of L8300? Is LCD_PWR_EN present going into U8300?\n\nQ7706 is related to backlight circuit. Backlight circuit is irrelevant until we have image. First image; THEN backlight!!\n\nYou do not replace Q7706 if it is not being told to open. Q7706 is P channel mosfet, so usually it will let power through when the voltage on the GATE(pin 3) is lower than the voltage on the source(pin 4) by a significant enough margin. \n\nIf the voltage on pins 3 and 4 are the same, there will be no output. Q7706 is doing its job, so you don't replace it!\n\nR7701\/R7702 create a voltage divider that U7701 allows a path to ground if it is told that backlight should be on. U7701 is not allowing Q7706 to pass voltage through because the machine doesn't think the LCD is connected\/coming on.. so fix that first. Answer my above questions."
    },
    {
        "post_id":362,
        "thread_id":314,
        "title":"No backlight \/ Display 820-3787 after wrong LCD installed",
        "user_id":76,
        "username":"Tony Tone",
        "post_date":"2016-03-24 11:09:17",
        "message":"Damn. Lost a learning opportunity. Customer is jumping up and down and wants their MacBook right now. So I'll give it to em."
    },
    {
        "post_id":364,
        "thread_id":314,
        "title":"No backlight \/ Display 820-3787 after wrong LCD installed",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2016-03-24 12:08:56",
        "message":"the screen doesn't work, good luck getting anything done with it"
    },
    {
        "post_id":367,
        "thread_id":314,
        "title":"No backlight \/ Display 820-3787 after wrong LCD installed",
        "user_id":76,
        "username":"Tony Tone",
        "post_date":"2016-03-24 14:44:48",
        "message":"I know people are dumb asses.  Masaratti dealer, snobbish. As far as I know, I don't think anyone else in town does board work. Gave him back just the bottom half of his Mac back.  I'm not handing over my screen. LOL. Fuck but anyways.  Ya I studied your videos for like 9 hours and tested, & tested to the best of my knowledge.  I was also thinking as you are pointing out, but clueless.  Thought I'd question Q7706 just because I wasn't getting voltage out even though I seen your explanation in videos.  I will study what you have given me fa' sheezy : D  Wish I still had that fucking board.  Fuck the customer and their money I want to fix that fucking board LOL."
    },
    {
        "post_id":368,
        "thread_id":314,
        "title":"No backlight \/ Display 820-3787 after wrong LCD installed",
        "user_id":76,
        "username":"Tony Tone",
        "post_date":"2016-03-24 14:59:41",
        "message":"Know what'd be DAF? If we put a deposit down on a board & only you know whats wrong with it & we tried to figure it out. Like different levels. Lemme get an easy one, LOL. & then ship them back to you. Not for pay or work, but as a learning tool.  A computer class I once took the back wall was stacked with computers that the teacher sabotaged and we had to pick a random one and fix it."
    },
    {
        "post_id":404,
        "thread_id":314,
        "title":"No backlight \/ Display 820-3787 after wrong LCD installed",
        "user_id":77,
        "username":"leonattpcs",
        "post_date":"2016-03-25 12:59:00",
        "message":"Customer is jumping up and down - no patience or what?"
    },
    {
        "post_id":423,
        "thread_id":314,
        "title":"No backlight \/ Display 820-3787 after wrong LCD installed",
        "user_id":76,
        "username":"Tony Tone",
        "post_date":"2016-03-26 07:26:49",
        "message":"Nope. Then they wanna bitch about their lid. That's what you get for backing out mid-repair."
    },
    {
        "post_id":440,
        "thread_id":314,
        "title":"No backlight \/ Display 820-3787 after wrong LCD installed",
        "user_id":77,
        "username":"leonattpcs",
        "post_date":"2016-03-26 12:46:25",
        "message":"I know, they bring it on themselves."
    }
]