[
    {
        "post_id":68150,
        "thread_id":60359,
        "title":"RAM replace A1369",
        "user_id":28284,
        "username":"dudipupan",
        "post_date":"2020-11-19 19:51:58",
        "message":"Hi,\n\ni want to replace the RAM of a A1269 from 2010. I already unsoldered the old chips. I want to replace them with some chips soldered on a ddr3 sodimm ram stick. Are there any restrictions (except of frequency) or can I just take any RAM?\n\nThank yo\nBest regards"
    },
    {
        "post_id":68156,
        "thread_id":60359,
        "title":"RAM replace A1369",
        "user_id":1057,
        "username":"piernov",
        "post_date":"2020-11-20 05:02:17",
        "message":"No you must use same RAM chips as what this board model was shipped with originally. RAM chips must match SPD profile stored in EFI. A given board can come with a few different chips model, correct profile is selected with RAMCFG strapping resistors.\nAnyway not sure why you're trying to replace RAM chips but it's most likely a waste of time."
    },
    {
        "post_id":68172,
        "thread_id":60359,
        "title":"RAM replace A1369",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-11-20 14:10:58",
        "message":"Reball original chips and be sure to solder them correctly on the board.\nIf board fails to start (beeping RAM error again), then it is trash.\nBad CPU, or broken solders\/traces underneath CPU..."
    },
    {
        "post_id":68476,
        "thread_id":60359,
        "title":"RAM replace A1369",
        "user_id":28284,
        "username":"dudipupan",
        "post_date":"2020-11-27 11:23:55",
        "message":"Thank you for your reply. \n\nMaybe some context is needed:\nWhen I received the MacBook it failed to start (3x beeping) so I decided to reflow the RAM chips (because it also crashed on Memory Test).\nAfter reflowing it started but threw kernel panic after some minutes. So I decided to remove the RAM chips. Now I found some chips of the same type and i will try to reball them and put them on the board."
    }
]