{"post_id":33023,"thread_id":33023,"title":"820-00426 Doesn't Load OS, Runs Hot!","user_id":868,"username":"computercaverva","post_date":"2018-03-27 21:12:24","message":"I have a 2015 A1398 that came in with no signs of liquid damage or other physical damage. The computer powers on and passes Apple built in diags. The computer will load up and about 80% through the loading progress bar then the screen goes black and reboots. The heatsink gets incredibly hot when running for only about a minute. I can get the computer to run at a \"normal\" temperature with the the trackpad disconnected. I have tried connecting a known good trackpad to the board and it still runs hot. I watched Louis' video on the 00138 that was failing to load an OS due to corrosion but all three of the buck controller ICs look to be in good condition. No corrosion, burns, etc.\n\nPPBUS: 12.54V\nPPVRTC: 3.332V\nPPVCC: 1.804V\nPPVCORE_GFX: 0.85V\n\nThis is the only remotely questionable buck controller IC, there is a small semi-circle mark on one of the ICs. (attached photo)"}
{"post_id":33030,"thread_id":33023,"title":"820-00426 Doesn't Load OS, Runs Hot!","user_id":2,"username":"dukefawks","post_date":"2018-03-27 21:47:11","message":"Tried to boot from USB?"}
{"post_id":33055,"thread_id":33023,"title":"820-00426 Doesn't Load OS, Runs Hot!","user_id":868,"username":"computercaverva","post_date":"2018-03-28 12:15:53","message":"It will load into a bootable High Sierra disk and will start installing a fresh OS on a known good SSD, however when it reboots following the install into the OS for the first time the issue of the black screen and rebooting starts again."}
{"post_id":33069,"thread_id":33023,"title":"820-00426 Doesn't Load OS, Runs Hot!","user_id":2,"username":"dukefawks","post_date":"2018-03-28 16:06:11","message":"If it gets really unusually hot there may be damage to the CPU. Also check Vcore voltage it may be high due to a bad FET in Vcore supply."}
{"post_id":33087,"thread_id":33023,"title":"820-00426 Doesn't Load OS, Runs Hot!","user_id":868,"username":"computercaverva","post_date":"2018-03-29 07:56:32","message":"I don't have a schematic for the 00426 I'm just using the 3787 and hoping it is close enough. I am getting 1.804V on the coils for VCORE and PH1\/PH2."}
{"post_id":33097,"thread_id":33023,"title":"820-00426 Doesn't Load OS, Runs Hot!","user_id":2,"username":"dukefawks","post_date":"2018-03-29 16:31:48","message":"Not sure what it should be on these boards but 1.7\/1.8V is common on other boards of this age.\nYou could replace that FET but also replace the controller chip U7200.\nAny mistakes here will kill the CPU so be careful!"}
