{"post_id":25166,"thread_id":25166,"title":"820-3115 - Can't find the short.","user_id":375,"username":"gcain","post_date":"2017-09-08 19:00:34","message":"Something around Q7220 or maybe U7200 is getting hot. I've replaced both of them.\n\nAlso removed and replaced Q7260\/1 and it's still getting hot in the same area.\n\nNo PP3v42 or any power rails really.\n\nIt seems to warm up slowly but does eventually get quite hot which is making it hard to pin point what it is.\n\nWhen I inject power it only pulls about .3 amps."}
{"post_id":25179,"thread_id":25166,"title":"820-3115 - Can't find the short.","user_id":289,"username":"smiba","post_date":"2017-09-09 17:47:18","message":"To start, what exact line has the short we're looking for? Based on the chips you've been replacing I think P3V3_S5?\n\nReplacing Q7261 makes no sense at thats for PP3V3_S3, which is never going to happen while we don't have PP3V42_G3H"}
{"post_id":25185,"thread_id":25166,"title":"820-3115 - Can't find the short.","user_id":375,"username":"gcain","post_date":"2017-09-09 20:40:19","message":"[QUOTE=\"smiba, post: 25179\"]To start, what exact line has the short we're looking for? Based on the chips you've been replacing I think P3V3_S5?\n\nReplacing Q7261 makes no sense at thats for PP3V3_S3, which is never going to happen while we don't have PP3V42_G3H[\/QUOTE]\n\nI replaced Q7261 and Q7260 because they were literally sizzling when power was applied.\n\nShort is on PP3v42_G3H"}
{"post_id":25190,"thread_id":25166,"title":"820-3115 - Can't find the short.","user_id":289,"username":"smiba","post_date":"2017-09-10 06:12:27","message":"I guess it can happen if Q7260 is stuck open and the controller tries to sink that current with Q7261\n\nWhat S5 rails are you missing or is it only PP3V42_G3H?\n\nIf you can't find anything that gets hot you'll have to de-solder some stuff to see if it goes away. First bet would be on U6990 itself. if it isn't it can be a lot of things including a internal short :("}
{"post_id":25197,"thread_id":25166,"title":"820-3115 - Can't find the short.","user_id":2,"username":"dukefawks","post_date":"2017-09-10 11:24:17","message":"I fear this will be extensive damage. 3V42 has nothing to do with anything around U7200. Only place they come together would be the PCH. U7200 heats up when injecting voltage on 3V42? Checked other rails for shorts to GND?"}
