{"post_id":24603,"thread_id":24603,"title":"820-00165 keeps rebooting","user_id":90,"username":"ytesfay80","post_date":"2017-08-24 16:57:50","message":"This board had liquid damage only in one spot that I could find. C7425 was the only component I could fine where there was any liquid damage. I removed that cap and I saw that the pad on Pin 2 was completely gone so I had to put the cap on pin 1 and put some solder onto the probe point next to it. Now the fan spins and the cpu gets warm but for some reason when I have the screen or something plugged in I will see the screen flash as if it turns on but then it will shut off and the fan stops spinning then it repeats over and over.\n\nWhen I have no external components plugged in the fan will spin for about 10 seconds then shut off and repeat again.\n\nC7425 was surprisingly the only component that had any signs of liquid damage. I ultrasonic'd the board but still the issue remains.\n\nWhen I first received the board the fan would spin for 1 second then shut off and it does that also when I remove C7425 from the board."}
{"post_id":24614,"thread_id":24603,"title":"820-00165 keeps rebooting","user_id":2,"username":"dukefawks","post_date":"2017-08-24 19:29:19","message":"Corroded trace to U7400 pin13 and or Q7430?"}
{"post_id":24616,"thread_id":24603,"title":"820-00165 keeps rebooting","user_id":90,"username":"ytesfay80","post_date":"2017-08-24 20:11:49","message":"Also I made a mistake in the previous post. Pin 1 was actually the one that had the pad gone and I had to solder to Prboe 768. \nThere is continuity from Pin 13 of U7400 to Pin 2 of C7425.\nThere is also continuity from Pin 2 of C7425 to Pin 4 of Q7430.\nDo you know why Pin 2 of C7425 leads to the U7400 chip when the schematic shows that Pin 1 should be connected to U7400?"}
{"post_id":24665,"thread_id":24603,"title":"820-00165 keeps rebooting","user_id":2,"username":"dukefawks","post_date":"2017-08-26 13:31:36","message":"Can you not see on the schematic that pin 2 of C7425 goes to pin 13 on U7400? Is the trace between C7425 pin 1 and U7400 pin 15 in tact?"}
{"post_id":24689,"thread_id":24603,"title":"820-00165 keeps rebooting","user_id":90,"username":"ytesfay80","post_date":"2017-08-26 18:53:00","message":"Sorry I didn't notice it connected to pin 13. \nBut Pin 1 was gone from the pad so I have Pin 1 soldered to Probe 768 and Pin 2 is on its original pad. \nI have continuity from Probe 768 all the way to Pin 15 of U7400."}
{"post_id":24697,"thread_id":24603,"title":"820-00165 keeps rebooting","user_id":2,"username":"dukefawks","post_date":"2017-08-27 14:41:27","message":"No idea, replace U7400 and check traces around it. Also of course the common U1950 pin 8 should be checked."}
