{"post_id":51551,"thread_id":51551,"title":"3115, fan spin but no chime","user_id":2088,"username":"Hardwood T\/S","post_date":"2019-08-21 21:18:55","message":"Plug in the 60W OEM magsafe, you usually get a green light w\/fan spin, no chime\/display\/anything. Fan continually runs higher and higher etc, the usual. No USB activity\/no beeps when ram is not inserted.\nOccasionally, when optical drive is connected, you'll get the whir of the optical drive starting, but still no display\/chime\/etc.\n\nNow I did replace U6100 and reflow'd SMC to rule out easy fixes, did some inspecting around the board to see if anything was amiss--found C3887 and R1810 poppin off the board, due to corrosion. Didn't bother with C3887 as it was TBLT, but R1810 seems to me the likely culprit as to why this board isn't fully booting. Unfortunately, pad 1 was already gone, and while attempting to solder a nice lil jumper wire to it, pad 2 decided to pop off as well. So, now I have no pads for R1810 and unfortunately the closest trace points are nearly half a board away. Before I go crazy over this, is this likely the reason why the board isn't booting? Not sure if this data line is critical for board POST.\n\nedit - if not obvious ALL_SYS_PWRGD and VCORE have proper voltages, 3.4v\/1.2v. As a side note, 3v42 is 3.5v and PPBUS_G3H is 12.62v. Bit higher than usual?"}
{"post_id":51579,"thread_id":51551,"title":"3115, fan spin but no chime","user_id":682,"username":"2informaticos","post_date":"2019-08-22 18:55:21","message":"R1810 is not the culprit for your problem.\nIs just for audio codec clock.\n\nYou probably still have corrosion in other areas of the board.\nBe sure R7403 is OK."}
{"post_id":51600,"thread_id":51551,"title":"3115, fan spin but no chime","user_id":2088,"username":"Hardwood T\/S","post_date":"2019-08-23 17:18:06","message":"Found the issue--SMC_LRESET_L had a broken trace between the SMC pad and it's via. Unfortunately replacing SMC is doodoo for me rn, but with a new hot air station here and a new stencil coming in soon I'll give a shot at reballing one of the many I have.\n\nI'm guessing this is the issue, at least. Sound right?"}
{"post_id":51601,"thread_id":51551,"title":"3115, fan spin but no chime","user_id":682,"username":"2informaticos","post_date":"2019-08-23 18:47:45","message":"Undefined SMC_RESET_L signal is a good reason for non working board..."}
{"post_id":51602,"thread_id":51551,"title":"3115, fan spin but no chime","user_id":682,"username":"2informaticos","post_date":"2019-08-23 18:56:25","message":"I recommend you to get direct heat stencil and reball with solder paste.\nMany videos available on Internet..."}
{"post_id":51619,"thread_id":51551,"title":"3115, fan spin but no chime","user_id":2088,"username":"Hardwood T\/S","post_date":"2019-08-24 17:11:14","message":"SMC_RESET_L and SMC_LRESET_L are different data lines, are they not? SMC_LRESET_L is the one that is broken trace on mine.\nStencil should be arriving soon."}
{"post_id":51620,"thread_id":51551,"title":"3115, fan spin but no chime","user_id":682,"username":"2informaticos","post_date":"2019-08-24 20:02:04","message":"Yeah, my eyes fail a lot...\nSMC_LRESET_L comes from PLT_RESET_L and SMC really needs that signal."}
