[
    {
        "post_id":68002,
        "thread_id":60345,
        "title":"anyone figure out the problems with Big Sur and A1502s?",
        "user_id":1423,
        "username":"captainmac",
        "post_date":"2020-11-17 07:34:19",
        "message":"Like the title says: \nBig Sur is out a couple of days and i have had about 3 customers hand in their A1502 (from 2013\/2014 and 2015) for same issue: update stalled and the Mac ends up displaying only black screen.\nAfter unplugging the I\/O-Board the update can be continued, but the I\/O Board somehow became fucked after this..\nI don't really have so much time to google and figure this out, so was wondering if any of you guys encountered it\/figured it out yet."
    },
    {
        "post_id":68021,
        "thread_id":60345,
        "title":"anyone figure out the problems with Big Sur and A1502s?",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-11-17 15:29:09",
        "message":"Reflash known good BIOS and check if image comes back."
    },
    {
        "post_id":68036,
        "thread_id":60345,
        "title":"anyone figure out the problems with Big Sur and A1502s?",
        "user_id":1057,
        "username":"piernov",
        "post_date":"2020-11-18 03:30:05",
        "message":"Several reports of RIO board being the problem (apart from the usual OS and EFI corruption).\n[MEDIA=reddit]MacOS\/comments\/jue7n5\/_\/gceqahn[\/MEDIA]\nAlso one comment on Apple's forum (at [URL]https:\/\/discussions.apple.com\/thread\/252033190[\/URL] ) that has since be deleted mentioned RIO board too and especially HDMI IC.\n[ATTACH type=\"full\"]59538[\/ATTACH]\nThere's also an SPI ROM for SD card reader on RIO board apparently that could be related to the problem.\nMaybe the update causes the failure, maybe the RIO board had already failed and the update only reveals it."
    },
    {
        "post_id":68040,
        "thread_id":60345,
        "title":"anyone figure out the problems with Big Sur and A1502s?",
        "user_id":1423,
        "username":"captainmac",
        "post_date":"2020-11-18 04:15:45",
        "message":"thanks a lot for the info!\nOK. So i guess it's best to just replace the RIO Board then.\nAlso, if a machine is already in my shop and it needs to be updated by me, do you happen to know (slim chance, i know) if it'll be fine if i run the update without the RIO connected, and reconnect it after succesful upgrade, or will it still be fucked then?"
    }
]