{"post_id":15623,"thread_id":15623,"title":"[SOLVED]820-3115 must press power button for ~2 seconds before power on","user_id":515,"username":"SMMRepair","post_date":"2017-02-27 11:32:25","message":"I've had this issue occur before, but could always resolve it. Seems to be tied to current-sensing, but this one is a bit different:\n\n1. Board powers on normally (quick-press of power button) with charger and charger\/battery connected. With battery-only, power button must be held 2-3 seconds to power on. Tested with 3 known-good test cases, so it's certainly a board issue and not a keyboard or battery issue.\n2. Board had liquid near SMC, but it didn't appear to quite reach the SMC. I heated the SMC with a bit of flux just in case any residue\/debris made its way under the chip.\n3. Current-sending near ISL6259 all looks fine, no liquid to that area, and all current-sensing checks out normally (17\/18 and 27\/28), resistance and continuity.\n\nI double-checked all the repairs I had to make near the edge of the board, but don't see anything that looks obvious. So far, all the normal causes in the past seem fine on this board. Any idea what else to check? I'm hoping the fact that it powers on normally with charger and with both charger\/battery, but not battery-alone, will be a good clue. Thanks in advance as always."}
{"post_id":15629,"thread_id":15623,"title":"[SOLVED]820-3115 must press power button for ~2 seconds before power on","user_id":558,"username":"arghhh","post_date":"2017-02-27 13:04:09","message":"Check SMC reset."}
{"post_id":15635,"thread_id":15623,"title":"[SOLVED]820-3115 must press power button for ~2 seconds before power on","user_id":2,"username":"dukefawks","post_date":"2017-02-27 15:28:36","message":"R5014 receiving 3V42 on pin 2?"}
{"post_id":15674,"thread_id":15623,"title":"[SOLVED]820-3115 must press power button for ~2 seconds before power on","user_id":515,"username":"SMMRepair","post_date":"2017-02-28 11:20:24","message":"Sorry for the delay in getting back to this; I ended up finding the issue was the SMC. After checking the things you guys mentioned (and everything looking OK), I decided to pull the SMC and replace it, as I was noticing some just weird behavior with SMC-related things (BIL button-press was inconsistent, charger light would pulse ever-so-slightly, my 3v42 was ~3.48v, etc), and that solved the problem. Board powers on normally with just a normal button-press now. Thanks, guys!"}
