{"post_id":4640,"thread_id":4640,"title":"trouble installing ASD on usb","user_id":90,"username":"ytesfay80","post_date":"2016-07-21 10:19:06","message":"I have the file for ASD 3S156 installed on a partitioned USB stick. With the EFI 3S156.dmg file I tried doing the restore method with disk utility as the pdf file says to do. I would get an error so I just followed what louis said in a previous post to put the EFI or OS .dmg file on a partition and boot into it with the option key on startup. On startup I held the option key but the only drive that came up was the Macbooks SSD.\n\nHere is a video of me trying to install it onto the usb [url]https:\/\/youtu.be\/RYdTpbfrUro[\/url]"}
{"post_id":4641,"thread_id":4640,"title":"trouble installing ASD on usb","user_id":145,"username":"Sykulski","post_date":"2016-07-21 10:32:45","message":"You're trying to restore the dmg file. You need to restore the mounted asd image itself. Try choosing the ASD 3S156 as source instead of the dmg-file."}
{"post_id":4642,"thread_id":4640,"title":"trouble installing ASD on usb","user_id":90,"username":"ytesfay80","post_date":"2016-07-21 13:17:35","message":"Okay. I tried 3 more combinations from a different 2011 MBA. The options for restoring are different than the 2013 MBA but anyways neither of them worked in restoring. \n\nHere are the errors I got from them [url]https:\/\/www.dropbox.com\/sh\/x7g5wu6f2sixbmc\/AABQKetxZfZBO6-Tr5IrIlEQa?dl=0[\/url]\n\nAlso, one of the errors said the disk image needs to be scanned but when I try to scan the image it doesn't work and the ASD EFI 3S156.dmg file says I have only 'read' privileges even though the other files say I have read and write privileges."}
{"post_id":4679,"thread_id":4640,"title":"trouble installing ASD on usb","user_id":90,"username":"ytesfay80","post_date":"2016-07-22 00:19:52","message":"I just read this somewhere and I am wondering if this has been the issue since I am using a 32GB Sandisk thumb drive\n\n[COLOR=#272A30][FONT=\"][SIZE=16px]\"Can you use a FireWire hard disk or USB flash 'thumb' drive instead of a USB hard disk to start up ASD 3S119 or later?[\/SIZE][\/FONT][\/COLOR] [COLOR=#272A30][FONT=\"][SIZE=16px]No. A USB hard disk is required; ASD 3S119 or later is not designed or supported for use with any other type of media.\"\n\nUpdate: I went and purchased a 1TB external hard drive and now when I follow the exact directions for restoring the .dmg file I get this error \"Could not unmount volume \/Volumes\/3S156 (Resource Busy)\".[\/SIZE][\/FONT][\/COLOR]"}
{"post_id":4680,"thread_id":4640,"title":"trouble installing ASD on usb","user_id":2,"username":"dukefawks","post_date":"2016-07-22 03:44:31","message":"There are plenty of videos on youtube that show how to restore a .dmg file to a HDD or USB."}
{"post_id":4681,"thread_id":4640,"title":"trouble installing ASD on usb","user_id":90,"username":"ytesfay80","post_date":"2016-07-22 04:03:16","message":"I watched videos and did google searches but for some reason they were not working for me. I finally found a way to get it to work though. I had to plug two usbs to get it restore properly. Thanks"}
