{"post_id":65851,"thread_id":60092,"title":"Macbook Pro 2019 Keyboard Backlight issue with screen replacement","user_id":2873,"username":"Alex97Lewis","post_date":"2020-09-30 10:02:49","message":"Hi all,\nFirst off I know it's a screen assembly issue as me and a colleague have been diagnosing this issue for the past two months.\n\nWe have worked on multiple 2019 pros no matter what board number it is, just the 2019 range. When we have replaced the screen assembly we've noticed the unit will boot up fine, and at the login screen the Keyboard Backlight is visible, but as soon as you log into the OS and the desktop loads, the keyboard backlight will disappear and never ever appear again until the machine shuts down, and then starts back up (Logging out and back in does not work, the backlight will stay off until shutdown).\n\nThis has been tested on numerous logic boards with over 10 different screen assemblies from different suppliers. As soon as you put the original screen assembly back on and log in, the keyboard backlight is fine.\n\nNew screen assemblies seem to stop the keyboard backlight from working after logging in - And when I press the backlight brightness up or down on the touchbar, absolutely nothing happens, not even the brightness level icon appears on the screen. No icon, no level, nothing.\n\n\nHas anyone else had this issue before, and is there any way of actually fixing this? Is it an Apple security feature for a more troublesome repair? Is it just the light sensor on every single screen assembly is faulty - Just putting this out there if anyone has had this similar issue before and if anyone actually knows ways to resolve this?\n\n\nSorry if this is in the wrong category, but I guess it is relating to macbook repairs...\n\nThank you!"}
{"post_id":65861,"thread_id":60092,"title":"Macbook Pro 2019 Keyboard Backlight issue with screen replacement","user_id":682,"username":"2informaticos","post_date":"2020-09-30 17:06:40","message":"If ALS doesn't work, keyboard backlight also stops to work.\nDirect flashlight on the ALS (webcam) and check if LCD backlight responds.\nIf not, ALS is not working.\nNo idea if ALS is paired somehow with T2.\n\nMaybe the chinese didn't put ALS on these replacement screens?\n\nWith replacement LCD connected, disconnect webcam and connect the webcam from an original LCD assembly; another than the one from that machine."}
{"post_id":65876,"thread_id":60092,"title":"Macbook Pro 2019 Keyboard Backlight issue with screen replacement","user_id":1423,"username":"captainmac","post_date":"2020-10-01 04:56:33","message":"I have had this issue with 2016\/2017\/2018 screens (13 and 15 inch) as well. A lot of the ones that are being sold, don't have an ALS sensor, or have one, but somehow it's not pairing with the logicboard (i read somewhere that there is some preprogrammed code in the sensor\/screen, if it's not programmed, or blank, than the sensor will not be recognized.)\n\nedit: i think that if you get the ones that are being sold as 'refurbished' (ie: the LCD is replaced inside an original part) most of the times, the ALS works.\nMy local vendor sells these listed as '92% or 95% new'"}
{"post_id":65905,"thread_id":60092,"title":"Macbook Pro 2019 Keyboard Backlight issue with screen replacement","user_id":1057,"username":"piernov","post_date":"2020-10-01 10:13:49","message":"I've heard that there are a lot of low quality assemblies for USB-C machines on the market, and it's particularly bad for the T2 machines. The ones being sold as new generally have random issues including ALS, camera, true tone, backlight, tint shift…, it's pretty much the same for refurbished ones since when they're sold as new they're often refurbished units anyway. Apparently the only reliable ones are used (non-refurbished) screens pulled from machines. But they're pretty rare and of course expensive.\nIt may be a better solution to get it replaced at Apple."}
