{"post_id":97534,"thread_id":63711,"title":"820-00165 keys and trackpad not working","user_id":22195,"username":"Neil250","post_date":"2023-03-14 21:31:49","message":"Machine was booting to the desktop originally, login in fine BUT would not charge battery AND WOULD not run on battery\nalone.\n\nKeyboard and trackpad working fine.\n\nI decided to change the ISL625 chip.\n\nGood news: the battery now appears to charge and machine continues to boot to the desktop.\n\nBad news, keyboard and trackpad now no longer work.\nMachine also now ONLY works on battery and charger blinking green on ac adapter. No fan spin.\n\nDisconnect AC adapter, connect battery--> fan spin and boot to desktop but NO trackpad or keyboard.\nConnect AC adapter and battery appears to be charging. Solid orange light on magsafe aletrnating with flashing green every 3 seconds.\n\nPPBUS G3H: 4.32V on AC ADAPTER\nPPBUS G3H: 6.91V on BATTERY\n\n\nSuspected DC IN leak:  D7012 appeared cracked and shorted.\n\nReplaced it. Remove battery, attach AC adapter.\nGreen light flashing continues. PPBUS_G3H bounces between 2.5V and 4.5 V.\nConnect battery.\nPPBUS_G3H bounces between 6.90V\n\nStrange thing is that I started this whole sequence with the machine not working on battery and booting on AC power.\nNow I have the opposite but the trackpad and mouse dont work in either case.\n\nMy question now:\n\n?Q7180? does it need to be replaced.\nI don't have a stable correct PPBus_G3H so the other option is start looking at U7100.\n\nI am assuming I have to back up and look at why I dont have PPBUS_G3H"}
{"post_id":97537,"thread_id":63711,"title":"820-00165 keys and trackpad not working","user_id":682,"username":"2informaticos","post_date":"2023-03-15 04:10:20","message":"Probably bad solders at U7100.\n\nAmber light on Magsafe 2 doesn't mean the battery is charging; you get it even without battery!\nMagsafe 2 switches to green light only when the battery is fully charged.\n\nTrackpad\/keyboard not working before loading macOS too?\nCheck if you can access boot menu.\nTry known good trackpad flex\/board.\n\nDo you get stable 3V42_G3H voltage?\nAlso check if DCIN_G3H fluctuates.\nDid you try with fake charger, or lab PSU?"}
{"post_id":97602,"thread_id":63711,"title":"820-00165 keys and trackpad not working","user_id":22195,"username":"Neil250","post_date":"2023-03-16 06:08:39","message":"cleaned pads and resoldered U7100\nMachine now boots and charges\ntrackpad works and keyboard works\n\nThanks!"}
