{"post_id":14705,"thread_id":14705,"title":"[820-3023] CPU keeps freezing\/locking up after a while","user_id":289,"username":"smiba","post_date":"2017-02-13 11:37:56","message":"Hey everyone,\n\nI got this motherboard in and I just can't seem to figure out whats wrong with it. I've been probing all around the CPU's supplies and the CPU itself and nothing seems to be very out of order.\nThe motherboard does have close to no signs of any water damage, the customer confirmed it has not been in contact with liquid. Other then it being a bit dusty it looks good.\nQuick ADT came back without issues\n\nBehaviour:\n\n- Macbook always starts with the chime (It does always POST)\n- Usually after letting it cool down it boots into the system and is usable for 5-30 minutes until it crashes\n- Once it crashes, directly rebooting it will most likely let it crash in just a few minutes (Possible issue due heat?)\n- It doesn't always kernel_panic, usually the cursor\/system just locks up showing no sign of life. I've also had it happen that the screen just went black while browsing and it started blasting the fan on full speed even though the CPU wasn't warm.\n\nWhere to even start looking with something like this? Any help is much appreciated :)"}
{"post_id":14706,"thread_id":14705,"title":"[820-3023] CPU keeps freezing\/locking up after a while","user_id":289,"username":"smiba","post_date":"2017-02-13 11:39:44","message":"No Title\n\nOh and here is a picture of the kernel panic by the way, although I doubt it shows anything of use. Its most likely just the last piece of code it ran before the cpu died again"}
{"post_id":14727,"thread_id":14705,"title":"[820-3023] CPU keeps freezing\/locking up after a while","user_id":2,"username":"dukefawks","post_date":"2017-02-13 15:41:37","message":"I can already tell you that this will be a waste of time. I assume you tried to boot from USB and same issue remains. If so this thing can be junked."}
{"post_id":14733,"thread_id":14705,"title":"[820-3023] CPU keeps freezing\/locking up after a while","user_id":289,"username":"smiba","post_date":"2017-02-13 16:04:00","message":"Yes the issue remains either way, even in AHT it can just freeze without warning\n\nI'll just run it through pure 2-propanol bath and see if maybe there was any hidden corrosion, otherwise I'll give up. Can't fix everything I guess"}
{"post_id":14936,"thread_id":14705,"title":"[820-3023] CPU keeps freezing\/locking up after a while","user_id":289,"username":"smiba","post_date":"2017-02-16 15:25:42","message":"After letting the board soak in a fresh bath of >99% isopropyl alcohol and letting it fully dry it doesn't post anymore, green light on the charger and fan spin but no chime.\n\nNot sure if I should be happy that I now have a issue thats most likely resolvable or sad because it died? Anyways will report back with results, lets see if I can figure out what happened"}
{"post_id":14939,"thread_id":14705,"title":"[820-3023] CPU keeps freezing\/locking up after a while","user_id":289,"username":"smiba","post_date":"2017-02-16 15:44:19","message":"U7400 looks like corroded crap! Probably missed it because its has almost the same colour as the dust had\n\nWill replace, CPU VCORE was there, CPU AXG was 0V\n\nEDIT: After getting a small esd safe brush near those pins the dirt\/corrosion was easily removed. It wasn't as bad as I initially thought.\nI checked and there is no short on CPU AXG so the CPU itself should be alive, the problem is most likely still the U7400.\n\nIs there a possibility the gates are messing up though? I think it would be too high or a short instead of 0V if it was though"}
{"post_id":14950,"thread_id":14705,"title":"[820-3023] CPU keeps freezing\/locking up after a while","user_id":2,"username":"dukefawks","post_date":"2017-02-16 17:21:23","message":"U7400 never dies, R7402 is more likely or a trace."}
{"post_id":14955,"thread_id":14705,"title":"[820-3023] CPU keeps freezing\/locking up after a while","user_id":289,"username":"smiba","post_date":"2017-02-16 18:00:03","message":"R7402 reading 90.4kohm which is within its 1% tolerance\n\nI'll check the traces tomorrow for continuity, thanks!"}
{"post_id":14975,"thread_id":14705,"title":"[820-3023] CPU keeps freezing\/locking up after a while","user_id":289,"username":"smiba","post_date":"2017-02-17 08:30:50","message":"Continuity from U7400 to Q7510 on CPUIMVP_UGATE1, CPUIMVP_PHASE1, CPUIMVP_LGATE1\n\nShould I just go ahead and replace U7400? Sounds like the most logical solution right now. Q7510 looks like mint so I have no reason to really suspect it"}
{"post_id":14982,"thread_id":14705,"title":"[820-3023] CPU keeps freezing\/locking up after a while","user_id":682,"username":"2informaticos","post_date":"2017-02-17 12:39:55","message":"I don't think U7400 is bad, as you get VCORE at least (\"U7400 never dies\").\nAXG voltage depends by BIOS, PCH and CPU itself.\nAlso just a corroded resistor somewhere can make you waste the time..."}
{"post_id":14989,"thread_id":14705,"title":"[820-3023] CPU keeps freezing\/locking up after a while","user_id":2,"username":"dukefawks","post_date":"2017-02-17 13:59:44","message":"More suspect are all \"power\" traces. pin 15,24,40,39. It worked before cleaning so there is a corroded trace or resistor."}
{"post_id":14997,"thread_id":14705,"title":"[820-3023] CPU keeps freezing\/locking up after a while","user_id":289,"username":"smiba","post_date":"2017-02-17 14:57:24","message":"I checked all the resistors for U7400 (Page 58 of the schematic) and none of them are out of spec.\n\nI also noticed that sometimes AXG is actually there when you plug the power in. It seems to be somewhat random if it will work though. None of the time it chimes\nI've seen the following values:\n\nCPU_PH1 - AXG_R\n1.15V - 0V\n0.77V - 0.42V\n0.75V - 0.81V\n\nI'm still suspecting the U7400 chip, or at least hope its not the CPU that died. Any other idea's based on these findings? Thanks a lot, I'm just wondering how a simply dipping in some isopropyl could kill and hope I can get it to recover.\n\nThe MAX15092GTL isn't pricey on aliexpress so its worth a try\n\nEDIT: Didn't see duke's reply, gimme a moment to check them"}
{"post_id":14998,"thread_id":14705,"title":"[820-3023] CPU keeps freezing\/locking up after a while","user_id":289,"username":"smiba","post_date":"2017-02-17 15:17:46","message":"PIN 15 OK (5.12V)\n\nPIN 24 OK (5.08V)\n\nPIN 39 OK (5.03V)\n\nPIN 40 OK (5.03V)\n\nI even swooped my iron over the pins with fresh new solder and they look all nice smooth now, same issue. (CPU_PH1 0.75V, AXG_R 0.81V)"}
{"post_id":15012,"thread_id":14705,"title":"[820-3023] CPU keeps freezing\/locking up after a while","user_id":682,"username":"2informaticos","post_date":"2017-02-18 04:57:48","message":"I saw several boards where AXG is not present, but get video.\nAs example 3115 and 3462, if I correctly remember.\nI don't know if is the case now...\nOn 3462 AXG appeared for 2-3 sec and went off just before chime and get video.\nHowever if you don't even get USB activity, don't waste time searching video on it.\nYour problem is caused by liquid, so could be a simple corroded resistor\/trace which make you crazy."}
{"post_id":15061,"thread_id":14705,"title":"[820-3023] CPU keeps freezing\/locking up after a while","user_id":289,"username":"smiba","post_date":"2017-02-18 16:44:33","message":"No Title\n\nJust guessing at the moment, I already verified if the clock signals are working and they are. I also know the SPI chip does have a little bit of I\/O, but too little for it to have actually fully loaded its data (I know it usually is at least 4 times as much)\n\nWhile I was at it I just probed PPVCORE_S0_CPU and it looked like the following.\n\nIs this an acceptable amount of noise on the CPU power rail? It looks a bit high to me and I don't think its interference from my oscilloscope, it disappears if I disconnect the power. What could be causing this to happen on both AXG and VCORE"}
{"post_id":15076,"thread_id":14705,"title":"[820-3023] CPU keeps freezing\/locking up after a while","user_id":2,"username":"dukefawks","post_date":"2017-02-18 20:00:32","message":"You are making this way more complicated. Is CPU Vcore present now? If there was corrosion on U7400 it may be somewhere else too. Inspect closer"}
{"post_id":15081,"thread_id":14705,"title":"[820-3023] CPU keeps freezing\/locking up after a while","user_id":289,"username":"smiba","post_date":"2017-02-18 20:10:21","message":"CPU VCore was always present, AXG usually is present now. I have yet to find a pattern in why it is sometimes 0V and sometimes ~0.8V\n\nI'm confident there was no other corrosion on the board other then a little on U7400 and a few test pads. I cleaned off the corrosion of parts that were affected by it and verified their values were as expected.\n\nAt this point I'd say you are right and U7400 is an unlikely suspect. What is the right suspect, I dont know? Probably a resistor somewhere or maybe the CPU just randomly decided to die\n\n​​​​​​I also double checked all the power lines and they all have their right voltages\n\nAny other ideas? I'm just feeling like I'm overlooking something"}
