[
    {
        "post_id":75085,
        "thread_id":61143,
        "title":"820-00840 - Stuck on Loading Screen - High Fan Spin",
        "user_id":1358,
        "username":"mccafe",
        "post_date":"2021-05-05 11:02:22",
        "message":"Hello guys,\n\nI have an 820-00840 that had corrosion on the battery connection (battery itself and not on the motherboard). There are also red indicators showing there had been moisture around the board, but corrosion is pretty much non-existent - looked everywhere. The MacBook turns on, but gets stuck on the Apple progress bar, almost reaching the end, but never booting to the macOS. There is a high fan spin also.\n\nWhat I did so far is replace the battery, because it was shot and not running off it.\n\nWhere do I even begin? Help, thanks!"
    },
    {
        "post_id":75087,
        "thread_id":61143,
        "title":"820-00840 - Stuck on Loading Screen - High Fan Spin",
        "user_id":1358,
        "username":"mccafe",
        "post_date":"2021-05-05 11:50:59",
        "message":"Tried booting into an installer (holding option key), with and without keyboard\/trackpad connected, with and without SSD connected, different combinations and it still goes to just the Apple progress bar. It did boot once to the login screen prior to the battery replacement and the customer did mention that it never actually turned on and that it was a surprise it did turn on in front of him when he brought the device to our store.\n\nPPBUS_G3H = 13v\nPPVCCCPU_S0G_PH1 \/PH2\/ PH3 = 0.6-0.8v\nPPVCCGT_S0G_PH1 \/PH2\/PH3 = 0v\nPPVCCSA_S0G = 0.8-0.9v"
    },
    {
        "post_id":75088,
        "thread_id":61143,
        "title":"820-00840 - Stuck on Loading Screen - High Fan Spin",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-05-05 12:54:14",
        "message":"Try first disconnecting webcam.\nNext step, try known good trackpad flex\/board.\nClean ME BIOS is other option."
    },
    {
        "post_id":75091,
        "thread_id":61143,
        "title":"820-00840 - Stuck on Loading Screen - High Fan Spin",
        "user_id":1358,
        "username":"mccafe",
        "post_date":"2021-05-05 13:08:32",
        "message":"New trackpad fixed the issue of high fan spin. After a while it actually booted into the login screen. Trackpad and keyboard worked perfectly for a bit. After testing, I was about to close it up and marked it as fixed until all of a sudden it turned off. Thought it was because I didn't login on time, but when I tried turning it on, stays black, no backlight. CPU VCore 0v. Tried disconnecting battery and charger and trying again to no avail. PPBUS still 13v and PPVCCSA_S0G = 0.8-9v."
    },
    {
        "post_id":75094,
        "thread_id":61143,
        "title":"820-00840 - Stuck on Loading Screen - High Fan Spin",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-05-05 15:07:24",
        "message":"Try disconnecting trackpad flex.\nIn fact, test the board alonbe; no cables connected (apart of charger, of course)."
    }
]