[
    {
        "post_id":16009,
        "thread_id":16009,
        "title":"820-3476 with black checkered RAM failure",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-03-06 12:24:03",
        "message":"I have a board that required a bit of repair to a few connectors; once I repaired it, I got ASD running and the board froze with the checkered black pattern common to RAM failure. I know it's difficult (impossible?) to determine which RAM chip is bad, and that really the only way to repair it is to replace all RAM chips together at once. Before I write this one off (not interested in performing that repair), is there any last-ditch effort I can make to identify which chip is bad? Is applying flux to each chip and heating it up even an option? Or is this one that will require replacing of all RAM chips?\n\nThanks as always!"
    },
    {
        "post_id":16012,
        "thread_id":16009,
        "title":"820-3476 with black checkered RAM failure",
        "user_id":36,
        "username":"aprendiz",
        "post_date":"2017-03-06 12:50:41",
        "message":"No way to know which one, but you could try replacing the closest to connectors..."
    },
    {
        "post_id":16014,
        "thread_id":16009,
        "title":"820-3476 with black checkered RAM failure",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2017-03-06 14:07:46",
        "message":"Beeping sometimes means cracked ball, but this is definitely failure, which you just have to guess. Sadly replacing all is best option."
    },
    {
        "post_id":16029,
        "thread_id":16009,
        "title":"820-3476 with black checkered RAM failure",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-03-06 14:52:44",
        "message":"Yeah, I figured. I don't have the equipment to replace the chips, so will probably send it off or use for parts. Out of curiosity, what size solder balls do these RAM chips use?"
    },
    {
        "post_id":16192,
        "thread_id":16009,
        "title":"820-3476 with black checkered RAM failure",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-03-08 17:47:30",
        "message":"RAM chips are .4 or .45mm. There is actually a program out there that can determine the faulty data line. It is part of Apple's \"phoenix\" package. I have not seen it leaked for the newer machines though."
    }
]