{"post_id":55836,"thread_id":55836,"title":"820-00138 Powers and boots, but no green light.","user_id":515,"username":"SMMRepair","post_date":"2020-01-16 14:12:24","message":"Got one that has me stumped; first one in a while of this type!\n\n1. 820-00138, no liquid, no damage from aftermarket charger or anything at all. Board powers on and boots, but has no green light.\n2. Confirmed SMC_BC_ACOK, SYS_ONEWIRE, 3v42, etc, are all present across board and near SMC.\n3. SMC_RESET_L is high, as system boots\/works.\n4. Board does power on with charger only, just has no green light.\n5. Inspected entirety of ISOL circuitry, replaced Q7010, Q7180, and D7010, as I've seen those cause funky issues like this, despite everything measuring fine. No change.\n6. Replaced ISL before finally replacing SMC, and no change.\n7. Replaced U7000\/7001 to be safe. No change.\n8. Removed JTAG, no change.\n9. Confirmed continuity from ISL --> SMC and confirmed diode readings with working board throughout SYS_ONEWIRE circuitry.\n10. Pull up for smc_bc_acok good near SMC (R5187).\n11. No bent\/cracked ports on PCB or anything causing weird shorts, and all continuity is confirmed between sys_onewire\/ISL\/SMC\/etc.\n\nNo clue from here; any help would be appreciated. Board isn't turning charger off because it powers...so not sure. It's probably a random resistor I haven't checked or something, but everything is pristine. All help appreciated!"}
{"post_id":55840,"thread_id":55836,"title":"820-00138 Powers and boots, but no green light.","user_id":682,"username":"2informaticos","post_date":"2020-01-16 18:52:02","message":"Did you try known good DCIN board?\nThere is a small resistor\/coil in serie with ADAPTER_SENSE signal.\nAnd one TVS diode which can burnt it..."}
{"post_id":55842,"thread_id":55836,"title":"820-00138 Powers and boots, but no green light.","user_id":515,"username":"SMMRepair","post_date":"2020-01-16 19:36:59","message":"Yeah, tried about a dozen. No luck. Thinking this one might be a PCB fault, but no cracks or damage visible. Might go ahead and call it quits on this one in the interest of time."}
{"post_id":55843,"thread_id":55836,"title":"820-00138 Powers and boots, but no green light.","user_id":682,"username":"2informaticos","post_date":"2020-01-16 19:47:00","message":"Do you have good continuity from U7000 to central pin of Magsafe?\nPossibly broken pin at J7000..."}
{"post_id":55870,"thread_id":55836,"title":"820-00138 Powers and boots, but no green light.","user_id":515,"username":"SMMRepair","post_date":"2020-01-17 09:24:45","message":"Yes :(\n\nThinking a PCB issue at this point. Literally everything else works except charging and green light. Board runs from charger, and will run from charged battery. All functions normal, but no green light and no charging (\"battery is not charging\"). All signals present and normal; ONEWIRE, SMC_BC_ACOK, 3v42, all present and steady with no shorts and full-continuity from charger --> U7000\/1 --> q7080\/ISOL --> ISL --> SMC."}
{"post_id":55871,"thread_id":55836,"title":"820-00138 Powers and boots, but no green light.","user_id":682,"username":"2informaticos","post_date":"2020-01-17 09:43:51","message":"For some reason, you don't have communication between SMC and charger.\nMake short between IN-OUT of U7000 and see if change something.\nBe sure to have correct Magsafe 2 charger.\n\nWhat you see on power options in system report?"}
{"post_id":55873,"thread_id":55836,"title":"820-00138 Powers and boots, but no green light.","user_id":515,"username":"SMMRepair","post_date":"2020-01-17 10:05:09","message":"Using genuine 85W magsafe2 charger, yeah; tried 3 different ones.\n\nI just bridged pins 4\/5 of U7000 and no change. :(\n\nI will check system report and report back soon; I might throw another SMC on there to be sure. I did pull from a parts board, so who knows. Would be wild if it had the exact same fault as the original, though, so doubtful. Will report back soon. Thanks, Vali."}
{"post_id":55881,"thread_id":55836,"title":"820-00138 Powers and boots, but no green light.","user_id":682,"username":"2informaticos","post_date":"2020-01-17 11:53:20","message":"Once SMC is removed, check continuity from its corresponding pad to U7000."}
