{"post_id":67671,"thread_id":60305,"title":"820-000165 Liquid damage","user_id":26416,"username":"estebanquito356","post_date":"2020-11-09 01:31:38","message":"Hello, \n\n\ni recently got a 2015 13'' MBA 820-000165 that had a liquid split on it\n\n\nIt's got clear signs of liquid, but not big signs of corrosion under the microscope.\n\nWhen plugged in the light turns green and amber.  Power consumption goes from 0.01A to 0.29A to 0.01A again, and repeats.\nFan sometimes does quarter fan spin, sometimes 5v is so briefly that it doesn't. \n\nAlready tried with a good know working IO board.\n\n\nHere are the voltages i measured:\n\n\nPPBUS_G3H: 8.6V steady\n\nPP3V42_G3H: 3.4V steady\n\nPP5V_S5: 5V steady\n\nPP5V_S4RS3: Goes from 0.09 to 5v to 0.09 in a circle\n\nPP5V_S0: Goes from 0.09 to 5v to 0.09 in a circle\n\nPP3V3_S5: 3.32V\n\nPP3V3_S4: 0.03 to 3.3 in a circle\n\nPP3V3_SUS: 3.32 steady\n\nPP3V3_S3: 0.00 to 3,3 in a circle\n\nPP3V3_S0: 0,00 to 3,3 in a circle\n\nPP1V8_S3: 0,00 to 2,28 in a circle very briefly \n\nPP1V2_S3: 0,00 to 1,2 in a circle\n\nPP1V05_SUS: 1,05 steady\n\nPP1V5_S0: 0,00 to 1,49 in a circle\n\nPP1V05_S0: 0,00 to 1,05 in a circle\n\n\n\nAny help in how to continue will be much appreciated\n\nThanks"}
{"post_id":67677,"thread_id":60305,"title":"820-000165 Liquid damage","user_id":682,"username":"2informaticos","post_date":"2020-11-09 03:02:56","message":"First of all, welcome to the forum!\n\nCheck for short all secondary power rails.\nStart with big coils, but do not forget pages 57758.\nIf no short, the power rail must pulse at least, as the other above mentioned.\n\nTest the board starting in SMC bypass.\nReball SMC, as basic step for liquid affected boards."}
{"post_id":67685,"thread_id":60305,"title":"820-000165 Liquid damage","user_id":26416,"username":"estebanquito356","post_date":"2020-11-09 03:59:38","message":"Thank you very much for the welcoming\n\nI quickly checked resistance in every big inductor, everything looks fine. Only the cpu lines where lower at around 18ohm but im sure that's very normal. \n\nI'm yet to check pages 57\/58.\n\nWhat i did do was a SMC bypass, and now the pulses are way longer, for example the fan was barely trying to spin, now it goes to full speed before it turns down.\n\nThanks very much for the help, i'm going to inspect pages 57\/58 (any advice in what to look first at?) and i'll let you know.\n\n\n\nCheers!"}
{"post_id":67686,"thread_id":60305,"title":"820-000165 Liquid damage","user_id":682,"username":"2informaticos","post_date":"2020-11-09 04:08:32","message":"If stays on longer time in SMC bypass mode, check all sensors from pages 41-43.\n\nI still recommend to reball SMC!"}
{"post_id":67831,"thread_id":60305,"title":"820-000165 Liquid damage","user_id":26416,"username":"estebanquito356","post_date":"2020-11-12 14:44:53","message":"Hello again,\n\nsince i'm not very familiar with page 41-43, and it's my first time working on them, anything i need to check up first? Is there anything that is most common to fail or do i need to check every component on every circuit?\nIt is my first time working with current\/temp sensors so any tips are well appreciated. Thanks!"}
{"post_id":67832,"thread_id":60305,"title":"820-000165 Liquid damage","user_id":682,"username":"2informaticos","post_date":"2020-11-12 14:55:33","message":"You must check output voltage for all sensor circuits.\nReball SMC and maybe no need for more tests..."}
{"post_id":67983,"thread_id":60305,"title":"820-000165 Liquid damage","user_id":26416,"username":"estebanquito356","post_date":"2020-11-16 19:27:44","message":"Hello again,\n\nI checked all of the sensor's voltges:\n\n\nC5455 pulses from 0,15 - 0,11V\nC5465  0v\nC5433  0,12v\nC5475  0v\nC5445  0v\nC5485  0v\nC5425  0v\nC5495  0v\n\n\n(this voltages dont make much sense to me)\n\n\nUnfortunalelly i dont have a stencil to do a SMC reballing, best i can do is a reflow. I did put some good flux on it, heat it up slowly until it floated, tapped it with the tweezers, made it dance around with the hot air, and let it cool down. No change was observe to the behaviour of the voltages' pulses.\n\n\nI've found a little bit of corrosion arround U6100 area. Not color spots or formations, but dark resistors.  r6115, r6128, r6126, r6125 have all one end too dark. I've measured them all and the traces and they seem to be good, don't know if trouble there can relate to the symptoms of the logic board.\n\nAgain any help is much appreciated. I understand this board can be on the hard one's to fix, so i may put it on the side for a bit. \nI will be posting others that might be way easier to fix soon.\n\nThanks in advance!"}
{"post_id":67998,"thread_id":60305,"title":"820-000165 Liquid damage","user_id":682,"username":"2informaticos","post_date":"2020-11-17 08:40:27","message":"You must check ALL SPI Bus Series Termination resistors (aprox 20) and traces; some of them are placed underneath PCH.\nAlso clean\/remove J6100 (some of mentioned resistors near it too).\nFinally, try known good BIOS."}
