{"post_id":61723,"thread_id":59591,"title":"820-00165A Liquid Damaged Doesn't start with i\/o board plugged in","user_id":1547,"username":"CRC2018","post_date":"2020-07-01 12:23:29","message":"Got a Macbook Air A1466 liquid damage job in today 820-00165A board. Have cleaned it up and fixed the following issues:\n1) C7136 completely exploded and burned PPDCIN_G3H_CHGR to ground inside the board - have done some digging around where C7136 was and cleared this short\n2) Backlight feedback to LP8550 was broken next to L7701\/D7701- have repaired this with a jumper wire. \n\nThe issue is board will start fine without the left i\/o board connected, it runs gives backlight etc. If the left i\/o board is connected I get the orange light and it wont start - tried with known good i\/o board, known good connecting cable and known good battery - it wont start at all. \n\nIf I were to connect the Left I\/O Board after the fan starts to spin after applying power from charger with battery connected I just get the display with the battery charging symbol then it powers back off and no reaction to power button - power button is working normally when left i\/o board isn't connected. \n\nPPBUS_G3H is giving 8.6V as I would expect when the orange light is lit. \n\nI know these boards wont normally start without the battery being plugged in so I'm thinking maybe this is an issue with the battery circuit."}
{"post_id":61736,"thread_id":59591,"title":"820-00165A Liquid Damaged Doesn't start with i\/o board plugged in","user_id":682,"username":"2informaticos","post_date":"2020-07-01 15:00:34","message":"\"I know these boards wont normally start without the battery being plugged in\"\nI never faced with such issue on these boards.\n\nCheck basic signal for power on sequence with LIO board connected.\nInspect J9500 pins for corrosion."}
{"post_id":61763,"thread_id":59591,"title":"820-00165A Liquid Damaged Doesn't start with i\/o board plugged in","user_id":1547,"username":"CRC2018","post_date":"2020-07-02 04:16:52","message":"Interesting you should say that - for the past couple years i've never found an 820-00165-A which will start without the battery when the left i\/o board is attached - they will start when the i\/o board is not connected usually just like this one!\nJ9500 is clean - there was 0 liquid damage on that part of the board, main areas of liquid damage were around the display connector and around where the trackpad plugs in - Q7130 area."}
{"post_id":61764,"thread_id":59591,"title":"820-00165A Liquid Damaged Doesn't start with i\/o board plugged in","user_id":682,"username":"2informaticos","post_date":"2020-07-02 05:11:41","message":"Are you using original Magsafe 2 charger???"}
{"post_id":61989,"thread_id":59591,"title":"820-00165A Liquid Damaged Doesn't start with i\/o board plugged in","user_id":1547,"username":"CRC2018","post_date":"2020-07-07 10:29:31","message":"Thats a good question - i'm not 100% sure it is original but it certainly looks it - it's an 85W one. \n\nFound out why it wasn't starting eventually - it was R5501 not connected on PPBUS_G3H side. Now i've got another issue that the board appears to start but after I shut it down and leave it for a bit it won't start up again and gives the \"I need charging\" symbol (on battery) or the \"charging\" symbol on the screen (on charger) - battery is at 100%. If I do an SMC reset it'll usually then start up and shows the battery at 100%. I've got a battery on order to test so i'll report back if that fixes it."}
