[
    {
        "post_id":48121,
        "thread_id":48121,
        "title":"820-3787 Not booting after changing FDMF6808N chips",
        "user_id":135,
        "username":"bjf",
        "post_date":"2019-04-03 14:54:19",
        "message":"Any idea why this might be happening with two of these that I worked on? They were both booting before, but with issues. After changing all 3 FDMF6808N chips they both get hung up on the boot progress bar. I've gone over it a bunch of times to make sure everything is soldered properly. I've tried different chips too. No change. Has anyway else experienced this?"
    },
    {
        "post_id":48124,
        "thread_id":48121,
        "title":"820-3787 Not booting after changing FDMF6808N chips",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-04-03 17:35:02",
        "message":"Sounds like CPU got messed up. Just curious have you had good success with this repair?"
    },
    {
        "post_id":48125,
        "thread_id":48121,
        "title":"820-3787 Not booting after changing FDMF6808N chips",
        "user_id":427,
        "username":"overshoot",
        "post_date":"2019-04-03 18:38:39",
        "message":"I was about to do one myself this morning but I am quite afraid now to do so.\nSince it is only not able to boot, what does ASD EFI points out?"
    },
    {
        "post_id":48126,
        "thread_id":48121,
        "title":"820-3787 Not booting after changing FDMF6808N chips",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-04-03 18:43:13",
        "message":"Did you solder new FDMF6708, or \"new\" FDMF6808 chips (don't really exist)?"
    },
    {
        "post_id":48129,
        "thread_id":48121,
        "title":"820-3787 Not booting after changing FDMF6808N chips",
        "user_id":135,
        "username":"bjf",
        "post_date":"2019-04-03 21:14:54",
        "message":"\"Sounds like CPU got messed up. Just curious have you had good success with this repair?\"\nI've never tried it before. I did it with the heat sink off. Maybe that was the wrong idea. Not sure.\n\nNo issues found in ASD.\n\nI used FDMF6808N chips pulled from 820-00163 and 820-00426 boards."
    },
    {
        "post_id":48130,
        "thread_id":48121,
        "title":"820-3787 Not booting after changing FDMF6808N chips",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-04-04 03:04:43",
        "message":"Do not reuse FDMF6808, as is the common failure on this CPU power supply design.\nYou should start changing only phase 1 chip at least; that one fails more."
    },
    {
        "post_id":48141,
        "thread_id":48121,
        "title":"820-3787 Not booting after changing FDMF6808N chips",
        "user_id":427,
        "username":"overshoot",
        "post_date":"2019-04-04 06:54:13",
        "message":"Then, shall we use FDMF6708 instead?"
    },
    {
        "post_id":48145,
        "thread_id":48121,
        "title":"820-3787 Not booting after changing FDMF6808N chips",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-04-04 07:29:22",
        "message":"Yeah as 2 informaticos said use NEW FDMF6708 not the 6808 used. I've done two so far one seemed to work. The other I learned that you MUST let the board cool\/ultrasonic it or it can kill the CPU easily from too much heat. I'd say remove heatsink from CPU when doing it"
    },
    {
        "post_id":48159,
        "thread_id":48121,
        "title":"820-3787 Not booting after changing FDMF6808N chips",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-04-04 11:39:35",
        "message":"Always remove CPU heatsink in similar case, even to reball\/replace SMC.\nIf not, the heatsink make you heat to much the board on the working area.\nFDMF6708 chips can be easy get from Mouser and are really new..."
    },
    {
        "post_id":48164,
        "thread_id":48121,
        "title":"820-3787 Not booting after changing FDMF6808N chips",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2019-04-04 12:57:12",
        "message":"Oh my goodness--yes, ALWAYS remove heatsink when working on any board, unless you're doing something super minor on edge of board, etc.\n\nI have repaired around 20 of these CPU vcore drop-out issue boards. Of the 20, ~10 were 3662, ~5 were 3787 and ~5 were 00138\/00163\/00426. I have noticed that the DG boards DO NOT LIKE this repair. The IG boards (00138\/3662) seem to \"take\" to the repair more often. I've had two 3662 boards come back (so, 8 successfully repaired) with similar issues. I have had 4 of the 3787 boards come back, 2 00138 boards and every single 00426\/00163 board came back. So, DG board repair success rate is ~10% and IG repair success rate is around 70-80%. Mind you, this is a pretty small sample size, but I would not even bother with the DG boards anymore. If you check temperatures on affected 3787 boards, for example, CPU often runs MUCH hotter than on affected 3662 boards (and unaffected 3787 boards). I think this is somehow related to DG\/IG differences, but again I have no clue, this is just speculation. All repairs performed with new 6708 chips, so can rule out 6808 \"new\"\/used issues. On all repairs I replaced all three CPU power supplies (ph1-3), so I can't speak to success of only replacing the phase 1 supply.\n\nI think the issue with the DG boards is often BOTH a damaged CPU (on some boards only!) and damaged power supplies. I think some boards have ONLY damaged 6808s (more frequently the 3662s), while some boards have BOTH damaged 6808s AND CPU. The DG boards seem to have damaged CPU and 6808s much more often. For some reason, I think the IG board CPUs aren't killed as often. No idea why.\n\nAs for the board hanging after 6808 replacement: You probably did not replace chips well. I would guess they aren't \"flat\" enough on the board. Do not ever try to re-use solder when replacing these. Remove old solder, apply new solder in proper amounts and replace chip(s). I had the same issue on one board, and it never \"recovered\" from the improper replacement. Must have damaged the CPU in some way; maybe even heated it too much, but I doubt that (I mask pretty well and angle my hot air appropriately, etc).\n\nThis repair is really finicky, and it's not as simple as just replacing 6808s with 6708s...if it were, I think we'd all know by now. Some boards DO get repaired, but others definitely do not (and likely have damaged CPUs). My personal opinion would be to run the no-crash app on all DG boards to skirt the issue, and perform hardware repair on IG boards and hope you get lucky."
    },
    {
        "post_id":48166,
        "thread_id":48121,
        "title":"820-3787 Not booting after changing FDMF6808N chips",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-04-04 13:50:00",
        "message":"Thanks for the detailed report :)"
    },
    {
        "post_id":48169,
        "thread_id":48121,
        "title":"820-3787 Not booting after changing FDMF6808N chips",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-04-04 15:44:06",
        "message":"This is very detailed thank you so much [USER=\"515\"]SMMRepair[\/USER] ! I think the one I fixed was a IG and the one that was fucked was DG, so that makes sense. Will definitely keep all of that in mind the next time one comes in."
    },
    {
        "post_id":48173,
        "thread_id":48121,
        "title":"820-3787 Not booting after changing FDMF6808N chips",
        "user_id":427,
        "username":"overshoot",
        "post_date":"2019-04-04 18:43:53",
        "message":"Thanks for the detailed explanation as well."
    },
    {
        "post_id":48181,
        "thread_id":48121,
        "title":"820-3787 Not booting after changing FDMF6808N chips",
        "user_id":135,
        "username":"bjf",
        "post_date":"2019-04-05 03:32:09",
        "message":"Thanks so much for the explanation. That probably saved everyone a lot of headaches."
    },
    {
        "post_id":48215,
        "thread_id":48121,
        "title":"820-3787 Not booting after changing FDMF6808N chips",
        "user_id":135,
        "username":"bjf",
        "post_date":"2019-04-06 14:00:08",
        "message":"Is there a go-to app to keep the DG models from crashing? I've heard of a few different options but was wondering if there is one that is known to work best."
    }
]