{"post_id":70303,"thread_id":60622,"title":"820-2610 C7771 330uf capacitor still reading 0.3 V after replacement","user_id":29350,"username":"plantguy123","post_date":"2021-01-15 14:14:06","message":"Hello. I have a 17\" 2009 Macbook Pro (logic board 820-2610 I believe). For the past few years it was having trouble starting up and then it would shut off quickly. Occasionally it would boot completely and then it would work fine for days. A few months ago it stopped starting up completely. I read on a forum about how this could be due to the infamous C7771 capacitor. I followed the heat test and put it on the radiator. The computer then booted up, so I then got a few of this capacitor: 330 uf 1362J - d\n\n[URL]https:\/\/www.mobilesentrix.ca\/capacitor-ic-for-macbook-pro-unibody-13-15-17-a1278-a1286-1297-c9560-330uf-2v-b2-sm[\/URL]\n\nInitially I installed the capacitor after moving the 2R2 L7770 coil to make room for it. When I was removing the original tantalum capacitor I tried moving it before it was hot enough and partially detached the + lead pad on the logic board. I tried smoothing over the *partial* break with solder. The replacement cap measured got a 0.3 volt reading with the multimeter, which obviously wasn't good. \n\nTrying again I wanted to make sure that the capacitor was properly attached to the partially damaged pad. I tried attaching another capacitor with wires and then I hooked the negative lead wire to a screw hole (just to try something new), but got the same 0.3 V reading. \n\nIf the new cap is measuring 0.3 V, then maybe that suggests that the original problem wasn't the capacitor, or that there are more problems? I didn't test the tantalum cap because I assumed that it had been the culprit based on the symptoms.\n\nI read on another post that the L7770 2R2 coil should be returning a 1 V reading. I got a 0.1 V reading from it - could I have broken the coil with excessive heat from the hot air rework station? Here are the photos of the repair:\n\n[MEDIA=imgur]a\/wNBtyxj[\/MEDIA] \n\nAnyone have any ideas as to what could've gone wrong? Thanks."}
{"post_id":70306,"thread_id":60622,"title":"820-2610 C7771 330uf capacitor still reading 0.3 V after replacement","user_id":682,"username":"2informaticos","post_date":"2021-01-15 14:44:34","message":"First of all, welcome to the forum!\n\nYou've probably destroyed something on the board.\nThat filter cap requires very short conections to its place.\nNeeds to have very low ESR value and Mouser has it in stock.\nNEVER use hot air again in that area!\nLift one pin first, or use JBC\/WELLER tweezer.\n\nBe very carefull if you replace it with bigger size cap."}
{"post_id":70311,"thread_id":60622,"title":"820-2610 C7771 330uf capacitor still reading 0.3 V after replacement","user_id":29350,"username":"plantguy123","post_date":"2021-01-15 15:06:58","message":"Thanks! Good to know about the need for short connections. Given that the 0.3 V reading was happening before I used the wires (with the cap right on the board), any ideas of where I should start testing to find the potential source of the problem?"}
{"post_id":70314,"thread_id":60622,"title":"820-2610 C7771 330uf capacitor still reading 0.3 V after replacement","user_id":682,"username":"2informaticos","post_date":"2021-01-15 15:32:53","message":"Board looks really ugly now.\nYou should check all traces and solder for surrounding components of U7750.\nPay atention to Ra\/Rb divider."}
{"post_id":70411,"thread_id":60622,"title":"820-2610 C7771 330uf capacitor still reading 0.3 V after replacement","user_id":29350,"username":"plantguy123","post_date":"2021-01-18 12:55:01","message":"Haha yeah not looking the best. \n\nBy saying I should check the traces and solder, do you mean with the multimeter or just visually to see if everything is intact? \n\nWhat's the Ra\/Rb divider? Tried looking it up but can't find anything on it. Thanks."}
{"post_id":70425,"thread_id":60622,"title":"820-2610 C7771 330uf capacitor still reading 0.3 V after replacement","user_id":682,"username":"2informaticos","post_date":"2021-01-18 19:09:19","message":"Look better at R7780\/81.\n\nCheck traces continuity with buzzer (diode mode)."}
{"post_id":70775,"thread_id":60622,"title":"820-2610 C7771 330uf capacitor still reading 0.3 V after replacement","user_id":29350,"username":"plantguy123","post_date":"2021-01-26 22:46:29","message":"Cleaned the flux off the board, and after some searching I still can't find what the Ra\/Rb divider is. Would you mind explaining?\n\nJust got some super fine multimeter probe adapters for the small chips and I'm in the process of checking the continuity of the traces in the region, will update when I'm done. So far so good.\n\nCould the 2R2 coil have sustained some damage from taking a lot of the heat from the heat gun? What voltage should the coil itself return so I can check it? Also what should the 2R2928F63 chip at L7510 return? I chipped the corner off when I brushed it with the tweezers (visible in pics) while it was still hot from the heat gun. Did I break it?\n\nThanks again!"}
{"post_id":70778,"thread_id":60622,"title":"820-2610 C7771 330uf capacitor still reading 0.3 V after replacement","user_id":682,"username":"2informaticos","post_date":"2021-01-27 04:18:04","message":"An image is better than 1000 words...\n[ATTACH]59653[\/ATTACH]\nIn case of doubt, you can change the coil and other components, if donor board is available."}
{"post_id":70899,"thread_id":60622,"title":"820-2610 C7771 330uf capacitor still reading 0.3 V after replacement","user_id":29350,"username":"plantguy123","post_date":"2021-01-29 13:19:08","message":"Thanks, makes sense.\n\nMaybe I'll get a board for components, but in the meantime what values (voltage, resistance, etc) should I be getting from the 2R2 coil and the component at L7510?"}
{"post_id":70904,"thread_id":60622,"title":"820-2610 C7771 330uf capacitor still reading 0.3 V after replacement","user_id":682,"username":"2informaticos","post_date":"2021-01-29 14:09:07","message":"As per scematic..."}
{"post_id":70912,"thread_id":60622,"title":"820-2610 C7771 330uf capacitor still reading 0.3 V after replacement","user_id":29350,"username":"plantguy123","post_date":"2021-01-29 14:51:44","message":"So if this is the schematic info on L7510, how would I get the values I should expect from the multimeter? Haha sorry I'm a total beginner. Thank you so much! \n[ATTACH type=\"full\"]59660[\/ATTACH]"}
{"post_id":70913,"thread_id":60622,"title":"820-2610 C7771 330uf capacitor still reading 0.3 V after replacement","user_id":682,"username":"2informaticos","post_date":"2021-01-29 15:32:44","message":"2.2uH is the iductance of the coil.\nYou can check if get 0 ohm between its pins.\nHowever this will not ensure the coil is good."}
{"post_id":70914,"thread_id":60622,"title":"820-2610 C7771 330uf capacitor still reading 0.3 V after replacement","user_id":29350,"username":"plantguy123","post_date":"2021-01-29 15:35:11","message":"Thanks. Is there no way to be sure besides swapping a new one in?"}
