{"post_id":30436,"thread_id":30436,"title":"[SOLVED]820-3115 Fin Stack Sensor Error fixed?","user_id":1153,"username":"JohnB8812","post_date":"2018-01-15 21:17:28","message":"Ok so this 2012 definitely had liquid the board was very clean when I got it but the underside of the lid was HORRENDOUS lmfao. Anyways, the sensor that failed was the fin stack sensor, so I replaced U5511 and checked the caps and resistors on the circuit for shorts or damage and they all check out. I ran ASD again and was STILL getting crazy high fan speed, so I replaced R5260 and R5261 because they were reading 1\/4 of their values. Still had high fan speed, so I removed the edge bonding from the SMC and reflowed it. Now the fan speed is completely gone BUT the board still fails the Fin Stack sensor test. The machine boots normally and runs off a battery, and even on a slow old, spindle drive it runs pretty well. I'm going to test it with a known good drive tomorrow just to make sure it is running full speed like it should, but my question is should I keep looking at the sensor failure even if the machine is running properly?"}
{"post_id":30437,"thread_id":30436,"title":"[SOLVED]820-3115 Fin Stack Sensor Error fixed?","user_id":2,"username":"dukefawks","post_date":"2018-01-15 22:41:23","message":"Look at the actual reported temperature in the ASD hardware profile."}
{"post_id":30445,"thread_id":30436,"title":"[SOLVED]820-3115 Fin Stack Sensor Error fixed?","user_id":1153,"username":"JohnB8812","post_date":"2018-01-16 09:03:45","message":"Sensor says -124 degrees BUT with a known good drive, it runs perfectly fine and boots normally haven't seen it crash once nor have any issues. Should I just leave this alone?"}
{"post_id":30449,"thread_id":30436,"title":"[SOLVED]820-3115 Fin Stack Sensor Error fixed?","user_id":2,"username":"dukefawks","post_date":"2018-01-16 09:47:59","message":"It means the sensing transistor Q5520 is not connected or shorted to U5511. Check traces, Q5520 and C5511"}
{"post_id":30451,"thread_id":30436,"title":"[SOLVED]820-3115 Fin Stack Sensor Error fixed?","user_id":1153,"username":"JohnB8812","post_date":"2018-01-16 10:44:03","message":"Q5520 bad. Boom solved. Thanks Duke!"}
