{"post_id":41836,"thread_id":41836,"title":"820-3437- Green light, no fan spin but sometimes boots. VERY temperamental","user_id":511,"username":"kevinklinkmuller","post_date":"2018-11-07 06:27:31","message":"I have a really odd one. 820-3437 came in with no sign of life except green light. Pulls around 0.018A  from DCPS. Sometimes it turns on but most times it's dead. \n\nUsed a thermal cam and it was able to detect that the ISL is 1 degree warmer than the rest of the board consistently but that probably doesn't mean much.\n\nBoard looks pristine but I do suspect it's been through an ultrasonic before because of the discolouration of the test points and the board has definitely been removed before"}
{"post_id":41837,"thread_id":41836,"title":"820-3437- Green light, no fan spin but sometimes boots. VERY temperamental","user_id":511,"username":"kevinklinkmuller","post_date":"2018-11-07 06:34:56","message":"have just been told that they have used a fake charger and this happened. \n\nI tested something myself, I used a original charger and it 100% doesnt work. when I use my DCPS with a macbook cable, it works 20% of the time but only in a certain direction it seems. Yes have tested new DC in board"}
{"post_id":41838,"thread_id":41836,"title":"820-3437- Green light, no fan spin but sometimes boots. VERY temperamental","user_id":511,"username":"kevinklinkmuller","post_date":"2018-11-07 06:44:49","message":"when it does turn on it's perfect. everything works as it should"}
{"post_id":41839,"thread_id":41836,"title":"820-3437- Green light, no fan spin but sometimes boots. VERY temperamental","user_id":511,"username":"kevinklinkmuller","post_date":"2018-11-07 06:54:04","message":"wait now it works with original charger too. hmmm"}
{"post_id":41840,"thread_id":41836,"title":"820-3437- Green light, no fan spin but sometimes boots. VERY temperamental","user_id":511,"username":"kevinklinkmuller","post_date":"2018-11-07 07:04:36","message":"once I get the issue sorted once it works indefinitely even after shutting down. I have scraped the contact points around ISL earlier. Before I did that the machine showed no sign of life. now it's booting properly once I get it going. I have noticed that regardless of a real and fake charger, if I plug it in, the first time it will never work. but if i do it a second time it always works. It's only an issue when the battery has been disconnected before. Is this just a quirk with this particular machine? Like i said it was dead before I started messing around ISL. \n\nI would just like to know what exactly happened"}
{"post_id":41842,"thread_id":41836,"title":"820-3437- Green light, no fan spin but sometimes boots. VERY temperamental","user_id":682,"username":"2informaticos","post_date":"2018-11-07 07:24:48","message":"First, check resistance between pins 17\/18 and 27\/28.\nThe issue looks like leakage and original detects it and stop to power the board.\nCheck around Q7010, R\/D7012...\nPost exact values of R7180\/81 and R7185\/86, measured onboard.\nPossibly Q7180 need to be changed."}
