[
    {
        "post_id":53433,
        "thread_id":53433,
        "title":"820-00165  (PM_SLP_S4_L)  Looking into the crystal ball!",
        "user_id":5210,
        "username":"KC Micro Tronix",
        "post_date":"2019-10-15 10:00:30",
        "message":"Today I fixed a board that had corrosion under U1900 which operates the 25Mhz crystal. I was like wow. Look on the scope. The crystal comes and goes.\nPulled U1900 repealed and replaced and Bam! I got fan spin. so.... I dive into the toybox! I knew there were tons of PM_SLP_S4_L boards in there!\n\nToy Box first one I grab! 820-00165 missing (PM_SLP_S4_L) does the exact same thing! SYSCLK_CLK25M is erratic. Pops in for a split second. Just long enough for my Tek 784 to trigger lock and and let me see. Then it is gone. Each time it does this I see the current bounce a few mA. Like it was just about to wake up. I changed U1900 and Y1905 (careful not to overtemp) and no change.\n\nU1900 pin 1 (PPVRTC_G3H) 3.3v\nU1900 pin 13 (PP3V42_G3H) 3.42v\nU1900 pin 5 (PP3V3_S5RS3RS0_SYSCLKGEN) 3.3v\nU1900 pin 2,3 (SYSCLK_CLK25M_X2 and X1) intermittent 25Mhz signal\n\nI am thinking that because all these parts come from donors I could easily be throwing bad parts on the board but I have tried twice now. Stop me before I rape a working board! These crystal circuits are not magic. There is not much to them. GIve U1900 power and PP3V3_S5RS3RS0_SYSCLKGEN and Y1905 should sing like a canary. Hopefully I am wrong here and am missing something.\n\nMy Toy Box is boards I could not quickly resolve.   eBay has been a great way to learn!"
    },
    {
        "post_id":53443,
        "thread_id":53433,
        "title":"820-00165  (PM_SLP_S4_L)  Looking into the crystal ball!",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-10-15 14:00:09",
        "message":"25MHz at U1900 is in S0 state..."
    },
    {
        "post_id":53452,
        "thread_id":53433,
        "title":"820-00165  (PM_SLP_S4_L)  Looking into the crystal ball!",
        "user_id":5210,
        "username":"KC Micro Tronix",
        "post_date":"2019-10-15 15:35:09",
        "message":"25 mhz output from the crystal is intermittent bursts and not stable."
    },
    {
        "post_id":53453,
        "thread_id":53433,
        "title":"820-00165  (PM_SLP_S4_L)  Looking into the crystal ball!",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-10-15 15:52:56",
        "message":"Because your board tries to start and do not stays in S0.\nYour problem is not there."
    }
]