[
    {
        "post_id":67343,
        "thread_id":60261,
        "title":"820-00923 rebooting during boot",
        "user_id":803,
        "username":"SoloHarty",
        "post_date":"2020-10-31 09:04:20",
        "message":"I have got an 820-00923 with some heavy liquid damage around one of the thunderbolt sockets. It has been cleaned and components replaced to the point where it will turn on and pass AHT with no issues. but as soon as I type the customers password to login, the loading bar starts and then the whole Mac reboots. This also happens when trying to boot from recovery, internet recovery and external USB. My thinking is whenever it tries to access the SSD it runs into a problem but it's all coming back great on AHT.\n\nHas anyone had this problem before and can offer some guidance?\n\nThanks"
    },
    {
        "post_id":67353,
        "thread_id":60261,
        "title":"820-00923 rebooting during boot",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-10-31 15:04:14",
        "message":"Did you try to boot in safe mode?\nAlso try USB boot, eventually disconnecting J9600."
    },
    {
        "post_id":67363,
        "thread_id":60261,
        "title":"820-00923 rebooting during boot",
        "user_id":803,
        "username":"SoloHarty",
        "post_date":"2020-11-01 05:29:35",
        "message":"I have already tried external USB. It gets loaded to a point then just reboots. J9600 looks very clean and I would remove it entirely if I thought that was the only way. Kinda nice having the lifeboat connector there JUST incase there is no other option. Not too sure if it would work due to the faults anyway."
    },
    {
        "post_id":67366,
        "thread_id":60261,
        "title":"820-00923 rebooting during boot",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-11-01 06:51:43",
        "message":"I mean remove the metal plate, not connector itself; disconnect it, in other words."
    }
]