[
    {
        "post_id":36310,
        "thread_id":36310,
        "title":"[SOLVED]Macbook Air 820-3437 - Not powering from battery and not charging battery",
        "user_id":1563,
        "username":"Polymer15",
        "post_date":"2018-06-28 05:34:31",
        "message":"Have a Macbook Air 820-3437 here with battery charging and battery power issues. The battery will not charge and the computer will not run off battery. If loaded into the OS, it says \"your battery needs to be replaced\". I replaced the battery, now it just says no battery is installed (but it still gives the battery percentage at 52%!). I don't think it is the battery in this case. The charger shows green then orange.\n\nSMBUS_SMC_5_G3_SCL : Shows activity (also checked for connection to J6950, is fine)\nSMBUS_SMC_5_G3_SDA : Shows activity (also checked for connection to J6950, is fine)\nPPVBAT_G3H_CONN : Initially shows around 3V - 4V, but then drops to 0V after around 20 seconds\nSYS_DETECT_L: 0.33V\n\n\nNot sure what else to try. Other than the battery, when plugged into AC it works fine.\n\nMy only thought is with the U5000 or U7100, but visually - they seem fine."
    },
    {
        "post_id":36322,
        "thread_id":36310,
        "title":"[SOLVED]Macbook Air 820-3437 - Not powering from battery and not charging battery",
        "user_id":1309,
        "username":"Inwerp",
        "post_date":"2018-06-28 10:35:13",
        "message":"Check \/ replace R7151, R7152, r17150, r7115, q7155, also c7116 for short. The simplest way is to replace charger chip and everything between U7100 and battery."
    },
    {
        "post_id":36333,
        "thread_id":36310,
        "title":"[SOLVED]Macbook Air 820-3437 - Not powering from battery and not charging battery",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-06-28 14:23:05",
        "message":"Check \/ replace R7151, R7152, r17150, r7115, q7155, also c7116 for short. The simplest way is to replace charger chip and everything between [URL=\"https:\/\/store.rossmanngroup.com\/isl6259ahrtz.html\"]U7100[\/URL] and battery. \n\nIgnore that please!\n\nFirst question would be PPBUS voltage without battery connected. Second question would be to connect the old battery again and check what OSX says about the status\/cycle count\/etc.\n\nMy suspicion is you have 2 bad batteries. These machines need A1496 battery model!"
    },
    {
        "post_id":36368,
        "thread_id":36310,
        "title":"[SOLVED]Macbook Air 820-3437 - Not powering from battery and not charging battery",
        "user_id":1563,
        "username":"Polymer15",
        "post_date":"2018-06-29 02:28:21",
        "message":"Certainly was the battery, had two duds! Thanks duke, and Inwerp wouldn't be too hasty with the hot air station! :D"
    }
]