[
    {
        "post_id":7200,
        "thread_id":7200,
        "title":"[SOLVED]Late 2008 MacBook Aluminum Liquid damage, now working, power button not working",
        "user_id":61,
        "username":"wrbailey",
        "post_date":"2016-09-23 07:00:54",
        "message":"[PLAIN][SOLVED]Late 2008 MacBook Aluminum Liquid damage, now working, power button not working[\/PLAIN]\n\nHi everyone!\n\nI have a Late 2008 Aluminum MacBook (I got for free)\n\nWas not turning on (green light and amber when battery hooked up)\n\nNoticed capacitor C7272 was almost completely obliterated and it goes to ground and PPBUS_G3H. Had to replace and also run a small jumper, as the pad was completely gone. I also replaced C7273 below it for good measure, as it was looking a little corroded and not so happy as well. Plugged in, used power pad jumpers and fan came on. I hooked machine back up and plugged the battery and charger in and tried to turn on with power button, but did not want to turn on with pressing power button.\n\nUsed jumper pads instead and machine turns on, chimes (long dong, haha) and all seems to work well. ALL keys work while in OS, as tested. BUT Power button does nothing. Figured it liquid damage, so I tried like 5 other keyboards, no power buttons \"worked\".\n\nIs the power button pin 5 on the keyboard connector? The connector had a little bit of \"Green\" corrosion on a couple pins, like 10 or 11, but nothing seen around the pins 1-8 area.\nThis makes me believe it isn't a \"keyboard\" issue, and there is something that is causing the SMC not to see the WS_KBDONOFF_L (it may have a different name, however I am at work and did not bring my schematic files with me.)\n\nAnyone have an idea where I would start? I tried looking at the SMCONOFF_L signal and that measures 3.42V. Am I correct when saying the _L (I know Rossmann has a video about _L signals) denotes when that signal goes LOW, that is when it actually \"does\" something?\n\nAny help or ideas would be great :)\n\nThanks!\n\nOh, the board is 820-2327-A and I did try the SMC reset, but didn't help of course (it does mention it can affect power button not working)\n\nLooking around the forum, I saw good questions from some mods for power button issues...\n\nWhen the machine is off, power button doesn't work. Also when the machine is on, the power button wont turn machine off.\nAs mentioned, shorting jumper pads turns machine on."
    },
    {
        "post_id":7206,
        "thread_id":7200,
        "title":"[SOLVED]Late 2008 MacBook Aluminum Liquid damage, now working, power button not working",
        "user_id":61,
        "username":"wrbailey",
        "post_date":"2016-09-23 11:09:52",
        "message":"I am following the other post that is currently going on with power button issues, but if anyone thinks this could be different (it is, as Nate8organic at least powers down his Air), let me know...\n\nI figure I'll check the SMCLID measurement on mine as well, when Lid is open and also measure the SMC_ONOFF_L with power button pressed and not pressed and post those results on here when I get home in a few hours."
    },
    {
        "post_id":7244,
        "thread_id":7200,
        "title":"[SOLVED]Late 2008 MacBook Aluminum Liquid damage, now working, power button not working",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2016-09-24 12:34:33",
        "message":"SMC_ONOFF_L will be 3.42v, and when you press the button go down.  SMC_ONOFF_L should go low when you press the button. Does it go low when you press the button? If it doesn't, either bad keyboard, bad R5710, or bad connector. \n\nThe a1278 2008 is annoying to try and plug a keyboard into and align properly compared to 2009-2012, so make sure the kb is sitting in the connector nicely."
    },
    {
        "post_id":7252,
        "thread_id":7200,
        "title":"[SOLVED]Late 2008 MacBook Aluminum Liquid damage, now working, power button not working",
        "user_id":61,
        "username":"wrbailey",
        "post_date":"2016-09-24 13:26:24",
        "message":"I checked the drop in SMC_ONOFF_L and it \"drops\" from 3.417 to 3.415 (which I wouldn't actually consider a \"drop\".) Pressing the power button does consistently cause the change (0.002V drop) when pressed, so I am guessing not a bad keyboard. There was some corrosion around resister R5710 and C5710, however R5710 measures at 0.988k, which is within spec. Could C5710 be causing an issue, as the test pad next to it was fried and is basically missing now... however I get 3.42V wherever SMC_ONOFF_L should be. There was some corrosion on the keyboard connector... So I guess I'll replace C5710 for shits and giggles and then see if it helps and then on to connector, unless you can think of anything else it could be...\n\nI have tried to make sure the keyboard connector is in all the way and seems to be aligned, as I've tried 5 different keyboards, I'd hope I'd be able to align at least one of them properly...\n\nThanks again!"
    },
    {
        "post_id":7255,
        "thread_id":7200,
        "title":"[SOLVED]Late 2008 MacBook Aluminum Liquid damage, now working, power button not working",
        "user_id":61,
        "username":"wrbailey",
        "post_date":"2016-09-24 14:10:34",
        "message":"Actually it was the test point... When I had cleaned the resistor and capacitor, I had added enough solder where it came into contact with the barely-there test pad. So it was still measuring 3.417V, when I just replaced the resistor and capacitor and tried to make my solder job \"OEM\"-like, no solder was touching the test pad, and there was 0V at the resistor and capacitor. I had to run a tiny jumper from in-between C5710\/R5710 to \"R5015\" pad which could provide the SMC_ONOFF_L to those points. \n\nPlugged and keyboard in and BAM! turned the machine on... SOOOO glad I looked again at that area! Did not want to replace a keyboard connector for no reason!\n\nThanks again Louis!!! \n\nThis was my FIRST ever jumper and after watching, I think LITERALLY all of your videos, I felt completely comfortable doing so!\n\nYou can close this one as SOLVED! \n\nThanks again to the admins for taking the time to answer our, sometimes dumb, questions!!"
    }
]