[
    {
        "post_id":42099,
        "thread_id":42099,
        "title":"Ultrasonic and keyboard\/trackpads",
        "user_id":1466,
        "username":"jpadie",
        "post_date":"2018-11-13 08:11:46",
        "message":"I've just finished repairing an A1465 after a liquid spill, but the keyboard is resisting attempts of cleaning with alcohol.\n\nhas anyone tried cleaning them in an ultrasonic bath?  \n\nditto with a trackpad - does an ultrasonic negatively effect the surface?  \n\nthanks in advance.\nJustin"
    },
    {
        "post_id":42102,
        "thread_id":42099,
        "title":"Ultrasonic and keyboard\/trackpads",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-11-13 08:55:37",
        "message":"I don't think ultrasounds will affect trackpad.\nHowever, take care if your cleaner doesn't have sweep function.\nRegulary change the position of the board you clean and never let it more than 10min total in the claeaner..."
    },
    {
        "post_id":42108,
        "thread_id":42099,
        "title":"Ultrasonic and keyboard\/trackpads",
        "user_id":1309,
        "username":"Inwerp",
        "post_date":"2018-11-13 12:45:47",
        "message":"what about 10 minutes? I mean, i did 30 min on some PC Notebook boards (believe me, German beer is almost impossible to remove with alcohol\/glass cleaner\/acetone\/Amtech flux). Is there something special about macbook boards?\n\nas for keyboard, i had 2 successful cleaning with alcohol bath, it was also around 30 mins distilled water with regular movent and rotation, then again isopropyl bath and 30 min 80°c hot air. did it only because i was not really in the mood to drill 100 nuts just to fix 2 keys. I guess this method works only if you have a random key(s) failure. if it is the line in matrix, you're almost certainly wasting your time. \n\nAlso, Vertyanov IC programmer is extremely handy for keyboard diagnostics."
    },
    {
        "post_id":42110,
        "thread_id":42099,
        "title":"Ultrasonic and keyboard\/trackpads",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-11-13 13:05:38",
        "message":"Be aware of hot spots created if you don't have sweep function!\nSome people don't use that function, even the machine has the option...\nYou can make more damage on the board."
    }
]