[
    {
        "post_id":92528,
        "thread_id":63083,
        "title":"820-02020  board view schematic error.  \"I am troubleshooting no backlight\"",
        "user_id":5210,
        "username":"KC Micro Tronix",
        "post_date":"2022-09-12 07:45:50",
        "message":"RP884 & RP845 shows up as 0 ohms on the schematic but is actually 10 ohms.   I double checked this against a known good LB.\nDriver is not pulling down 12v enable signal and turning on the buck.   Not sure why I have replaced it.   This was a liquid damaged board so who knows here.\n\nI will update this once I figure it out."
    },
    {
        "post_id":92530,
        "thread_id":63083,
        "title":"820-02020  board view schematic error.  \"I am troubleshooting no backlight\"",
        "user_id":5210,
        "username":"KC Micro Tronix",
        "post_date":"2022-09-12 08:47:50",
        "message":"Well I am totally stumped on this one.  \n\nUP800 gets the 1v8 enable.   Does not enable QP800   12v remains high.  In my experience this will stay enabled even if there is a failure with the FET and the buck is shut down.  I have replaced UP800 twice just to make sure.  \"all sources are donors\".\nFET driver QP801 has been replaced.\nUP800 has been replaced.\nall resistors checked and double checked.\nall voltages are present 5v to UP800\n\nI just have no idea why It is not enabling QP800\n\nI know that QP800 is a sensitive part.  I have seen them damaged multiple times by just a little surge caused by liquid.  Maybe all my donors are bad.   I am going to sit this one aside until I have a working test board to pull parts from."
    },
    {
        "post_id":92541,
        "thread_id":63083,
        "title":"820-02020  board view schematic error.  \"I am troubleshooting no backlight\"",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-09-12 10:08:23",
        "message":"QP800 can be verified outside, like any other P-channel MOSFET, if in doubt with it.\n\nUP800 requires correct communication with LCD assemly, to enable and adjust the backlight.\nDid you test with known good panel?\nImage is present for sure?"
    }
]