{"post_id":32376,"thread_id":32376,"title":"[SOLVED]MBAir 820-00165 -- no post","user_id":1408,"username":"jdwhatnot","post_date":"2018-03-08 17:24:31","message":"A machine came in, said the screen is dark. Confirmed no backlight, 7V on the BKLT supply after the diode. Checked U7701 and there was slight off-white corrosion along the side of the IC. Brushed it away and fluxed the chip hoping for quick fix. It did not solve the issue. So I put it aside until I could get back to it. About a week later when I had more time I went to check it out again, but it's now decided to not post at all. I went ahead and just replaced U7701 anyway.\n\nWe have orange light, fans don't stop spinning. Usually I just give up when I see this but I need to figure this problem out because it's not the first time I've seen it, plus it was actually booting to OSX when it came in. So....\n\nWe are in S0, all power rails present, chipset has proper signals. One weird thing is that sometimes if I measure PM_RSMRST_L on R8133 it will appear to try post; fan will die, and it sometimes brings the fan back up for the next post cycle, but usually 3v3_SUS dies and doesn't come back up. So I replaced R8133, same symptom, replaced U8130, same symptom. There was no other corrosion seen, and the board has been ultrasonicked.\n\nAny ideas? Unfortunately chipset replacement is out of the question and my hot air station doesn't throw out enough heat to desolder an SMC, but that's where I'm leaning. Also, on a whim with another board I swapped out the ROM with another of the same model and it did not fix the issue, so there's also that."}
{"post_id":32377,"thread_id":32376,"title":"[SOLVED]MBAir 820-00165 -- no post","user_id":637,"username":"TCRScircuit","post_date":"2018-03-08 20:39:07","message":"This could be many things... Could be a random corroded resistor somewhere, could be spi resistors or traces, could be SMC, could even be the CPU but let's not go there yet --\n\nPlease measure the following -- \n\n PM_PCH_PWROK  -\n\nPPVCC_S0_CPU Both voltage and Resistance to gnd\n\nPLT_RESET_L\n\nWhat exactly do you mean by it \"trys to post\" ?"}
{"post_id":32392,"thread_id":32376,"title":"[SOLVED]MBAir 820-00165 -- no post","user_id":1408,"username":"jdwhatnot","post_date":"2018-03-09 14:00:11","message":"[QUOTE=\"TCRScircuit, post: 32377\"]This could be many things... Could be a random corroded resistor somewhere, could be spi resistors or traces, could be SMC, could even be the CPU but let's not go there yet --\n\nPlease measure the following --\n\nPM_PCH_PWROK -\n\nPPVCC_S0_CPU Both voltage and Resistance to gnd\n\nPLT_RESET_L\n\nWhat exactly do you mean by it \"trys to post\" ?\n\n\n\n[\/QUOTE]\n\nHigh\n1.8V on both rails\nHigh\n\n\"Trying to post\" being S0 state, power rails present, fan is spinning; the intended result being three complete posts and then a nice Mac chime.\n\n\nSo, for an update... it looks like I've leaned something new. So on all other boards I can recall having worked on over the past few years, Air boards have been unique in that when power is applied the board will do three complete posts and then chime and become operational. This board spins up the fans once, waits about 5 seconds, and then chimes. Never seen this behavior before, but I've not worked on a lot of 00165's with hardware issues yet.\n\nBut the new U7701 works and backlight is operational. So yay for science!?\n\nEDIT: I need to mark as solved, how can I do this?"}
{"post_id":32399,"thread_id":32376,"title":"[SOLVED]MBAir 820-00165 -- no post","user_id":2,"username":"dukefawks","post_date":"2018-03-09 15:10:08","message":"Only 3437\/3435 will do 3 times on\/off. 00165 will just power on. 2915\/2914 will do 1 time on\/off."}
{"post_id":32400,"thread_id":32376,"title":"[SOLVED]MBAir 820-00165 -- no post","user_id":1408,"username":"jdwhatnot","post_date":"2018-03-09 15:25:02","message":"[QUOTE=\"dukefawks, post: 32399\"]Only 3437\/3435 will do 3 times on\/off. 00165 will just power on. 2915\/2914 will do 1 time on\/off. [\/QUOTE]\n\nThank you for that clarification!"}
