{"post_id":76563,"thread_id":61313,"title":"820-00850 error messages when trying to install OS","user_id":28284,"username":"dudipupan","post_date":"2021-06-12 08:02:29","message":"Hi there ?\nI got a problem with an A1989 (2018) throwing various errors when trying to install any macOS than High Sierra. When I try to install it with app store I get an error message \"application is damaged\". If I try it with my install flash stick I get the error message like on the picture (Flash stick is good. Been using it for many installations this week). High Sierra seems to work fine (except missing keyboard backligh) - I also can install updates for High sierra here. I got the MBP connected to the internet via thunderbolt so connection should be stable.\nNo history known about this board. Might be possible that someone swapped the LCD earlier.\n\nWhat I already tried: \n\n- unplugged anything except screen (using external keyboard an mouse)\n- install it out of safe mode\n- restore with DFU\n- SMC and PRAM reset\n- download big sur as dmg\n\nnow I'm running out of ideas ?\nThank you and greetings"}
{"post_id":76564,"thread_id":61313,"title":"820-00850 error messages when trying to install OS","user_id":682,"username":"2informaticos","post_date":"2021-06-12 08:14:56","message":"Missing keyboard backlight is sign of ALS problem; probably new chinese screen, without ALS.\n\nOnce High Sierra installed, did you try to upgrade to newer macOS?\n\nFor pendrive installation, turn off WiFi and test with the Date trick in Terminal."}
{"post_id":76585,"thread_id":61313,"title":"820-00850 error messages when trying to install OS","user_id":28284,"username":"dudipupan","post_date":"2021-06-12 16:40:28","message":"Yes I think so too concerning the backlight. But that's another thing ??\n\nI tried but it fails too. For example I try to upgrade to Catalina I get the error on the picture below. \n\nI tried the date trick but without any success ??"}
{"post_id":76588,"thread_id":61313,"title":"820-00850 error messages when trying to install OS","user_id":28284,"username":"dudipupan","post_date":"2021-06-12 19:19:25","message":"If I try uhrade to Big Sur from High Sierra I get an error \"An error occurred preparing the software update\". Have to reinstall High Sierra after every failed try because High Sierra is not bootable anymore after the failed upgrade. May it be a Memory Problem?"}
{"post_id":76596,"thread_id":61313,"title":"820-00850 error messages when trying to install OS","user_id":682,"username":"2informaticos","post_date":"2021-06-13 04:42:32","message":"Disconnect internal LCD and try to recover original macOS from Apple Configurator.\nUse external monitor, or try known good LCD assembly."}
{"post_id":76597,"thread_id":61313,"title":"820-00850 error messages when trying to install OS","user_id":28284,"username":"dudipupan","post_date":"2021-06-13 07:59:29","message":"I just tried that with but still getting These errors ? But Backlight is working now ?"}
{"post_id":76598,"thread_id":61313,"title":"820-00850 error messages when trying to install OS","user_id":28284,"username":"dudipupan","post_date":"2021-06-13 08:00:00","message":"*keyboard backlight"}
