{"post_id":79623,"thread_id":61657,"title":"820-01326","user_id":1984,"username":"macRepairAmb","post_date":"2021-09-01 09:50:37","message":"Have this board that's not powering up. I'm using the 820-01041 schematic also as it appears to be the same as this board, 820-01326. Anyway, i get PP20V and current pull when battery is connected, indicating battery charge and no current with battery removed. I'm still a bit rusty with these newer macbook's and the power sequence. Only thing i've found so far is \nPP3V3_S5 at 0v \nPP3V3_AWAKE - 3.3v.\n\nShouldn't PP3v3_S5 be at 3.3 as well since AWAKE is up? Any suggestions on what to check."}
{"post_id":79630,"thread_id":61657,"title":"820-01326","user_id":682,"username":"2informaticos","post_date":"2021-09-01 10:16:06","message":"As always when deal with T2 machine, should start with DFU mode.\n\nIf all SLPS2R and AWAKE voltages are present, the board should be detected in Apple Configurator 2.\nYou should check these voltages only if is not detected; save time this way.\n\nPower on diagrams available for 01055 and 01598 boards; should be sufficient for other T2 boards diagnostic.\nIf don't find them on the forum, search logi.wiki webpage."}
{"post_id":79669,"thread_id":61657,"title":"820-01326","user_id":1984,"username":"macRepairAmb","post_date":"2021-09-01 16:26:27","message":"All SLPS2R and AWAKE voltages are present. I did try DFU mode revive and kept getting errors. When i first plugged in to my system, configurator 2 show that the MacBook pro was in recovery mode. [ATTACH type=\"full\"]60139[\/ATTACH]"}
{"post_id":79670,"thread_id":61657,"title":"820-01326","user_id":1984,"username":"macRepairAmb","post_date":"2021-09-01 16:28:09","message":"looking a little close, found corrosion at U9000 and surround components, along with U9080 and surrounding components. Somehow i missed these. Let me clean these up and hopefully this is what's causing my issue."}
{"post_id":79676,"thread_id":61657,"title":"820-01326","user_id":682,"username":"2informaticos","post_date":"2021-09-01 17:00:35","message":"SSD must be in working state; T2 has its dedicated partition there!"}
{"post_id":79866,"thread_id":61657,"title":"820-01326","user_id":1984,"username":"macRepairAmb","post_date":"2021-09-06 13:38:10","message":"After cleaning up the corrosion, i'm still not able to get past T2 error. Getting a different T2 error now (see picture). Checked the voltages from the chips affected by the corrosion, U9000 and U9080\n\nPP2V5_NAND_SSD0 - 2.5\nPP0V9_SSD0 - 0.98\nPP1V8_SSD0 - 1.8\n[ATTACH type=\"full\"]60147[\/ATTACH]"}
{"post_id":79867,"thread_id":61657,"title":"820-01326","user_id":682,"username":"2informaticos","post_date":"2021-09-06 15:55:22","message":"More damage caused by corrosion probably..."}
{"post_id":79874,"thread_id":61657,"title":"820-01326","user_id":1547,"username":"CRC2018","post_date":"2021-09-06 20:04:05","message":"Ultrasonic the board then try again - theres probably crap underneath one or more chips."}
