{"post_id":14848,"thread_id":14848,"title":"[SOLVED]820-2936-B Late 2011 13\" Intermittent Memory Beeps (x3)","user_id":61,"username":"wrbailey","post_date":"2017-02-15 10:36:19","message":"I have a Late 2011 13\" MacBook Pro.\n\nNo liquid damage seen. No obvious physical damage, alluding to dropping.\n\nMost of the time it boots just fine, runs OS just fine. I've tried different ram and swapping ram slots.\n\nRan ASD and everything passes until it gets to memory test. Almost all of them pass as well. But Fails on \"ERROR Data mismatch\"\n\nThis happens during two tests and doesn't matter what ram or slots I have filled or empty.\n\nIs this most likely a RAM slot issue... but like I said, doesn't matter which ram slot is empty or used...??\n\nOr could this be a board (non ram slot issue)? AKA something that can be fixed, or should this go to the scrap\/crap\/donor board pile?\n\nThanks!!\n\n--- I guess I didn't state the issue.\n\nSo rarely when booting I'll get three beeps. Most of the time, when I doing something that most likely requires heavy RAM usage, it'll cause 3 beeps and freeze.\n\nLike I was trying to install XCode. Downloaded just fine, but upon installing it, got 3 beeps. then upon reboot, 3 beeps while booting (Apple logo and progress bar.)\n\nRemoving ram and re-inserting seems to help, but also resetting PRAM seems to help (until you do something that requires memory intensive use.\n\nHopefully this makes sense?"}
{"post_id":14851,"thread_id":14848,"title":"[SOLVED]820-2936-B Late 2011 13\" Intermittent Memory Beeps (x3)","user_id":36,"username":"aprendiz","post_date":"2017-02-15 10:43:01","message":"I say to the pile!! Broken traces between CPU and memory slots........"}
{"post_id":14854,"thread_id":14848,"title":"[SOLVED]820-2936-B Late 2011 13\" Intermittent Memory Beeps (x3)","user_id":61,"username":"wrbailey","post_date":"2017-02-15 10:51:48","message":"Hmmm. Okay, boo. Wish I could fix, but I know ram\/cpu issues are pretty stupid on these older boards. Have a board with USB issues I can fix and throw in here I guess. Thanks!"}
