{"post_id":9160,"thread_id":9160,"title":"A1304 Air beeping on startup, various kinds of beeping","user_id":546,"username":"Stella","post_date":"2016-11-04 06:39:22","message":"Hi!\n\nMy Macbook Air started the dreaded Faulty RAM-beeps yesterday. First it beeped in groups of three, then on 2nd attempt to start it it did single beeps with about 4 sec between them. I have opened it, removed some dust, and I'm ready to put the motherboard inside the oven... but I wanna check w you guys first if there is a better, more long-lasting way to fix it? (I don't have any specialist tools)"}
{"post_id":9166,"thread_id":9160,"title":"A1304 Air beeping on startup, various kinds of beeping","user_id":2,"username":"dukefawks","post_date":"2016-11-04 06:58:32","message":"Without replacing the MCP79U this is trash. You can heat it up and it may work, but it's an A1304 they are garbage."}
{"post_id":9191,"thread_id":9160,"title":"A1304 Air beeping on startup, various kinds of beeping","user_id":546,"username":"Stella","post_date":"2016-11-04 12:23:51","message":"Would replacing the MCP79U be an option, and what would be the best to replace it with?"}
{"post_id":9196,"thread_id":9160,"title":"A1304 Air beeping on startup, various kinds of beeping","user_id":515,"username":"SMMRepair","post_date":"2016-11-04 13:41:23","message":"Without sounding too harsh, what duke is saying is that the model you have (A1304) is, well, terrible. It was the first Air model and was riddled with various issues (battery issues, hinge issues, MCP issues, RAM issues, etc). It's like buying a first-year model of a brand new model of car. It's not worth repairing (replacing the MCP would cost you 1\/3rd the cost of a new Air, and even then, the repair would be shaky at best). It's not worth repairing.\n\nI'd recommend saving your SSD for data retrieval, then selling the unit for parts. Then put that money towards a new(er) MacBook Air. The A1304 is quite literally garbage."}
{"post_id":9214,"thread_id":9160,"title":"A1304 Air beeping on startup, various kinds of beeping","user_id":546,"username":"Stella","post_date":"2016-11-04 18:00:10","message":"I thought A1237 was the first Air model? Anyway, I'm gonna go w the oven method here and see if I can get some life back into it to get the files, if that doesn't work take out the SSD, and then retire it. For the record, this very A1304 has worked faultlessly for eight years, not one single problem w it until a couple of weeks ago when it got harder to wake up from Sleep mode, and then yesterday w the RAM problem. I guess I was lucky getting this particular one.\n\nThanks for the advice!"}
{"post_id":9242,"thread_id":9160,"title":"A1304 Air beeping on startup, various kinds of beeping","user_id":1,"username":"larossmann","post_date":"2016-11-05 22:43:23","message":"A1237\/A1304 were the first airs and are probably the all time worst Apple laptops of the last decade. There are no MCP79u new, Duke probably bought the last in existence three years ago :p and used them by now."}
{"post_id":9245,"thread_id":9160,"title":"A1304 Air beeping on startup, various kinds of beeping","user_id":2,"username":"dukefawks","post_date":"2016-11-05 23:23:43","message":"Oh no, the sad part is I still have a few!"}
