[
    {
        "post_id":78163,
        "thread_id":61490,
        "title":"MacBook A2141 (820-01700) Stuck on 5V & DFU",
        "user_id":1692,
        "username":"mdc2018",
        "post_date":"2021-07-28 20:00:24",
        "message":"Hi Guys. I have an A2142 (820-01700) board here for data recovery.\nIt's pulling 5V and auto detects in DFU mode.\n\nThe board was previously in at another shop, there was flux around the T2 Chip, ISL9240 and PMIC.\nI changed ISL9240 - it appears prior shop attempted reflow on these components... not change or reball them. I am worried they damaged T2.\n\nAll CD3217 appear to measure good and sequence leading to 20V looks good.\nI understand on this model that T2 chip required to get 20V.\n\nAttempting \"Revive\" in Apple Configurator 2 returns error 4014.\n\nI am looking into the possibility of swapping NAND to another board. Someone told me that could work for data recovery, looking for confirmation (Board 820-01700)\n\nOr in terms of repair on this board, if anyone has any advice on what else I can check.\n\nTIA!!"
    },
    {
        "post_id":78171,
        "thread_id":61490,
        "title":"MacBook A2141 (820-01700) Stuck on 5V & DFU",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-07-29 01:48:11",
        "message":"T2 doesn't require 20V input.\nIt should work before that; it decides to switch from 5V to 20V.\nIn fact, these boards can fully work with just 5V input.\n\nIs very important the SSD to be in good working state, as T2 has its firmware partition there.\nSo check if all SSD voltages are there.\n\nIf someone else messed up with the board before, this may be hopeless project..."
    },
    {
        "post_id":78269,
        "thread_id":61490,
        "title":"MacBook A2141 (820-01700) Stuck on 5V & DFU",
        "user_id":1692,
        "username":"mdc2018",
        "post_date":"2021-07-30 20:15:57",
        "message":"I am missing SSD Voltages (PP2V5_NAND, PP1V8_SDD0, PP0V9_SDD0)\n\nI see in schematics that these lines are created by U9580 and U9500.\n\nI have VIN on both these IC but noticed I am missing SSD0_VR_P2V5_EN. (Same goes for SSD1 \/ U9080 & U9000)\n\nI am wanting to learn more about how the SSD circuit works in these models and the power sequences - so that I can diagnose this issue.\n\nThanks so much for the help!"
    },
    {
        "post_id":78276,
        "thread_id":61490,
        "title":"MacBook A2141 (820-01700) Stuck on 5V & DFU",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-07-31 02:59:12",
        "message":"Check diode mode to ground at all SSD power rails.\nPower on sequence available for many boards, including T2 machines:\n[URL unfurl=\"true\"]https:\/\/logi.wiki\/index.php\/Main_Page#All_pages[\/URL]"
    }
]