{"post_id":15100,"thread_id":15100,"title":"[SOLVED][820-4924] Very slow - Diagnostic test errors (PPN001, PFM006, NDC001, NDL001)","user_id":289,"username":"smiba","post_date":"2017-02-19 10:06:22","message":"[PLAIN][SOLVED][820-4924] Very slow - Diagnostic test errors (PPN001, PFM006, NDC001, NDL001)[\/PLAIN]\n\nCustomer came in with a macbook bought just a few months ago that got a coffee spill\n\nI opened up the device and there was a bit off a corroded mess around the bottom left side of the motherboard and some next to the fan and secondary board. I cleaned both the corrosion of the motherboard and secondary board and probed the ugliest parts which all came back fine. (Within spec and no short)\n\nThe macbook boots, but is very slow. Running Apple Diagnostic test gives me the following errors:\n\nPPN001\nPFM006\nNDC001 (Camera issue, even though it fully works in OS X)\nNDL001 (Bluetooth issue, might be true, haven't been able to check but WiFi works)\n\nI downloaded istat and checked the sensors, but none of them are very off. The only thing I noticed is that CPU_Vcore has spikes up to 1.7V and CPU System Agent Core sometimes just reports back 0\n\nWhere is the CPU System Agent Core sensor trace or sensor located? Is it acceptable for the Vcore to spike up to voltages between 1-1.7V?\n\nThanks"}
{"post_id":15118,"thread_id":15100,"title":"[SOLVED][820-4924] Very slow - Diagnostic test errors (PPN001, PFM006, NDC001, NDL001)","user_id":1,"username":"larossmann","post_date":"2017-02-19 14:11:19","message":"Bottom left with what orientation? Bottom left means nothing without context! U5870 is most common sensor issue on these since it is on the corner, besides trackpad."}
{"post_id":15125,"thread_id":15100,"title":"[SOLVED][820-4924] Very slow - Diagnostic test errors (PPN001, PFM006, NDC001, NDL001)","user_id":2,"username":"dukefawks","post_date":"2017-02-19 14:22:16","message":"Camera issue is actually the ALS. U5870 and ALS are on the same bus, 1+1=2."}
{"post_id":15131,"thread_id":15100,"title":"[SOLVED][820-4924] Very slow - Diagnostic test errors (PPN001, PFM006, NDC001, NDL001)","user_id":289,"username":"smiba","post_date":"2017-02-19 17:16:00","message":"I can't believe this was the fix!!\n\nJust some left over corrosion I underestimated on the camera connector! I still don't know what happened to it as it was not shorted, but putting some new solder on it and cleaning up until it looked like new got rid of the errors!\n\nThanks a lot!"}
