{"post_id":64464,"thread_id":59934,"title":"820-00165 no camera detected","user_id":21617,"username":"Chuck60","post_date":"2020-08-31 20:33:30","message":"Hi I know I posted this earlier last month but now I have two with the same issue :\/\nCamera not recognized. I just finished testing 2 -820-3437 and the FaceTime works fine :\/ I tried PRAM and installed a new OS X on my test drive \nBoth 820-00165 where water damaged but no where near Anything todo with camera \none was near smc the other had near PP3v3_SUS I’m not sure what’s the issue also the test chassis is a 2013 air shell if they helps"}
{"post_id":64475,"thread_id":59934,"title":"820-00165 no camera detected","user_id":682,"username":"2informaticos","post_date":"2020-09-01 03:30:34","message":"Sometimes BIOS corruption is possible on water damaged boards.\nYou should try known good BIOS, clean ME to discard this.\nCorrupted ME region is known to cause this symptom.\n\nAlso read Piernov post at the end of this thread.\n[URL unfurl=\"true\"]https:\/\/boards.rossmanngroup.com\/threads\/820-3476-820-3437-stuck-on-progress-bar-with-applecamin.54959\/[\/URL]"}
{"post_id":64494,"thread_id":59934,"title":"820-00165 no camera detected","user_id":21617,"username":"Chuck60","post_date":"2020-09-01 16:57:03","message":"ok I will :) thanks\n\nafter reading post he mentioned that replacing R2042 Repaired the camera. I will check R2042 or equivalent on 820-00165"}
{"post_id":64644,"thread_id":59934,"title":"820-00165 no camera detected","user_id":21617,"username":"Chuck60","post_date":"2020-09-04 10:42:56","message":"Ok I tried replacing the above component it was in fact reading the same 8ohms I replaced it with a 0ohm 201 resistor and it’s the same issue no camera detected.  I will order a new bios chip and switch out the old one with new. I still have to try smc reset but I’m my short experience never does anything. I’m currently check the voltages and CAM_SENSOR_WAKE_L_CONN R4031, R4030 and L4009, L4007 to see if there’s any physical damage or liquid. I’m assuming the camera must be connected for these lines to be active I’ve also ordered a camera cable just for ease of use"}
{"post_id":64653,"thread_id":59934,"title":"820-00165 no camera detected","user_id":682,"username":"2informaticos","post_date":"2020-09-04 15:29:21","message":"Be aware of new BIOS chip.\nVery likely they just write dump read form other board.\nNo clean ME region in such case; and will not serve you!!!\n\nOnce battery is removed (also charger), SMC reset is automatically done when power is applied again.\nNo need to bother with that..."}
{"post_id":64656,"thread_id":59934,"title":"820-00165 no camera detected","user_id":21617,"username":"Chuck60","post_date":"2020-09-04 15:49:36","message":"Yes I plan to do a clean Me on the new chip I just wanted to have the old Chip in case I had a issue to swap back :) thank you for your help"}
{"post_id":64659,"thread_id":59934,"title":"820-00165 no camera detected","user_id":682,"username":"2informaticos","post_date":"2020-09-04 16:56:20","message":"Make backup and verify if read good.\nThen you can erase original chip and write it many times..."}
{"post_id":64682,"thread_id":59934,"title":"820-00165 no camera detected","user_id":515,"username":"SMMRepair","post_date":"2020-09-05 10:14:49","message":"This issue is almost ALWAYS U3900, if no damage to board (and no tampering with BIOS). We repair at least one of these per week, and replacing U3900 resolves issue about 90% of the time. Another thing you really need to check on these is the pins on iSight connector itself--both inside connector and external. I've had a dozen or so of these 00165 boards that actually had loose pins at the board; they just didn't have enough solder and broke free at some point. Lastly, I've seen several that had a pin very slightly lodged\/stuck inside connector so it wasn't making good contact. If BIOS has been fucked with, then disregard all of this and start there!"}
{"post_id":64685,"thread_id":59934,"title":"820-00165 no camera detected","user_id":21617,"username":"Chuck60","post_date":"2020-09-05 11:17:57","message":"Ok I’ll check all that out tonight thank you \n For your help."}
{"post_id":66017,"thread_id":59934,"title":"820-00165 no camera detected","user_id":21617,"username":"Chuck60","post_date":"2020-10-03 13:57:35","message":"Ok I just received the replacement u3900 and u1900 May I ask do I need to have the camera plug for these voltages to be present ? \nI want to go over The power supplies and enables startBig at pin 6 of u1900 and run through all of them before I replace either chip on these boards"}
{"post_id":67308,"thread_id":59934,"title":"820-00165 no camera detected","user_id":21617,"username":"Chuck60","post_date":"2020-10-30 14:22:57","message":"I’ve come back to this board once again I replaced BCM U3900 chip cleaned me region and nothing :( I resoldered the camera connector. Is it possible that I can send the file for bios and maybe you can clean the me :\/ I’ve tried but maybe I’m not doing it right. I’ll go over the pier rails again. It’s hard to diagnose:( I’ve tried many ways lastly I’m gonna try to use a external keyboard and mouse with DisplayPort out and a camera connected open the app and see if I’m getting all my signals. Last I checked all inputs where there. So I don’t know what’s going on here. It initially had some water damage on c4030,c4031 replaced both caps with new and U2030 is no stuff"}
{"post_id":67313,"thread_id":59934,"title":"820-00165 no camera detected","user_id":682,"username":"2informaticos","post_date":"2020-10-30 17:33:19","message":"That chip is easy te destroy if overheat its Si die.\nIf camera connector is properly soldered, check if ALS sensor works at least.\nIf not, be sure 5V voltage arrives to connector."}
{"post_id":67314,"thread_id":59934,"title":"820-00165 no camera detected","user_id":21617,"username":"Chuck60","post_date":"2020-10-30 17:36:16","message":"Ok I’ll check it. I used around 380 to solder it and it’s the same symptoms as before :\/ all inputs and no change on output"}
{"post_id":67317,"thread_id":59934,"title":"820-00165 no camera detected","user_id":21617,"username":"Chuck60","post_date":"2020-10-30 17:42:18","message":"Ok yes als works I cover camera and key board lights intensify. I tried also re installing OS X and even erase ssd several time. Just in case it was a software issue :( I’m basically stuck."}
{"post_id":67324,"thread_id":59934,"title":"820-00165 no camera detected","user_id":682,"username":"2informaticos","post_date":"2020-10-30 18:01:02","message":"We should have several BIOS files with clean ME posted on the forum.\nBe sure to have good connections for camera lines and try another camera too."}
{"post_id":67325,"thread_id":59934,"title":"820-00165 no camera detected","user_id":21617,"username":"Chuck60","post_date":"2020-10-30 18:21:14","message":"Thank you very much I have two different cameras and both don’t work. I’ll search for it :) wish me luck cause I need it"}
{"post_id":67329,"thread_id":59934,"title":"820-00165 no camera detected","user_id":1057,"username":"piernov","post_date":"2020-10-31 05:02:09","message":"Linux camera driver is more verbose than macOS and shows you some initialization steps in the kernel log. It may or may not help narrowing down the problem."}
{"post_id":67335,"thread_id":59934,"title":"820-00165 no camera detected","user_id":515,"username":"SMMRepair","post_date":"2020-10-31 07:57:38","message":"Check inside the camera connector to make sure no pins are pushed \"up\" and not making proper contact with the cable; have had a few instances of this. Also, did you buy U3900 reballed, or did you reball it? Where did you buy it? What diode readings do you get at the big coils near the chip?"}
