[
    {
        "post_id":67103,
        "thread_id":60233,
        "title":"820-4924 (3.1\/16gb!) Green\/Orange light, no power.  Damaged U7200",
        "user_id":27543,
        "username":"down1nit",
        "post_date":"2020-10-25 21:25:07",
        "message":"Possibly unimportant: Came in working.  Was shutting down on login.  I thought it was OS, so wiped and reinstalled. Reinstalled fine, made user, and it shuts down when about to show desktop.  Worked fine in Safe Boot.  Weird.  Ended up buying mac from customer so she could get a new one and get back to work, and I can get a working LCD for another customer.\n\nANYWAY.  Finally got around to inspecting board, found water damage at R7222 -> R7225 (nostuff) replaced them all, checked continuity, found more damage, missing pad\/trace from U7200 pin 22 to U7320, ran bodge after pulling chip and reworking. Was some damage under pin 22 but haven't replaced U7200 yet since EN is missing. Should I?\n\nNow the thing doesn't power on and I hate everything :)  No good signals at U1950 but I do have 5VS5\/3.42V\/12.6V.\n\nNo PM_SLP_S4_L because it's 2020"
    },
    {
        "post_id":67108,
        "thread_id":60233,
        "title":"820-4924 (3.1\/16gb!) Green\/Orange light, no power.  Damaged U7200",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-10-26 02:05:23",
        "message":"Be sure all traces, solders and components around U7200 are good.\nI hope you didn't solder R7225!\n\nYou must get ALL_SYS_PWRGD before CPU_VR_EN.\nActually your board seems that doesn't start at all.\nI recommend to reball SMC, probably corrosion underneath affecting solder balls.\nDo you get 3V3_S5\/SUS at least?\nTry to start in SMC bypass mode, just in case."
    },
    {
        "post_id":67241,
        "thread_id":60233,
        "title":"820-4924 (3.1\/16gb!) Green\/Orange light, no power.  Damaged U7200",
        "user_id":27543,
        "username":"down1nit",
        "post_date":"2020-10-29 00:09:48",
        "message":"Oh no! I totally soldered R7225!  Even scraped the trace and put it sideways, since the factory pad was vanished, lost to oxidation and isopropyl!  I killed it hard core didn't I? I knew to not put anything there; I know what nostuff means, but it's sure as shit soldered right there on my board.  A 0 ohm of course.\n\nMy brain went into monkey see monkey do mode maybe?! So yea, I super legit put a 0 ohm there. Good catch.  Massively good catch.  I'm impressed beyond anything, ever. Wow.\n\nThanks 2.  Did I kill it?  A lovely 3.1\/16GB, 4924?\n\nEdit:  I can't check 3.3_S5 at this exact moment, but I do have a 32k clock which i think gets power from 3.3s5?  I can check in morning."
    },
    {
        "post_id":67248,
        "thread_id":60233,
        "title":"820-4924 (3.1\/16gb!) Green\/Orange light, no power.  Damaged U7200",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-10-29 03:58:35",
        "message":"R7224\/25 can NOT be placed at same time in the board.\nIf you did that, R7201 should be burnt now.\nIf R7224 misses from the factory, then R7225 can be place; but I doubt about that, as schematic mentions NO STUFF."
    }
]