{"post_id":2319,"thread_id":2319,"title":"[SOLVED] 2012 Retina 15\" 820-3332","user_id":135,"username":"bjf","post_date":"2016-05-04 17:32:17","message":"Any idea what would cause a board to spin up the fans and boot (sometimes) if you touch a component to measure voltage? It appears to do this with almost any component. The board will also just sometimes work fine. It previously had some major damage to the ISL power chip area, specifically the voltage sense resistor area. Inrush limiter area was also blown up pretty bad. I thought I had this board repaired, but now it's only intermittently working and testing it is mind-boggling as it powers up normally most of the time and then turns on sometimes when you test a component for voltage and then dies when you stop testing it. \n\nThanks, Ben"}
{"post_id":2320,"thread_id":2319,"title":"[SOLVED] 2012 Retina 15\" 820-3332","user_id":135,"username":"bjf","post_date":"2016-05-04 17:45:34","message":"MagSafe light also sometimes goes green instead of staying orange."}
{"post_id":2321,"thread_id":2319,"title":"[SOLVED] 2012 Retina 15\" 820-3332","user_id":110,"username":"MOberdick","post_date":"2016-05-04 17:55:25","message":"Does it power back on again on its own after shutting itself off?"}
{"post_id":2322,"thread_id":2319,"title":"[SOLVED] 2012 Retina 15\" 820-3332","user_id":135,"username":"bjf","post_date":"2016-05-04 18:07:11","message":"Yes, it goes on and off constantly. I can drop it slightly or hold the board at different angles and it will turn off. The MagSafe light turns green and the board turns off. I can then touch a ground pin or some other ground with my finger and it will turn on (sometimes.) As I'm sitting here typing this it's turning on and off, sometimes staying on until I unplug it and sometimes just cycling on and off. This board has reached a point where I don't think I can troubleshoot it anymore. The intermittent behavior is making it impossible for me to gather any more information, so I'm hoping maybe someone else might have an idea of where to go next."}
{"post_id":2329,"thread_id":2319,"title":"[SOLVED] 2012 Retina 15\" 820-3332","user_id":2,"username":"dukefawks","post_date":"2016-05-05 07:39:10","message":"Sounds like a bad solder somewhere. This will be nightmare if you cannot pinpoint the area where the problem is. Try flexing and pushing and see where the board reacts to find the area."}
{"post_id":2352,"thread_id":2319,"title":"[SOLVED] 2012 Retina 15\" 820-3332","user_id":135,"username":"bjf","post_date":"2016-05-05 13:11:45","message":"Yes, a nightmare it has become. Thanks for the tip. I'll try to poke at it and see what I can learn."}
{"post_id":2423,"thread_id":2319,"title":"[SOLVED] 2012 Retina 15\" 820-3332","user_id":135,"username":"bjf","post_date":"2016-05-07 12:27:15","message":"Ok, so it stayed off for a few minutes which allowed me to measure that every voltage other than 3V42 and PPBUS_G3H was missing. My question is which comes first, SMC or clock? I'm assuming it goes SMC then clock but I'm not sure if the clock needs to be present for anything to function. It looks like 3V3_S5 is necessary for the clock to be present and 3V3_S5 will only come on if the SMC is doing it's job fully. In my case, of course, it's missing. Another note, when the power dies the magsafe light goes to green from normal orange. Also, poking the board with a spudger on the right side near the clock and SMC causes it to turn off. I can't quite determine which area it is beyond that though."}
{"post_id":2428,"thread_id":2319,"title":"[SOLVED] 2012 Retina 15\" 820-3332","user_id":135,"username":"bjf","post_date":"2016-05-07 18:33:17","message":"Well, now I lost my magsafe light altogether. I did a reflow of the SMC area and it's gone now. Not sure what's next. Any ideas are welcome.Thanks."}
{"post_id":2430,"thread_id":2319,"title":"[SOLVED] 2012 Retina 15\" 820-3332","user_id":2,"username":"dukefawks","post_date":"2016-05-07 21:05:35","message":"Reball SMC first."}
{"post_id":2902,"thread_id":2319,"title":"[SOLVED] 2012 Retina 15\" 820-3332","user_id":135,"username":"bjf","post_date":"2016-05-21 19:46:18","message":"Ok, I have the SMC reinstalled. Magsafe light is back. The board seems to be staying on now even when I push on the spot that would consistently shut it down previously. There is no display though and the fans are on high. All voltages are present."}
{"post_id":2907,"thread_id":2319,"title":"[SOLVED] 2012 Retina 15\" 820-3332","user_id":1,"username":"larossmann","post_date":"2016-05-22 09:42:29","message":"It now qualifies to be fixed for free by the Apple extended warranty! :D"}
{"post_id":2922,"thread_id":2319,"title":"[SOLVED] 2012 Retina 15\" 820-3332","user_id":135,"username":"bjf","post_date":"2016-05-22 13:06:27","message":"Yeah, they'll love seeing the network of wires I've run around the ISL chip :\/\n\nIt didn't have a video chip issue before I pulled the SMC so I'm feeling like it's something still in my control. It ran fine other than turning off if I pushed on the board near the SMC. That problem is gone now."}
{"post_id":2957,"thread_id":2319,"title":"[SOLVED] 2012 Retina 15\" 820-3332","user_id":135,"username":"bjf","post_date":"2016-05-24 11:23:31","message":"Solved. I re-reballed the SMC and the computer is functional again. So far it's not shutting down like it used to when I push on the board near the SMC either. We'll see how long it lasts. Thanks for the suggestions."}
{"post_id":16515,"thread_id":2319,"title":"[SOLVED] 2012 Retina 15\" 820-3332","user_id":735,"username":"theodore","post_date":"2017-03-14 14:00:37","message":"Is the SMC chip U4900?"}
{"post_id":16521,"thread_id":2319,"title":"[SOLVED] 2012 Retina 15\" 820-3332","user_id":1,"username":"larossmann","post_date":"2017-03-14 15:40:15","message":"On this board, yes."}
