[
    {
        "post_id":35240,
        "thread_id":35240,
        "title":"820-3208 with no light no nothing",
        "user_id":1423,
        "username":"captainmac",
        "post_date":"2018-05-29 07:45:59",
        "message":"need help with this board\ncame in just a little dusty, but no real corrosion or liquid traces\n\nget 0,3V on PP3v42\ntesting of course with known good DCINboard and LIO Cable.\nR6905 was replaced because it looked blown and showed a drop in voltage on pin 1 18.49V to pin 2: 2,49V, but ofcourse it blew again.\n\nam i correct in thinking that that can be caused by a short on pp3v42?\nPP3V42 measures no resistance to ground (literally with my fucked up multimeter, 0,01 Ohms)\n\nAre there any usual suspects to this rail that i am overseeing?\nHave tried taking off the caps around U6990 and U6990 itself, no change in resistance.\n​​​​​​​should i suspect something around U7000?"
    },
    {
        "post_id":35241,
        "thread_id":35240,
        "title":"820-3208 with no light no nothing",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2018-05-29 07:53:41",
        "message":"Inject voltage and see what heats up. You likely have a short on 3v42. Check caps near SMC as well. I'd say try everything you can that is not the SMC first."
    },
    {
        "post_id":35247,
        "thread_id":35240,
        "title":"820-3208 with no light no nothing",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-05-29 12:52:11",
        "message":"Not really a common suspect besides the SMC itself. Indeed inject voltage on the 3V42 bus. Start low and monitor current. See if SMC is getting hot if not look for other things that may heat up."
    },
    {
        "post_id":35264,
        "thread_id":35240,
        "title":"820-3208 with no light no nothing",
        "user_id":1423,
        "username":"captainmac",
        "post_date":"2018-05-30 04:30:04",
        "message":"OK, have put current through it, started at 1v and cranked to 2v, only thing that gets hot is the ISL (SMC stays cold). So decided to replace the ISL as I have plenty on 3437donors lying around. didn't change anything.\nis the next suspect the SMC?"
    },
    {
        "post_id":35321,
        "thread_id":35240,
        "title":"820-3208 with no light no nothing",
        "user_id":1423,
        "username":"captainmac",
        "post_date":"2018-05-31 08:57:09",
        "message":"I have replaced the SMC as well in the meantime, there is no change in symptoms. Is it ok to take off the SMC again and look for shorts that way? Or any hints on what to suspect next?"
    },
    {
        "post_id":35365,
        "thread_id":35240,
        "title":"820-3208 with no light no nothing",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-06-01 14:12:20",
        "message":"IF there is a short something should heat up when you inject 3V. Sure you can remove the SMC and look for shorts again, but should not be needed. Is the short still there?"
    }
]