{"post_id":56834,"thread_id":56834,"title":"820-2915 Charging slow","user_id":2552,"username":"EsteTron","post_date":"2020-02-17 11:03:42","message":"MacBook came in with a swollen battery a few months ago and not holding a charge. Replaced battery and sent customer on their way. Customer comes back a 2 months later with the replacement battery no longer holding a charge and only had 1 cycle count. Considered it a defective battery and replaced under warranty. Customer comes back in again with the same issue of the battery not holding a charge, stuck a 1 cycle count.\n\nRan coconut battery and discovered that the MacBook was charging that battery at 0.1 Watt. Discharging with 6.8 Watts\n\nOn U7000\nPP5V1_CHGR_VDD= 5V\nPP5V1_CHGR_VDDP= 4.9V\nResistant between pin 27\/28 : 20.5 ohms\nResistance between pin 17\/18 : 2.8 ohms\n\nI replaced Q7055.\n\nMacBook now begins to charge at 15 Watts, but then drops to charging at 6.8 Watts\n\nMeasured\nR7050 : 0.3 ohms\nR5441 on SMC_DCIN_ISENSE : 4.5k ohms\nR5420 on CHGR_BMON : 0 ohms\nR5422 on SMC_BMON_ISENSE : 45.3k ohms\nThese reported normally.\n\nReplaced Q7055 again to rule out defective mosfet. No change.\n\nI then measured around Q7080\nR7085, R7086, R7080, R7081 were all reporting the same measurements when compared to a working board.\n\nI replaced Q7080.\n\nMacBook is still charging at 6.8 Watts.\n\nJust to make sure that the SMC was not screwing with the charging, I replaced SMC from a working donor.\n\nStill charging at 6.8 Watts.\n\nWhat I have determined is that something is limiting the charging current to the battery because the board will begin to take 15 Watts but then drop to 6.8 Watts. I installed another battery just to make sure that I don't have a defective battery only to have to same results.\n\nI know it is in my face, but what else is responsible for battery current sensing?"}
{"post_id":56835,"thread_id":56834,"title":"820-2915 Charging slow","user_id":682,"username":"2informaticos","post_date":"2020-02-17 11:07:30","message":"Did you try known good working battery???\nNew chinese batteries are nightmare.\nFind an old original battery, just for test..."}
{"post_id":56838,"thread_id":56834,"title":"820-2915 Charging slow","user_id":2552,"username":"EsteTron","post_date":"2020-02-17 11:29:39","message":"I just tried 4 other batteries all from the same vendor and they were reporting different charging values from 6.2 watts to 9.8 watts. Being that the main parts of the board look perfectly fine leads me to believe I got a really bad batch of batteries."}
{"post_id":56840,"thread_id":56834,"title":"820-2915 Charging slow","user_id":2552,"username":"EsteTron","post_date":"2020-02-17 12:02:49","message":"Just installed a used battery and now getting 22 watts. Being that I had multiple batteries report a similar reading, I assumed the issue was with the board. But it turns out that the issue was all around a bad batch of New batteries. Thank you."}
