{"post_id":28377,"thread_id":28377,"title":"[SOLVED]820-2915 No Wifi...Kinda?","user_id":1153,"username":"JohnB8812","post_date":"2017-11-22 10:35:32","message":"Ok so this one is driving me insane lol. Customer came in saying no wifi problem with MBP. There drive was also super sluggish, so I used my boot drives to rule that out. With my boot drives, no wifi, so I replaced the wifi card with a known GOOD Airport card, and now, I have WiFi on my boot drives. HOWEVER, his drive continued to show no WiFi and in fact, it says no hardware installed. I cloned his drive to a new SSD since he needed to swap drives anyway, and I STILL get no hardware installed, but get WiFi from my boot drives. I checked his drive for malware and found some, but he still has no wifi installed. Would this be a main board issue or is this software level? He is running 10.12.5 on his drive my boot drives that I tried were 10.7.5, 10.9.5, 10.11.5 and 10.13."}
{"post_id":28389,"thread_id":28377,"title":"[SOLVED]820-2915 No Wifi...Kinda?","user_id":461,"username":"Gurmon","post_date":"2017-11-22 16:33:29","message":"You could always install a clean version of OSX on the SSD, then migrate their data from the old HDD. That's the easiest way to fix software issues."}
{"post_id":28392,"thread_id":28377,"title":"[SOLVED]820-2915 No Wifi...Kinda?","user_id":1153,"username":"JohnB8812","post_date":"2017-11-22 16:57:38","message":"Ok that was the next thing I was going to try. I tried installing 10.12.6 to see if that would make a difference, but no dice. I will attempt that on Friday and see what happens."}
{"post_id":28522,"thread_id":28377,"title":"[SOLVED]820-2915 No Wifi...Kinda?","user_id":1153,"username":"JohnB8812","post_date":"2017-11-25 13:37:11","message":"Ok so was NOT HD or the Wifi card it ended up being a blown L3404! Replaced it and we have the wee fee again! Thanks for that video you posted a long time ago btw Louis that helped make a lot of sense for this trash board lol. Mark this as solved!"}
