{"post_id":26533,"thread_id":26533,"title":"820-3437-B no backlight","user_id":917,"username":"galvestonmac","post_date":"2017-10-08 17:26:41","message":"I have an 820-3437-B with no backlight on the screen and no light on the charger.  Computer will power on after 3 fan spins but no backlight.  This computer was liquid damaged in multiple areas.\n\nI replaced R7788 due to corrosion and now have pin 1=8.5v 2=6.57\n\nQ7706 pin 1=.04v 2=.03v 3=6.50v 4=8.65v 5=.12 6=.05v\n\nC7782 pin 1=8.55v 2=6.57v\n\nF7700 pin 1=8.55v 2=8.55v\n\nI seem to have a short on PPVIN_S0SW_LCDBKLT_FET\n\nI'm a little confused because I have the right boardview and the right schematic but some of the components aren't on the board. I was looking for U5490 but even though it's in the schematic it's not on the board.\n\nAre there multiple versions of the boardview and schematic for the particular board?"}
{"post_id":26538,"thread_id":26533,"title":"820-3437-B no backlight","user_id":2,"username":"dukefawks","post_date":"2017-10-08 18:22:18","message":"A component being in the schematic does not mean it will be on the board. \n\nLCDBKLT_ISNS:YES is what is in the schematic. The production boards do not have current sensing for the backlight.\n\n6.57V is not a valid voltage. It is either 8.5V or about 2.8V which you can calculate from the resistor divider R7788\/R7789. Question now is the voltage on pin 3 of Q7707. I assume you are measuring this with the LCD connected and that you have an image on the screen."}
{"post_id":26540,"thread_id":26533,"title":"820-3437-B no backlight","user_id":917,"username":"galvestonmac","post_date":"2017-10-08 19:02:10","message":"Yes,  I have an image on the screen but no backlight. I will check pin 3 Q7707 and report back. thanks."}
{"post_id":26584,"thread_id":26533,"title":"820-3437-B no backlight","user_id":917,"username":"galvestonmac","post_date":"2017-10-09 19:36:15","message":"I have 0v on Q7707 at pin 3. I removed Q7707 and now I have 5.65v at pin 3.  Looking for a replacement in my donor pile. Does anyone know the correct orientation of the Q7707 chip? It has a \"D\" on it but no marking for pin 1.  Mine blew away as I was removing it."}
{"post_id":26588,"thread_id":26533,"title":"820-3437-B no backlight","user_id":2,"username":"dukefawks","post_date":"2017-10-09 19:59:18","message":"And what is wrong with 0V at pin 3? That is exactly what it is supposed to be when EDP_BKLT_EN and BKLT_PLT_RST_L are present. Also look at the diagram and tell me what would happen if you install Q7707 the \"wrong\" way. Understanding how this works is essential in being able to diagnose this stuff.\n\nSo the conclusion here is that the gate of Q7706 is not being pulled down low enough. This could be a dead R7789 or a corroded trace. Wrong value for R7788 would also cause issues. Check both resistor values and traces. The last option could be a dead Q7706.\n\nFor testing you could just bypass Q7706 pin 4 to 5 and the backlight should work."}
{"post_id":26589,"thread_id":26533,"title":"820-3437-B no backlight","user_id":917,"username":"galvestonmac","post_date":"2017-10-09 22:14:34","message":"thank you! will try that and reporting findings back."}
{"post_id":26654,"thread_id":26533,"title":"820-3437-B no backlight","user_id":1101,"username":"ielectron","post_date":"2017-10-10 17:24:21","message":"if u solder Q7707 (two n channel mosfet in 1  package) the other way around, than the gates would be reversed, though both gate would get the opening voltage, the drain and source would be reverse connected, the mosfet would never open, that would close Q7706 for forever and there would be no backlight."}
{"post_id":26692,"thread_id":26533,"title":"820-3437-B no backlight","user_id":2,"username":"dukefawks","post_date":"2017-10-11 19:13:15","message":"No, look again at what happens when reversed....."}
