{"post_id":56454,"thread_id":56454,"title":"820-00850 won't work inside case?  Weird issue","user_id":831,"username":"Revive","post_date":"2020-02-05 12:08:57","message":"I'm having a super weird issue with an 820-00850 A1989, that pulls 20v .01 amps.\nThe board is very clean, and when I remove it from case it pulls 20V .60 amps no problem.\nWhen I put the logic board back in the case the problem instantly returns down to .01 amp, this is with nothing plugged in except the USB-C jacks.\nI'm suspecting it may have something to do with the io jacks ribbon crimping causing an issue, but Ive replaced them with known good ones, is possible this particular board is more sensitive to the ribbon being crimped somehow?\nI get identical results testing from the left or right side\nIs there something stupid I'm missing here? Anyone ever have a problem like this?\n[ATTACH=JSON]{\"data-align\":\"none\",\"data-size\":\"medium\",\"data-tempid\":\"temp_2861_1580926068515_990\"}[\/ATTACH]\n.01 amps\n\n[ATTACH=JSON]{\"data-align\":\"none\",\"data-size\":\"medium\",\"data-tempid\":\"temp_2860_1580926072786_499\"}[\/ATTACH]\n.60 amps"}
{"post_id":56455,"thread_id":56454,"title":"820-00850 won't work inside case?  Weird issue","user_id":682,"username":"2informaticos","post_date":"2020-02-05 14:30:00","message":"Board turns on if you remove it again from the case?\nCheck each USB-C port connecting in both directions."}
{"post_id":56461,"thread_id":56454,"title":"820-00850 won't work inside case?  Weird issue","user_id":831,"username":"Revive","post_date":"2020-02-05 16:19:56","message":"Yes outside the case all 8 positions of the USB-C connections work.  When I put it in the case and connect only the ports it stays at .01amp.\nI can actually lift it out of the case and watch the change happen live.\nI no longer suspect the crimping because it happens with a loose port laying flat connected.  \nI took a couple videos but cant upload MOV's to the Forum, is there a video format that is acceptable?"}
{"post_id":56462,"thread_id":56454,"title":"820-00850 won't work inside case?  Weird issue","user_id":682,"username":"2informaticos","post_date":"2020-02-05 18:17:14","message":"Upload somewhere else and post the link only.\n\nConnect only one side USB ports; J3300, or JB500, one by one.\nTry to see if you can locate the issue on just one side."}
{"post_id":56494,"thread_id":56454,"title":"820-00850 won't work inside case?  Weird issue","user_id":831,"username":"Revive","post_date":"2020-02-06 11:52:37","message":"It seems to happen the same on all the ports, they all hold 20V steady but the amps drop to almost 0 when it goes in the case, I know it sounds super weird.\nSee attached videos, the first two you see it going from .01 amps to .40 after pulling from case, the last one you see it going .39 amps down to .01 when putting back in the case.\n\n[URL]https:\/\/imgur.com\/a\/7TLIIzc[\/URL]"}
{"post_id":56495,"thread_id":56454,"title":"820-00850 won't work inside case?  Weird issue","user_id":682,"username":"2informaticos","post_date":"2020-02-06 12:22:34","message":"Could be some problem with the hall sensors.\nPut it in case with LCD panel open.\nCheck all SMC_LID signals."}
{"post_id":56528,"thread_id":56454,"title":"820-00850 won't work inside case?  Weird issue","user_id":831,"username":"Revive","post_date":"2020-02-07 10:47:22","message":"Yes, opening the lid  works in restoring the amps!  \nSo it seems when SMC_LID is low something is happening, is it possible PP1V8 is being shorted in J4801 or J4800 only when low, or more likely something wrong with U3900? \nAm I the only one who hates replacing hall sensors."}
{"post_id":56536,"thread_id":56454,"title":"820-00850 won't work inside case?  Weird issue","user_id":682,"username":"2informaticos","post_date":"2020-02-07 14:08:17","message":"When lid is open, board works?\nHall sensor should be disabled then.\nMaybe only one is bad and you can let it out."}
{"post_id":56671,"thread_id":56454,"title":"820-00850 won't work inside case?  Weird issue","user_id":831,"username":"Revive","post_date":"2020-02-11 16:02:36","message":"Yes when lid is open the board works, but when lid is closed it wont charge at all (.01 amps)\nI've replaced both hall sensors one at a time and observed, everything was the same back to square one.\nGoing down the lid sensor line I replaced U4802 and the caps around it, now the board pulls 20v .08 amps (where as it used to pul .60 amps out of case) which doesn't make any sense, none of this makes sense. \nThe thermal camera indicates heat under the U3900, so maybe the T2 chip is causing problems, possibly PP1v8_awake? \nProbably going to give up on this one"}
{"post_id":56676,"thread_id":56454,"title":"820-00850 won't work inside case?  Weird issue","user_id":682,"username":"2informaticos","post_date":"2020-02-11 17:51:06","message":"Try T2 firmware recovery; already posted on the forum necessarry info..."}
