{"post_id":5657,"thread_id":5657,"title":"820-3462 not detecting battery","user_id":63,"username":"spakhnyuk","post_date":"2016-08-18 17:08:44","message":"This board was liquid damaged. Board was cleaned in the Crest ultrasonic. \nEverything on the board works, in fact the battery will charge, and it will run off the battery, but the battery is not being detected. \nI have tried a different top case with a known good battery and a different interposer board. Same issue remains. \n\nCan you guys help me troubleshoot this? \nThanks!"}
{"post_id":5662,"thread_id":5657,"title":"820-3462 not detecting battery","user_id":1,"username":"larossmann","post_date":"2016-08-18 19:55:58","message":"My bet is it's missing \"the screw.\" There is a screw holding the battery into the computer.\n\nIf not that, my bet is on SMC data line.\n\n1) Put red probe on ground, black probe on pin 2 of R5280 with no power applied to the board, and give me the measurement. \n2) Put red probe on ground, black probe on pin 2 of R5281 with no power applied to the board, and give me the measurement."}
{"post_id":5710,"thread_id":5657,"title":"820-3462 not detecting battery","user_id":63,"username":"spakhnyuk","post_date":"2016-08-19 17:10:26","message":"Here are the diode mode measurements you requested: \n\npin 2 of R5280 is 0.338\npin 2 of R5281 is a short to ground (0.002) to be exact\n\nit's not missing \"the screw\" and I did try using a known good interposer board between the battery connector and the mlb."}
{"post_id":5711,"thread_id":5657,"title":"820-3462 not detecting battery","user_id":63,"username":"spakhnyuk","post_date":"2016-08-19 17:20:14","message":"I'm going to replace R5281 and let you know what happens. \nThanks!"}
{"post_id":5717,"thread_id":5657,"title":"820-3462 not detecting battery","user_id":1,"username":"larossmann","post_date":"2016-08-19 18:15:17","message":"It's not R5281. That measurement you gave me shows a short to ground. R5281 does not have a path to ground. something on that line has a path to ground and is causing this. It can be U7000, it can be U4900, it can be some solder blob somewhere. Start by removing U7000 and seeing if it goes away."}
{"post_id":7478,"thread_id":5657,"title":"820-3462 not detecting battery","user_id":63,"username":"spakhnyuk","post_date":"2016-09-30 15:52:28","message":"I removed U7000 and the short on R5281 is still there. What should I do next? Is removing U9400 the next step?"}
{"post_id":7484,"thread_id":5657,"title":"820-3462 not detecting battery","user_id":1,"username":"larossmann","post_date":"2016-09-30 17:08:12","message":"I'd inject 2v on the line to see what gets hot to confirm, but yeah, most likely U4900."}
{"post_id":7489,"thread_id":5657,"title":"820-3462 not detecting battery","user_id":2,"username":"dukefawks","post_date":"2016-09-30 19:28:36","message":"Pretty sure your SMC is dead. Use new U7000 and SMC from donor."}
{"post_id":37598,"thread_id":5657,"title":"820-3462 not detecting battery","user_id":1637,"username":"Adan","post_date":"2018-07-26 13:42:52","message":"Hi had the same issu with the same board. I changed several time the SMC, same problem. Then I realised a pin of the UM 29 503 battery connector (inter the board and the battery) was fold down. I set up it right, then it work. Somebody touch the MacBook in a wrong way before me."}
