{"post_id":96688,"thread_id":63606,"title":"A2337 820-02016 PPOV805_S1_VDD_FIXED shorted","user_id":40706,"username":"Panrix Microelectronix","post_date":"2023-02-15 18:15:27","message":"Hey guys,\n\nJust wanted to pick your brains and see if anyone has experienced this before.. We’ve had 2xA2337 MacBooks in within the last 2 weeks for screen repairs. Both came in fully functional but just had screen damage (could see image and lcd damage)\n\nNot quite sure what one of our techs is doing but both Mac’s are now dead and further investigation has found that PPOV805_S1_VDD_FIXED is shorted on both!\n\nIs this common failure for this model? I don’t know how this fault could occur - any ideas? Can’t think of what is going wrong and causing this to happen but we can’t continue to have this happen.\n\nAppreciate any advice! Thank you"}
{"post_id":96689,"thread_id":63606,"title":"A2337 820-02016 PPOV805_S1_VDD_FIXED shorted","user_id":682,"username":"2informaticos","post_date":"2023-02-15 19:01:21","message":"[URL unfurl=\"true\"]https:\/\/drive.google.com\/file\/d\/1zRabYUrrpM3KJKEurv9RvGu7GMTDDOcA\/view?usp=share_link[\/URL]\nMay be normal; did you compare with working board?"}
{"post_id":96692,"thread_id":63606,"title":"A2337 820-02016 PPOV805_S1_VDD_FIXED shorted","user_id":40706,"username":"Panrix Microelectronix","post_date":"2023-02-16 03:35:06","message":"please can you explain what the circled notes mean?\n\ntested the line against known good board and also there is no short on line when cpu is removed"}
{"post_id":96699,"thread_id":63606,"title":"A2337 820-02016 PPOV805_S1_VDD_FIXED shorted","user_id":682,"username":"2informaticos","post_date":"2023-02-16 05:17:45","message":"The mentioned LPDP_RX power rails may be grounded in the MLB; depending of board revision."}
{"post_id":99873,"thread_id":63606,"title":"A2337 820-02016 PPOV805_S1_VDD_FIXED shorted","user_id":28596,"username":"Jeffotskie26","post_date":"2023-06-12 05:09:12","message":"hi just want to join with this issue.\n1. i got same issue with the macbook if fully working just screen cracked.\ni accidentally put a2179 lcd upon testing i heard the startup sound but no display\nthen i realize i use a2179 lcd. (i tested it one time its like less than 2 mins after i see no display i removed the screen and put correct lcd)\n2. upon testing correct lcd a2337 the macbook is not turning on.  PPOV805_S1_VDD_FIXED is fully short\nu7700 is over heating. i tried removed u7700  PPOV805_S1_VDD_FIXED still short.\n3. i have fully working same model a2337 i tested the  PPOV805_S1_VDD_FIXED diode to ground is 0.266\nboth are same board version 820-02016\n\nmy question is the a2179 lcd cause to short the PPOV805_S1_VDD_FIXED."}
{"post_id":99876,"thread_id":63606,"title":"A2337 820-02016 PPOV805_S1_VDD_FIXED shorted","user_id":682,"username":"2informaticos","post_date":"2023-06-12 06:28:43","message":"If still short after removing U7700, M1 is the first suspect.\nThere are several filter caps, but the processor is the most sensitive.\n\nComparing video connectors, you can see that A2179 display caused short to ground on several M1 data lines.\nThat may be a reason to kill M1 processor."}
{"post_id":99920,"thread_id":63606,"title":"A2337 820-02016 PPOV805_S1_VDD_FIXED shorted","user_id":28596,"username":"Jeffotskie26","post_date":"2023-06-13 23:44:32","message":"so this case is hopelesss. only way is to find logic board replacement."}
