{"post_id":30731,"thread_id":30731,"title":"820-2915 Mux issue?","user_id":1092,"username":"Ryanlen2","post_date":"2018-01-25 12:09:57","message":"This board came in with display not working. LCD would power on for a split second with no backlight, then turn off. Diode measurements of LVDS were normal compared to working board. Voltage measurements seemed good as well except pins 26 and 27 seemed off. Was getting .640V on pin 26 and 1.1V on pin 27. Seeing as these pins go to MUX I tried reflowing. When there was no change I then decided to try replacing it. Usually no biggie... Only problem with this is I cant find my stencil for u9600. So I tried replacing it with residual solder left on chip. This took a few tries. Now the computer still turns on and chimes but Im not getting 3.3V to the LCD anymore. I have 3.3V on pin 1 of R9600 but only .937 on pin 2. So PP3V3_S0_GMUX_R isnt present for U9600. No GPU_VCORE. Im guessing somethings not soldered correctly and I will have to wait to either find my stencil or new one comes in. I have one these successfully before without a stencil, not sure what happened this time. Just wanted to run this by you in the chance that it could be something else.\n\nKnown working LCD\n.445 in Diode on pins 2&3 of connector.\n\nThanks for the help."}
{"post_id":30737,"thread_id":30731,"title":"820-2915 Mux issue?","user_id":2,"username":"dukefawks","post_date":"2018-01-25 13:29:10","message":"Just give it a proper reball. After that you will probably also find out the GPU is fucked."}
{"post_id":30740,"thread_id":30731,"title":"820-2915 Mux issue?","user_id":1092,"username":"Ryanlen2","post_date":"2018-01-25 13:48:08","message":"Hey Duke. Thanks man... You think GPU is gonna be screwed on this one? It was working intermittently before it stopped working all together. Also worked externally. Or are you saying I fucked it up? LOL... :D\n\nLater."}
{"post_id":30742,"thread_id":30731,"title":"820-2915 Mux issue?","user_id":2,"username":"dukefawks","post_date":"2018-01-25 20:48:18","message":"I don't think I have ever changed a MUX on these boards, so a bad GPU is more likely. But in any case you need to properly reball the MUX as that is causing the current issue."}
