[
    {
        "post_id":102182,
        "thread_id":64289,
        "title":"A2337 short on audio board",
        "user_id":55433,
        "username":"thatsjayb",
        "post_date":"2023-10-26 12:00:34",
        "message":"Hi,\n\nI have an A2337 when the charger is connected to the laptop is taking 5.14 volts, 0.05A and 0.25W.\n\nThe only place i found a short was on the bottom caps of the audio board but when i remove the heatsink the short is gone and the macbook works perfectly fine! could this be a bad cpu\/ram ?\n\n\nAny help would be appreciate it \nThanks"
    },
    {
        "post_id":102193,
        "thread_id":64289,
        "title":"A2337 short on audio board",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-10-27 02:40:07",
        "message":"First of all, welcome to the forum!\n\n\"when i remove the heatsink the short is gone\"\nDo you mean the metal cover of that connector maybe?\n\nYou should inspect audio board\/flex for corrosion.\nCheck M1 data lines corresponding to that connector.\n\nYou should try DFU, just in case."
    },
    {
        "post_id":102323,
        "thread_id":64289,
        "title":"A2337 short on audio board",
        "user_id":55433,
        "username":"thatsjayb",
        "post_date":"2023-10-30 10:06:19",
        "message":"Thank you,\n\nI mean when I remove the actual heatsink the one above the processor and the memory ram.\n\nThe audio board is brand new and the computer is now working ok without the heat sink.\n\nI will now check the M1 data lines on the board.\n\nAlso what exactly I should try in DFU mode ?\n\n\nThank you"
    },
    {
        "post_id":102326,
        "thread_id":64289,
        "title":"A2337 short on audio board",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-10-30 12:17:52",
        "message":"Forget DFU, if machine works.\n\nPut back heatsink and look around screw holes for any damage sign."
    },
    {
        "post_id":102332,
        "thread_id":64289,
        "title":"A2337 short on audio board",
        "user_id":55433,
        "username":"thatsjayb",
        "post_date":"2023-10-30 12:59:46",
        "message":"[QUOTE=\"2informaticos, post: 102326, member: 682\"]\nForget DFU, if machine works.\n\nPut back heatsink and look around screw holes for any damage sign.\n[\/QUOTE]\nHi,\n\nI did a visual inspection under a microscope and everything seems to be working ok. I put back the heatsink and the MacBook stopped working, after I removed it again and now it works fine.\n\nLooks like whenever the heatsink in on there is a short to ground on PPBUS_AON but when I remove the heatsink the short is gone which makes me believe that either a component under the heatsink might be touching the heatsink causing the short or perhaps the A2 pin under U0600 on the top left or maybe the pressure from the bracket might be interfering with a component connected to the PPBUS_AON line causing it to short to ground when the heatsink is on.\n\nReally hope you can guide me to find the issue and get this board fixed.\n\n\nThank you"
    },
    {
        "post_id":102338,
        "thread_id":64289,
        "title":"A2337 short on audio board",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-10-30 15:13:02",
        "message":"What is resistance (ohm scale) to ground at PPBUS_AON?\nCheck it disconnecting charger and battery; allow 10-15s to discharge remanent voltage.\n\nYou may have a problem inside board.\nPressure caused by heatsink screws may cause short between the copper layers."
    }
]