[
    {
        "post_id":68379,
        "thread_id":60395,
        "title":"A1465 2014 Won't turn on if battery attached.",
        "user_id":26416,
        "username":"estebanquito356",
        "post_date":"2020-11-25 22:25:20",
        "message":"I have this A1465, it works perfectly, battery charges, runs great on battery power, reboots just fine. No signs of liquid and the Mac is in mint condition.\n\nTrouble is when you turn the computer off, it won't turn on again with the power button. When the charger is connected it charges the battery but the macbook doesn't turn on (sometimes if the battery is very low it does turn on). You have to disconnect the battery, plug in the charger, it turns on by itself, connect the battery again and it runs great until you turn it off again.\n\n\nI've tried another battery, the Mac behaves the same.\nI've measured SMC_ONOFF_L when battery connected and power button pressed: 0.42V.  (If not pressed 3.42V as usual).\n\nI've measured voltage on F7140: \n7.40V battery only\nSlowly goes from 7.40 to 8.6V battery + charger connected\n8.59V only charger\n\nWhat i also tried is with the battery disconnected, connect the charger, it turns on, i turn it off from the OS without disconnecting the charger, and it doesn't turn on again with the power button. SMC_ONOFF_L goes to 0.40V but it doesn't turn on. Tried shorting the pad to ground but same result.\n\nSMC bypass does not work either. \n\nCan it be a bad SMC? Bad keyboard (is the only i have unfortunatelly)?\n\nAny help is much appreciated. Thanks!"
    },
    {
        "post_id":68386,
        "thread_id":60395,
        "title":"A1465 2014 Won't turn on if battery attached.",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-11-26 01:46:34",
        "message":"Can you turn it on with R5115\/16 pads, if keyboard is disconnected?\nCheck SMC_LSOC_RST_L w\/ and w\/o trackpad flex connected."
    },
    {
        "post_id":68396,
        "thread_id":60395,
        "title":"A1465 2014 Won't turn on if battery attached.",
        "user_id":26416,
        "username":"estebanquito356",
        "post_date":"2020-11-26 02:10:19",
        "message":"Can you turn it on with R5115\/16 pads, if keyboard is disconnected?\n\nTried with R5116 and no, it doesn't turn on\n\n\nCheck SMC_LSOC_RST_L w\/ and w\/o trackpad flex connected\n\nWith flex connected: 1.59V\n\nWith flex disconnected: 3.4V\n\n\n\nI don't get why it doesn't turn on bridging R5116. \n\n\nI'm gonna try: \"What i also tried is with the battery disconnected, connect the charger, it turns on, i turn it off from the OS without disconnecting the charger, and it doesn't turn on again with the power button. SMC_ONOFF_L goes to 0.40V but it doesn't turn on. Tried shorting the pad to ground but same result.\" But this time with flex disconnected.\n\n\nSorry for the next late response, i have to head out of my house and i'll be back in 8hs."
    },
    {
        "post_id":68402,
        "thread_id":60395,
        "title":"A1465 2014 Won't turn on if battery attached.",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-11-26 03:30:35",
        "message":"\"With flex connected: 1.59V\"\nThere is a problem with trackpad board, or flex.\n\nDid you try R5115\/16 pads with trackpad flex disconnected?\nOr just removing keyboard from trackpad board?"
    }
]