{"post_id":4804,"thread_id":4804,"title":"[SOLVED]820-2850 (c9560)","user_id":23,"username":"mrjoeham","post_date":"2016-07-25 13:45:27","message":"HI, I am new to this group and also pretty new at mac board repairs.  Ive watched videos, but to be honest I am almost 40 and my brain cant soak in stuff as quickly as I would like it to.  Goal here is to learn from you all.  I have a macbook pro 15inc 2010 board 820-2850.  I heard these board suck to work on.  I also heard that the capacitor C9560 suck too and common problem on this board.  The symptom I am having with this particular board is that it shuts down and kernal panics when I open 2 or more applications.  It powers on fine and seems like everything is working.  I tested the ram separately by booting it up with it individually and getting same results. I even used different ram to be sure and getting same results in that scenario.  I would like to change out C9560 with a Polymer capacitor and than see what result I get.  I am just not sure which one to order from Mouser.  Could someone help point me to which one? and also any other steps I need or should look into to find the correct solution for this issue.  Thanks all.\n\n[url]http:\/\/www.mouser.com\/Passive-Components\/Capacitors\/Polymer-Capacitors\/_\/N-bjuf7?P=1z0z7ymZ1z0wrktZ1z0x63tZ1ynye84[\/url]"}
{"post_id":4807,"thread_id":4804,"title":"[SOLVED]820-2850 (c9560)","user_id":2,"username":"dukefawks","post_date":"2016-07-25 17:33:22","message":"Take a normal 330uf cap from a dead board. They can pretty much be found on any Mac or PC board. Scrape away some solder mask on the GND side to be able to fit the slightly bigger cap."}
{"post_id":4810,"thread_id":4804,"title":"[SOLVED]820-2850 (c9560)","user_id":1,"username":"larossmann","post_date":"2016-07-25 18:46:32","message":"on an 820-3115 or an 820-2915 they even say \"330\" on them! if you have any of those as a donor."}
{"post_id":4811,"thread_id":4804,"title":"[SOLVED]820-2850 (c9560)","user_id":1,"username":"larossmann","post_date":"2016-07-25 18:48:48","message":"I use these since I ran out on donor boards. [url]https:\/\/www.mouser.com\/Search\/ProductDetail.aspx?R=EEF-CX0D331Rvirtualkey66720000virtualkey667-EEF-CX0D331R[\/url]"}
{"post_id":4813,"thread_id":4804,"title":"[SOLVED]820-2850 (c9560)","user_id":23,"username":"mrjoeham","post_date":"2016-07-25 19:23:33","message":"Great and thanks, I will go ahead and and see if this corrects the problem and update results.  Have great evening gentlemen."}
{"post_id":4817,"thread_id":4804,"title":"[SOLVED]820-2850 (c9560)","user_id":23,"username":"mrjoeham","post_date":"2016-07-25 22:07:36","message":"No Title\n\nTook this from 820-2327, Scrape the board, tin and installed.  Working now solid!  Thanks you.  What video should I watch on why this component failed and how to test to verify failure?"}
{"post_id":4821,"thread_id":4804,"title":"[SOLVED]820-2850 (c9560)","user_id":2,"username":"dukefawks","post_date":"2016-07-25 22:14:55","message":"Just run any youtube video so the system will switch over to the dedicated GPU. Pretty sure you can call it fixed."}
{"post_id":4822,"thread_id":4804,"title":"[SOLVED]820-2850 (c9560)","user_id":23,"username":"mrjoeham","post_date":"2016-07-25 22:20:33","message":"Yes sir, was the first thing I tested to make sure.. rocking music videos now for about 30 mins still going."}
