[
    {
        "post_id":26203,
        "thread_id":26203,
        "title":"[SOLVED]820-3662 No image no backlight",
        "user_id":1104,
        "username":"Jay",
        "post_date":"2017-10-01 12:41:06",
        "message":"Unit posts but display stays black. Checked with flashlight but can't see anything.\nTested with another screen and same issue.\n\nStill new at this so tracking an issue through the schematics is still a little difficult. That said I took the following readings:\n\n[B]Q7706[\/B]\nPin 1: 0.53mv and dropping constantly [COLOR=#FF0000](should be 12.6V?)[\/COLOR]\nPin 2: 0.26mv and dropping constantly (same value as pin 1 when I check back and forth)[COLOR=#FF0000] (should be 12.6V?)[\/COLOR]\nPin 3: 12.46 v [COLOR=#008000](correct)[\/COLOR]\nPin 4: 12.57 v [COLOR=#008000](correct)[\/COLOR]\nPin 5: 0.36 mv and dropping constantly [COLOR=#FF0000](should be 12.6V?)[\/COLOR]\nPin 6: 0.26 mv and dropping slowly [COLOR=#FF0000](should be 12.6V?)[\/COLOR]\n\n[B]L7710[\/B]\nPin 1: 0.18.1 mv steady (measured at C7710 pin 1) [COLOR=#FF0000](should be 12.6V?)[\/COLOR]\nPin 2: 0.15.8 mv steady (measured at probe point above it) [COLOR=#FF0000](should be 45V?)[\/COLOR]\n\n[B]Q7701[\/B]\nPin 1: 0.08.4 mv\nPin 2: 0.08.3 mv\nPin 3: 0.07.5 mv slowly rising\nPin 4: 0\nPin 5: 0.11.8 mv slowly rising\nUnsure what any of these should read as schematic doesn't mention voltages. I am assuming pin 5 should shoot out 40+V?\n\n[B]U7701[\/B]\nUnable to read, I ordered better multimeter probes from Louis' site :)\n\n[B]J8300[\/B]\nPin 1: 0 [COLOR=#FF0000](should be 55V?)[\/COLOR]\n\n[B]L8300[\/B]\nPin 1: 0 [COLOR=#FF0000](should be 5V?)[\/COLOR]\nPin 2: 0 [COLOR=#FF0000](should be 5V?)[\/COLOR]\n\n[B]U8300[\/B]\nPin 1: 0 (can't find what this should read)\nPin 2: 5 [COLOR=#008000](correct)[\/COLOR]\nPin 3: 5 [COLOR=#008000](correct?)[\/COLOR]\nPin 4: 0 [COLOR=#FF0000](should be 5V?)[\/COLOR]\nPin 5: 0 [COLOR=#FF0000](should be 5V?)[\/COLOR]\nPin 6: 0\n\n[B]R8165[\/B]\nPin 1: 5 v [COLOR=#008000](correct)[\/COLOR]\nPin 2: 4.80 v [COLOR=#008000](correct?)[\/COLOR]\n\n[COLOR=#000000]Lots of question marks as I am not experienced enough to be certain about anything.\n\nAt this point I start to lose track a little. Am I going in the right direction\/measuring the relevant points?\nI would like to find a solution at some point but today I'm just trying to learn how to read the roadmap better\/properly :)[\/COLOR]"
    },
    {
        "post_id":26204,
        "thread_id":26203,
        "title":"[SOLVED]820-3662 No image no backlight",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-10-01 13:30:45",
        "message":"Q7706 \/ L7710 \/ Q7701 are all inactive because the system is probably not activating the backlight at all.\n\nThe system needs to \"talk\" to the display before it will activate the backlight, since there is no picture we can conclude the talking isn't going well\nTo verify this see how the BKLT_EN_R\/EDP_IG_BKL_ON signal is doing. This signal is most likely low, so the backlight is not being enabled.\n\nSince U8300's Pin 1 is LOW the display is not getting its 5V power signal, this is the issue we should look into.\n\nHow does the connector look like? Are all the pins making contact to the board?\nCheck if R8300 is alright"
    },
    {
        "post_id":26213,
        "thread_id":26203,
        "title":"[SOLVED]820-3662 No image no backlight",
        "user_id":1104,
        "username":"Jay",
        "post_date":"2017-10-01 16:41:24",
        "message":"Thanks smiba,\n\n[B]R8300[\/B]\nPin 1: 0V\nPin 2: 0V\n\nJ8300 looks good, all pins are connected properly.\n\nTo check BKLT_EN_R I need to measure pins on U7750 which I currently can't do with the meter probes I have. Should be able to check later this week though.\nUsing the probe point and R7756 to measure though gives me 0V\n\nMeasuring EDP_IG_BKL_ON on pin 1 of R7742 gives me 0V"
    },
    {
        "post_id":26219,
        "thread_id":26203,
        "title":"[SOLVED]820-3662 No image no backlight",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-10-01 20:11:38",
        "message":"First you need an image before even looking at the backlight circuit. Does L8300 get a pulse of 5V while powering on. Check it while powering on and it should go to 5V for a while. If it then drops off it means no LCD was detected.\nWas this liquid damage? Tried an external screen?"
    },
    {
        "post_id":26222,
        "thread_id":26203,
        "title":"[SOLVED]820-3662 No image no backlight",
        "user_id":1104,
        "username":"Jay",
        "post_date":"2017-10-01 20:22:06",
        "message":"No liquid damage reported or found. L8300 gets a split second pulse where the meter shows 0L but then 0V immediately after on both pins. An external screen receives no signal from either Thunderbolt port."
    },
    {
        "post_id":26223,
        "thread_id":26203,
        "title":"[SOLVED]820-3662 No image no backlight",
        "user_id":637,
        "username":"TCRScircuit",
        "post_date":"2017-10-01 20:52:16",
        "message":"Does this even chime? Maybe you are addressing a no lcd issue when in reality you should be looking for a no brain issue."
    },
    {
        "post_id":26224,
        "thread_id":26203,
        "title":"[SOLVED]820-3662 No image no backlight",
        "user_id":1104,
        "username":"Jay",
        "post_date":"2017-10-01 20:53:50",
        "message":"It does chime yeah."
    },
    {
        "post_id":26234,
        "thread_id":26203,
        "title":"[SOLVED]820-3662 No image no backlight",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-10-02 05:20:52",
        "message":"No video over DisplayPort (Thunderbolt) could indicate an issue with the CPU, I think even without display connected this should work, but I have not verified this myself.\n\nAlso to measure L8300 put your multimeter on Voltage mode and on a high enough range (One that can probe 5V). It shoudn't show OL as that would mean it peaks on a high voltage."
    },
    {
        "post_id":26239,
        "thread_id":26203,
        "title":"[SOLVED]820-3662 No image no backlight",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-10-02 06:28:31",
        "message":"Inspect connector\/cable and try a known good LCD assembly. 2012-14 all work for testing."
    },
    {
        "post_id":26253,
        "thread_id":26203,
        "title":"[SOLVED]820-3662 No image no backlight",
        "user_id":1104,
        "username":"Jay",
        "post_date":"2017-10-02 12:39:18",
        "message":"The meter figures out the range itself, it picks up 5V as well as 60V or 0.020 mV and displays it properly. That said I don't have years of experience using a meter so.. that's just my observations.\nWould the Mac still chime if there's a CPU issue?\n\nA known-good display was tried before it was shipped to me and it had the same problem. All I have is 13\" 2013 displays to try, would that work? I know the techs at the shop this came from, they have the skill to properly troubleshoot so I don't doubt their KG equipment or methods. Once they believe it's board related they ship it to me, they don't tinker with it themselves. The connector and cable look good as new. The connector pins are all firmly connected to the board, the inside looks clean and ok as well."
    },
    {
        "post_id":26257,
        "thread_id":26203,
        "title":"[SOLVED]820-3662 No image no backlight",
        "user_id":1104,
        "username":"Jay",
        "post_date":"2017-10-02 13:21:25",
        "message":"I put the machine back together as I need some space for other repairs right now.\nAimed a bright LED light at the center of the screen and powered on. For a split second I see white lines on the screen, not visible without the LED light pointed at it. This is the same time as the chime is heard, maybe but barely before. Screenshot of a video recording I did:\n[ATTACH type=\"full\" width=\"200px\"]26258._xfImport[\/ATTACH]"
    },
    {
        "post_id":26270,
        "thread_id":26203,
        "title":"[SOLVED]820-3662 No image no backlight",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-10-02 21:01:33",
        "message":"Auto ranging meters are stupidly slow. No way to catch pulsing rails on these things.\nFirst thing is still to test with a known good LCD. Just dig up a few cracked test LCDs. Also check for any knocked off caps\/resistors in the data lines to the LCD."
    },
    {
        "post_id":26329,
        "thread_id":26203,
        "title":"[SOLVED]820-3662 No image no backlight",
        "user_id":1104,
        "username":"Jay",
        "post_date":"2017-10-03 21:16:47",
        "message":"KG display en route. Should get here same time as fine meter probes. To be continued."
    },
    {
        "post_id":26689,
        "thread_id":26203,
        "title":"[SOLVED]820-3662 No image no backlight",
        "user_id":1104,
        "username":"Jay",
        "post_date":"2017-10-11 12:19:45",
        "message":"KG display arrived, Mac is in perfect health. Lesson learned; test everything myself even if others have tested it already.\nThanks for the help along the way  guys :)\n\n(I don't know how to mark posts as solved, can an admin do so pls?)"
    }
]