[
    {
        "post_id":26609,
        "thread_id":26609,
        "title":"820-3787 No backlight, No liquid damage. Known good screen",
        "user_id":468,
        "username":"ALB-Repairs",
        "post_date":"2017-10-10 08:55:17",
        "message":"As titled, 3787 with a known good screen . Backlight enable is not present. VIN is present, Fuse is good, Power goes no further than Q7706 as normal when its not enabling. No shorts.ect\nWorks on external. Kinda at a loss as there is no sign of liquid anywhere on the machine so i dont know where to look\nAlso tried another WLED with no change."
    },
    {
        "post_id":26610,
        "thread_id":26609,
        "title":"820-3787 No backlight, No liquid damage. Known good screen",
        "user_id":557,
        "username":"MDY",
        "post_date":"2017-10-10 08:58:15",
        "message":"PWM?\nTried to conect enable to 3V_S0 rail?"
    },
    {
        "post_id":26635,
        "thread_id":26609,
        "title":"820-3787 No backlight, No liquid damage. Known good screen",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-10-10 14:04:59",
        "message":"Are you sure there is an image on the LCD? Testing with a 2012\/13 LCD? 2015 will not work."
    },
    {
        "post_id":27323,
        "thread_id":26609,
        "title":"820-3787 No backlight, No liquid damage. Known good screen",
        "user_id":468,
        "username":"ALB-Repairs",
        "post_date":"2017-10-26 04:38:51",
        "message":"There is no image on the screen. confirmed in OSX system preferences, this is the original display.\nThere is no keyboard backlight either, but the keyboard keys react as if the keyboard backlight is present. \n\nBut i have tried 4 or 5 different screens, some i know are from 13\/14 so should display but still nothing. Do you know if a 2012 panel will work to test a 3787? ive tried a known good 2012 assembly. \n\nConfused as to where to look as its not even recognising the display. LCD_HDP is 2.8V and l8300 is at 5V."
    },
    {
        "post_id":27325,
        "thread_id":26609,
        "title":"820-3787 No backlight, No liquid damage. Known good screen",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-10-26 05:18:06",
        "message":"5V on L8300 means it is detecting something. Did you put a flashlight on the back of the Apple logo to 100% confirm there is no image?\nInspected connector\/cable for damage?\nCheck if any caps in eDP lines are knocked off C8320 and friends, same for FL8300 and friends."
    },
    {
        "post_id":27329,
        "thread_id":26609,
        "title":"820-3787 No backlight, No liquid damage. Known good screen",
        "user_id":468,
        "username":"ALB-Repairs",
        "post_date":"2017-10-26 06:01:37",
        "message":"Yeah it detects something, Ive replaced the LVDS connector on the odd chance it fixed it (like one other odd one recently), But no dice, the cables are undamaged, and as stated ive tried other assemblies with clean cables.\n\nIn system preferences it only see's the external display. Ive tried putting a torch through and got nothing\n\nIll check for missing caps, but there are none near the LVDS, And ill check the filters coming from the LVDS. I dont have a good board to compare diode mode readings with so its becoming a nightmare."
    },
    {
        "post_id":27334,
        "thread_id":26609,
        "title":"820-3787 No backlight, No liquid damage. Known good screen",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-10-26 06:33:11",
        "message":"I did have a board once that had one of the 2 backlight chips that was fucked and it did not even get image. If all the caps and traces to\/from the LCD connector look good and you verified continuity from the caps to the end of a separate LCD cable then try replacing both backlight chips."
    }
]