{"post_id":46665,"thread_id":46665,"title":"820 2850 CPU1,2,3 running hot still after changing C9560","user_id":1517,"username":"jurgenkoppen","post_date":"2019-02-24 13:44:08","message":"I just replaced the cap, and it boots OK after some struggle, which I resolved with SMC and PRAM reset. Also replaced a corrupt HDD with a good one. But there is still too much heat according to HW sensor: Up to 94C in CPU1,2,3 and 71C at PCH. I checked the heatpipe as far as visible with board in, but did not see the liquid residue. Any clue where to look from here? Should I take off the heatpipe and put in new thermal paste?"}
{"post_id":46666,"thread_id":46665,"title":"820 2850 CPU1,2,3 running hot still after changing C9560","user_id":682,"username":"2informaticos","post_date":"2019-02-24 13:53:02","message":"Nothing wrong, it works really hot.\nI reached 102 degrees in tests with that board.\n\nHeaven will stay under 90 degrees after 15-20 minutes.\nBut in [url]www.meteoearth.com[\/url] temps go crazy high..."}
{"post_id":46672,"thread_id":46665,"title":"820 2850 CPU1,2,3 running hot still after changing C9560","user_id":1517,"username":"jurgenkoppen","post_date":"2019-02-24 18:25:04","message":"Thank you . I will check out your link asap."}
{"post_id":46686,"thread_id":46665,"title":"820 2850 CPU1,2,3 running hot still after changing C9560","user_id":1153,"username":"JohnB8812","post_date":"2019-02-25 09:07:52","message":"Yeah sounds like a fixed MacBook to me! They normally run hot because shitty design."}
{"post_id":46692,"thread_id":46665,"title":"820 2850 CPU1,2,3 running hot still after changing C9560","user_id":1517,"username":"jurgenkoppen","post_date":"2019-02-25 10:55:05","message":"Thank you JohnB8812. So in your opinion fresh Arctic Silver will be a waste of time? I think I read somewhere that the thermal paste tends to dry up after a few years, and that more recently developed pastes dissipate heat better...Just wondering if I can extend the life of this rig....I suggested to the owner to also put in an SSD drive to help with efficiency."}
{"post_id":46693,"thread_id":46665,"title":"820 2850 CPU1,2,3 running hot still after changing C9560","user_id":1153,"username":"JohnB8812","post_date":"2019-02-25 10:56:47","message":"New paste is ok. I recommend HY880. But I think this one is likely ok as long as it doesn't crash anymore."}
{"post_id":47728,"thread_id":46665,"title":"820 2850 CPU1,2,3 running hot still after changing C9560","user_id":1517,"username":"jurgenkoppen","post_date":"2019-03-22 19:20:21","message":"One more question semi relating to this: Can the 820-2915-B board with kernel panic also be fixed by replacing the olde C9560 cap? The boards look very similar and might be interchangeable?"}
{"post_id":47729,"thread_id":46665,"title":"820 2850 CPU1,2,3 running hot still after changing C9560","user_id":682,"username":"2informaticos","post_date":"2019-03-22 20:13:41","message":"C9560 is known as common issue for 2850, where GPU doesn't fail usually.\n\n2915 is known for GPU problems; sometime VRAM, or GMUX.\nThere are few mods to disable GPU on this board.\nBattery connector is different..."}
{"post_id":47730,"thread_id":46665,"title":"820 2850 CPU1,2,3 running hot still after changing C9560","user_id":1517,"username":"jurgenkoppen","post_date":"2019-03-22 20:36:31","message":"Thank you, 2informaticos. I was also considering replacing the infamous 2915 boards with the 2850, which are at least easily fixable, so my friends with the 2915s do not just have to sell it for parts. Albeit, I am keen on inexpensive parts....Anyways, most aspects seem to match the 2850,  which is really my favorite of that vintage,fixable, affordable, and besides the cap quite tough while  capable of running High Sierra with the 64bit structure."}
{"post_id":47731,"thread_id":46665,"title":"820 2850 CPU1,2,3 running hot still after changing C9560","user_id":1153,"username":"JohnB8812","post_date":"2019-03-22 21:12:27","message":"Yeah 110% of the time the GPU is dead on 2915. Not bad to replace with 3330 board on those and swap the LCD connector or jimmy rig the cable"}
{"post_id":47739,"thread_id":46665,"title":"820 2850 CPU1,2,3 running hot still after changing C9560","user_id":1517,"username":"jurgenkoppen","post_date":"2019-03-24 01:35:16","message":"OK, so I did another replacement of C9560 on a 2850 board, and it ran fine after with a fresh install with a High Sierra HDD. I used the cap I bought from Louis' store, the oversized unit, and also had replaced the trackpad, which had been the only error showing in ASD after the surgery. I was ready to give it to a new owner,but upon inserting the new owner's old SSHD (which came out of a screwed 2915), the 2850 did a panic again, even with the new cap. WTF!! Are there other reasons to panic on these 2850 boards beside the cap? I am attaching the error report, if that helps with figuring this out. Also currently running Disc Warrior on the new owner's SSHD (which had previously been in a 2915), and it showed 7 out of 10 in the optimisation index. So DW is about to rebuild it. Could it be that the machine did the kernel panic just because I installed his SSHD which was subjected to kernel panics in the owner previous 2915? Also attaching the DW report."}
{"post_id":47742,"thread_id":46665,"title":"820 2850 CPU1,2,3 running hot still after changing C9560","user_id":1517,"username":"jurgenkoppen","post_date":"2019-03-24 03:56:34","message":"Another factor which MIGHT play into the crash of my freshly re-capped 2850 has come to light: The SSHD I had tried to implant into the machine had a \" Logical Volume Group\" Type, and a \"Logical partition\" format. Being the rookie I still am ( for the time being) , I am drawing blanks as to what that means, other than that when I put my own \" Guide Partition Table \" formatted HDDs into the machine, it crashes no more. I am not sure if this is the right place to ask for some enlightenment on this, or maybe a link...but I thought I ought to try...? So now I am transfering my friends data from his logical partition drive to a guide partition HDD in the 2850, and so far , so good..."}
