{"post_id":98101,"thread_id":63771,"title":"A1278 intermittent question mark folder","user_id":32299,"username":"posarah","post_date":"2023-04-02 21:33:01","message":"Hi,\n\nquick question for the a1278 can you use any sata ssd for them or do you need to use a particular model? I know the a1502\/a1466 you have to use a transcend jet stream otherwise you will have sleep issues, so I wanted to make sure the a1278 isn’t similar.\n\nwe’ve gota a1278 in atm with the typical intermittent question mark folder. Sometimes you get it in cold boot other times it’s fine it boots to the os than after a hour or so it reboots and goes to the question mark folder. We were able to do a Time Machine backup and we’re able to restore it but that hasn't resolved the issue. Is there anything else I should be checking before replacing the hdd?\n\nthanks for your assistance."}
{"post_id":98107,"thread_id":63771,"title":"A1278 intermittent question mark folder","user_id":682,"username":"2informaticos","post_date":"2023-04-03 03:04:01","message":"You should try another HDD cable first."}
{"post_id":98127,"thread_id":63771,"title":"A1278 intermittent question mark folder","user_id":32299,"username":"posarah","post_date":"2023-04-03 18:52:54","message":"Ah of course sorry didn’t think of that. We’ve replaced the ssd, they actually had a hp ssd in there already so we replaced it with a Samsung.\n\nis there any particular test that seems to trip up the question mark folder more than others? We ran unigine overnight to try get it to fail but it’s still going so I’m wondering if there’s any other tests we can try? Or should we just replace the cable out of precaution? I’m a bit reluctant because we don’t have them in stock and the customers a bit antsy to get his laptop back."}
{"post_id":98129,"thread_id":63771,"title":"A1278 intermittent question mark folder","user_id":682,"username":"2informaticos","post_date":"2023-04-04 03:00:22","message":"Inspect HDD connector pins; resolder them if needed.\nThere may be some small coils, resistors and capacitors in series with data lines; check them and resolder.\n\nHowever, changing HDD cable is a \"must do\" in this case."}
