{"post_id":23828,"thread_id":23828,"title":"[SOLVED]820-3437-B - no green light. PPBUS_G3H missing","user_id":612,"username":"Atomrepair","post_date":"2017-08-04 09:02:25","message":"Water damage.\n\nI first got 0.48 volt on PPDCIN_G3H.\nI've replaced (from donor board):\n\nQ7010\nU7090\nQ7180\n\nreplacing the first two wasn't necessary, but after replacing Q7180, PPDCIN_G3H is 18V.\n\nCHGR_AGATE is 0V with U7100 present. I lifted U7100, CHGR_AGATE went to ~16V.\nAfter placing a (new) U7100, it went back down to 0V.\nResistance from CHGR_AGATE to ground is 845KOhm\n\nPPDCIN_G3H_INRUSH is 0V\n\nmeasured 9 Ohms on pin 1 of R7180. Seems a bit low, but I dont understand the Inrush circuitry. Some type of protection?"}
{"post_id":23829,"thread_id":23828,"title":"[SOLVED]820-3437-B - no green light. PPBUS_G3H missing","user_id":612,"username":"Atomrepair","post_date":"2017-08-04 09:41:02","message":"Update: found shorted caps in the PPDC_G3H_INRUSH circuit (C7130, C7131, C7135 and C7136). Not sure if all shorted, but replaced. Short to ground on this rail is now gone,but voltage on this rail and on PPBUS_G3H is only 1V.\n\nedit: Replaced Q7130 just to be sure, but no change."}
{"post_id":23836,"thread_id":23828,"title":"[SOLVED]820-3437-B - no green light. PPBUS_G3H missing","user_id":2,"username":"dukefawks","post_date":"2017-08-04 11:37:48","message":"The original defect was probably only those caps. The problem now is probably in the other stuff you did. Also power up without U7100 is pretty unsafe and can kill FETs.\n\nCheck Voltage on pin 2 of U7100 and check resistance between pins 17\/18 27\/28. Green then orange light present?"}
{"post_id":23899,"thread_id":23828,"title":"[SOLVED]820-3437-B - no green light. PPBUS_G3H missing","user_id":612,"username":"Atomrepair","post_date":"2017-08-07 02:31:16","message":"What FETS would be at risk if powering on without U7100? Q7130? If so, can you explain why? I assumed that with the gate signal from U7100 missing, nothing bad could happen.\n\nU7100 Pin 2 = 16.1 V\nresistance between 17\/18 = infinite\n27\/28 = 20Ohm\n\nR7151 is ~4 Ohm\nR7152 is 0.L\nR7150 has a large crack at pin 1\n\nNo light on charger"}
{"post_id":23916,"thread_id":23828,"title":"[SOLVED]820-3437-B - no green light. PPBUS_G3H missing","user_id":2,"username":"dukefawks","post_date":"2017-08-07 19:21:41","message":"17\/18 should have 2-3Ohm so there is a problem there. Shouldn't affect the green light though. Fix the R7150\/51\/52 issue so that pin 17\/18 measures 2-3 Ohm again. Also check ACOK. These boards will power on without a green light so if PPBUS comes up at 12.6V again then we can look at the green light issue."}
{"post_id":23932,"thread_id":23828,"title":"[SOLVED]820-3437-B - no green light. PPBUS_G3H missing","user_id":612,"username":"Atomrepair","post_date":"2017-08-08 02:39:38","message":"I've replaced R7150, R7151 and R7152. Resistance on pin 17\/18 is now 3.1 Ohm.\n\n\nI've replaced Q7180 again, as I wasn't sure of my earlier replacement there. After that, I got 8.6V on PPBUS_G3H.\n\nI replaced the slew of components I took out of the battery circuit, the LVDS connector, C8317, F7700 and Q7706 (all were shorted, broken and\/or disfunctional).\n\nLaptop is now powering on when I plug it in, and screen is working.\n\n[B]Remaining problems:[\/B]\n- Power button wont work\n- Laptop will turn on, but reboots twice while doing so. When it does get to the OS or ASD, it often reboots after a while anyway.\n- Battery not detected (battery could be bad, I dont have a known good one yet)\n- Charger light starts green, then goes orange (with or without battery inserted).\n\nManaged to run ASD EFI once, with default options except ram. It throws a few sensor errors (Th1H, TB0T, TB1T, TB2T) but everything else passes.\nASD OS - laptop started rebooting itself when about 75% through the tests. Didnt see the errors.\n\nPPBUS_G3H is now sitting at 8.2V. Board behaves the same as above, but keyboard& trackpad wont work when plugged in. The 8.2V stays.\n\nCouple of measurements:\n\nPP3V42_G3H    3,42V\nPP3V3_S5    3,33V\nPP5V_S5    5,12V\nPPVRTC_G3H    3,4V\nPM_DSW_PWRGD    3,4V\nSMC_RESET_L    3,4V"}
{"post_id":23958,"thread_id":23828,"title":"[SOLVED]820-3437-B - no green light. PPBUS_G3H missing","user_id":2,"username":"dukefawks","post_date":"2017-08-08 21:38:54","message":"Power button issue could also cause the shutting down. Could be bad keyboard or the trackpad\/flex cable\/connector.\nTurning on\/off 3 times before boot is normal.\nPPBUS is at 8.6V so battery data bus is probably ok. Looks like a dead battery to me.\nCharger light going green then orange even without battery is normal.\n\n8.2V on PPBUS means no communication from SMC. Could be crap under SMC\/dead SMC or crap under battery connector. I assume this is without battery connected.\n\nTBxT are all battery sensors, th1h I think is on the IO board on these airs, LIO finstack sensor. Bad IO board\/cable\/connector or crap under SMC."}
{"post_id":23973,"thread_id":23828,"title":"[SOLVED]820-3437-B - no green light. PPBUS_G3H missing","user_id":612,"username":"Atomrepair","post_date":"2017-08-09 04:16:35","message":"SMBUS_SMC_5_G3_SDA is 3 Ohms to ground, problem was in U7100, which was fine before I hooked that battery up.\nI've replaced U7100 again, which fixed the short. Both pin 5 and 6 of the battery connector are ~80k now, same as the donor boards I have.\nHowever, PPBUS_G3H remains at 8.2V. Could hooking up the battery from this laptop have damaged the SMC? The battery connector looks clean now (after a short UC session), but I neglected to check before plugging the battery in.\n\nIf SMC is the prime suspect I'll have to order a stencil for my BGA jig and wait for that. to arrive.\n\nI've added a few pics, might help. I'm ashamed of the way the new soldered in LVDS connector looks, but I'm holding off on adding a new one until the board is functioning properly.."}
{"post_id":24017,"thread_id":23828,"title":"[SOLVED]820-3437-B - no green light. PPBUS_G3H missing","user_id":2,"username":"dukefawks","post_date":"2017-08-09 21:29:52","message":"The SMC was probably killed. Yes a faulty battery can kill the SMC\/ISL6259 if the 8V battery voltage shorts out to the data pins. So this battery may be a killer.\n\nIt also has quite severe corrosion. The trackpad flex cable\/connector will certainly be a problem too....."}
{"post_id":24052,"thread_id":23828,"title":"[SOLVED]820-3437-B - no green light. PPBUS_G3H missing","user_id":612,"username":"Atomrepair","post_date":"2017-08-10 03:46:30","message":"Is there a way to check whether the battery is indeed the cause of this without hooking it up? Maybe by attaching it to my lab supply and measuring data lines?"}
{"post_id":24105,"thread_id":23828,"title":"[SOLVED]820-3437-B - no green light. PPBUS_G3H missing","user_id":2,"username":"dukefawks","post_date":"2017-08-10 20:45:35","message":"For the $40 I would just not risk it. Replacing another SMC is a lot more work...."}
{"post_id":24144,"thread_id":23828,"title":"[SOLVED]820-3437-B - no green light. PPBUS_G3H missing","user_id":612,"username":"Atomrepair","post_date":"2017-08-11 10:49:35","message":"I'm looking at getting SMC reballing stuff and have ordered a set of new batteries. Thanks so far Duke, I will report back later."}
{"post_id":25872,"thread_id":23828,"title":"[SOLVED]820-3437-B - no green light. PPBUS_G3H missing","user_id":612,"username":"Atomrepair","post_date":"2017-09-25 06:12:30","message":"Finally received my SMC jig last week, I got around to taking one off a donor board and reballing that. First time doing this sucked, but I got it on the board in the end. PPBUS is now back to 8.6. Machine runs off new battery and charges it as well.\nI also found a short to ground on the trackpad\/keyboard conn at pin 18, SMC_LSOC_RST_L, sadly not before trying to run the laptop with that shit connected. Everything still working, so it's hopefully still be ok.\nGoing to order me a trackpad and flex to see if that fixes the remaining problems. Probably not, I expect the keyboard will be messed up too but we'll see."}
{"post_id":25888,"thread_id":23828,"title":"[SOLVED]820-3437-B - no green light. PPBUS_G3H missing","user_id":296,"username":"jadao","post_date":"2017-09-25 19:23:32","message":"Does the short to ground remains on pin 18 when no cable is plugged in?\nIf so, you have c4836 and u5110 suspected to give SMC_LSOC_RST_L a path to ground.\nOtherwise, check trackpad\/keyboard, I doubt connector problem because there is no adjacent ground pins next to pin 18."}
{"post_id":25907,"thread_id":23828,"title":"[SOLVED]820-3437-B - no green light. PPBUS_G3H missing","user_id":612,"username":"Atomrepair","post_date":"2017-09-26 01:02:50","message":"[USER=\"296\"]jadao[\/USER] SMC_LSOC_RST_L is fine on the logic board itself (with nothing connected). I might have worded my last post a little unclearly. The short to ground is located on the trackpad pcb. I don't think I'll bother trying to fix that thing."}
{"post_id":26708,"thread_id":23828,"title":"[SOLVED]820-3437-B - no green light. PPBUS_G3H missing","user_id":612,"username":"Atomrepair","post_date":"2017-10-12 03:44:54","message":"After replacing the trackpad and flex cable, keyboard and trackpad are now working fine.\nThis board now passes all ASD tests apart from one: Fan Motor exhaust test 4.\n\nASD EFI error is:Motor is spinning slower than it should\nASD OS: Motor unable to stabilize between min and max limits\n\nPP5V_S0 at fan connector is at 5.1V.\nPP3V3_S0_FAN is at 3.3V\n\nFan actually seems to run fine. It's running silently when laptop isn't  stressed, loudly when it is.\n\nSeeing that I've replaced the SMC on this board, and that one of the inputs of Q6060  (which looks fine) comes from the SMC (SMC_FAN_0_CTL).. I think I know what the likely culprit is going to be, but I'd really hate pulling an SMC off an otherwise (finally) fully functional board at the risk of making it worse than it is now. Anything else I might do before messing with the SMC again? I've half a mind to run the thing through some serious stress testing to see whether an issue crops up."}
{"post_id":26709,"thread_id":23828,"title":"[SOLVED]820-3437-B - no green light. PPBUS_G3H missing","user_id":296,"username":"jadao","post_date":"2017-10-12 05:00:59","message":"Before reflowing\/relacing SMC: I see in your post that before relacing smc you ran ASD but it only reach about 75% of the test.\nCan you check if you might had this error before smc replacement? I don't remember when motor fan is done in asd sequence tests.\n\nDo you have a spare fan to test?\n\nMake sure resistors R6065 R6060 R6061 measure good an no sign of water corrosion"}
{"post_id":26711,"thread_id":23828,"title":"[SOLVED]820-3437-B - no green light. PPBUS_G3H missing","user_id":612,"username":"Atomrepair","post_date":"2017-10-12 05:32:08","message":"I've hooked everything up, assembled the machine fully and ran the tests again. Its passing the fan exhaust (and all other tests) in both EFI and OS versions of ASD.\nNot sure if intermittent issue or if something need to be connected for the fan to work, other than the fan itself"}
{"post_id":26718,"thread_id":23828,"title":"[SOLVED]820-3437-B - no green light. PPBUS_G3H missing","user_id":612,"username":"Atomrepair","post_date":"2017-10-12 10:10:21","message":"I've run ASD EFI and OS several times now (all default tests) and it's passing everything every time. I've booted up OS X and ran furmark (or whatever its called nowadays) for a couple hours without issues.\n\nAnything else I ought to do before calling this damn thing fixed?"}
{"post_id":28719,"thread_id":23828,"title":"[SOLVED]820-3437-B - no green light. PPBUS_G3H missing","user_id":612,"username":"Atomrepair","post_date":"2017-12-01 03:02:35","message":"This has been back at the customer for a while now and still running fine. Mark as solved please :)"}
