[
    {
        "post_id":66895,
        "thread_id":60208,
        "title":"820-01949-A  water damage.",
        "user_id":5210,
        "username":"KC Micro Tronix",
        "post_date":"2020-10-21 08:56:10",
        "message":"I know this is a snow ball's chance on the 9th plane of hell past the river Stix,  but if anyone knows were a board view is for this LB please PM me.\nI have a few pads that are way gone and I need to find the other side.\n\nIt would also be nice to know the processor power supply resistance measurements on the coils.   I have no reference boards for this machine.  I am reading 150 ohms and that seems unusual to me.\n\nI am able to get the CD3217's to talk to the charger and switch to 19v but current draw does not indicate CPU is firing up"
    },
    {
        "post_id":66900,
        "thread_id":60208,
        "title":"820-01949-A  water damage.",
        "user_id":1057,
        "username":"piernov",
        "post_date":"2020-10-21 10:39:19",
        "message":"Schematics\/boardview most likely won't leak before a few months. I have no idea how this board looks, but check if it's similar enough to 820-00850.\nThis has an Ice Lake CPU on 10nm, so it'd make sense for the resistance to be different from the previous gen (it was mostly the same through Skylake\/Kaby Lake\/Coffee Lake). Maybe it's comparable to A2179\/820-01958 but of course it's pretty new as well so not common to have one lying around either."
    },
    {
        "post_id":68589,
        "thread_id":60208,
        "title":"820-01949-A  water damage.",
        "user_id":1423,
        "username":"captainmac",
        "post_date":"2020-12-01 07:31:42",
        "message":"i know it's a farcry, but\ndid you figure anything out about this model yet? I'm looking at 00850 schematics but they're not really  similar enough to get anything useful. have one taking 20V @ 0.006Amps but nothing else. CPU gets like a couple degrees hotter than the rest of the board.. (nothing on any phases of VCORE)\nAnyone know if this board needs the battery to function? I've tried it ofcourse but cant be 100% sure that the battery is good and obviously dont just have one lying around..\nPPBUS is 12.6V, RTC is there, PP3V G3S is there, seems to be in S5 state, but nothing above that..\nHad some damage around one of the CPU Mosfets (nothing major, no burnt looking components) and some around what looks to be U9000"
    },
    {
        "post_id":75512,
        "thread_id":60208,
        "title":"820-01949-A  water damage.",
        "user_id":5210,
        "username":"KC Micro Tronix",
        "post_date":"2021-05-17 08:35:38",
        "message":"I still have nothing on the LB"
    },
    {
        "post_id":75526,
        "thread_id":60208,
        "title":"820-01949-A  water damage.",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-05-17 13:41:48",
        "message":"It is recognized in DFU at least?\nIt should, if all SLPS2R and AWAKE voltages are present.\nCheck the coils around PMU."
    }
]