{"post_id":49069,"thread_id":49069,"title":"820-00840 No Power (weird one)","user_id":1153,"username":"JohnB8812","post_date":"2019-05-10 16:46:36","message":"Have an 820-00840 for no power no liquid whatsoever no signs of drop damage either. When I first got it in, it had no PP3v3_G3H. Was missing enable so replaced U7000 and PP3v3_G3H came back but no 20 volts on DC-in. Replaced both CD3215's, and now, this one is weird. It will show 5 volts on DC in for about 10 seconds or so on both ports, then it will shoot up to 20 volts at 0.00 amps. PPBUS is not present. DC in is a steady 20 volts and PP3v3_G3H is a steady 3.4 volts. Any ideas where to begin? PPBUS is for sure missing and not shorted to ground. I seem to have 5 volts on my TBA VDD pins and current sense resistor are not blown. Have tried 2 ISL9239 chips so far.\n\nSomething I did notice too when this first came in was that when I would open the lid on the device, the fans would ramp up really quickly then shut off. With the battery connected, the device at first would give fan spin and then nothing when testing. That makes me suspect of an SMC or sensor issue as well."}
{"post_id":49073,"thread_id":49069,"title":"820-00840 No Power (weird one)","user_id":682,"username":"2informaticos","post_date":"2019-05-10 18:02:45","message":"So you get steady 20V at R7020 after 10s?\n\nCheck near the USB port.\nThere should be one chip which is not present on schematic, nor boardview.\nPI3USB32, does it have any burn sign?"}
{"post_id":49076,"thread_id":49069,"title":"820-00840 No Power (weird one)","user_id":1153,"username":"JohnB8812","post_date":"2019-05-10 19:12:46","message":"Yes after 10 seconds it stays steady at 20. Will check that on Monday to be sure didn?t see any liquid but could still be burned"}
{"post_id":49079,"thread_id":49069,"title":"820-00840 No Power (weird one)","user_id":682,"username":"2informaticos","post_date":"2019-05-11 04:15:50","message":"20V means SMC talks with charger.\nFor some other reason U7000 doesn't generate PPBUS_G3H.\nExtended thread on the forum didn't clarify yet how SMC\/U7000 assembly works.\nIf you have time, try to see if can get something disabling the communication between them.\nRemove F7000 and check if any voltage comes on (pin 1)."}
{"post_id":49135,"thread_id":49069,"title":"820-00840 No Power (weird one)","user_id":1153,"username":"JohnB8812","post_date":"2019-05-13 09:14:29","message":"Ok back to this one. The P13USB chip is present and not burned on this model at least no obvious damage that I can see. I removed F7000 and get zero volts on both sides of the fuse."}
{"post_id":49136,"thread_id":49069,"title":"820-00840 No Power (weird one)","user_id":1153,"username":"JohnB8812","post_date":"2019-05-13 09:27:47","message":"SMC_RST_IN is 0 volts, but based on the schematic, that doesn't matter as it comes from the keyboard.\nSMC_MPM_OK is missing, but SMC_AUX_OK is 3.4."}
{"post_id":49137,"thread_id":49069,"title":"820-00840 No Power (weird one)","user_id":682,"username":"2informaticos","post_date":"2019-05-13 10:19:49","message":"Thinking on its name, SMC_RST_IN should be good with 0V; high level means reset active.\nBetter to compare with good board; using same ISL9239.\n\nCHGR_A\/BMON should be close to 0V, check that.\nTry changing Q7030\/40.\n\nWe have feedback in other threads, where 13V has been confirmed on pin 1\/F7000 (with fuse removed)."}
{"post_id":49140,"thread_id":49069,"title":"820-00840 No Power (weird one)","user_id":1153,"username":"JohnB8812","post_date":"2019-05-13 11:03:33","message":"Ok that was my next guess being that U7000 was bad to begin with. Will replace Q7030\/40 and the ISL again to rule that out."}
