{"post_id":31579,"thread_id":31579,"title":"[SOLVED]820-2610 runs for a few minutes then stops abruptly","user_id":820,"username":"brrayne","post_date":"2018-02-15 01:10:23","message":"Hi there, I have an old 820-2610 that charges, starts, chimes, boots etc. but cuts out after running for a few minutes. Sometimes after one minute, sometimes after ten minutes, but it won't run for much longer than that.\n\nIt gets the all clear from ASD.\n\nI'm aware of the C7771 issue with this model, and have already replaced this cap.\n\nThere was a tiny bit of liquid corrosion around a couple of probe points (all cleaned up now), but I couldn't see any noticeable damage to any components.\n\nI'm still pretty new to this stuff, and am not sure where to start checking to find the fault, especially as it's able to enter an S0 state. I would appreciate any suggestions you can provide for diagnosing the issue.\n\nThanks in advance,\nBruce"}
{"post_id":31587,"thread_id":31579,"title":"[SOLVED]820-2610 runs for a few minutes then stops abruptly","user_id":2,"username":"dukefawks","post_date":"2018-02-15 07:32:56","message":"Depends where the corrosion was. Probably a corroded trace\/resistor in that area or corrosion under a chip."}
{"post_id":31627,"thread_id":31579,"title":"[SOLVED]820-2610 runs for a few minutes then stops abruptly","user_id":820,"username":"brrayne","post_date":"2018-02-15 16:53:05","message":"Thanks for that Duke.\n\nI really thought I'd exhausted all options around the small area of corrosion, but your reply made me go back and have an even closer look. I noticed that the corrosion had got into one of the three tiny drill holes to the top right of Q7058. I used a 0.5mm drill bit to drill out the hole, right through the board, and that seemed to fix it. It's been running happily for a couple of hours now.\n\nThanks again, and you can flag as \"solved\".\n\nBruce"}
{"post_id":31634,"thread_id":31579,"title":"[SOLVED]820-2610 runs for a few minutes then stops abruptly","user_id":820,"username":"brrayne","post_date":"2018-02-15 20:32:48","message":"I spoke too soon, it stopped again. I need to do some more investigating. I'll replace some components around the area of the original corrosion (the probe points between Q7970 and Q7058) and see if anything improves."}
{"post_id":31699,"thread_id":31579,"title":"[SOLVED]820-2610 runs for a few minutes then stops abruptly","user_id":820,"username":"brrayne","post_date":"2018-02-16 18:39:49","message":"This MacBook is now working perfectly, the only problem is that I didn't do anything else.\n\nAs I can't get it to play up anymore, it leads me to think that it's a cracked trace or a BGA ball that's intermittently making contact. I could end up losing days trying to find this problem, so I won't bother you with it anymore.\n\nOnce again Duke, thanks for your help.\nBruce"}
