{"post_id":8321,"thread_id":8321,"title":"820-3437, Boots, No Chime\/Video, Likely BIOS Issue?","user_id":515,"username":"SMMRepair","post_date":"2016-10-20 12:20:16","message":"Another board from my \"tough\" pile. This board has good green\/orange light, powers on, all rails present (including vcore @ 1.76v), but it has no chime and no video. I thought it might be a BIOS\/SPI ROM issue, and I noticed that I get 3.3v on pins 1, 2, 3, 7 and 8 of U6100, but not on pin 5 (SPI_MLB_MOSI) or 6 (SPI_MLB_CLK). I actually don't have a working board to compare values, but I believe those should be 3.3v, correct? I actually tried 3 known-good dumps from other boards of the exact same model (2014, 1.4, 4GB) without luck. Same exact issue, so I don't think the BIOS is communicating properly with the PCH.\n\nI get 0v at R6111 pin 1, R6112 pin 1, R6115 pin 1, and R6116 pin 1. All resistors in this circuit measure properly.\n\nAll other voltages present and look good. PCH gets appropriately warm. Any ideas here? All help appreciated."}
{"post_id":8325,"thread_id":8321,"title":"820-3437, Boots, No Chime\/Video, Likely BIOS Issue?","user_id":2,"username":"dukefawks","post_date":"2016-10-20 12:53:29","message":"Was this a liquid spill?"}
{"post_id":8328,"thread_id":8321,"title":"820-3437, Boots, No Chime\/Video, Likely BIOS Issue?","user_id":515,"username":"SMMRepair","post_date":"2016-10-20 12:56:27","message":"I actually don't think it was, but I can't be positive of that. This one has been in the pile for several months."}
{"post_id":8329,"thread_id":8321,"title":"820-3437, Boots, No Chime\/Video, Likely BIOS Issue?","user_id":2,"username":"dukefawks","post_date":"2016-10-20 13:01:37","message":"Have you removed J6100? Also I hope you saved the original BIOS file, you cannot just swap them around without ME region issues."}
{"post_id":8333,"thread_id":8321,"title":"820-3437, Boots, No Chime\/Video, Likely BIOS Issue?","user_id":515,"username":"SMMRepair","post_date":"2016-10-20 13:14:24","message":"Correct, I save all BIOS files. This one did not work with the original file, a cleaned ME region original file, a known-good\/clean ME Region blank serial file, known-good\/clean ME region with original serial and board number applied, etc. I get no progress (no delayed chime, nothing) from any of the files I tried. Even if I can get to a delayed chime boot, I can force update the EFI to resolve. I can't even get that far on this board, though, just a fan. No chime, etc. \n\nJ6100 has not been removed, and is clean (no liquid\/corrosion)."}
{"post_id":8335,"thread_id":8321,"title":"820-3437, Boots, No Chime\/Video, Likely BIOS Issue?","user_id":2,"username":"dukefawks","post_date":"2016-10-20 13:28:33","message":"If you remove the ROM totally the board should power cycle. Also with chip removed you can check diode mode on all pins."}
{"post_id":8351,"thread_id":8321,"title":"820-3437, Boots, No Chime\/Video, Likely BIOS Issue?","user_id":515,"username":"SMMRepair","post_date":"2016-10-20 15:51:59","message":"With SPI ROM chip removed, I get the slightest fan twitch ever, roughly every 5 seconds. Fan does not fully spin and doesn't give the cycle (on\/off\/on\/off) normally seen with missing BIOS.\n\nDiode readings for U6100 with chip removed:\n\nPin 1: .420\nPin 2: .408\nPin 3: 1.036\nPin 4: 0\nPin 5: .442\nPin 6: .444\nPin 7: .402\nPin 8: .348"}
{"post_id":8352,"thread_id":8321,"title":"820-3437, Boots, No Chime\/Video, Likely BIOS Issue?","user_id":2,"username":"dukefawks","post_date":"2016-10-20 16:10:28","message":"PCH is seeing the ROM then. It could be the SMC is not seeing the ROM because of corroded trace\/resistor. Especially pin 5 and 6 look a bit high, so check if those make it to the SMC"}
{"post_id":8355,"thread_id":8321,"title":"820-3437, Boots, No Chime\/Video, Likely BIOS Issue?","user_id":515,"username":"SMMRepair","post_date":"2016-10-20 16:42:26","message":"Thanks for all the help, dukefawks. I'll probably set this one aside and come back to it when I have time to remove\/replace the SMC after checking for continuity. I didn't want to just leave the thread unbumped, and will post back once I have a chance to remove the SMC and check to see if that's the cause. :)"}
{"post_id":8356,"thread_id":8321,"title":"820-3437, Boots, No Chime\/Video, Likely BIOS Issue?","user_id":2,"username":"dukefawks","post_date":"2016-10-20 16:50:52","message":"No need to remove it. Just remove the resistors to separate PCH\/SMC in the data lines and measure diode mode."}
{"post_id":8387,"thread_id":8321,"title":"820-3437, Boots, No Chime\/Video, Likely BIOS Issue?","user_id":515,"username":"SMMRepair","post_date":"2016-10-21 12:04:18","message":"Ahhh, ok. I'll do that this afternoon, then. What value should I expect if the SMC is continuous with the data lines? I guess I could test a known-good board, but just curious of what would be a \"good\" reading, and what would be \"bad\". I guess anything low is bad (no load)?"}
{"post_id":8388,"thread_id":8321,"title":"820-3437, Boots, No Chime\/Video, Likely BIOS Issue?","user_id":2,"username":"dukefawks","post_date":"2016-10-21 13:02:57","message":"Probably between .400 and .600."}
