{"post_id":81571,"thread_id":61860,"title":"820-00426 KP during Boot","user_id":4543,"username":"brunomotter","post_date":"2021-10-19 09:26:27","message":"Hello. Got this board here. It gives a KP when booting. I booted into verbose and got it filmed to see where it was panicking. Apparently it's related to USB because on nanosecond line of verbose it says last loaded kext is IOUSBHostHIDDevice, which obviously is related to USB function. I tried verifying R4600\/01 as I thought it could be some kind of current sensing issue and both read ok. I tried replacing U4600 and U4650 but still same. The board had some corrosion around R5250 and it was open, so I cleaned the area and replaced that. Also had some little corrosion on C8931, which I also cleaned and replaced. I'm stuck now. What else could I verify? Just to mention, I'm testing board alone in the desk right now, nothing connected to it except for external monitor via genuine thunderbolt to HDMI adapter, original 85W charger and a keyboard via USB and known good SSD with fresh MacOS installed. Same thing is happening.. KP during boot, related to USB"}
{"post_id":81576,"thread_id":61860,"title":"820-00426 KP during Boot","user_id":682,"username":"2informaticos","post_date":"2021-10-19 14:58:48","message":"\"last loaded kext is IOUSBHostHIDDevice\"\nThat is the last correctly loaded; problems appears in the next step, which could be GPU related, or something else.\n\nTry starting in safe mode.\nAlso try Windows 10 Live USB."}
{"post_id":81583,"thread_id":61860,"title":"820-00426 KP during Boot","user_id":4543,"username":"brunomotter","post_date":"2021-10-19 16:14:51","message":"No go with safe mode. Booting on windows live USB I get BSOD telling Stop Code: Driver IRQL No Less Or Equal\nWhat failed: ACPI.sys"}
{"post_id":81584,"thread_id":61860,"title":"820-00426 KP during Boot","user_id":4543,"username":"brunomotter","post_date":"2021-10-19 16:19:53","message":"Suspecting bad RAM here... I got errors like these on a MacBook Air some time ago and it turned to be a bad RAM module. But the problem is this piece of crap has 32 RAM modules and it's a no go to replace them all!"}
{"post_id":81585,"thread_id":61860,"title":"820-00426 KP during Boot","user_id":682,"username":"2informaticos","post_date":"2021-10-19 17:24:15","message":"Just in case, change the FDMF6808N chips..."}
