[
    {
        "post_id":37461,
        "thread_id":37461,
        "title":"820-3208a - paint damage.",
        "user_id":1466,
        "username":"jpadie",
        "post_date":"2018-07-22 10:43:30",
        "message":"I have an 820-3208a with paint spill in a bunch of places.  Seems to have got everywhere and although it was non-conductive paint, the board had serious damage around the pp3v42_g3H area on both sides of the board.  the stop mask has evaporated in a number of places; but I have rebuilt the whole of that area from Q9706 to the voltage divider feeding u6990.\n\nalso blown was D6905 and u3890 was very crispy.  stop mask stripped from underneath.  U9410 area nasty too.  Replaced U9410, U3890, D6905.\n\ngreen light on charger now.  But only 2.5v on pp3v42_g3h.  resistance to ground on pp3v42_g3h is 83ohm.  diode mode shows 4mv to L6995.  \n\n1.5v on PPBUS_G3H. and smc_reset_L is being kept low.   U5010 replaced just in case. \n\nvoltage injected on pp4v42 at C6992.  incrementally pushed it up to 5v with no excessive current use (10mA) and no heat at all on the board.\n\nany suggestions for this one would be welcome.\n\nthanks\nJustin"
    },
    {
        "post_id":37463,
        "thread_id":37461,
        "title":"820-3208a - paint damage.",
        "user_id":1718,
        "username":"Electrontechnician",
        "post_date":"2018-07-22 11:35:33",
        "message":"Was that latex paint?   That contains water and is also conductive due to many constitutions in that paint."
    },
    {
        "post_id":37464,
        "thread_id":37461,
        "title":"820-3208a - paint damage.",
        "user_id":1466,
        "username":"jpadie",
        "post_date":"2018-07-22 11:49:58",
        "message":"No idea.  Something must have been conductive to cause the fried board.  But when I measure the resistance across the remnants of the paint it is not conductive.  I've removed all the paint from the board and lifted and cleaned all the components with trace of paint on them apart from the usb as thunderbolt ports. Not sure how to remove them cleanly so I've just cleaned them with a toothbrush as best I can."
    },
    {
        "post_id":37527,
        "thread_id":37461,
        "title":"820-3208a - paint damage.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-07-24 18:16:57",
        "message":"You injected 5V on 3V42 line. That is VERY risky and could have damaged stuff. Probably crap under the SMC. I don't think on old board like this is worth putting time in if damage is severe."
    },
    {
        "post_id":37543,
        "thread_id":37461,
        "title":"820-3208a - paint damage.",
        "user_id":1466,
        "username":"jpadie",
        "post_date":"2018-07-25 02:26:27",
        "message":"Thanks for the reply.  We all have to learn somewhere and this is one of those boards.  Re the voltage on 3v42 - injecting 3.42v showed very low current draw and no heat in any of the circuits.  If there was a short (and it's measuring 83 Ohm whereas on other boards the 3v42 to ground is much higher, so there would seem to be something amiss,  then how would you recommend chasing down the short without increasing voltage and seeing what got hot?"
    },
    {
        "post_id":37562,
        "thread_id":37461,
        "title":"820-3208a - paint damage.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-07-25 17:34:48",
        "message":"You can't find a 83 Ohm short easily as it won't produce heat at 3V. Sometimes heat\/cold can point to a certain area\/part that is the problem. I would expect crap under the SMC"
    }
]