[
    {
        "post_id":74941,
        "thread_id":61128,
        "title":"820-01521 - No backlight",
        "user_id":427,
        "username":"overshoot",
        "post_date":"2021-05-01 23:54:48",
        "message":"Hi,\n\nI have that bloody board that has no backlight.\nIt has image, I can confirm that and it works fine on an external screen.\nTest screen is working fine and has been tested with another board.\n\nI'm getting the EDP_BKLT_EN at 3.3V on both side of R8442 and it goes to the backlight driver as well.\nI've checked around the backlight driver and no signs of liquid. The only signs of liquid damaged were found around Q7660 but I am getting a stable 5.12V on PP5V_G3S (area has been cleaned)\nI've already replaced the driver 2 times as I am not getting it to switch. On my working board, BKLT_SD goes from 12.44V to 6V (multimeter used here) and backlight comes on.\nOn the faulty board, it stays at 12.44V.\n\nOne thing that I've noticed is the I2C signals stay at 5.12V all the time whereas with the working board, there's a drop to 4V at some point (which indicates no communication with the screen on the faulty board)\n\nI've checked continuity from the I2C signals testpads next to R8453 and R8452 to the screen connector and it's good.\nI'm banging my head against the wall on that one.\nShould be simple shouldn't it be?!"
    },
    {
        "post_id":74942,
        "thread_id":61128,
        "title":"820-01521 - No backlight",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-05-02 00:30:07",
        "message":"Not so simple for sure.\nApart of enable, I2C communication with display is required; PCH sends it first EDP_BKLT_PWM.\nCompare diode mode readings on these signals with good board.\n\nDo PRAM reset 2-3 times, just in case."
    },
    {
        "post_id":74946,
        "thread_id":61128,
        "title":"820-01521 - No backlight",
        "user_id":427,
        "username":"overshoot",
        "post_date":"2021-05-02 01:58:18",
        "message":"I already did the PRAM reset.\nI've measured that EDP_BKLT_PWM signal and I am getting 2.4V on the faulty board.\nI'm getting .75 on both good and faulty board in diode mode.\nThe I2C signals also compares same on both board, around .47 in diode mode."
    },
    {
        "post_id":74955,
        "thread_id":61128,
        "title":"820-01521 - No backlight",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-05-02 14:15:38",
        "message":"2.4V looks good, but you should check if there is PWM signal for sure (o-scope).\nYou may have bad contacts at LCD connector.\nCheck BKLT_SCL\/SDA lines with o-scope."
    },
    {
        "post_id":75171,
        "thread_id":61128,
        "title":"820-01521 - No backlight",
        "user_id":427,
        "username":"overshoot",
        "post_date":"2021-05-07 03:33:41",
        "message":"C8512 was shorted. I should have tried the thermal camera right away.\nWould have saved me from redoing the LVDS connector.\nOh well... you live and learn.\nThanks for your help"
    }
]