{"post_id":8878,"thread_id":8878,"title":"820-0165-A resterting","user_id":316,"username":"G.Beard","post_date":"2016-10-30 12:03:30","message":"Hi.\n\n[B]Damage[\/B]\nLiquid damaged board. Light corrosion.\n\n[B]Corroded areas[\/B]\nU5110, U7090, R5117, R5641, R5193.\n\n[B]Replaced[\/B]\nAll replaced along with everything that directly connects aside from the SMC.\n\n[B]Problem[\/B]\nPowers on, chimes, stays on for long enough to get to boot options then restarts, chimes. As though PRAM reset but after boot option or during boot\n\n\nThought maybe there is still a problem with SMC reset or thermal trip or the SMC itself.\nDon't want to just go pulling the SMC off willy-nilly.\nNot sure of how to check for on SMC reset.\nChecked CPU_THEMTRIP_3V3, is low when powered until reset then goes high. Can't tell what one is happening first, reset or high.\n\n\nAnything else it could be?\nWhat should I be looking for here please?"}
{"post_id":8880,"thread_id":8878,"title":"820-0165-A resterting","user_id":2,"username":"dukefawks","post_date":"2016-10-30 13:36:39","message":"Probably corrosion under SMC or around CPU power supply. Does it stay on a blinking question mark or also reboot?"}
{"post_id":8882,"thread_id":8878,"title":"820-0165-A resterting","user_id":316,"username":"G.Beard","post_date":"2016-10-30 13:56:46","message":"Restarts during boot or question mark or loading ASD. With or without trackpad or any other peripherals.\n\nI'll take the first option and slap a new SMC on since that is where the corrosion was close to.\nEverything else looks clean and perfect..... And I mean clean, this MacBook could have belonged to the boy in the bubble.\n\nI'll test CPU power and try SMC and report back."}
{"post_id":9391,"thread_id":8878,"title":"820-0165-A resterting","user_id":316,"username":"G.Beard","post_date":"2016-11-08 17:43:40","message":"Still got this board here. Replaced the SMC, checked CPU power looks OK. This is the same one that ran ASD when it should not have. Replaced with freshly flashed SPI clean ME, serial blanked.\nThe machine will not power from battery. Powers on from charger then loops on \/ off.\nGetting green \/ orange.\n\nNo idea where I need to be looking now. Been over and over this board looking for visible clues."}
{"post_id":9393,"thread_id":8878,"title":"820-0165-A resterting","user_id":2,"username":"dukefawks","post_date":"2016-11-08 17:46:00","message":"What is PPBUS, without battery of course."}
{"post_id":9406,"thread_id":8878,"title":"820-0165-A resterting","user_id":316,"username":"G.Beard","post_date":"2016-11-08 20:43:42","message":"Ppbus_g3h = 8.58v"}
{"post_id":9410,"thread_id":8878,"title":"820-0165-A resterting","user_id":2,"username":"dukefawks","post_date":"2016-11-08 21:19:40","message":"Is it still coming on to a screen then shut down?"}
{"post_id":9412,"thread_id":8878,"title":"820-0165-A resterting","user_id":316,"username":"G.Beard","post_date":"2016-11-08 21:39:02","message":"[QUOTE=\"dukefawks, post: 9410\"]Is it still coming on to a screen then shut down?[\/QUOTE]\n\nYep, if I hold alt it will go to the boot menu screen then just restart and dong. If I just leave it, it will attempt to boot, restart and dong. Tried with nothing but screen and battery plugged, same thing. Tried with known working everything. Same."}
{"post_id":9414,"thread_id":8878,"title":"820-0165-A resterting","user_id":2,"username":"dukefawks","post_date":"2016-11-08 22:24:05","message":"I have no more ideas. The only board I had with similar issues had corrosion under one off the CPU FET drivers like U7320."}
