{"post_id":25312,"thread_id":25312,"title":"2014 MacBook Pro 15\" 820-3662 shutting down","user_id":135,"username":"bjf","post_date":"2017-09-13 16:37:08","message":"I have this computer that is shutting down during use. It was not a liquid-damaged board. It's an IG board which I've rarely, if ever, seen have issues like this. I've tried narrowing down the variables but I'm not getting far. EFI and OS ASD both came back fine. The console log is just registering a normal shutdown. Any ideas how to proceed with something like this?"}
{"post_id":25322,"thread_id":25312,"title":"2014 MacBook Pro 15\" 820-3662 shutting down","user_id":2,"username":"dukefawks","post_date":"2017-09-13 20:05:27","message":"Yeah fuck these boards, I have had a bunch with the same shit. Haven't figured it out yet."}
{"post_id":25354,"thread_id":25312,"title":"2014 MacBook Pro 15\" 820-3662 shutting down","user_id":135,"username":"bjf","post_date":"2017-09-14 11:32:59","message":"The only thing I've discovered is that it doesn't happen with the battery disconnected. I can get it fail with full certainty by turning it on and going to Console, but when I disconnect the battery, it won't turn off. That's all I have so far."}
{"post_id":25355,"thread_id":25312,"title":"2014 MacBook Pro 15\" 820-3662 shutting down","user_id":145,"username":"Sykulski","post_date":"2017-09-14 13:43:21","message":"I also get these ones in regularly. I stopped posting about the issue about a year ago after a couple of threads in here with no solution to the problem. Please make a sticky about it if a common issue with a solution is found some day..."}
{"post_id":25368,"thread_id":25312,"title":"2014 MacBook Pro 15\" 820-3662 shutting down","user_id":2,"username":"dukefawks","post_date":"2017-09-14 21:22:17","message":"Without battery the CPU is clocked down. So the issue could be in the CPU Vcore supply. It could be the battery but I doubt that."}
{"post_id":25372,"thread_id":25312,"title":"2014 MacBook Pro 15\" 820-3662 shutting down","user_id":383,"username":"roy.ruan","post_date":"2017-09-14 22:12:51","message":"don't think it's the battery personally, had seen few of these, i tried replacing the IC for the GPU, but no luck"}
{"post_id":25389,"thread_id":25312,"title":"2014 MacBook Pro 15\" 820-3662 shutting down","user_id":1,"username":"larossmann","post_date":"2017-09-15 11:32:17","message":"I fixed this once by replacing the entire CPU vcore power supply and it never came back. I tried it again on another with the same issue and it was not fixed, so I have no real solution"}
{"post_id":25794,"thread_id":25312,"title":"2014 MacBook Pro 15\" 820-3662 shutting down","user_id":135,"username":"bjf","post_date":"2017-09-22 13:31:49","message":"I switched out U7310, U7320, U7330, U7200 and all the big caps (pulled from a 2015 board). No change. Worth a shot though. CPU voltage disappears, the screen stays on (but goes black) for a few seconds and then it shuts down."}
