{"post_id":90768,"thread_id":62859,"title":"820-02020-A Liquid damage and power cycling","user_id":32528,"username":"GfilipeZ","post_date":"2022-07-05 14:09:14","message":"Hi,\n\nThis is my first M1. I feel a little lost and not knowing where to start.\n\nThe machine had a liquid damage, next to UC300; UC710; JR940 and UP900.\nI did reflow to the IC's. In the measurements I didn't find any low resistance value (short circuit) and the IC's output voltages are correct.\n\nWith the battery disconnected, the machine is in a loop. The chime is heard, it reaches 20.3V for 1 second and returns to 5V again.\n\nWith the battery connected, it also loops. But after restarting 6 times, it apparently ends up booting (it always remains in 20.3V during de loops, doesn't fall to 5V). But only the desktop image and the mouse appear. The icon user does not appear, not even to enter the password.\n\nMost likely I will have a short circuit, which I am not able to identify."}
{"post_id":90771,"thread_id":62859,"title":"820-02020-A Liquid damage and power cycling","user_id":682,"username":"2informaticos","post_date":"2022-07-05 15:13:35","message":"First of all, welcome to the forum!\n\nA short circuit should prevent the board to turn on.\n\nTry to put the machine in DFU mode.\nIf there is important data, do Revive; not Restore, which will erase SSD."}
{"post_id":90868,"thread_id":62859,"title":"820-02020-A Liquid damage and power cycling","user_id":32528,"username":"GfilipeZ","post_date":"2022-07-08 08:19:23","message":"Hi [USER=682]@2informaticos[\/USER],\n\nThank you, for your reply.\nI tried the revive, but still the same.\n\n\nI've been thinking a little more about this problem and analyzing the schematic. In practice the conclusion I came to is that the external monitor is being identified as a secondary monitor. That's why, only the desktop image appears, and the user icon does not appear.\n\n\nFrom what I understood from the schematic, the display is identified by the signal LPDP_INT_HPD. That goes directly to the U0600 processor. I have already removed the connector JP600, in case there is any corrosion. I checked the voltage of this signal, and it is approximately zero.\n\nHow is it possible for the machine to continue to identify the external monitor as secondary? Even if there is no voltage present at LPDP_INT_HPD?\nDo M1 work differently from Intel?\n\nCould it be a processor malfunction?\nOS restore will be my last solution as the customer wants to recover the data."}
{"post_id":90875,"thread_id":62859,"title":"820-02020-A Liquid damage and power cycling","user_id":682,"username":"2informaticos","post_date":"2022-07-08 09:57:57","message":"If no internal LCD detected, you should get welcome screen on external monitor.\nReally strange to get the desktop before logging into macOS.\n\nCan you access Internet Recovery on external monitor?\nTry to save the data puting the machine in Target Disk mode."}
