[
    {
        "post_id":88732,
        "thread_id":62617,
        "title":"820-02016 Bootlooping",
        "user_id":2207,
        "username":"macfixer",
        "post_date":"2022-04-21 02:40:39",
        "message":"Hello friends,\n\nHave a board here that was in an accident on a stovetop about a year ago, customer came in with it for bootlooping issue.\nDFU does not work, have tried forcing DFU using the pads cloes to trackpad connector.\nNo visible damage on board or daughter board at all, only damage from the stovetop is slightly melted right speaker, as well as messed up plastics on the bottom cover.\nIt bootloops at 50% loading bar. Tried with and without battery, same symptoms.\n\n\n[ATTACH]60587[\/ATTACH][ATTACH]60588[\/ATTACH]\n[ATTACH type=\"full\"]60589[\/ATTACH][ATTACH type=\"full\"]60590[\/ATTACH]"
    },
    {
        "post_id":88733,
        "thread_id":62617,
        "title":"820-02016 Bootlooping",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-04-21 03:27:35",
        "message":"First of all, welcome to the forum!\n\nIt fails DFU, or you can't access it at all?\nTry forcing with DFU pads and JT400 disconnetced."
    },
    {
        "post_id":88736,
        "thread_id":62617,
        "title":"820-02016 Bootlooping",
        "user_id":2207,
        "username":"macfixer",
        "post_date":"2022-04-21 03:48:08",
        "message":"Thank you!\n\nIt doesnt pop up in AC2 at all, keeps bootlooping\n\nDoing the DFU key combo presents me nothing, I forced with DFU pads but it keps up the same symptoms, the bootlooping. JT400 was disconnected when i forced DFU"
    },
    {
        "post_id":88749,
        "thread_id":62617,
        "title":"820-02016 Bootlooping",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-04-21 10:30:25",
        "message":"Can you acces Internet Recovery, or enter Target Disk mode?\nIf not, may have a problem with the keyboard, or trackpad."
    },
    {
        "post_id":88778,
        "thread_id":62617,
        "title":"820-02016 Bootlooping",
        "user_id":2207,
        "username":"macfixer",
        "post_date":"2022-04-22 02:46:54",
        "message":"Tested the M1 boot menu thing by holding power button, to try share disk as well as recovery, no response.\n\nGonna try moving the board to a known working chassi."
    },
    {
        "post_id":88781,
        "thread_id":62617,
        "title":"820-02016 Bootlooping",
        "user_id":2207,
        "username":"macfixer",
        "post_date":"2022-04-22 03:02:34",
        "message":"Moved board to the working chassi, no change"
    },
    {
        "post_id":88788,
        "thread_id":62617,
        "title":"820-02016 Bootlooping",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-04-22 04:50:27",
        "message":"Looks like bad T2..."
    },
    {
        "post_id":88797,
        "thread_id":62617,
        "title":"820-02016 Bootlooping",
        "user_id":2207,
        "username":"macfixer",
        "post_date":"2022-04-22 07:00:22",
        "message":"M1 air has no T2 ;)"
    },
    {
        "post_id":88799,
        "thread_id":62617,
        "title":"820-02016 Bootlooping",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-04-22 07:54:53",
        "message":"M1 is real SOC (System On Chip); all is there, CPU with embedded security functions (RAM included also).\nWe still refer to SMC functions on other machines where SMC is already embedded into T2.\n\nIf you like the correct expression, then bad M1.\nSupposing a malfunction of the part corresponding to T2 heritage functions."
    },
    {
        "post_id":88800,
        "thread_id":62617,
        "title":"820-02016 Bootlooping",
        "user_id":2207,
        "username":"macfixer",
        "post_date":"2022-04-22 07:56:52",
        "message":"Alright im following then, thanks for the help!"
    },
    {
        "post_id":92899,
        "thread_id":62617,
        "title":"820-02016 Bootlooping",
        "user_id":5210,
        "username":"KC Micro Tronix",
        "post_date":"2022-09-28 13:27:04",
        "message":"I have one of these too.   It lets me select startup options then after a few seconds flashes a purple screen for 1\/20th a second and resets.   DFU nothing works.   Must be a core RAM issue or something on the M1.    I have seen a few of these M1's die for no reason at all.\n\nI just reflowed the M1 and jiggled it around a bit.    Let's see if that helps......\n\nIt did not help.\n\nWhen loading startup options I now get a cursor in the upper left which is new.   Not a pink flash.   But then it goes out and just restarts same as before.\nThe NAND seemed good with simple diode \/ resistance testing.   We are looking a RAM problem on the M1 is my guess.  It could also be NAND but NAND is not over heating.  I would have to pull the NAND to find out.   I don't have a programmer for this generation of NAND and it's underfilled.  If I ever get caught up and want to play around I may attempt a NAND \/ M1 swap for the fun of it.  I am sure the Metcal can move that IC.\n\nThe next one of these I encounter I am just going to Total it.  This will make a nice donor.   I know the M1 PMIC is good and the CD3217's  all of which will get harvested as needed. \n\nIf anyone else encounters this and has success with it please msg me on the board or text (913) 901.7626"
    }
]