{"post_id":41935,"thread_id":41935,"title":"820-4924 Works fine on battery or plugged in, but not together","user_id":135,"username":"bjf","post_date":"2018-11-09 01:13:32","message":"This will work completely fine either way, but if you have the battery plugged in and then plug in the power adapter the MagSafe light goes out and it will just run on battery. It will run fine though plugged in with no battery attached. I've replaced the ISL. PPBUS is at 12.63V. Battery is at 11.3V which is the same on a known-good board. Board was liquid-damaged and originally had 1.5V on PPBUS. I changed the ISL and that fixed that. I've measured every component in the power circuit and checked for any shorts or incorrect diode measurements compared to a good board. No difference that I can find. I've replaced Q7155, Q7130 and Q7180. Not sure what I'm missing."}
{"post_id":41938,"thread_id":41935,"title":"820-4924 Works fine on battery or plugged in, but not together","user_id":682,"username":"2informaticos","post_date":"2018-11-09 03:21:28","message":"Post CHGR_AMON and CHGR_BMON with charger and battery both connected.\nDid you try to start in SMC bypass mode?\nCheck resistance to ground for SCL\/SDA lines on battery bus; diode mode, red probe to ground."}
{"post_id":41965,"thread_id":41935,"title":"820-4924 Works fine on battery or plugged in, but not together","user_id":1153,"username":"JohnB8812","post_date":"2018-11-09 08:58:52","message":"Current sensing for sure fine?"}
{"post_id":41978,"thread_id":41935,"title":"820-4924 Works fine on battery or plugged in, but not together","user_id":135,"username":"bjf","post_date":"2018-11-09 12:48:46","message":"I’ve tested the usual spots many times as I’ve had to keep going over things to try to find an answer. Current sensing, data lines, diode measurements on pins on ISL, surrounding component values and diode measurements - nothing is off.\n\nThe MagSafe light dies immediately when I plug it in. The power adapter is not happy. My main test adapter is not coming back on, even after sitting unplugged overnight. Looks like it was killed by the board. My other ones are managing to recover once I let them sit unplugged for about 10 minutes.\n\nSMC-bypass works fine without battery but does nothing with it plugged in. No power. Same situation as normal mode.\n\nSDA on battery connector: .502\nSCL on battery connector: .504\nR4439 and R5429 are measuring fine. Diode measurements are good also.\n\nCHGR_AMON is at 0V with battery and adapter plugged in.\nCHGR_BMON is at .052V\n\nDiode measurements on both AMON and BMON are both normal at .712 and .722 respectively.\n\nPPBUS (battery only): 11.34V\nPPBUS (power adapter only): 12.63V\nPPBUS during SMC-bypass (without battery plugged in): 12.32V\n\n———————————\n\nFor Reference:\n\nWith Known-Good Board (and same battery)\nCHGR_AMON: 1.367V\n.712 in diode mode\n\nCHGR_BMON: .052V\n . 724 in diode mode\n\nPPBUS (battery only) 11.34V\nPPBUS (power adapter only) 12.55V\n\nSMC bypass works fine with and without battery plugged in. Fan spins up high and PPBUS voltage drops to 12.24V"}
{"post_id":41981,"thread_id":41935,"title":"820-4924 Works fine on battery or plugged in, but not together","user_id":1153,"username":"JohnB8812","post_date":"2018-11-09 13:28:58","message":"Check resistance between pins 17\/18 and 27\/28 of the ISL6259"}
{"post_id":41982,"thread_id":41935,"title":"820-4924 Works fine on battery or plugged in, but not together","user_id":682,"username":"2informaticos","post_date":"2018-11-09 13:29:13","message":"\"CHGR_AMON is at 0V with battery and adapter plugged in.\nCHGR_BMON is at .052V\"\nLooks like no consumption at all from charger.\nSystem sinks aprox 0.3A from battery...\n\nPost pins 1 & 26 of U7100 in this case.\nMaybe need to change Q7180."}
{"post_id":41984,"thread_id":41935,"title":"820-4924 Works fine on battery or plugged in, but not together","user_id":135,"username":"bjf","post_date":"2018-11-09 13:42:21","message":"Pin 1: .636 in diode mode\nPin 26: .634\n\nI did change Q7180 once already.\n\nAs far as voltage coming from the adapter, it's dying immediately. It's going into some type of serious shutdown\/failure. I just lost two more. They won't come back after letting them sit unplugged for about 30 minutes. It's a nice i7 16GB board but I might have to pull the plug on this soon. I can't keep losing good 85 watt adapters."}
{"post_id":41989,"thread_id":41935,"title":"820-4924 Works fine on battery or plugged in, but not together","user_id":682,"username":"2informaticos","post_date":"2018-11-09 14:51:41","message":"Need voltages at these pins; sorry for mistyping...\nAlso post PPBUS with both charger and battery connected."}
{"post_id":42033,"thread_id":41935,"title":"820-4924 Works fine on battery or plugged in, but not together","user_id":135,"username":"bjf","post_date":"2018-11-09 21:48:21","message":"PPBUS is the same as when the adapter is not plugged in. 11.32V.\nPin 26: 10.8V\nPin 1: 0V\n\nKeep in mind though, the adapter is literally getting friend the moment I plug it in. These measurements might not be affected at all by the adapter being plugged in. Not sure though. You'll know better than me. My grasp of the circuit is limited. It does trigger the auto-turn-on so something is happening when you plug it in."}
{"post_id":42036,"thread_id":41935,"title":"820-4924 Works fine on battery or plugged in, but not together","user_id":135,"username":"bjf","post_date":"2018-11-10 01:34:38","message":"I just noticed that U7100 is getting extremely hot, right up near 100°C. I didn't have the battery plugged in. Any idea what would cause that?"}
{"post_id":42037,"thread_id":41935,"title":"820-4924 Works fine on battery or plugged in, but not together","user_id":135,"username":"bjf","post_date":"2018-11-10 02:15:14","message":"Well, not quite sure what was happening, but R7192 looked a little crooked. I resoldered it and reflowed U7190 a little and the temperatures came way back down to normal. Board is charging normally now. Done. Thanks for the help."}
