[
    {
        "post_id":84666,
        "thread_id":62168,
        "title":"820-00928 No POST",
        "user_id":4543,
        "username":"brunomotter",
        "post_date":"2022-01-07 10:20:22",
        "message":"Hello. Got this board here which had contact with shampoo(don't ask me how). It got soaked in shampoo by right USB-C ports and fluid got into the machine on upper part of the board near to CPU and GPU. U7230 was melted and I replaced it. There were a bunch of blown caps also which I replaced. After that, I cleaned the board in ultrasonic cleaner to remove shampoo residues from the board and from under BGA chips. The board is turning on and pull 1.2A from charger(96W original apple charger with original USB-C cable), but gives no POST. Things I've already tried: verified all SPI termination resistors, tested with new known good bios but still same results. No POST, no chime, no image, just CPU and GPU get hot but nothing else. \n\nLA350 - 0.903V\nLA650 - 0.901V\nLA640 - 0.903V\nL7330 - 1.050V\nL7231 - 1.065V\nL7221 - 1.059V\nL7211 - 1.059V\nL7420 - 0V\nL7410 - 0V"
    },
    {
        "post_id":84669,
        "thread_id":62168,
        "title":"820-00928 No POST",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-01-07 10:33:59",
        "message":"Very likely CPU got damaged; because overvoltage through U7230."
    },
    {
        "post_id":84682,
        "thread_id":62168,
        "title":"820-00928 No POST",
        "user_id":4543,
        "username":"brunomotter",
        "post_date":"2022-01-07 15:47:47",
        "message":"Is there any way to make sure it's CPU? I was already suspecting it may got damaged, but anyway."
    },
    {
        "post_id":84685,
        "thread_id":62168,
        "title":"820-00928 No POST",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-01-07 17:45:44",
        "message":"If you cannot find any corroded passive component, no too much to do then.\nCan also be corrosion under some BGA chip; maybe broken solders."
    }
]