{"post_id":94937,"thread_id":63395,"title":"Mac air & baby sick?","user_id":35752,"username":"Anterweb","post_date":"2022-12-18 15:33:20","message":"Am I going mad or do these new air models not have the logic board number printed on them? \nAll I could find is this... \n[ATTACH]60904[\/ATTACH][ATTACH]60905[\/ATTACH]\n\nThis lady just dropped this off telling me her 5 month old baby was sick on it. She said she cleaned it with baby wipes and now it won't come on! \n(IT FUCKING STINKS!) \n\nSo it does turn on, with backlight but no image, I get a chime and it charges, tried external display and got one then it went off, then it came on again then I couldn't get one at all so give up for the night. \n\n\n\nTried again today opened it up and it's immaculate inside, no liquid sensors triggered no sign of moisture at Al it looks like new both sides of the board. \n\nThen I tried external display again and it was on the user log in screen with it auto typing into the log in box.. Stuck key maybe?\n\nI then notice that if I power it off holding the power button it just turns itself back on again. \n\nIt also speaks to me and says \"username\" if I hit f12. \n\nSo I'm guessing the keyboard \/ TP are liquid damaged and the logic board is OK? but question is would this prevent the screen form working? I get backlight nothing else. \n\nI'm thinking if this is a new screen keyboard and tp it's not an economical repair. Your advice appreciated"}
{"post_id":94938,"thread_id":63395,"title":"Mac air & baby sick?","user_id":682,"username":"2informaticos","post_date":"2022-12-18 20:04:45","message":"Check the model printed on the backcover.\nA1932 -> 820-01521.\nA2159 -> 820-01598.\nA2179 -> 820-01958.\nCan also be M1 Air."}
{"post_id":94940,"thread_id":63395,"title":"Mac air & baby sick?","user_id":35752,"username":"Anterweb","post_date":"2022-12-19 01:01:26","message":"[IMG alt=\"20221218_202951.jpg\"]https:\/\/boards.rossmanngroup.com\/data\/attachments\/4\/4058-5b821f8a177843a2d449e2072dd6331f.jpg[\/IMG]\nIts an A2179"}
{"post_id":94943,"thread_id":63395,"title":"Mac air & baby sick?","user_id":682,"username":"2informaticos","post_date":"2022-12-19 04:26:13","message":"Looks like sticky key there.\nBeing T2 machine, it will auto power on if any key, or trackpad is pressed.\nThat's the reason doesn't stay off after holding power button."}
{"post_id":94944,"thread_id":63395,"title":"Mac air & baby sick?","user_id":35752,"username":"Anterweb","post_date":"2022-12-19 04:36:15","message":"What about no screen just backlight. Would keyboard trackpad issue cause this or you think the screen is fucked to? Trying to establish if its worth attempting to repair this? I don't have any donor parts for this to even try them."}
{"post_id":94947,"thread_id":63395,"title":"Mac air & baby sick?","user_id":682,"username":"2informaticos","post_date":"2022-12-19 06:24:26","message":"This looks like LCD issue.\nYou must test with known good compatible screen.\nBroken one, where you can see small part of image, is good enough for diagnostic."}
