{"post_id":19784,"thread_id":19784,"title":"820-4924 - No fan","user_id":767,"username":"pws6074","post_date":"2017-05-05 16:43:36","message":"Guys, \n\nI already fixed PPBUS \/ Backlight and battery issue, but i can figure out the FAN.\nI get 5V pin 1, but the fan doesn't spinning .\n\nSome hint?"}
{"post_id":19785,"thread_id":19784,"title":"820-4924 - No fan","user_id":515,"username":"SMMRepair","post_date":"2017-05-05 16:55:27","message":"Fan doesn't spin automatically on-boot with the 4924. It only turns on under heavy load; if you want to test it, run something load-heavy and wait a bit. It'll turn on."}
{"post_id":19787,"thread_id":19784,"title":"820-4924 - No fan","user_id":767,"username":"pws6074","post_date":"2017-05-05 17:00:49","message":"Yes, i did that."}
{"post_id":19788,"thread_id":19784,"title":"820-4924 - No fan","user_id":515,"username":"SMMRepair","post_date":"2017-05-05 17:13:46","message":"If the unit isn't shutting down, or throttling performance due to the heat, and you have 5v on the fan, and the fan is plugged in, then it's probably fine. It's certainly POSSIBLE there's an issue with the fan, but I really think it's just not being told to turn on yet. Run FurMark on it for a few minutes at 4X AA. It'll turn on. If not, it will shut down. Either way you'll find out the issue. My money is on the fan being fine."}
{"post_id":19791,"thread_id":19784,"title":"820-4924 - No fan","user_id":767,"username":"pws6074","post_date":"2017-05-05 17:20:04","message":"I test wih Mac Fan control and then works.\nWithout the software, get's really hot and the fan not turn on"}
{"post_id":19796,"thread_id":19784,"title":"820-4924 - No fan","user_id":515,"username":"SMMRepair","post_date":"2017-05-05 17:30:45","message":"You would be surprised HOW hot these things can get before the fan turns on. Again, if the unit isn't shutting down or throttling performance, it's probably fine. I've had so many customers think their unit was broken because the fan didn't spin. After 5-10 minutes of FurMark\/CPU stressing via terminal, the fan kicks on fine. Try it."}
{"post_id":19802,"thread_id":19784,"title":"820-4924 - No fan","user_id":2,"username":"dukefawks","post_date":"2017-05-05 20:28:59","message":"Turn on and hold D key, it will run diagnostic."}
