[
    {
        "post_id":62224,
        "thread_id":59649,
        "title":"820-00165 Short Troubleshooting",
        "user_id":26765,
        "username":"sws",
        "post_date":"2020-07-10 13:50:32",
        "message":"Hello,\n\nSeems like 820-00165 day on the forum.  I'm working with an 820-00165 board that had a blown F7140.  Fixed that but still no power or fan spin and found there to be a short on C7313.  Replaced C7313 and now I get fan spin, high speed, but no green light on charger.  It also seems like there may be another short somewhere on the board.  Sometimes taking a voltage measurement causes the board to reset itself or it may be coincidence with the board resetting(?)\n\nI'm not sure which issue to address first or how to proceed from here.\n\nP5VS0_EN is 5.18V\nPPBUS_G3H 8.57V\nSMC_BC_AOK: 3.374V\nP1V8S3_PGOOD: 3.341V\nPPDCIN_G3H: 15.04V\nSYS_ONEWIRE: 0.946V (moving with a +\/- 0.025V).\nSMC_S5_PWRGD_VIN: 3.374V\nSMC_P1V05S0_VSENSE: 1.054V\nP1V05S0_PGOOD: 3.340V\nALL_SYS_PWRGD: 3.341V\nSMC_RESET_L: 3.375V\nResistance to ground on SMC_RESET_L: 174KOhm\nCHGR_RST_L: 3.374V"
    },
    {
        "post_id":62227,
        "thread_id":59649,
        "title":"820-00165 Short Troubleshooting",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-07-10 14:10:20",
        "message":"\"SYS_ONEWIRE: 0.946V\"\nThis signal is pulled-up inside LIO board.\nTry another LIO board\/flex.\n\nConnecting only power cable from LIO board, check for activity at MLB USB port.\nYou should also get image on internal LCD."
    },
    {
        "post_id":62240,
        "thread_id":59649,
        "title":"820-00165 Short Troubleshooting",
        "user_id":26765,
        "username":"sws",
        "post_date":"2020-07-10 21:05:33",
        "message":"Well, J7000, the connector for the charger board may have been the cause of the issues.  It broke off the motherboard before I could test this.  So now I need to find the connector on mouser or find a donor board that has the same connector for cheap.  At the risk of going off-topic in this thread, anyone know of another board that has the same style connector or a source for good donor boards these days?  I looked at some others that I had around but none are the same; no MB Airs around.\n\nSteve"
    },
    {
        "post_id":62241,
        "thread_id":59649,
        "title":"820-00165 Short Troubleshooting",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-07-11 01:12:19",
        "message":"Make stock of scrap boards for replacement parts.\n\nMany times I talked about galaxyelectronics2015 eBay seller, who can provide best price if contact him directly.\nHe has many boards unlisted and is also present on Aliexpress, UltimateElectronics Store."
    },
    {
        "post_id":62261,
        "thread_id":59649,
        "title":"820-00165 Short Troubleshooting",
        "user_id":26765,
        "username":"sws",
        "post_date":"2020-07-11 23:07:25",
        "message":"Putting closure on this one, it was related to the LIO - though specifically the J7000 connector on the motherboard itself.  One of the pins on there must have been broken already which caused inconsistent behavior and maybe was responsible for the initial fuse issue. Once I finished the job of breaking it off completely I was able to work around the broken connector and the board now turns on, boot chimes, and shows the question mark folder, awaiting a drive and OS install.\n\nThanks for the help\n\nSteve"
    }
]