{"post_id":45989,"thread_id":45989,"title":"820-00281 waterdamage - no image?","user_id":149,"username":"Fizzl92","post_date":"2019-02-11 08:48:58","message":"Hello,\nthis 820-00281 was waterdaamaged. Just J4402 and J3300 were burned (Pin 22 and 56). The rest of the machine looks fine. I replaced them and run a jumper for PP5V_S0_T139. Pin 56 on J3300 is just a Testpoint) After that i checked all pins for connection to the pads aswell as for shorts to other pads and to GND. Everything looked fine. So i put it in the ultrasonic tested it and now it turns on (drawing ~1,2A). It spins the fans from the first second and activates the backlight after a few seconds. Also a external mouse stays on and it can charge it now at all 4 ports (at the damaged connector the amp meter didn?t even activate before). The trackpad stays clickable. The problem is that is shows nothing on the screen (an external monitor does not activate at all). So i am stuck here as it could be a problem with the video-out over the USB-Cs, an issue with the ininternal screen communication\/power and\/or something completely different..."}
{"post_id":45994,"thread_id":45989,"title":"820-00281 waterdamage - no image?","user_id":682,"username":"2informaticos","post_date":"2019-02-11 12:07:29","message":"Did you try it without touchbar connected?\nCheck DFR_TOUCH_LID level.\n\nAny liquid sign at J8500?\nLook close to pin 43; that could kill U9850 MUX.\n\nCan you confirm USB acitivity for sure?\nUse USB pendrive with OSX; if flashes is OK (start with boot menu, or disconnect J9600)."}
{"post_id":46000,"thread_id":45989,"title":"820-00281 waterdamage - no image?","user_id":149,"username":"Fizzl92","post_date":"2019-02-11 12:53:52","message":"Thank you for the answer.\nI tryed with everything disconnected - no change.\nDFR_TOUCH_LID seems to be straight 0V\nJ8500 looks perfektly fine - liquid only hit the one \"wing\". The rest of the board looks also like new\nBut i could not confirm USB activity (Mouse seems to work but my USB drive (Mavericks is my newest one with an LED indicator) did not light up.\nI did try without Liveboat already - no change..."}
{"post_id":46017,"thread_id":45989,"title":"820-00281 waterdamage - no image?","user_id":682,"username":"2informaticos","post_date":"2019-02-11 18:34:11","message":"If backlight comes on, seems that LCD is recognized.\nBoard should work for that; unless gets stuck after few seconds.\n\nDo PRAM reset.\nUse USB mouse light as indication, instead of chime.\nIf you have an USB-C volt-ampermeter, it can help you to detect board activity."}
{"post_id":46037,"thread_id":45989,"title":"820-00281 waterdamage - no image?","user_id":149,"username":"Fizzl92","post_date":"2019-02-12 01:42:25","message":"Mouse light stays on aswell as the fans but i could force a PRAM reset with an external keyboard i think as the backlicht turns of and back on after a few seconds. USB-C ampmeter stays at ~1,4A during the reset. No change so far.\nBut the amp meter gives another hint. So the Board turns on but after 5 Seconds the amp reading goes back down to 0A and after another 3 seconds back up to normal. No idea what this means. After that the board stays powered on ."}
{"post_id":46039,"thread_id":45989,"title":"820-00281 waterdamage - no image?","user_id":682,"username":"2informaticos","post_date":"2019-02-12 04:05:04","message":"These new boards are very sensitive to liquid spill; CPU gets damaged so easy.\nSome data lines from inside board can be affected.\nStrange to react at PRAM reset with external keyboard and not for internal..."}
{"post_id":46051,"thread_id":45989,"title":"820-00281 waterdamage - no image?","user_id":149,"username":"Fizzl92","post_date":"2019-02-12 05:34:47","message":"My guess is that the internal kayboard (or a few keys) is not working => no reset possible (Caps Lock is also not working...)\nIstn`t there anything i can do - specially as the customer needs the data and it actually turns on now...\nIs target disk mode still possible on these newer ones via an USB-C to Thunderbold adaptor? I already ordered the tool that connects to the lifeboat as last chance but it needs time to arrive..."}
{"post_id":46056,"thread_id":45989,"title":"820-00281 waterdamage - no image?","user_id":149,"username":"Fizzl92","post_date":"2019-02-12 06:49:51","message":"Update:\nWhile i was testing every szenario that came into my mind i also tested with the battery (not for the first time). It charges the battery with 4A and turns on from battery. Is this a model that needs a good battery to work?\nBut the interesting part is that it actually istn?t completely dead because it showes me the \"empty batttery\" symbol if i start it from battery sometimes. If i plug it in or just leave it like this it just stays at that screen forever. So i guess CPU is alive and its charging but something with the video is messed up and the picture is freezing or something. Could this be caused be a problem with CPU\/GPU Vcore or something?"}
