{"post_id":47288,"thread_id":47288,"title":"820-00281, No Boot, Fans Spin.","user_id":515,"username":"SMMRepair","post_date":"2019-03-11 17:43:06","message":"Have an 820-00281 that's actually powering on (fan spins), but then it cuts off soon after. CPU isn't getting very warm (oh no), and ppbus_g3h is at 12.67v, but should be closer to 13.1v I believe. I'd normally suspect a CPU or BIOS issue with these symptoms, but aren't so sure on newer models. Would like some confirmation here before getting that far.\n\nNo liquid, no drop or any other damage. I'll gather measurements now and will add them in, but wanted to ask first if ppbus_g3h being ~12.67v is \"too low\" for this model? I know ~12.26v on the older boards means SMC is not turning on (or isn't communicating with ISL), but typically that would result in no fan spin. On these newer models, would they be able to have fan spin if SMC is bad? I'd not think so, but wanted to check, as I've seen in some other threads that ppbus being 12.6v could indicate an issue.\n\nWill return with more measurements shortly, thanks in advance!"}
{"post_id":47291,"thread_id":47288,"title":"820-00281, No Boot, Fans Spin.","user_id":515,"username":"SMMRepair","post_date":"2019-03-11 18:19:12","message":"OK, some more measurements:\n\nppbus_g3h: 12.6v (should be 13.1v?)\npp3v3_s5: 3.3v\npp3v3_g3h: 3.42v\npp5v_s5: 5v\npp3v0_g3h: 3v\npp1v0_sus: 1v\npp5v_s4: 0v\np5vs4_pgood: 0v\npm_slp_s5_l: 0v (primary issue I believe--I can't get into s4 because of no pm_slp_s5_l)\ns5_pwrgd: 3.3v\npp2v9_sysclk: 3v\n\nAt U7650, we're missing p5vs4_en_rcd (enable 1), which I imagine is due to pm_slp_s5_l missing. \n\nCombine missing pm_slp_s5_l with the \"cold CPU\" and I get concerned. No damage to board, no liquid, etc, just a lifeless CPU. Any idea what I can check on this model to figure out what's causing no PM_SLP_S5_L?\n\nWould ppbus being low (SMC?) be the reason for PM_SLP_S5_L missing? But, would I get fan spin if SMC was at fault? SMC_PM_G2_EN is present (as are all s5 signals through pgood). The hang up appears to be S4 switch, which relies on PM_SLP_S5_L.\n\nAny advice appreciated!"}
{"post_id":47292,"thread_id":47288,"title":"820-00281, No Boot, Fans Spin.","user_id":515,"username":"SMMRepair","post_date":"2019-03-11 18:22:07","message":"Also, if someone happens to have a working BIOS dump for the 00820 and could post it, that would be very, very appreciated!"}
{"post_id":47293,"thread_id":47288,"title":"820-00281, No Boot, Fans Spin.","user_id":682,"username":"2informaticos","post_date":"2019-03-11 19:27:51","message":"Your board is stuck in S5 state, so no reason for CPU to get hot at all.\nI suppose PCH gets hot through RTC, S5, or SUS power rails.\nDo you note that with heatsink?\nDoes it get very hot without heatsink?\n\nLower PPBUS_G3H means bad communication between SMC and U7000; this may not affect all SMC functions.\nBad PCH\/CPU probably means trash board.\nRemember PPBUS_G3H issue in case you want to reuse SMC; you can discard\/confirm that issue then."}
{"post_id":47319,"thread_id":47288,"title":"820-00281, No Boot, Fans Spin.","user_id":515,"username":"SMMRepair","post_date":"2019-03-12 09:16:40","message":"Thanks so much, I appreciate it! The PCH does not get warm, no; nothing gets warm really at all--CPU has a very, very, very slight warmth (5% of normal), but not much at all.\n\nJust to confirm: PPBUS_G3H on this model should definitely be 13.1v, correct? And it being 12.6v indicates an SMC\/U7000\/Comms\/Trace issue (similar to 12.26v on older boards), correct? So I should go ahead and replace U7000, then the SMC, and see if it resolves? I just want to confirm that ppbus should be 13.1v on this model before assuming the issue is a low ppbus and wasting the time; I know on some other models, the schematics are wrong, and ppbus actually differs from what's written (i.e. on the older 17\" boards, for example).\n\nCan you please let me know if there's anything else I should check prior to replacing U7000? Thanks again!"}
{"post_id":47321,"thread_id":47288,"title":"820-00281, No Boot, Fans Spin.","user_id":515,"username":"SMMRepair","post_date":"2019-03-12 10:59:22","message":"OK, a bit of an update, as behavior has changed:\n\n1. I think ppbus being 12.6v is fine. I think this might be acceptable, and have found threads previous with the 15\" Touchbar boards having ppbus at 12.6v. I'm going to assume this is unrelated to the issue. Also, I don't believe I'd see any sign of fan spin if ppbus were not correct (or sufficient), and it isn't running on 5v, so all seems well with SMC-->ISL comms.\n2. To be sure there was no crap under SMC (even though this wasn't a spill unit), I went ahead and reflowed the SMC, U7000 and USB-C controllers.\n3. I noticed the CPU actually DOES get very, very hot for a very short time--i.e. ~1 second--right when I hit the power button (or connect charger). I didn't notice this at first, because CPU spikes in heat and then cools off within just a few seconds. I thought it wasn't getting hot at all, but it is.\n4. I got the board installed back into the unit and it now charges\/powers\/boots--hooray!\n\nMight have just been a case of crap under SMC or USBC controllers. Who knows, but we'll see if it continues to work without issue. I've seen similar behavior on units with failing SMCs (inconsistent power over days\/weeks, etc). Will be interesting to see if that issue extends to the newer models, so will update thread if anything changes."}
{"post_id":47330,"thread_id":47288,"title":"820-00281, No Boot, Fans Spin.","user_id":682,"username":"2informaticos","post_date":"2019-03-12 18:05:23","message":"Good to hear that.\nPlease check PPBUS_G3H now, with the board in the case (working).\nI was thinking ISL9239 should generate 13V in all boards..."}
{"post_id":47337,"thread_id":47288,"title":"820-00281, No Boot, Fans Spin.","user_id":1153,"username":"JohnB8812","post_date":"2019-03-12 19:56:27","message":"I'd bet was possibly crap under a chip somewhere. 12.6 is normal I can confirm have had several 15\" Touchbars with 12.6 Apple just wants to fuck with us with 13.1 on the 13\"s haha."}
{"post_id":47345,"thread_id":47288,"title":"820-00281, No Boot, Fans Spin.","user_id":682,"username":"2informaticos","post_date":"2019-03-13 03:27:53","message":"Did you read it on F7000\/01?\nBe aware, L7030 pin 1 is not the good test point; pin 2 yes, is OK..."}
