[
    {
        "post_id":14638,
        "thread_id":14638,
        "title":"820-4924 Chimes but nothing happens after that",
        "user_id":67,
        "username":"bighead",
        "post_date":"2017-02-10 12:36:40",
        "message":"Hi,\n\nThis is the second time I got this MacBook back for repair.\nFirst time there was no backlight. The unit was not liquid damaged.\nQ7700 was the problem. After I change that the backlight come on.\n\nAgain this unit wasn't liquid damaged.\n\nCustomer said he has the some problem after took it home.\nNo picture on the screen.\n\nSo I checked it and turned it on and we got a picture. We tried 3-4 times\nand the 5th time the MacBook just hangs with the backlight on.\nNow I can not get this unit boot. It just hangs.\n\nIt chimes but you have to wait for the chime like 10seconds.\nCPU gets extremaly hot and the fan does not turn on.\nI know the fan won't turn on on this unit until it gets hot. But this gets f..ing hot.\nLike burning your finger. The voltage on the CPU Vcore is 1.8V.\n\nI checked the board again but can't see any problem. It reacts for the PRAM reset.\nI tried to unplug everything, no luck.\n\nPCH\/CPU failed?\n\nThank you."
    },
    {
        "post_id":14640,
        "thread_id":14638,
        "title":"820-4924 Chimes but nothing happens after that",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-02-10 12:40:01",
        "message":"Removed SSD? Disconnect IO board? It should come up the the question mark."
    },
    {
        "post_id":14641,
        "thread_id":14638,
        "title":"820-4924 Chimes but nothing happens after that",
        "user_id":67,
        "username":"bighead",
        "post_date":"2017-02-10 12:46:35",
        "message":"I removed everything just left the LCD on it. I even tried it without LCD and connected an external display.\nNothing."
    },
    {
        "post_id":14645,
        "thread_id":14638,
        "title":"820-4924 Chimes but nothing happens after that",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-02-10 13:27:26",
        "message":"Too much of a coincidence. This must have been liquid or impact damage. ROM corrupted maybe?"
    },
    {
        "post_id":14647,
        "thread_id":14638,
        "title":"820-4924 Chimes but nothing happens after that",
        "user_id":67,
        "username":"bighead",
        "post_date":"2017-02-10 13:37:51",
        "message":"One thing is 100% and that is this wasn't liquid damaged. I can't tell that if there was any impact damage or not.\nThere is no visible dent\/ding on the MacBook. This thing came with those ugly plastic\/rubber case.\n\nIf I can get it boot again then probably the original problem was this aside from the backlight problem.\nI'll try a different rom. There is nothing to lose at this point."
    }
]