{"post_id":30940,"thread_id":30940,"title":"[IDIOT]820-3302 (iMac late 2013) and 820-3126-A (iMac 21 2011) power on problem","user_id":1186,"username":"Salvatore951","post_date":"2018-02-01 04:14:28","message":"I have two iMac 21\" received by two different customer, they have both the same problem. Logic board sometimes doesn't turn on (only first led turns on the board) when that happens, I have to unplug power cable for fa while and then iMac start to work normally.\nWhen imac turns on, it works perfectly, I have already tried with other working power supply on both.\nCould be an SMC problem?"}
{"post_id":30948,"thread_id":30940,"title":"[IDIOT]820-3302 (iMac late 2013) and 820-3126-A (iMac 21 2011) power on problem","user_id":2,"username":"dukefawks","post_date":"2018-02-01 08:15:21","message":"2 completely different machines, are you expecting a \"fix all\" answer? With the 2011 machine it is usually the video card, I have never figured out the actual issue with the card but it is not the GPU. Try a known good card.\n\nThe 3302 I have no idea, it could be absolutely anything."}
{"post_id":30966,"thread_id":30940,"title":"[IDIOT]820-3302 (iMac late 2013) and 820-3126-A (iMac 21 2011) power on problem","user_id":1186,"username":"Salvatore951","post_date":"2018-02-01 15:00:34","message":"I have written that only first led tuns on, second led doesn't turn on, this issue has nothing to do with gpu. It could be a power rail or smc issue. \nHonestly this forum is becoming useless, most of the answer I read in all topic are useless, superficial and obvious. Only Louis' answer are always useful, but he reply rarely, maybe he hasn't enough time. Why Why Louis doe not make a video of iMac board?"}
{"post_id":30975,"thread_id":30940,"title":"[IDIOT]820-3302 (iMac late 2013) and 820-3126-A (iMac 21 2011) power on problem","user_id":2,"username":"dukefawks","post_date":"2018-02-01 17:02:36","message":"2nd LED is ALL_SYS which will not light up if videocard does not give power good signal. I guess you know better though....\n\nGoodbye!"}
