{"post_id":99849,"thread_id":63964,"title":"820-02016 A2337 missing backlight","user_id":28497,"username":"iMuhtaseb","post_date":"2023-06-11 04:05:40","message":"Hello,\n\nThis computer firstly was brought in for a no power issue. Visual inspection showed no corrosion whatsoever, but showed one of the CD3217 blown up.\nAfter replacing it the computer remained taking 5V on one port and 20V on the other although the CD3217 I took is from an M1 MacBook Pro (820-02020) but IDK.. anyway that's not the issue.. the computer was still not powering on even on 20V.. I noticed some consumption on the ammeter I took the thermal camera and noticed U5700 was heating up (3.8 AON generator).. I took it off and replaced it..\n\nAfter this the computer boots but with no backlight\n- tested a good display, still no backlight\n- tested without the audio board, guessed maybe it could do something funky, still no backlight\n- measured backlight fuse it was OK\n- checked backlight Vsense on backlight chip there were 12V\n- Backlight enable from PMU is there. \n- Measured some values of resistance to few resistors and noticed backlight 5V A resistor (RP845) should be 0 ohms and it read 200 ohms I have replaced it\n- Measured 5V D resistor and it was 50 ohms instead of 0, I took the voltage readings and it was 5.188V precisely as it should; have not replaced it\n- Both 5V D and A are showing as 5.188V exactly.\n- I have measured BK_SD (backlight shutdown) and it was 12V telling the backlight to reset.\n- I have replaced UP800 from A1502; still no backlight.\n\n\nWhat am I supposed to do next?"}
{"post_id":99850,"thread_id":63964,"title":"820-02016 A2337 missing backlight","user_id":682,"username":"2informaticos","post_date":"2023-06-11 04:34:20","message":"Classic failure on this case is RD560.\nCheck if not corroded.\nAlso check continuity until UC710.\n\nDo you get correct 3V3_S2 voltage?\nIf yes, then check UC120 voltages."}
{"post_id":99858,"thread_id":63964,"title":"820-02016 A2337 missing backlight","user_id":28497,"username":"iMuhtaseb","post_date":"2023-06-11 08:01:32","message":"I don't want to sound dumb but what does 3V3_S2 has to do with backlight?  😅\n\nAnyway, I checked RD560\nPPBUS = 12V\nPPBUS_3V3S2_VIN = 12V\n\nUD560 had 12V on IN+ and IN-. VS\/enable were available too but INA_3V3S2HS_IOUT was 0v\nI replaced RD560 and UD560 and still not getting INA_3V3S2HS\n\nAlthough PP3V3_S2 is present and UC710 had all of its voltages except for P3V3S2_FB..\n\nI was measuring P3V3S2_FB and computer stopped working all of the sudden.. plugging in the charger ammeter turns on with 5V then it shuts down.. a few seconds then it does it again.. it's slower than a normal cycle.\nSomething gone wrong while I was probing P3V3S2_FB.\n\nI measured PP3V3_S2 and it now it seems shorted to ground.. I removed the coil and measured and short was on the S2 side not switching side..\nI injected 0.5v and UP701 (display switch) heated up.. removed it and still short it there, short is not clear as before but there's low resistance to ground. Before it was 0.001 on diode mode now its 0.039. With the S2 coil removed the computer takes 20V again and when I measure 3v3_S2 it fluctuates."}
{"post_id":99859,"thread_id":63964,"title":"820-02016 A2337 missing backlight","user_id":682,"username":"2informaticos","post_date":"2023-06-11 09:43:29","message":"\"I don't want to sound dumb but what does 3V3_S2 has to do with backlight?\"\n2.4V on 3V3_S2 causes missing backlight.\nAnd this was reported several times on the forum.\nOf course, only peoples who read more posts can find intersting information.\nYou can learn a lot from other members threads.\nJust take notes and save time, when you face the same problems.\n\nIf you had correct 1V8 output from UC120, why did you check more pins of it???\nIf you remove UC120, there is still low diode mode on 3V3_S2 line?"}
{"post_id":99867,"thread_id":63964,"title":"820-02016 A2337 missing backlight","user_id":28497,"username":"iMuhtaseb","post_date":"2023-06-12 02:02:01","message":"I made a typo on my previous post \"Although PP3V3_S2 is present and [U]UC120[\/U] had all of its voltages except for P3V3S2_FB..\"\nI mentioned UC120 but I was speaking about UC710.\n\nIt's difficult for a technician to go through every post reading and taking notes on all cases of all kinds, that's why logic.wiki and repair.wiki are there.. shame no one adds those valuable informations to those sites.\n\n3v3_S2 is being very low diode mode still until I have removed all chips associated with it; UC810, U900, UC830, UP701\ndiode mode went up and its being generated successfully without fluctuation.\nI have measured UC810 the chip itself its resistance to ground and there isn't any.. I went back and replaced it and immediately diode mode lowered back I haven't even returned all the chips back just UC810..\nIDK what causes this to happen and its so weird..\n\nAfter returning UC810 and turning the laptop 3v3_S2 is present stable but sadly the computer is no longer POSTing and I cannot see anything on screen; it's a matter of backlight issue anymore.. I took the current sense resistor RD810 the one after UC810 exactly and I measured PP3V3_S2_WLBT in diode mode and it's lower that 3v3_S2 :whistle:"}
{"post_id":99868,"thread_id":63964,"title":"820-02016 A2337 missing backlight","user_id":682,"username":"2informaticos","post_date":"2023-06-12 03:06:31","message":"Did you resolder back all components?\n\n\"I mentioned UC120 but I was speaking about UC710.\"\nDo you get correct 1V8 output from [U]UC120[\/U]?"}
{"post_id":99877,"thread_id":63964,"title":"820-02016 A2337 missing backlight","user_id":28497,"username":"iMuhtaseb","post_date":"2023-06-12 06:28:50","message":"1.8V output from UC120 is there yes. \n\nI returned everything except for UC830 which seems to be bad; I measured in diode mode for its readings, the thermal\/ground pad was not in continuity with the pin8 of ground.. and on other legs it read OL."}
{"post_id":99881,"thread_id":63964,"title":"820-02016 A2337 missing backlight","user_id":682,"username":"2informaticos","post_date":"2023-06-12 08:38:40","message":"Not all chips have thermal pad connected to ground internally."}
