[
    {
        "post_id":12532,
        "thread_id":12532,
        "title":"820-3435 Macbook Air SMC_RESET_L and No Power Button",
        "user_id":110,
        "username":"MOberdick",
        "post_date":"2017-01-09 08:35:42",
        "message":"As the title says, I have a 3435 Air board that has no power button functionality but all other keys work. Followed back from keyboard connector to the SMC Reset circuit and I'm assuming this is where the problem lies. This board was very lightly water damaged but has been cleaned and this is the only remaining symptom. As of right now I have 3.4v on both SMC_ONOFF_L and SMC_LSOC_RST_L with a charger plugged in. When I plug a battery in (charger as well) and also press the power button, I continue to get a steady 3.4v with no change weather i'm pressing the power button or not. Other readings in the same area are 3.4v on VIN and V+, 3.2v on the Reset line, and a diode mode reading of .3 on pin 1 of R5100 but .47 on pin 2. This is a circuit I am not really familiar with so any tips as to what to look for would be greatly appreciated!"
    },
    {
        "post_id":12539,
        "thread_id":12532,
        "title":"820-3435 Macbook Air SMC_RESET_L and No Power Button",
        "user_id":36,
        "username":"aprendiz",
        "post_date":"2017-01-09 09:27:02",
        "message":"Bad keyboard....."
    },
    {
        "post_id":12540,
        "thread_id":12532,
        "title":"820-3435 Macbook Air SMC_RESET_L and No Power Button",
        "user_id":110,
        "username":"MOberdick",
        "post_date":"2017-01-09 09:29:27",
        "message":"Tried a new keyboard and also a new trackpad with the same issue... Still a keyboard problem? I can try another maybe the one i grabbed was just DOA"
    },
    {
        "post_id":12541,
        "thread_id":12532,
        "title":"820-3435 Macbook Air SMC_RESET_L and No Power Button",
        "user_id":36,
        "username":"aprendiz",
        "post_date":"2017-01-09 09:41:50",
        "message":"Corrosion on motherboard connector, it does power on if short R5115\/16 pads??"
    },
    {
        "post_id":12544,
        "thread_id":12532,
        "title":"820-3435 Macbook Air SMC_RESET_L and No Power Button",
        "user_id":110,
        "username":"MOberdick",
        "post_date":"2017-01-09 10:05:07",
        "message":"No Title\n\nI don't see corrosion on the board connector anywhere but after shorting the R5115 pads i saw smoke (didn't happen the first time I tried it). Turns out the most simple and only part that I overlooked was actually the problem, trackpad cable. Burned itself right up."
    }
]