[
    {
        "post_id":49905,
        "thread_id":49905,
        "title":"IPad air 2 no power on",
        "user_id":1840,
        "username":"Biggtechman",
        "post_date":"2019-06-12 00:55:50",
        "message":"Hello I have a ipad air 2 come in.\nNot charging and not turning on.\n\nIt was sucking .01ma to.00ma on and off.\nI swapped tristar and it still doing the same thing.\n\nanyway I found heat on u8650 nd had a quick look around at the caps.\nthey were fine.\nso I removed u8650 which did not remove the short.\n\nI found the short on the other side of nand on a cap.\n\nMy question is. U8650 is a usb charging controller which I assume works with tristar.\n\nI can't find any data sheet on it and I can't put it back on.\nCan I jump McClain to the 3v3 line on pin 5 and 6\nand what about pin 2 which is a 1v8 switch line.\n\nAny help is appriciated\n\nThanks"
    },
    {
        "post_id":49919,
        "thread_id":49905,
        "title":"IPad air 2 no power on",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-06-12 07:11:20",
        "message":"This is NOT a MacBook...probably better to post this on a different section..Why did you replace Tristar to begin with was it bad on a Tristar tester or something??? Weird for U8650 to get hot unless you have a short on a line that goes to it...put U8650 back. Do you have a short on PPVCC_MAIN or PP3v3_S2R?"
    },
    {
        "post_id":49976,
        "thread_id":49905,
        "title":"IPad air 2 no power on",
        "user_id":1840,
        "username":"Biggtechman",
        "post_date":"2019-06-12 22:56:45",
        "message":"Sorry about that, wasn't sure where to post.\n\nShort was on pp3v3_ext_sw\nI removed the short, it was c1842\nI can not put u8650 back on as it got damaged on removal.\n\nI'm just wanting to see if it's worth ordering that chip.\nFigured that u8650 was a bridge, so was looking to find out what I can jump so the ipad would turn on.\n\nI've read slot about pmic on ipad air 2 dying and not worth fixing. \nso I would like to avoid wasting anymore time and coin on it.\n\nIt showed symptoms of tristar failure."
    },
    {
        "post_id":49986,
        "thread_id":49905,
        "title":"IPad air 2 no power on",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-06-13 06:16:00",
        "message":"If that line was short, it is unlikely the PMIC is bad. That can happen but I doubt it in this case. Pull U8650 from a dead donor iPad if possible"
    },
    {
        "post_id":50011,
        "thread_id":49905,
        "title":"IPad air 2 no power on",
        "user_id":1840,
        "username":"Biggtechman",
        "post_date":"2019-06-13 17:15:07",
        "message":"Thanks for info, don't have doner board.\nwill order one."
    }
]