{"post_id":44993,"thread_id":44993,"title":"820-2936 liquid damaged","user_id":338,"username":"arnonabuurs","post_date":"2019-01-19 07:04:18","message":"Hi guys, got this one in, working. Customer wanted to upgrade, checked the board and area around Q5060 was corroded. Told him it needs fixing but he said he needed it at night, so came back the next day, mac died. Luckily not in my hands :). Anyway, I replaced Q5060 and Q5059 and resistors around it. Also replaced C4907 and R5250 beside SMC. Then I replaced R6101 and C6100 that looked corroded. For the rest all looks pretty OK. Now i have green and orange light with battery plugged in, but missing PP5V_S3, I do have PP3V3_S5. PPBus sits at 12.6v and I have 3.42v as well. Also there is a short in PP3V3_S0, I see its also going to the area i replaced IC, but all resistor I changed measure OK. Should i first focus on the 5V, or are these related?"}
{"post_id":44996,"thread_id":44993,"title":"820-2936 liquid damaged","user_id":682,"username":"2informaticos","post_date":"2019-01-19 08:33:42","message":"If you detect a pure short to ground, no need to power up the board.\nLocate the culprit and solve that problem first.\nStart with lower voltage if choose to inject tension.\nYou can remove Q7830 and test if board starts at least.\nPM_SLP_S4_L pulses?"}
{"post_id":45034,"thread_id":44993,"title":"820-2936 liquid damaged","user_id":338,"username":"arnonabuurs","post_date":"2019-01-20 23:41:10","message":"My flir cam saved the day on the short, U5501 was shorting 3v3 its back to normal after replacement. However, board not starts yet, now i am missing PP5V_S3. I do have PP3V3_S5 & S4 and 12.59v going into U7200. Since there is 3.3v coming out of U7200 can i assume the IC is good, or can only half of it work? PM_SLP_S4_L does not pulse when connecting the charger. On Q7911 I have 0v on pin 2 and 3.44 on pin 3."}
{"post_id":45044,"thread_id":44993,"title":"820-2936 liquid damaged","user_id":682,"username":"2informaticos","post_date":"2019-01-21 05:20:27","message":"5V_S3 is controlled by PM_SLP_S4_L.\nTrigger SMC_ONOFF_L and check if it pulses at least.\nIs not easy to see the pulse just connecting charger.\n\nU7200 should be good, it has 5V rail blocked.\n5V should come up, if you remove R7913, just for test."}
{"post_id":45144,"thread_id":44993,"title":"820-2936 liquid damaged","user_id":338,"username":"arnonabuurs","post_date":"2019-01-23 23:44:54","message":"If i remove R7913 i do get 5V yes. I get no response on PM_SLP_S4_L. Means CPU is dead? Maybe because i removed the U5510 some leg under the cpu are screwed."}
{"post_id":45145,"thread_id":44993,"title":"820-2936 liquid damaged","user_id":338,"username":"arnonabuurs","post_date":"2019-01-23 23:49:53","message":"Here some other values:\nSMC_ADAPTER_EN = 3.44v\nSMC_BATLOW_L = 3.27\nAlso tried it with battery connected and original 60 watt charger. Do have green and orange light."}
{"post_id":45150,"thread_id":44993,"title":"820-2936 liquid damaged","user_id":682,"username":"2informaticos","post_date":"2019-01-24 05:09:28","message":"Does it start in SMC bypass mode?\nCheck all 4 RTC signals, page 16.\nAlso check 32KHz presence at pin 12\/U2800."}
