{"post_id":95660,"thread_id":63481,"title":"820-02020 - MacBook Pro M1 2020 - blown UC710 (SN621371)","user_id":28726,"username":"ronaldo","post_date":"2023-01-17 11:14:25","message":"Hi everyone.\n\nThis MacBook had liquid damage about 10 months ago.\nI've replaced a few components and done U.S cleaning and it is back to life.\n\nSo, now it is back to me with no power: TrackPad clicking and a loud fan.\nAfter opening, I found a blown UC710 (SN621371) that I only found the equivalent  TPS621351RGXR . It seems to be OK, but still waiting for a few more components to test the mac. And a nice hole on the board. I had to dig in and use a UV mask to isolate after removing the fused shorted layers.\n\nProblem is that one short line remained PP3V3_V2. Leading me to the sense resistor RD810 next to the WIFI\/BT module.\nUnfortunately, I remove this sense resistor and the short on PP3V3_V2 is gone.\nThe short now is present on PP3V3_S2_WLBT_ISNS.\n\nDoes anyone know if is possible to replace the WIFI\/BT module on this model?\n\nThanks, everyone."}
{"post_id":95669,"thread_id":63481,"title":"820-02020 - MacBook Pro M1 2020 - blown UC710 (SN621371)","user_id":682,"username":"2informaticos","post_date":"2023-01-17 18:11:58","message":"Nothing to lose, apart of time.\nTry to get the chip from donor board, same model.\nPossibly married with M1, but the board should boot at least, I suppose."}
{"post_id":96231,"thread_id":63481,"title":"820-02020 - MacBook Pro M1 2020 - blown UC710 (SN621371)","user_id":40706,"username":"Panrix Microelectronix","post_date":"2023-02-02 11:31:12","message":"Hi Ronaldo,\n\nDid you have any luck in replacing the Wifi chip?\n\nI have one with the same line shorted PP3V3_S2_WLBT_ISNS which is coming from the IC. Have tried to replace the chip but it doesn't seem to work. Just wondering if there is a possible repair.\n\nThanks!"}
{"post_id":97749,"thread_id":63481,"title":"820-02020 - MacBook Pro M1 2020 - blown UC710 (SN621371)","user_id":28726,"username":"ronaldo","post_date":"2023-03-20 04:18:46","message":"The short was coming from a cap on the same line, PP3V3_S2 .\nAfter a 2nd full inspection under microscope, I found this crack on the cap,\nReplaced and it turned on.\nThe problem was that the cap was causing the Wi-Fi module to shine under the thermal camera.\nAfter all, I had to replace the Touch Bar flex cable as the fan was full speed even with touch working."}
