{"post_id":14861,"thread_id":14861,"title":"[SOLVED]820-3476 no backlight","user_id":235,"username":"MUUK","post_date":"2017-02-15 13:01:48","message":"History:\n\nLiquid damaged no green light.\nBurnt KBD backlight connector J4915 (removed and area cleaned) - no short to ground on pin 3\/4.\nD7010 missing (replaced) i've not idea why this was missing......\nNow powering on with green light but no backlight. (Does boot up checked with microscope light there is an image present)\n\n\nQ7700 \npin 4 12.58v\npin 3 12.46v\n0v on output\n\nR7701, C7700, R7702 measuring fine. Replaced anyway as looked like they needed it.\nR7700 0.2ohm\n\nu7700\npin 11 12.46v (This is the problem i believe as it should pull LCDBKLT_EN_L low)\npin 17 (enable) 3.3v\npin 5&18 (power) 5v\nR7731 & R7732 measure and look fine\nc7701 replaced \n\ntried replacing q7700 no change\n\nwith lcd connected.\nPPVOUT_S0_LCDBKLT 0v\nPP5VR3V3_SW_LCD 5v\nSMC_LID 3.4v\nDP_INT_HPD 3.3v\nEDP_BKLT_PSR_EN 3.3v\n\nR7750\nR7751 both 0.2ohm\n\nR7752\nR7753 both 2.3k\n\npin 1 of LCD connector diode mode to ground: 1.1v\n\n\nDoes the same on two screens. (original screen quoted as working by customer, plus my known good screen - granted i haven't used it in a while). Relatively new to this so don't have any others to swap with at the mo.\nTried different LVDS cable for shits and giggles but no change.\n\ni realise my issue is that LCDBKLT_EN_L (pin 3 of q7700) is not being pulled to ground and therefore not turning on.  I've replaced the pre and post q7700 caps  (c7700 & c7701) and the voltage divider to pin 3 as a caution. \nu7700 has power pins 5&18 and enable pin 17 but is not pulling pin 11 (SD) to ground. \nForgive my naivity but could i try jumping pin 3 of q7700 to ground just to see if it goes further ?\n\nI am rather lost now as to where to follow this - any hints please ?"}
{"post_id":14868,"thread_id":14861,"title":"[SOLVED]820-3476 no backlight","user_id":558,"username":"arghhh","post_date":"2017-02-15 16:14:39","message":"Replace U7700."}
{"post_id":14874,"thread_id":14861,"title":"[SOLVED]820-3476 no backlight","user_id":235,"username":"MUUK","post_date":"2017-02-15 17:01:11","message":"Changed U7700 from donor board. No change, re did the readings. Any other thoughts before trying another ? Possible to pull down LCDBKLT_EN_L to ground with a jumper just to test the rest up the chain?"}
{"post_id":14879,"thread_id":14861,"title":"[SOLVED]820-3476 no backlight","user_id":2,"username":"dukefawks","post_date":"2017-02-15 17:10:53","message":"Did you test with a screen from the correct year? Verify continuity between pins 15\/16 of U7700 and LCD connector."}
{"post_id":15027,"thread_id":14861,"title":"[SOLVED]820-3476 no backlight","user_id":235,"username":"MUUK","post_date":"2017-02-18 07:29:45","message":"Was indeed damaged trace. You can mark as closed. Thank you!"}
