{"post_id":26297,"thread_id":26297,"title":"[SOLVED]820-4924, No voltages anywhere, I'm missing something?","user_id":515,"username":"SMMRepair","post_date":"2017-10-03 11:46:24","message":"I'm working on an 820-4924 board that had liquid, and has no green light or signs of life *at all*. I'm missing PPDCIN_G3H and even PP18V5_DCIN_FUSE is 0v. There WAS liquid to the DC-In connector and pins 1 and 2 are corroded looking, but after scraping away a bit of corrosion and checking continuity through the connector, it seems fine. I ran a wire through the board to ADAPTER_SENSE just in case the through-hole was corroded, but no dice.\n\n1. No green light, no activity at all on charger. Board DOES power on from battery.\n2. Diode for J7000: 1: 1.89; 2: 1.89; 3: OL; 4: ground; 5: ground; 6: .588.\n3. 0V at F7005.\n\nI can't help but think I'm missing something obvious. I can pull the actual DC-In connector, but I don't think it's damaged enough to cause the charger to go into protection (I think is what's happening?). I don't detect any shorts on ppbus, 3v42, etc., but I don't think a short would prevent any voltage at all on the DC-In connector, right? Unless the short was on PPDCIN_G3H, etc., but there isn't.\n\nI haven't checked much beyond the above because I don't think anything would matter this early in the circuit\/power-on sequence. With 0v at F7005, I need to start here, correct?\n\nI feel like this will be an easy one, once I've figured it out (of course). All help appreciated!"}
{"post_id":26300,"thread_id":26297,"title":"[SOLVED]820-4924, No voltages anywhere, I'm missing something?","user_id":515,"username":"SMMRepair","post_date":"2017-10-03 12:09:59","message":"I'm terrible about this, but I got this one solved. The connector was at fault. Didn't \"look\" too bad, but when I pulled it, there was a ~.25\" dried\/hardened \"pool\" of delicious coca cola. Got it cleaned\/replaced and green light returned.\n\nWill update thread in ~1 hour once I confirm board works, but initial issue is resolved."}
{"post_id":26347,"thread_id":26297,"title":"[SOLVED]820-4924, No voltages anywhere, I'm missing something?","user_id":515,"username":"SMMRepair","post_date":"2017-10-04 08:55:52","message":"We can mark this one solved--got everything sorted. Board looks like a mess, but works well. Thanks again!"}
