{"post_id":39147,"thread_id":39147,"title":"[SOLVED]820-3332 -  changing serial number","user_id":624,"username":"Alan.L","post_date":"2018-08-31 18:33:39","message":"I've bought an eBay board, fixed with the u8900 reflow.\n\nwhen i edit the eBay board's serial number to match the serial number to the one on the bottom cover.\nThe system serial number in ASD has become \"not available\". however, OSX can see it fine.\n\nany idea why is not working in ASD but works in OSX?\n\n\n[IMG type=\"full\" width=\"200px\"]https:\/\/i.imgur.com\/JskroIk.jpg[\/IMG]\n\n[IMG type=\"full\" width=\"200px\"]https:\/\/i.imgur.com\/URI0M4n.jpg[\/IMG]\n\n\nthis usually works for me but not this time....\n\nThis is what I've done so far: I removed the ROM from the eBay board and put it into my EPROM programmer. I then used that to dump the ROM and opened the resulting file in a hex editor. I located the eBay board serial number in the file and changed it to the desired number. I made sure not to add any extra spaces or anything, and made sure the string was still located at the same offsets as the original. I saved the file and wrote it back onto the ROM. i have even tried just writing zeros then use Blank Board Serializer to write the number that way, but it just had an error and wouldn't do anything.\n\n\nThis is the ROM, ME region is all good, just want the serial number to change that will work in ASD and OSX:\n\n[URL=\"https:\/\/drive.google.com\/open?id=1uiiEmMvejOlK_y7EDqSnZe8yz428_pFF\"]https:\/\/drive.google.com\/open?id=1ui...SnZe8yz428_pFF[\/URL]\n\n\nNew serial number : C02JC22TDKQ4"}
{"post_id":39212,"thread_id":39147,"title":"[SOLVED]820-3332 -  changing serial number","user_id":2,"username":"dukefawks","post_date":"2018-09-04 22:17:18","message":"You can never just edit the serial number manually. You should always correct the Fsys checksum if you do that. Better in this case would have been to either take the old BIOS and stick the ME region from the  working board in front of it or take the Fsys block from the dead board and paste that into the new board BIOS.\n\nHere is the BIOS with clean ME and corrected Fsys checksum.\n\n[url]https:\/\/drive.google.com\/open?id=1eHl7MKUfzatzDyIelCO77nXgjE1BepD9[\/url]"}
{"post_id":39274,"thread_id":39147,"title":"[SOLVED]820-3332 -  changing serial number","user_id":624,"username":"Alan.L","post_date":"2018-09-06 11:34:59","message":"thank you Duke, it is working:)"}
