{"post_id":4258,"thread_id":4258,"title":"820-3662 liquid damaged no power","user_id":67,"username":"bighead","post_date":"2016-07-05 14:03:30","message":"Hi All,\n\nSo I have this nice Retina here with liquid damage.\nI cleaned it. Battery is dead.\n\nIt was powering on, but no CPU VCORE.\nI checked the power to U7200 and I saw R7202 was corroded. I changed it and it turned on for a sec or two and turned off.\n\nPP3V42_G3H was 70-80 Ohm short to ground. I found a bad corroded cap C1950. I changed it with U1950.\nIt turned on for a second again. I was able to turn it on with SMC bypass, but after 10 seconds it turned off. Never could turn it back on.\n\nI found SMC crystal wasn't oscillating and there was no voltage on it. No short! I didn't have the same board so I took the SMC off of the 820-3332.\nAfter I replaced the SMC the crystal is oscillating, but still not turning on. The fan just barely spins up. This is not a turn on-off loop thing.\nThis tries to turn on, turns off and it does not try to turn on again. I tried SMC bypass mode, but same thing. I couldn't find any short.\n\nIt still powers on if I remove R7202, just of course no CPU VCORE.\n\nAny ideas?\n\nThank you!"}
{"post_id":4275,"thread_id":4258,"title":"820-3662 liquid damaged no power","user_id":2,"username":"dukefawks","post_date":"2016-07-05 21:25:40","message":"Start with using the correct SMC. The original one is probably fine, was just crap under it."}
{"post_id":5751,"thread_id":4258,"title":"820-3662 liquid damaged no power","user_id":67,"username":"bighead","post_date":"2016-08-20 11:41:01","message":"Well, I received the parts board for this board. I changed the SMC with the correct one, but still no power.\nI lifted all CPUVCORE coils at the CPU side and checked them if I have anything on them without connecting it to the CPU.\nWith multimeter is show 3V which is extremely high. I checked with scope and it shows the PWM wave on both side of the coils. All of them(3).\nHow is that possible?"}
