{"post_id":103016,"thread_id":64374,"title":"A1466 Air Fan spin no power","user_id":56827,"username":"andersonamr","post_date":"2023-12-08 06:26:20","message":"Hi guys, costumer brought a macbook air a1466, board reference 820-00165-A.\n\nTesting the board outside the case we have the following pattern: Magsafe starts green, then turns orange. Fan spins at high rate and stays that way forever.\n\nPower supply draw: 0.315ma\nPPBUS_G3H 8.57v \nPP3V42_G3H 3.43v\n\nCPU gets mildly hot.\n\nNo signs of corrosion, board is super clean. When mounted on the case, the power supply draw goes to 0.450ma and PPBUS_G3H drops to 6.5v.\n\nThnaks guys!"}
{"post_id":103017,"thread_id":64374,"title":"A1466 Air Fan spin no power","user_id":682,"username":"2informaticos","post_date":"2023-12-08 09:21:24","message":"First of all, welcome to the forum!\n\n\"PPBUS_G3H drops to 6.5v\"\nWas that with both charger and battery connected?\n\nWork with board alone on the desk, until you get USB activity.\nDo you get L7310\/20 voltage?\nIf not, check L7430\/60.\nIf yes, check PLT_RESET_L."}
{"post_id":103026,"thread_id":64374,"title":"A1466 Air Fan spin no power","user_id":56827,"username":"andersonamr","post_date":"2023-12-08 10:37:11","message":"Hi 2in, how's going? After the post, i dig in and found PP3V3_S5 was missing on PIN 6 of U1930.\nSo i replaced U1930, both the capacitor and resistor around him, and still no PP3V3_S5, had to make a jumper wire from another point where PP3V3_S5 was present and boom, problem solved!\n\nU1930 needs PP3V3_S5, ALL_SYS_PWRGD and PM_SLP_S3_L to output CPU_VCCST_PWRGD.\n\nThanks for your time my man! I'll be here often, out of nowhere i'm getting costumers with macbooks, i was just an iphone guy.\nI'll attach the picture with the jumper i've made."}
{"post_id":103027,"thread_id":64374,"title":"A1466 Air Fan spin no power","user_id":56827,"username":"andersonamr","post_date":"2023-12-08 10:39:13","message":"Here's the jumper wire, kinda ugly but I was in the middle of making it, didn't got another pic because I was eager to mount it on the case to make sure I was right heheb"}
