{"post_id":53584,"thread_id":53584,"title":"820-00165 Backlight","user_id":1547,"username":"CRC2018","post_date":"2019-10-17 14:19:10","message":"Having an absolute nightmare trying to restore backlight to an 820-00165 which was liquid damaged. I had a small around of corrosion around the LCD connector which has cleaned up fine - most of the corrosion was around the backlight driver U7701 and its accompanying resistors. Having pulled the backlight driver and confirmed it looked burned out under the microscope have checked all pads underneath the backlight driver were connected to where they should be. Found all were connected with the following exceptions - Pin 12 wasn't connected to R7741 so i've scratched and fixed that, same with pin 8 and r7714. I've also replaced a couple of resistors next to U7701 as they were not reading correctly. Can also confirm Feedback Pin #5 is connected to pin 2 of D7701 - i've seen that line be blown before but not this time!\n\nObservations - \nGetting around 3.3v on EDP_BKLT_EN\nGetting 0v on LCDBKLT_EN_L\nGetting 2.8V on LCDBKLT_EN_DIV_L\nGetting PPBUS voltage or 8.5V on  LCDBKLT_BOOST, PPHV_S0SW_LCDBKLT \nResistors for LED_RETURN1,2,3,4,5,6 are all reading 0hms and connected to LCD Connector.\nTried another screen same result. \n\nI think i've covered everything i've tried but is there something i've missed - should also add i've tried now 3 new LP8550 drivers and i'm getting the same behavior with each which leads me to conclude that either im very unlucky and have a faulty batch of LED drivers or i've missed something!"}
{"post_id":53586,"thread_id":53584,"title":"820-00165 Backlight","user_id":682,"username":"2informaticos","post_date":"2019-10-17 14:43:11","message":"You didn't mention anything about image presence.\nWhat about BKL_PWM\/EN levels?\nDid you try PRAM reset?\nPost diode mode (red probe at ground) on both pins of D7701 and all return resistors."}
{"post_id":53598,"thread_id":53584,"title":"820-00165 Backlight","user_id":1547,"username":"CRC2018","post_date":"2019-10-18 05:30:36","message":"Hi\n\nThanks for your suggestion! BKL_EN was 0V traced the problem down to the Pad under R7731 was corroded - not at all visible from the top! have since repaired the pad and put a new 200k resistor there and now backlight restored!"}
