[
    {
        "post_id":88449,
        "thread_id":62576,
        "title":"A2337 boot-looping",
        "user_id":1166,
        "username":"Soji",
        "post_date":"2022-04-07 20:39:19",
        "message":"History\nThe owner change the screen and the apple  boot loop started.\nIt’s not entering dfu or recovery\nI think it’s a power problem\nThe usb-c ammeter too restarts every time apple logo loops.I think  It’s like a voltage or current loop.\nPls what to do next."
    },
    {
        "post_id":88450,
        "thread_id":62576,
        "title":"A2337 boot-looping",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-04-08 00:52:15",
        "message":"Disconnect internal LCD and test with external monitor."
    },
    {
        "post_id":88502,
        "thread_id":62576,
        "title":"A2337 boot-looping",
        "user_id":1166,
        "username":"Soji",
        "post_date":"2022-04-10 15:11:53",
        "message":"Just tested it with external monitors, no display on external monitor. It still loops and the typec ammeter restart every time it loops"
    },
    {
        "post_id":88503,
        "thread_id":62576,
        "title":"A2337 boot-looping",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-04-10 16:11:17",
        "message":"Very likely the owner worked on the machine without disconnecting the battery.\n\nMachine restarts w\/ and w\/o battery too?\nTry starting in SMC bypass mode."
    },
    {
        "post_id":88515,
        "thread_id":62576,
        "title":"A2337 boot-looping",
        "user_id":1166,
        "username":"Soji",
        "post_date":"2022-04-10 23:55:15",
        "message":"It’s still recycling with and without battery\nSmc bypass to is not going through. When it reached that time it bootloops , no matter the task it will turn off\n\nam thinking it’s a power thing, the power recycles\n\nthere is a big coil next to  speaker \nconnector 2r7 written on it. The 12.3 sometimes 13.2V goes to 00.00V when it loops\nI don’t have the schematic yet. Pls can you give a link to buy."
    },
    {
        "post_id":88516,
        "thread_id":62576,
        "title":"A2337 boot-looping",
        "user_id":36658,
        "username":"gir489",
        "post_date":"2022-04-11 00:15:50",
        "message":"Alright shot in the dark here. How old is the SSD? Have you tried swapping the drive out with another one? You might be chasing a phantom here. I would try a second boot device before trying all this extra rework.\n\nIf removing the bad part didn't fix it, and it still does the same thing, I'm betting it's the SSD. Just remember kids, correlation is NOT causation!"
    },
    {
        "post_id":88518,
        "thread_id":62576,
        "title":"A2337 boot-looping",
        "user_id":1166,
        "username":"Soji",
        "post_date":"2022-04-11 00:53:47",
        "message":"It’s a MacBook Air  M1 chip. It’s still a recent laptop. So I don’t really get what you said, \n\nyou mean I should replace the nand chips. \nand how do I do the second boot device( boot from a flash ?)"
    },
    {
        "post_id":88520,
        "thread_id":62576,
        "title":"A2337 boot-looping",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-04-11 01:02:43",
        "message":"L5230 is not the point where to check PPBUS_G3H.\nCheck at F5200, w\/ and w\/o battery battery connected.\nIf is not stable, you must check for short on all big coils.\n[URL unfurl=\"true\"]https:\/\/drive.google.com\/file\/d\/1awXha_0sosA1PNe1TWbjUiMA9Q70wYgm\/view?usp=sharing[\/URL]"
    },
    {
        "post_id":88522,
        "thread_id":62576,
        "title":"A2337 boot-looping",
        "user_id":36658,
        "username":"gir489",
        "post_date":"2022-04-11 01:35:02",
        "message":"[QUOTE=\"Soji, post: 88518, member: 1166\"]\nIt’s a MacBook Air  M1 chip. It’s still a recent laptop. So I don’t really get what you said,\n\nyou mean I should replace the nand chips.\nand how do I do the second boot device( boot from a flash ?)\n[\/QUOTE]\nYeah this is exactly why I stayed away from the A1 laptops. I bought a 2020 MacBook Pro used for $700 with the bottom bezel on the screen broken that I'm going to fix eventually but for now works all because it has cosmetic damage. And yes, I think it's one of the NAND chips or the A1 processor. Get Mac OS installed on a USB boot drive, or Linux (I recommend Mint Linux) and see if you can boot. Chances are you can't because nobody else supports the A1 chip like Apple wants, and they're trying to reclaim the Mac market share again by kicking Intel to the curb when they're done with them (again) but people like us remember. So you're either going to have to diagnose a chip fault, boot failure, RAM failure, or any other number of possible failures.\n\nMY BET! If it's the A1, they've locked out the security enclave and detected you swapped the screen. Now it's trying to lock you out for not being Apple certified repair. But that's just my guess from working on the days of when we swapped the fucking thumb button and it would stop reading finger prints and give you errors. Same shit different day."
    },
    {
        "post_id":88525,
        "thread_id":62576,
        "title":"A2337 boot-looping",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-04-11 04:19:41",
        "message":"You can't do anything until get stable PPBUS_G3H.\nAnd this fluctuation is not LCD related; as can be checked without LCD too."
    },
    {
        "post_id":88536,
        "thread_id":62576,
        "title":"A2337 boot-looping",
        "user_id":1166,
        "username":"Soji",
        "post_date":"2022-04-11 12:39:24",
        "message":"Thanks for the schematics.pls what can I do to get ppbus stable."
    },
    {
        "post_id":88538,
        "thread_id":62576,
        "title":"A2337 boot-looping",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-04-11 12:45:03",
        "message":"Check for knocked of components, broken traces.\nThe problem was induced by owner; when changed the LCD assembly.\nSomething changes if try disconnecting internal LCD?"
    }
]