{"post_id":18538,"thread_id":18538,"title":"[SOLVED]820-2850 no backlight","user_id":371,"username":"nate8organic","post_date":"2017-04-17 15:17:32","message":"got in a soda damaged 2850 board,  brought it back to life but i have no backlight.  i did replace the lvds connector and pin 40-38 on ppvout_s0_lcdbklt pads seem to have connected together is this a problem? also how does ppvout_s0_lcdbklt get to that part of the board?  pin 39 & 38 pads are also not connecting to the end of the pad they are only about half of the pad where the pins from the lvds connector are.  was wondering if this might be the problem? if so where should i run a wire from? can i scrape back the board in front of the pad?  or does it come from somewhere else?  i checked bklt_en and its there.  checked the fuse also good. \n\nThe only thing i notice on this board is that it takes a 10 seconds from plugging in the power until the chime and screen try to go on.  i do have data. and it does boot all the way.  \n\nThanks \nNate"}
{"post_id":18541,"thread_id":18538,"title":"[SOLVED]820-2850 no backlight","user_id":803,"username":"SoloHarty","post_date":"2017-04-17 15:45:35","message":"Those 3 pins being soldered together isn't an issue as they are all connected. I would run a decent gauge wire from pin 38,39 and 40 to somewhere like C9797, C9799 or C9000. What voltage are you getting on L9701?"}
{"post_id":18543,"thread_id":18538,"title":"[SOLVED]820-2850 no backlight","user_id":36,"username":"aprendiz","post_date":"2017-04-17 17:49:47","message":"Check continuity from pin 40 to D9701....... Voltaje on pin 40?? Do a PRAM reset....."}
{"post_id":18544,"thread_id":18538,"title":"[SOLVED]820-2850 no backlight","user_id":371,"username":"nate8organic","post_date":"2017-04-17 18:23:00","message":"actually just realized i'm getting 3.4v on lcd_bklt_en but i'm not getting anything on BKLT_EN.  nothing on ppvin_bkl"}
{"post_id":18545,"thread_id":18538,"title":"[SOLVED]820-2850 no backlight","user_id":36,"username":"aprendiz","post_date":"2017-04-17 18:49:38","message":"voltage on \n\nBKLT_PLT_RST_L\nLCD_BKLT_EN\nPPVOUT_S0_LCDBKLT"}
{"post_id":18547,"thread_id":18538,"title":"[SOLVED]820-2850 no backlight","user_id":2,"username":"dukefawks","post_date":"2017-04-17 20:04:23","message":"WTF is that LCD connector? Wrong type for a start!"}
{"post_id":18548,"thread_id":18538,"title":"[SOLVED]820-2850 no backlight","user_id":371,"username":"nate8organic","post_date":"2017-04-17 21:01:13","message":"im realizing that LCD_BKLT_EN is turning on 3.32 volts but goes to 0 volts after i open the lid.  \n\nBKLT_PLT_RST_L 3.32v\n\nPPVOUT_S0_LCDBKLT - 0 volts\n\ncontinuity from pin 40 to D9701 is there."}
{"post_id":18549,"thread_id":18538,"title":"[SOLVED]820-2850 no backlight","user_id":36,"username":"aprendiz","post_date":"2017-04-17 21:11:40","message":"Wow, Duke, you are right, I haven't noticed, you are using a 2012 connector on a 2011 board, first of all replace it for the right one...."}
{"post_id":18552,"thread_id":18538,"title":"[SOLVED]820-2850 no backlight","user_id":371,"username":"nate8organic","post_date":"2017-04-17 23:33:30","message":"oh wow lol! sorry i didn't see dukes comment before my last reply...  Seriously wtf i dont know, i was doing a couple lvds connectors this morning guess i was not paying attention on that one at all!  will change that out... i got it right on the other 2 boards i did. don't know how i missed that. \n\nanyway voltages are good now. and im not sure if that killed the fuse but the bklt fuse was bad and now all is working good. \\\n\nTHanks for that Duke, and thanks aprendiz. Also want to point out that this is 2010 not 2011, and also that 2011 lvds are the same as 2010. if im seeing correctly.  :)"}
