[
    {
        "post_id":35043,
        "thread_id":35043,
        "title":"[SOLVED]820-3330-b No Backlight",
        "user_id":1340,
        "username":"crea2k",
        "post_date":"2018-05-21 11:07:40",
        "message":"This one was dropped in with no backlight, F9700 was blown, so replaced this, as wasnt sure if someone had just killed it by changing a screen or getting it damp etc. There was then light on the screen for a second, then it blew again. Checked each side of F9700 and found that PPBUS_G3H side was 0 ohm short to ground. \nI next injected 6 volts into this side and magically the short vanished on its own, if I test now to ground in resistance mode its just showing OL.\n\nSo I dont know if to risk putting another fuse in place now that the desktop power supply has blown the short out, or if anyone knows if there is anything in particular that generally gets shorted to ground on that rail."
    },
    {
        "post_id":35044,
        "thread_id":35043,
        "title":"[SOLVED]820-3330-b No Backlight",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2018-05-21 11:15:52",
        "message":"Ok so first off, does the machine turn on and get an image? If so, then diode mode PPVOUT_S0_LCDBKLT and check for a short. It sounds like there is a short causing the fuse to blow."
    },
    {
        "post_id":35045,
        "thread_id":35043,
        "title":"[SOLVED]820-3330-b No Backlight",
        "user_id":1340,
        "username":"crea2k",
        "post_date":"2018-05-21 11:18:28",
        "message":"Yes it turns on and gets an image, just no backlight, ok thanks il check that and report back"
    },
    {
        "post_id":35046,
        "thread_id":35043,
        "title":"[SOLVED]820-3330-b No Backlight",
        "user_id":1340,
        "username":"crea2k",
        "post_date":"2018-05-21 11:46:42",
        "message":"Yes there is a short on that line. It is only present thought when the screen is plugged in ?"
    },
    {
        "post_id":35047,
        "thread_id":35043,
        "title":"[SOLVED]820-3330-b No Backlight",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2018-05-21 12:15:11",
        "message":"Tried known good screen? If the screen is causing the short, then you may have a bad screen cable or bad LCD in general. If you try a known good screen and the short persists, then you have a bad LCD connector more than likely."
    },
    {
        "post_id":35048,
        "thread_id":35043,
        "title":"[SOLVED]820-3330-b No Backlight",
        "user_id":1340,
        "username":"crea2k",
        "post_date":"2018-05-21 12:22:31",
        "message":"Iv probed the pins of the screen and the second, third pin are short to ground when its not connected to the motherboard at all. Iv taken the hinge apart but cant see any way of removing the cable, as it seems to go into the aluminum back of the screen once the hinge plastics are removed."
    },
    {
        "post_id":35049,
        "thread_id":35043,
        "title":"[SOLVED]820-3330-b No Backlight",
        "user_id":1340,
        "username":"crea2k",
        "post_date":"2018-05-21 12:25:25",
        "message":"Ok figured it out from youtube, will take it out and test the connector on the lcd itself for short"
    },
    {
        "post_id":35050,
        "thread_id":35043,
        "title":"[SOLVED]820-3330-b No Backlight",
        "user_id":1340,
        "username":"crea2k",
        "post_date":"2018-05-21 12:59:20",
        "message":"So open it  up and the screen end the pins are welded together and black and the cable pins are black and nasty!. So thats a new cable and screen then !. So I hopefully just need to replace the fuse, that is unless injecting 6 volts into the shorted side of the fuse has blown something else up between the fuse and the connector as there is no short at the fuse any more......"
    },
    {
        "post_id":35052,
        "thread_id":35043,
        "title":"[SOLVED]820-3330-b No Backlight",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2018-05-21 13:27:21",
        "message":"What do you get in diode mode on backlight output with no screen attached? For sure get a known good screen replace the fuse and remeasure before you put power through"
    },
    {
        "post_id":35053,
        "thread_id":35043,
        "title":"[SOLVED]820-3330-b No Backlight",
        "user_id":1340,
        "username":"crea2k",
        "post_date":"2018-05-21 13:30:25",
        "message":"0.536 at the connector and 0.412 at the fuse on pp_bus_g3h side"
    },
    {
        "post_id":35055,
        "thread_id":35043,
        "title":"[SOLVED]820-3330-b No Backlight",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2018-05-21 13:50:21",
        "message":"So replace the fuse and try a new screen. 0.536 is consistent with working backlight, so the short is more than likely a bad screen. Measure BEFORE you put power through to be certain short is gone tho"
    },
    {
        "post_id":35080,
        "thread_id":35043,
        "title":"[SOLVED]820-3330-b No Backlight",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-05-22 02:26:35",
        "message":"It is possible to replace the connector inside the LCD. You need to be VERY careful with applying heat as the flex cable to the panel is right on the other side of the PCB. I usually pick the connector apart slowly and desolder the pins 1 by 1. Then put on a new connector and hand solder every pin making sure to not soak too much heat into the PCB. Most of the time this will work, sometimes you end up with a bunch of lines on the left side in the LCD."
    },
    {
        "post_id":35461,
        "thread_id":35043,
        "title":"[SOLVED]820-3330-b No Backlight",
        "user_id":1340,
        "username":"crea2k",
        "post_date":"2018-06-05 01:43:15",
        "message":"Fixed !. Replaced the screen, cable and fuse and it's all back working once again !."
    },
    {
        "post_id":35462,
        "thread_id":35043,
        "title":"[SOLVED]820-3330-b No Backlight",
        "user_id":1340,
        "username":"crea2k",
        "post_date":"2018-06-05 01:44:13",
        "message":"Thanks, Iv left it in my parts pile, so if I come across another that needs a screen I can do that."
    }
]