[
    {
        "post_id":31832,
        "thread_id":31832,
        "title":"820-00244 No Power",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2018-02-20 16:32:15",
        "message":"edit: Going to add details in tomorrow; was able to locate the schematic\/boardview. Stay tuned.\n\nThat being said, the CPU gets warm when I plug the charger in, but there's no power. Would this eliminate the shorted PP3V3R3V0_AON? I'm not sure if this is enough to get started (until I track down the schematic), but I'll edit this thread in a bit if I can find the schematic."
    },
    {
        "post_id":31834,
        "thread_id":31832,
        "title":"820-00244 No Power",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2018-02-20 16:58:12",
        "message":"Of course after posting, I found the schematic. I'll edit my OP tomorrow with more information--sorry for the barebones post."
    },
    {
        "post_id":31840,
        "thread_id":31832,
        "title":"820-00244 No Power",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-02-20 19:31:15",
        "message":"The CPU gets warm but there is no power? If the CPU is getting warm and none of the other rails are coming high then I can already tell you this board is fucked."
    },
    {
        "post_id":31842,
        "thread_id":31832,
        "title":"820-00244 No Power",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2018-02-20 19:53:23",
        "message":"Hey Duke, yeah the CPU got warm on the very last test I performed; I think the board IS powering on, but when in the top-case, it's not. The unit had no liquid evident, so I didn't check top-case yet, but board showed no signs of life the few times I tried in the case assembly. The CPU got warm only after I plugged the board in after removing from the top-case. I'll be getting some proper diagnostics on it tomorrow morning and will post back. I jumped the gun in posting this thread because I had no schematic, but there was no way to close\/delete it immediately; I added what little info I had to help justify the thread, ha! Apologies for that.\n\nWill update soon with exact issue\/questions."
    }
]