[
    {
        "post_id":89301,
        "thread_id":62688,
        "title":"820-00239 not turning on.",
        "user_id":5109,
        "username":"Yoel Ren",
        "post_date":"2022-05-14 05:22:40",
        "message":"hi, this board came in with a bit of liquid damage at ub400 and ub300, both of these corresponding port will stay on,   while the other two looping.\ni replaced both ub400 and ub300, and i got 20v on all port now.\ni tested it in chassis and it did boot.\ni leave it one day, and next day it doesnt turn on anymore.\n\nwhen i plug usb c charger, it will go 20v, current fluctuating like its booting, and i did get usb activity for a few second, and then it will stuck at 0.08, no more usb activity.\nall port behave the same. any clue what to go for ?"
    },
    {
        "post_id":89304,
        "thread_id":62688,
        "title":"820-00239 not turning on.",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-05-14 09:18:49",
        "message":"Something else corroded on the board, or accessories.\nSome I\/V sensor may be triggered.\nCan you turn it on in SMC bypass mode?\n\nAlso test the board alone, disconnecting anything; keep only charger."
    },
    {
        "post_id":89349,
        "thread_id":62688,
        "title":"820-00239 not turning on.",
        "user_id":5109,
        "username":"Yoel Ren",
        "post_date":"2022-05-16 02:45:17",
        "message":"smc bypass always boot fine.\nanyway, the problem was smc_lid_right.\ni replace the 3 leg ic at J5260 that doesnt produce hall_sensor_right, and mac boot up fine now.\ni thought smc_lid missing only dim the display but still produce usb activity ? ( this is solved, but just curious.. )"
    },
    {
        "post_id":89354,
        "thread_id":62688,
        "title":"820-00239 not turning on.",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-05-16 03:46:38",
        "message":"You should noted that all MacBooks boot up even with lid closed; you can hear the chime, when available.\nSMC_LID controls image\/backlight and trackpad\/keyboard activity.\n\nOn Windows side, laptops don't turn on at all, if lid is closed."
    }
]