{"post_id":46652,"thread_id":46652,"title":"820-3332-A Doesn't run on battery","user_id":2316,"username":"Naevius","post_date":"2019-02-23 15:05:39","message":"This 820-3332-A board runs fine with the charger connected, but won't run on battery.\n\nWhen it's booted the OS sees the battery (says 17% charged), but won't charge the battery.\n\nThere was liquid damage around the battery connector. When the system boots there is 12.5V on J6950 (PPVBAT_G3H_CONN \/ GND), both with and without the battery connected. This voltage goes away after a couple of seconds. Both SDA and SCL lines are 3.4V, SYS_DETECT_L = 0.2V. Measured with diode mode on SDA\/SCL lines, both are 0.402V.\n\nThe battery while disconnected measures ~2V on the PPVBAT_G3H_CONN \/ GND connections on the connector, but ~11V on the actual battery connection (other side of the little circuit board connected to the battery). Not sure is this is normal behaviour of the little (charge protection?) circuit board connected to the battery.\n\n\nIs this just a dead battery (well, broken charging protection PCB connected to the battery), or is there more to it? Currently I don't have a replacement battery to test with. Something tells me it's something else, because of the liquid damage around the battery connector. There was a little bit liquid damage on the battery connector itsself, but most around U6990. Replaced U6990 because of corrosion under it, but didn't change anything. ISL looks fine, no liquid damage around it."}
{"post_id":46653,"thread_id":46652,"title":"820-3332-A Doesn't run on battery","user_id":682,"username":"2informaticos","post_date":"2019-02-23 16:18:29","message":"Looks like charging procesoor isnside battery got blocked.\nYou must test known good battery.\nThe original can be unlocked with special software, like be2works; dedicated interface required also..."}
{"post_id":46657,"thread_id":46652,"title":"820-3332-A Doesn't run on battery","user_id":2316,"username":"Naevius","post_date":"2019-02-23 18:31:01","message":"I have ordered a new battery, should be here in a couple days.\n\nI checked out be2works, but the software seems outdated (Win7 32bit only). I tested the demo on a virtual machine, but even after I installed the driver it can't find the driver when starting the application. It's also pretty expensive for what it does. Do you have experience with this software your self?\n\n[edit]\nThe software idea itself is very interesting. I wonder how that software actually works, the documentation is very limited. The 'dedicated interface' seems to be a simple CP2112 USB->SMBus convertor to communicate with the I2C bus of the battery. You can buy such a convertor for $8 on Ebay. Only issue remains is knowning what bytes to edit."}
{"post_id":46872,"thread_id":46652,"title":"820-3332-A Doesn't run on battery","user_id":2316,"username":"Naevius","post_date":"2019-02-28 20:47:54","message":"Replaced the battery, and problem solved!\n\nSo somehow the battery got blocked due to liquid on the connector i guess.\n\nAnyway, thank for your help :)"}
