[
    {
        "post_id":51059,
        "thread_id":51059,
        "title":"820-2849, fan spins for 2 seconds in a loop",
        "user_id":1698,
        "username":"Hermann Neupert",
        "post_date":"2019-07-29 13:52:07",
        "message":"Macbook 17\", customer says computer was heating up and randomly shutting down. He went to an Apple partner store, apparently only give a format to the computer and return it to the customer, he is not sure if something else was done to the macbook. As usual they try to sell him a new machine. \nAfter the Macbook was return he didn't have his data in the drive (that's why we think they give a format or reinstall the OS), macbook work fine for a couple of hours, then it start heating, fan spin very loud then it turns of.\nAfter heating up, customer let it rest for 1 day. Next day computer turns on for few minutes and then turn off, after a couple of times macbook stop booting.\n\nNow computer spin the fan for a few seconds and turns off, does this in a loop, if macbook is cold fan spins longer.\nPPBUS_G3H is 8.4 Volts, not sure what to expect in this line, is my first time working in this model and diagram says \"6V\"\nAll S5 rails are fine\nPP5V_S3 up to VCore are pulsating, shows normal voltage for a couple of seconds and then go to 0V. \n\nAny ideas? \nOr should I skip this one?"
    },
    {
        "post_id":51061,
        "thread_id":51059,
        "title":"820-2849, fan spins for 2 seconds in a loop",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-07-29 14:16:26",
        "message":"Board stays on if RAM module removed?\nIf yes, could have bad GPU; heat it for test..."
    },
    {
        "post_id":51064,
        "thread_id":51059,
        "title":"820-2849, fan spins for 2 seconds in a loop",
        "user_id":1698,
        "username":"Hermann Neupert",
        "post_date":"2019-07-29 15:04:27",
        "message":"Boards stays on with RAM removed.\n\nI try another RAM, that I know are good, and same problem. Fan only spins for a couple of seconds."
    },
    {
        "post_id":51112,
        "thread_id":51059,
        "title":"820-2849, fan spins for 2 seconds in a loop",
        "user_id":1698,
        "username":"Hermann Neupert",
        "post_date":"2019-07-31 15:55:54",
        "message":"GPU seems to be heated up in the past, also both GPU and CPU have and awful kind and amount of termal grease.\nAfter cleaning that mess, in the microscope I see a little damage in a corner of the GPU die.\nIs posible to disable the NVIDIA GPU in this model?"
    },
    {
        "post_id":51113,
        "thread_id":51059,
        "title":"820-2849, fan spins for 2 seconds in a loop",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-07-31 17:17:08",
        "message":"I don't think..."
    },
    {
        "post_id":51127,
        "thread_id":51059,
        "title":"820-2849, fan spins for 2 seconds in a loop",
        "user_id":1698,
        "username":"Hermann Neupert",
        "post_date":"2019-08-01 07:27:12",
        "message":"Ok.\nThis one is a no fix.\nThanks for the info"
    }
]