{"post_id":38423,"thread_id":38423,"title":"A1534 820-00045 Frankenstein","user_id":1539,"username":"ThisIsWes:AASP","post_date":"2018-08-14 21:34:13","message":"2015 a1534 [URL=\"tel:820-00045\"]820-00045[\/URL]\nreceived completely disassembled. Missing tpad, keyboard, audio flex cable. Purchased aftermarket replacements and reassembled.\nNo life.\nTook apart and tested the board. Turns on with only charger but PPDCIN_G3H is only 14.8V.\nAttached the display and got an Apple logo with progress bar then shuts off. Reassembled and unplugged one at a time to find the faulty component. Audio flex prevents from turning on at all. Tpad flex allows it to turn on but flashes backlight then off immediately. no tpad cable and it will load to Apple logo.\nThinking there’s liquid damage on the keyboard or tpad (no sensors tripped).\nBattery doesn’t appear to be picking up a charge - 5v to it when plugged in though.\n\nShould the machine be turning on with low V on PPDCIN_G3H? Not finding a short. Assuming this is a bad u7100 or u4700 causing to be low?\nAny other reason to turn on and crash?"}
{"post_id":38432,"thread_id":38423,"title":"A1534 820-00045 Frankenstein","user_id":1539,"username":"ThisIsWes:AASP","post_date":"2018-08-15 01:12:35","message":"Reading through other posts that say 14v is good on PPDCIN_G3H, though the schematic says 20v and Louis’ video mentions the same."}
{"post_id":38540,"thread_id":38423,"title":"A1534 820-00045 Frankenstein","user_id":2,"username":"dukefawks","post_date":"2018-08-17 14:05:31","message":"15V is normal. There were a few different audio\/trackpad cables so it sucks if you do not have the exact number. Did you not plug in audio cable upside down?"}
{"post_id":38586,"thread_id":38423,"title":"A1534 820-00045 Frankenstein","user_id":1539,"username":"ThisIsWes:AASP","post_date":"2018-08-19 03:31:50","message":"Tried a few different cables and whole known-good machines with just a board swap. Same result - quickly flashes the battery image, then Apple logo, followed by empty progress bar, and finally crash.\ncompared to working board - displays battery image longer, then logo."}
{"post_id":38636,"thread_id":38423,"title":"A1534 820-00045 Frankenstein","user_id":2,"username":"dukefawks","post_date":"2018-08-20 14:37:16","message":"Put in known good chassis and see if you can do a PRAM reset and do a reinstall of OSX. Corrupted OSX can make it turn off during boot."}
{"post_id":38687,"thread_id":38423,"title":"A1534 820-00045 Frankenstein","user_id":1539,"username":"ThisIsWes:AASP","post_date":"2018-08-21 19:14:50","message":"I’m able to boot from another device and can see the internal drive but it won’t mount or erase. “Unable to open device”.\nTried with Disk Utility, and terminal through bootable recovery and target disk.\n\nAble to boot into internal recovery mode. The OS volume appears to be corrupt and this drive is built from a corestorage logical volume. Have tried deleting this but keep getting “ownership of affected disks is required”.\n\nCould this be bad NAND even though I’m able to see the drive and access recovery?\n\n**ASD passes everything.."}
{"post_id":38746,"thread_id":38423,"title":"A1534 820-00045 Frankenstein","user_id":1,"username":"larossmann","post_date":"2018-08-23 16:30:08","message":"I believe that is internet recovery, not built into the drive. I would most likely imagine dead memory.  What happens if you boot into a linux install and [I]dd if=\/dev\/urandom of=\/dev\/whateveristheinternaldrive[\/I]  and then try to erase the drive from normal internet recovery?"}
{"post_id":38757,"thread_id":38423,"title":"A1534 820-00045 Frankenstein","user_id":1539,"username":"ThisIsWes:AASP","post_date":"2018-08-23 19:19:14","message":"[QUOTE=\"larossmann, post: 38746\"]I believe that is internet recovery, not built into the drive. I would most likely imagine dead memory. What happens if you boot into a linux install and [I]dd if=\/dev\/urandom of=\/dev\/whateveristheinternaldrive[\/I] and then try to erase the drive from normal internet recovery?[\/QUOTE]\n\nIt was definitely the drive recovery mode. No globe, plus the antenna connectors were ripped off. Replaced those then tried internet recovery just to be sure. “sudo diskutil cs delete “Macintosh HD”” tries to delete then fails with due to permissions. \n\nI noticed the core storage logical volume has about 4mb of free space and “diskutil list” shows 17 separate disk drives with about 15mb total. Compared to another a1534 which has almost 19mb of free space in the logical volume and no extra disk drives. Thinking multiple apfs containers were created and now it doesn’t have enough free space to do anything. System doesn’t recognize as such though and can’t merge disks. \n\nWill try your suggestion."}
{"post_id":38793,"thread_id":38423,"title":"A1534 820-00045 Frankenstein","user_id":1539,"username":"ThisIsWes:AASP","post_date":"2018-08-24 22:01:32","message":"[QUOTE=\"larossmann, post: 38746\"]I believe that is internet recovery, not built into the drive. I would most likely imagine dead memory. What happens if you boot into a linux install and [I]dd if=\/dev\/urandom of=\/dev\/whateveristheinternaldrive[\/I] and then try to erase the drive from normal internet recovery?[\/QUOTE]\n\n\n\nNo luck. “Input\/output error” after 1.6Gb. Shows up in the Disk app with 3 partitions.\n\nIs it possible to swap out the memory from a donor on these or would there be firmware issues?"}
{"post_id":38794,"thread_id":38423,"title":"A1534 820-00045 Frankenstein","user_id":1,"username":"larossmann","post_date":"2018-08-24 23:32:55","message":"Definitely bad NAND. I haven't tried swapping it yet, so not sure. It has been on my to do list, but most people seem to decide to chuck these if we can't get their data so haven't been able to."}
{"post_id":38817,"thread_id":38423,"title":"A1534 820-00045 Frankenstein","user_id":1539,"username":"ThisIsWes:AASP","post_date":"2018-08-25 11:50:54","message":"[QUOTE=\"larossmann, post: 38794\"]Definitely bad NAND. I haven't tried swapping it yet, so not sure. It has been on my to do list, but most people seem to decide to chuck these if we can't get their data so haven't been able to. [\/QUOTE]\n\nEh, I’ll give it a shot and see what happens. \n\nAlso, just saw your post about AASP’s. If you need a now former AASP employee from a university, I’m in."}
