[
    {
        "post_id":69298,
        "thread_id":60506,
        "title":"A1466 820-00165-A",
        "user_id":25466,
        "username":"hgoncalves",
        "post_date":"2020-12-18 09:15:08",
        "message":"I have an A1466 820-00165-A that has green light, no fan spin and no power (consumes 40 mA on PS).\n\nI realize that the U1950 was burnt (with pad 8 blown without pad), R1950 burnt without both pads,  C1950 burnt without pad 1, and i think that this is the cause of the behaviour.\n\nI try to scratch the pads to make some jumpers, but i cant find the tracks., and it seems that it will be very hard to \"reconstruct\" some of those signals.\n\nHow can i make some jumpers (from where; i think that i need to make the jumper before the sgnal arrives to the pad, and not when it parts away from the pad), to bring signal to the missing pads? Is this approach the best approach?"
    },
    {
        "post_id":69322,
        "thread_id":60506,
        "title":"A1466 820-00165-A",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-12-19 12:21:30",
        "message":"Forget the cap, rebuild trace pad 8 only.\nEasy job, I usually use 0.03 mm enamelled wire."
    },
    {
        "post_id":69384,
        "thread_id":60506,
        "title":"A1466 820-00165-A",
        "user_id":25466,
        "username":"hgoncalves",
        "post_date":"2020-12-21 04:48:48",
        "message":"Hi, thanks for the reply.\n\nshould i make a jumper from R8131 to U1950? And what about R1950 (it´s also missing?"
    },
    {
        "post_id":69387,
        "thread_id":60506,
        "title":"A1466 820-00165-A",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-12-21 07:10:06",
        "message":"You have 3V42_G3H trace 2-3mm away from pin 8; look at a good board.\nReplace R1950, of course."
    },
    {
        "post_id":69389,
        "thread_id":60506,
        "title":"A1466 820-00165-A",
        "user_id":25466,
        "username":"hgoncalves",
        "post_date":"2020-12-21 07:33:05",
        "message":"Sorry to be so annoying. but I'm not understanding.\n\nI believe that you are referring to the trace between C1959 and pad 8 (but as the pad of the cap has exploded, and interrupted the trace (i think), does the signal will be there)? I don't have continuity between R8131 and that trace under pad8. \nI tried to screech the trace before the cap, but i don't see that trace, and stopped before damage something, and waited for your reply.\n\nRegarding the R1950, both pads have exploded as shown in the picture. I cant replace the resistance, without first reconstruct the pads (i think) because i don't have where to solder the resistance? Am i wrong? If not, where is the best place to pull those signals?"
    },
    {
        "post_id":69396,
        "thread_id":60506,
        "title":"A1466 820-00165-A",
        "user_id":25466,
        "username":"hgoncalves",
        "post_date":"2020-12-21 11:12:58",
        "message":"It worked like this!\nDon't know if it was the best way, but for me it worked.\nThanks."
    },
    {
        "post_id":69403,
        "thread_id":60506,
        "title":"A1466 820-00165-A",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-12-21 12:59:40",
        "message":"Is a very big trace for 3V42_G3H near U1950 pad 8; just look at a clean board."
    }
]