[
    {
        "post_id":62265,
        "thread_id":59652,
        "title":"820-01521 Battery not detected \/ SMC issue",
        "user_id":1539,
        "username":"ThisIsWes:AASP",
        "post_date":"2020-07-12 15:21:48",
        "message":"Very clean machine\/ board that I received from a local shop I do repairs for. \nCustomer left untouched in their truck for a while and when they attempted to use again it was dead. Shop removed board and inspected. Apparently, when they reassembled it would now turn on but no battery detected. \nDiag shows PPT001 - No battery detected & PFM006 - May be an issue with SMC\n\nVisually no issues with the board. No LED light. If it was just no battery detected I would assume dead battery but since SMC is mentioned I'm wondering if its something else. Also, I don't have another battery to test with at the moment and would like to avoid purchasing if not necessary. \n\nWhen checking the battery itself I get 0v on the plug. following things back a bit I'm getting...\nMain -\/+ connections: 4.1v\n1st mosfet source: 4.1v\n                    drain: 3.85v\n2nd mosfet source: 3.85v\n                    drain: 0v \nDo these batteries not supply voltage until they talk to the board? Does anyone have one they can compare values against?\n\nPPVBAT_G3H_CONN: Alternates between 12.61v and 0.164v every 5 seconds with and without batt connected. \nPPBUS_G3H: 12.61 constant"
    },
    {
        "post_id":62268,
        "thread_id":59652,
        "title":"820-01521 Battery not detected \/ SMC issue",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-07-12 16:32:17",
        "message":"You should try known good battery.\n\"1st mosfet... 2nd mosfet\", please use schematic!\n\nBattery will not deliver any voltage, untill SYS_DETECT_L is pulled down; through R6950, or Q6955 (depends which present)."
    },
    {
        "post_id":62269,
        "thread_id":59652,
        "title":"820-01521 Battery not detected \/ SMC issue",
        "user_id":1539,
        "username":"ThisIsWes:AASP",
        "post_date":"2020-07-12 16:41:22",
        "message":"Don't have schematic for battery board... Do you? \n\nAny other options before good battery? \nAnyone have a machine they can remove the battery on and run diag to see if they get the same results?"
    },
    {
        "post_id":62272,
        "thread_id":59652,
        "title":"820-01521 Battery not detected \/ SMC issue",
        "user_id":1539,
        "username":"ThisIsWes:AASP",
        "post_date":"2020-07-12 20:52:06",
        "message":"Swapped out the battery and all is good."
    }
]