{"post_id":35745,"thread_id":35745,"title":"MBP i7 2.3 15\" Retina 2012 - Random loss of display and keyboard backlight.","user_id":169,"username":"TexpertLLC","post_date":"2018-06-12 19:04:45","message":"MacBook Pro \"Core i7\" 2.3 15\" Retina 2012 - Random loss of display and keyboard backlight.\n\nI just got this machine in.  I am not a proficient board repair tech.  That being said can one of you guide me on this.  The machine's display goes dark randomly, I thought it was losing power but the fans are still running for some time after the display is lost, then they finally do shut off as well. Then when I press power button they spin again but keyboard backlight or display.  This does not appear to be a backlight issue, as there is no image on the dark screen at all and the HDMI produces no signal out to a known good monitor.  Earlier today it stayed up and had normal functionality for over an hour.  I was able to check the battery health at that time and the battery is in \"normal\" condition.  SMC reset and unplugging the battery for several seconds brings the display back either momentarily or like I said I did get over an hour out of it earlier today.  I don't see any indication of liquid exposure except maybe around the pins of the DC in jack.  The moisture sticker under the display cable is perfectly white. as are the stickers on the battery.  Charger seems to function as expected green light, then orange.  Any guidance is appreciated and thanks in advance."}
{"post_id":35761,"thread_id":35745,"title":"MBP i7 2.3 15\" Retina 2012 - Random loss of display and keyboard backlight.","user_id":2,"username":"dukefawks","post_date":"2018-06-12 19:40:00","message":"Reflow\/resolder U8900, the usual problem on these boards."}
{"post_id":35773,"thread_id":35745,"title":"MBP i7 2.3 15\" Retina 2012 - Random loss of display and keyboard backlight.","user_id":169,"username":"TexpertLLC","post_date":"2018-06-13 06:23:17","message":"Thanks Duke"}
{"post_id":36889,"thread_id":35745,"title":"MBP i7 2.3 15\" Retina 2012 - Random loss of display and keyboard backlight.","user_id":169,"username":"TexpertLLC","post_date":"2018-07-10 17:24:17","message":"Okay so after resoldering the U8900 machine no longer randomly shuts off but now the trackpad\/pointer is intermittently erratic.  This was not the case before that I could tell, but it might have been, or maybe the cable for the trackpad was stressed during removal of the logic board.  Any ideas?"}
{"post_id":36891,"thread_id":35745,"title":"MBP i7 2.3 15\" Retina 2012 - Random loss of display and keyboard backlight.","user_id":1153,"username":"JohnB8812","post_date":"2018-07-10 18:13:17","message":"In my experience, 90% of the time it’s a bad tpad cable 10% bad tpad"}
{"post_id":36941,"thread_id":35745,"title":"MBP i7 2.3 15\" Retina 2012 - Random loss of display and keyboard backlight.","user_id":169,"username":"TexpertLLC","post_date":"2018-07-11 09:25:50","message":"Thanks John, just weird how the issue came up after resolder of the U8900 but then again it could have been damaged during removal of the logic board for the solder work."}
