[
    {
        "post_id":84953,
        "thread_id":62202,
        "title":"820-01814 - Will not enter Recovery mode.",
        "user_id":2333,
        "username":"realmacmods",
        "post_date":"2022-01-13 12:08:09",
        "message":"I have has this one at the shop for a few months now and have tried everything i could possibly think of, and am now at the point of seeing if someone knows something i dont about this model. \n\nCame in booting to the question mark folder. Thought, ok try internet recovery.  Will not ever enter recovery, it asks for wifi password, downloads the recovery image for about 20 minutes, looks as though its going to try to enter it, blips the fan real fast for about 1 second, shuts off, reboots to question mark as though i had done nothing at all. \n\nNo signs of damage to the board at all anywhere. all connections to everything the board are good. \n\nI have put it into DFU mode done both the revive and restore. No change afterward. \n\nI have tried several different power cords. I have put a bench supply in parallel with the battery on the off chance this was a battery issue. no change.\n\nI can boot into Target disk mode and interact with the SSD without issue. Ive put giant files on it to see if i could get it to choke at all, no issues.\n\nIt will boot into Diagnostics and comes back with no issues.\n\nI have put a Ubuntu image onto the SSD through target disk, it will not attempt to boot it.  Guessing some T2 nonsense going on there. \n\nDoes not seem possible to install Mac OS through target disk mode, the installer says its a target disk and wont continue.\n\nAnything at all i could be missing here?"
    },
    {
        "post_id":84955,
        "thread_id":62202,
        "title":"820-01814 - Will not enter Recovery mode.",
        "user_id":2333,
        "username":"realmacmods",
        "post_date":"2022-01-13 12:47:14",
        "message":"For clarity, DFU restore does not complete, or error.  The target MacBook goes to an Apple logo with a full bar, then the screen goes blank forever. Apple Configurator then switches from seeing the target in DFU mode, to a locked lock icon, and the status shown changes to \"booted\""
    },
    {
        "post_id":84957,
        "thread_id":62202,
        "title":"820-01814 - Will not enter Recovery mode.",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-01-13 14:54:26",
        "message":"Any history available?\nThis looks like T2 issue.\nIs the machine still in warranty?"
    },
    {
        "post_id":84966,
        "thread_id":62202,
        "title":"820-01814 - Will not enter Recovery mode.",
        "user_id":2333,
        "username":"realmacmods",
        "post_date":"2022-01-13 16:10:45",
        "message":"Nothing exciting, the guy rebooted one day and got the question mark.  Had him bring it in for an OS install, since it seemed like an easy one. Been pulling it out every now and again to try something different to no avail.\n\nOnly thing kind of unusual is the OEM charger he brought with it is completely dead.  I have plenty of them here, so i didnt think much of it. All USBC ports are working, so its not like the charger blew something out.  \n\nSN shows it is no longer under warranty.  Purchased in 2019.\n\nIs there anything to be done with the T2 chip? Can they be purchased\/flashed? Possible to pull a chip from a dead board and transplant it? \n\nAny chance of a bad solder joint or similar on that chip?\n\nProbably the most functional broken computer ive ever dealt with."
    },
    {
        "post_id":84969,
        "thread_id":62202,
        "title":"820-01814 - Will not enter Recovery mode.",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-01-13 16:59:10",
        "message":"We have few threads about T2, but nobody left a feedback about trying to change it and result got."
    },
    {
        "post_id":84970,
        "thread_id":62202,
        "title":"820-01814 - Will not enter Recovery mode.",
        "user_id":2333,
        "username":"realmacmods",
        "post_date":"2022-01-13 17:54:00",
        "message":"any opinion of messing with the t2 jailbreaking tool? im not even sure what it is meant to do. Any experience?"
    }
]