{"post_id":634,"thread_id":634,"title":"[solved]820-2915 U3900 BCM57765B0 Shorted... Hot as hell...","user_id":61,"username":"wrbailey","post_date":"2016-03-29 00:44:41","message":"So, this is the same 2011 15\" computer. Have it running \"fine\" however, after I was about to run tests on the board, I touched the Broadcom BCM57765B0 chip and it is boiling hot. Actually at first, I touched the other side of the board, behind the BCM chip and couldn't figure out why some components were getting very hot, with no rhyme or reason. Then I felt the other side of the board (had to remove the speaker assembly, then it was obvious)\n\nSo my question is... do I try to replace that chip, or do i just remove it from the machine entirely? On the schematic, it even says \"OMIT\" above U3900, what does that infer? Looks like it is the SD card reader\/LAN IC (which I don't care about so much Card Reader or LAN)\n\nIf I were to \"remove\" this chip from the board, what would one recommend? This has around 70 \"pins\" and would seem to be a beast to remove\/reinstall... which I am willing to try, but...\n\nAny way. If it were you, what would you do and how would you go about doing \"it\"?\n\nThanks again!!!\n\n**** JUST looked up the BC57765 and it is the Card reader IC, and LAN***"}
{"post_id":651,"thread_id":634,"title":"[solved]820-2915 U3900 BCM57765B0 Shorted... Hot as hell...","user_id":2,"username":"dukefawks","post_date":"2016-03-29 07:09:05","message":"It's dead anyway so doesn't hurt to pull it off."}
{"post_id":656,"thread_id":634,"title":"[solved]820-2915 U3900 BCM57765B0 Shorted... Hot as hell...","user_id":61,"username":"wrbailey","post_date":"2016-03-29 09:06:38","message":"[QUOTE=\"dukefawks, post: 651\"]It's dead anyway so doesn't hurt to pull it off.[\/QUOTE]\n\nOkay, just wanted to make sure it wouldn't screw up anything else. Coming off then!!\n\nI do have one from a \"hole\" donor board, I may try to put on... We'll see\n\nThanks!"}
{"post_id":731,"thread_id":634,"title":"[solved]820-2915 U3900 BCM57765B0 Shorted... Hot as hell...","user_id":61,"username":"wrbailey","post_date":"2016-03-29 23:31:23","message":"So I removed the BCM chip... no more hot spots on the board. \n\nBUT... when I was going through all the rails to make sure they were present, the PP15V_T29 is \"missing\" \nSchematic says, duh, Vout = 15V... I am only getting 0.485V on C3897... Is T29 the thunderbolt circuitry? I plugged in a thunderbolt to HDMI and it outputs to my monitor just fine... grey screen with ? Folder...\n\nIs something wrong? Will PP15V_T29 only show up under certain conditions, or do I have something wrong with the T29 Power Support circuit?\n\nThanks!!"}
{"post_id":732,"thread_id":634,"title":"[solved]820-2915 U3900 BCM57765B0 Shorted... Hot as hell...","user_id":1,"username":"larossmann","post_date":"2016-03-29 23:34:17","message":"Tell me what T29 is for, and measure when thunderbolt stuff is plugged in."}
