{"post_id":32913,"thread_id":32913,"title":"[SOLVED]820-3534-B Power Issues","user_id":1259,"username":"victor","post_date":"2018-03-24 09:27:20","message":"I got this board in because it was SOMETIMES turning on, and sometimes not. The device was reaching S0 state, but still not turning on sometimes.\n\nI found almost no liquid damage, apart from two tiny spots. One spot had discoloured a capacitor (C3282), which i replaced even though it wasn't shorted or out of cap. The other spot had ruined a resistor (R8178), and destroyed the trace beneath. This resistor was a 100ohm, and it carried PM_SLP_S3_L, which was getting stuck at one end of the dead resistor. I replaced this resistor and repaired the trace and the problem was totally solved. Computer has been perfect for the past two days.\n\nToday, i came to it and it was totally dead again, won't turn on ever now. It seems to be a new problem because more rails are missing. PM_SLP_S3_L doesn't even exist anymore for example.\n\nI've given the board two thorough cleans through the crest, and i cannot find any other areas of corrosion. Please help!\n\nPPBUS_G3H = 8.57v\nPP3V42_G3H = 3.42v\nPP5V_S5 = 5.12v\nPP5V_S4RS3 =5.12v\nPP3V3_S4 = 3.32v\nPP3V3_SUS =3.32v\nPM_SLP_S4_L = 3.32v\n\n[B]PP3V3_S3 = 0.05v\nPP5V_S0 = 0.00v\nPM_SLP_S3_L =0.00v[\/B]\n\nAny support would be greatly appreciated."}
{"post_id":32917,"thread_id":32913,"title":"[SOLVED]820-3534-B Power Issues","user_id":2,"username":"dukefawks","post_date":"2018-03-24 12:50:30","message":"U1950 would be a good suspect, pin 8 tends to corrode under the chip. Also U6100 and U1900 area. PPVRTC present?"}
{"post_id":32918,"thread_id":32913,"title":"[SOLVED]820-3534-B Power Issues","user_id":1259,"username":"victor","post_date":"2018-03-24 13:00:37","message":"Thanks for your response. PPVRTC is present. I'll flow some flux under u1950, but it looks perfect."}
{"post_id":32919,"thread_id":32913,"title":"[SOLVED]820-3534-B Power Issues","user_id":1259,"username":"victor","post_date":"2018-03-24 13:10:53","message":"I gave u1950, u6100 and u1900 the flux treatment. No cigar. Were you proposing replacing these chips?"}
{"post_id":32920,"thread_id":32913,"title":"[SOLVED]820-3534-B Power Issues","user_id":2,"username":"dukefawks","post_date":"2018-03-24 13:56:09","message":"R8178 is pretty unusual to be corroded. For liquid to get there it must also have affected the U6100 area. Did you take pictures before cleaning? Can you post a good clear picture of the area?"}
{"post_id":32921,"thread_id":32913,"title":"[SOLVED]820-3534-B Power Issues","user_id":1259,"username":"victor","post_date":"2018-03-24 14:12:24","message":"No Title\n\nAnnoyingly I didn't take a photo of the R8178 area before cleaning and repairing it. The resistor and one probe point were VERY corroded, the resistor literally fell right off. Really weird cause there is literally no sign of corrosion around u6100.\n\nI did take a photo of the discoloured cap before i replaced that though. Attached is a couple photos of the board, the discoloured cap, and the R8178 area post repair. The probe point next to it, connecting to R1667 is almost completely gone from corrosion, but the little bit left is still making a solid connection to R4852 for TPAD_SPI_MOSI and to R1667."}
{"post_id":32933,"thread_id":32913,"title":"[SOLVED]820-3534-B Power Issues","user_id":2,"username":"dukefawks","post_date":"2018-03-25 16:46:59","message":"If those pictures are of the current state R8178 looks pretty sad, did you even replace that resistor. Have you checked continuity on both sides of the resistor to other components on those lines? Also I did not see a pic of U6100 area."}
{"post_id":32938,"thread_id":32913,"title":"[SOLVED]820-3534-B Power Issues","user_id":1259,"username":"victor","post_date":"2018-03-25 19:04:35","message":"That's a replaced R8178, from a donor - it measures 100ohm as it should and has continuity on both sides. I don't think it is related to this problem, since PM_SLP_S3_L should be generated before reaching it and it isn't? The last photo shows u6100 area on the left, but not through microscope - will take another photo in work today."}
{"post_id":32944,"thread_id":32913,"title":"[SOLVED]820-3534-B Power Issues","user_id":1259,"username":"victor","post_date":"2018-03-26 03:57:59","message":"Duke, you were, of course right. The left side of R8178 had lost continuity, it DID have it, but it lost it, even though the pad underneath looked fine. I had to run a wire round to the other side of the board, connecting to the right side of R1462, which was actually measuring for PM_SLP_S3_L. Fan spinning now and problem solved! Thank you so much for your time."}
