[
    {
        "post_id":31347,
        "thread_id":31347,
        "title":"820-3115-B first no boot, now no power",
        "user_id":1104,
        "username":"Jay",
        "post_date":"2018-02-10 19:02:16",
        "message":"This board came in as \"no power\"\nFound it responded to SMC reset, fans pinned but no chime and no display power\/image. MagSafe LED green at first then orange.\n\nRe-attached 14 pins of the bottom RAM bay and set off to measuring.\n\nFound PPBUS_G3H to be 9V with the battery attached and 12.6V when the battery was disconnected. Even without battery the unit would not boot though. Fan spin, HDD spin, no chime and no display.\nPPBUS_G3H 12.6 without a battery, 9-9.6V with the battery and 11.4 with a KG battery (climbing to 11.95V or 12.04V)\n\nWhile measuring C7005 the Mac shut off instantly and hasn't powered on at all since. Power draw on PSU is 0.005--0.007 amps now.\n\nReplaced U7000, issue persists.\n\nCurrently:\nPPBUS_G3H = 0.520V\nPPDCIN_G3H = 5.5V\nPP3V42_G3H = 3.4V\nPPCHGR_DCIN = 15.85V\n\nResistance U7000 pins 27\/28 = 23ohm\n\nThis is where it becomes obvious I'm fairly new at this as there are now so many measurements and numbers in my head I am chasing my tail. Need to be put back on the right track, where should I look next?"
    },
    {
        "post_id":31349,
        "thread_id":31347,
        "title":"820-3115-B first no boot, now no power",
        "user_id":36,
        "username":"aprendiz",
        "post_date":"2018-02-10 19:19:17",
        "message":"You need 12.6V on ppbus_g3h first, check voltage on pin 2 and resistance on pins 17\/18 and 27\/28 from U7000..."
    },
    {
        "post_id":31351,
        "thread_id":31347,
        "title":"820-3115-B first no boot, now no power",
        "user_id":1104,
        "username":"Jay",
        "post_date":"2018-02-10 19:28:24",
        "message":"14.87V pin 2 of U7000, 27\/28 is 23ohm, 17\/18 is 3ohm"
    },
    {
        "post_id":31356,
        "thread_id":31347,
        "title":"820-3115-B first no boot, now no power",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-02-10 20:04:09",
        "message":"You must wonder what happened and how you killed it.\n\nIs green light still present? 0.5V on PPBUS would pretty much indicate a short to GND. Check resistance to GND on PPBUS.\n\nThere was nothing wrong in this area to start with. 9V with a battery connected is totally normal if the battery is discharged. You always measure PPBUS without battery and then it should be 12.6. With battery connected it will be at whatever voltage the battery wants it to be for charging."
    },
    {
        "post_id":31359,
        "thread_id":31347,
        "title":"820-3115-B first no boot, now no power",
        "user_id":1104,
        "username":"Jay",
        "post_date":"2018-02-10 20:38:11",
        "message":"Good to know, valuable info.\n\nGreen light turns on after about 10 sec, stays on for 5 sec then turns off and stays off.\n\nWhen measuring C7005 I could have shorted pin 1 with the probe point 1mm above it thus shorting pins 1 and 2 of U7000. Could that have done it? Not sure if that's what actually happened but only thing I can think of.\n\nPPBUS resistance to ground is 9 mega ohm and dropping."
    },
    {
        "post_id":31375,
        "thread_id":31347,
        "title":"820-3115-B first no boot, now no power",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-02-11 06:27:18",
        "message":"So green light is not really present. ACOK present from U7000?"
    }
]