{"post_id":84316,"thread_id":62139,"title":"820-01041 No boot, drop in PPVDDCPU_AWAKE voltage","user_id":26621,"username":"grmacs","post_date":"2021-12-28 12:45:38","message":"I have an A1990 board \/ 820-01041. Voltage starts at .75V but drops to .54V after a few seconds on PPVDDCPU_AWAKE.\nBoard goes to 20v and drops to 19.95V drawing 1.4A but no USB activity or inclination that it is booting.\nResistance to ground at PPVDDCPU_AWAKE seems low compared to donor board I have: 4.5 ohms compared to 13.5 ohms but donor board quite possibly isn't a good reference.\nI cant get it into DFU Mode at all but because of that, I checked AWAKE and SLPS2R voltages and discovered what I think is incorrect with the PPVDDCPU line.\n\nVcore is at .975V. Thermal cam shows fair amount of heat at PCH. Power rails going show good values though."}
{"post_id":84320,"thread_id":62139,"title":"820-01041 No boot, drop in PPVDDCPU_AWAKE voltage","user_id":682,"username":"2informaticos","post_date":"2021-12-28 14:50:15","message":"The other AWAKE and SLPS2R voltages have correct value?"}
{"post_id":84327,"thread_id":62139,"title":"820-01041 No boot, drop in PPVDDCPU_AWAKE voltage","user_id":26621,"username":"grmacs","post_date":"2021-12-28 15:34:08","message":"Yes. Through other suggestion being that I couldn't get DFU, I reflashed T2 Rom by pulling chip and placing back, but logic board behaves still the same."}
{"post_id":84328,"thread_id":62139,"title":"820-01041 No boot, drop in PPVDDCPU_AWAKE voltage","user_id":682,"username":"2informaticos","post_date":"2021-12-28 15:40:39","message":"Check the normal voltage of that rail in other T2 board.\nLift L7806-09 and R7806; check if no low value remains at U7800 side."}
{"post_id":84426,"thread_id":62139,"title":"820-01041 No boot, drop in PPVDDCPU_AWAKE voltage","user_id":26621,"username":"grmacs","post_date":"2021-12-31 15:12:55","message":"I don't have one to refer to but it looks like based on other threads it should stay at .75V. PUlling those components prevents the board from starting. It won't draw more than 5V. voltage readings on U7800 side that circumstance is .3V. Just to see what would happen, I tried injecting .75V for the awake signal to see what would happen and it seems that it interferes with the commuications because the board just stays at 20V 0 Amps and won't then drop to just under 20V like normal.\n\nWith components back on and everything normal, board goes to 20V 0 amps then drops just under 20V and The USB drive light comes on for a few seconds board draws almost 2 amps and USB light shuts off then the board goes back to drawing 20V 0 amps, and lowers to just under 20V one more time draws 80 mA, and then just stays at 20V, 0 amps and doesn't change.\n\nWondering if the CPU is shorted. This board gets all the way through and sends PLT_RST_L. CPU goes to 95 degrees celsius in a few seconds when the voltage drop under 20. The heat sink is off. I know macs run hot but that has to be too hot, too fast, correct?"}
{"post_id":84428,"thread_id":62139,"title":"820-01041 No boot, drop in PPVDDCPU_AWAKE voltage","user_id":682,"username":"2informaticos","post_date":"2021-12-31 16:07:11","message":"95 degrees in few seconds looks too much.\nCPU is susect there..."}
