{"post_id":93100,"thread_id":63153,"title":"a2289 820-01987 sort in pp2v5_nand","user_id":27549,"username":"Bravo2001","post_date":"2022-10-07 03:50:59","message":"Hi, \n\nI got an 820-01987 board with a short in pp2v5_nand. I know its a night mare but wanted to try. Also I have the donor parts so first removed U8600 Still 2.5 ohm on pp2v5_nand. Then removed U8700 and the short was gone. So wanted to only replace these two nand chips but read that you have to change all 4 as a set. So removed U8800 and U8900 to. Checked if PP2v5_nand is there but still nothing after shirt was gone. \n\nFigured out that PP2v5 is not being created beacause U9000 was dead. Replaced it and all SSD\/Nand power lines came active. Got the NAND chips from my donor and after reballing and cleaning everything. Got the chips on the exact same order back on my board. (had to do one 3 times because when I placed it I got a short!?!, figured out I had my schematic upside down (felt MEGA stupid, wasted 2 hours)) \n\nNow I know I have to restore T2 data. First DFU mode attempt failed. Board stuck at 20v, 0,046a. Second attempt again failed but board was almost booting. 20v, 0,6amp. Looks like I'm almost there. Fan spin and cpuvcore is 0,825V But does not go down. Stays at 0,825V This means not booting. Can someone Help? \n\nI was thinking something of bios? It doesn't boot... And how can I be shore NAND is correctly placed?"}
{"post_id":93103,"thread_id":63153,"title":"a2289 820-01987 sort in pp2v5_nand","user_id":682,"username":"2informaticos","post_date":"2022-10-07 09:22:44","message":"The BIOS is embedded on the T2.\nIt is reflashed in the DFU process.\n\nSo much heat applied repeatedly on the same NAND may not be too good.\nYou are not sure about chips quality now; even they have been soldered in correct order.\nTry another NAND kit..."}
{"post_id":93156,"thread_id":63153,"title":"a2289 820-01987 sort in pp2v5_nand","user_id":27549,"username":"Bravo2001","post_date":"2022-10-10 03:13:30","message":"Great tip, also this is the first time im changing NAND chip with underfill. Nightmare of a job... I have another donor here so will try that!"}
{"post_id":93388,"thread_id":63153,"title":"a2289 820-01987 sort in pp2v5_nand","user_id":27549,"username":"Bravo2001","post_date":"2022-10-18 15:41:36","message":"How much heat and air do you suggest to get NAND chips off? They are underfilled, very hard job."}
{"post_id":93389,"thread_id":63153,"title":"a2289 820-01987 sort in pp2v5_nand","user_id":682,"username":"2informaticos","post_date":"2022-10-18 17:36:56","message":"Depends on your hot air station.\nMany videos available on Internet; practice on scrap boards."}
