{"post_id":58252,"thread_id":58252,"title":"A1989 POST's OK. 4 issues, maybe linked","user_id":1879,"username":"RESQ-MYTECH","post_date":"2020-04-15 04:14:20","message":"Hello all. Hope your all keeping well and safe.\nSo, I have in an A1989. 820-00850. Logicboard is immaculate. When first powered on the progress bar will only go about 10%. after about 2 mins, fans will spin fast. Goes no further. Powering on to the boot options, two options available. One is Macintosh HD which will boot to the login screen. Other is Macintosh Install which again only goes to 10% on the progress bar. On both options fast fan spin. In the Macintosh HD once at the desktop, there is no battery indicator. When looking at the system report, shows no battery. Restart and press D on post, the results come up No Battery Detected. This is a Mid 2018 machine.\nLooking at the schematic, Page 66 Battery Hotbar Pads when I test PPVBAT_G3H_CONN i get 12.58v and there is no short to ground, so I know power is getting the the battery.\n\nMain question is this, Will the battery not being detected cause the fast fan spin and the inability to reinstall\/ upgrade the OSx?\nI suspect the battery to be faulty but want to rule out any other issues first. Dont want to buy a battery incase I am a line\/ sensor down somewhere.\n\nAs always, any help is greatfully received."}
{"post_id":58253,"thread_id":58252,"title":"A1989 POST's OK. 4 issues, maybe linked","user_id":682,"username":"2informaticos","post_date":"2020-04-15 04:21:22","message":"Trying known good battery, is the best option.\nDoesn't have a special enable screw?\nClean battery contacts."}
{"post_id":58255,"thread_id":58252,"title":"A1989 POST's OK. 4 issues, maybe linked","user_id":1879,"username":"RESQ-MYTECH","post_date":"2020-04-15 04:52:27","message":"Morning [USER=\"682\"]2informaticos[\/USER] . I have cleaned the contacts already. I also tested the battery itself and it's showing 0.001v, so completly flat. Even with the battery disconnected, I still get the fast fans and inability to run\/ install and OSx. This also happens if I try to boot from a live external drive. Would the battery issue cause the other two issues?"}
{"post_id":58256,"thread_id":58252,"title":"A1989 POST's OK. 4 issues, maybe linked","user_id":1879,"username":"RESQ-MYTECH","post_date":"2020-04-15 05:26:55","message":"I have also checked SYS_DETECT_L = 0V\/ SMBUS_3V3_BATT_SCL 3.374V \/SMBUS_3V3_BATT_SCA 3\/374V\/ BMON_IOUT 0.007V\nNot sure if this info helps"}
{"post_id":58261,"thread_id":58252,"title":"A1989 POST's OK. 4 issues, maybe linked","user_id":682,"username":"2informaticos","post_date":"2020-04-15 08:12:07","message":"You cannot get voltage on battery alone; must be enabled.\nIs the enable screw properly tight?\n\nFor other symptoms, you can try DFU recovery, to discard T2 issue."}
