{"post_id":80395,"thread_id":61735,"title":"820-01700 external monitor not working in recovery mode","user_id":7922,"username":"tcampbell34","post_date":"2021-09-20 18:41:39","message":"I got this 16\" MacBook pro in with minor liquid damage and no power. The liquid damage was on the LCD connector on the screen side and it had a partial short on PP3V3_S5. I replaced U9850 and that fixed the short on PP3V3_S5 and the board turns on and boots to the OS using an external monitor now. I don't have any good LCD's for this model right now, but wanted to reinstall a fresh copy of MacOS on it, so I tried to boot it into recovery using the external monitor but it loses the image once it get into the recovery screen. I have the internal LCD disconnected like usual, and when I first turn it on, I do get an image on my external monitor and I am able to select the Wifi network and then see the apple logo with the estimated time remaining. Then once it fully loads, it boots into recovery, but the external screen stay black. I actually had this issue with another 16\" once before and had to install the OS using VoiceOver which was a real pain. It seems for some reason the 16\" MacBook is the only one I have found that does not support external monitors in recovery mode. Have anyone else had this same issue, or have an idea on how to get recovery mode to work on an external monitor?"}
{"post_id":80400,"thread_id":61735,"title":"820-01700 external monitor not working in recovery mode","user_id":682,"username":"2informaticos","post_date":"2021-09-21 04:10:39","message":"Did you try PRAM reset?"}
{"post_id":80441,"thread_id":61735,"title":"820-01700 external monitor not working in recovery mode","user_id":7922,"username":"tcampbell34","post_date":"2021-09-21 18:30:36","message":"Yes it does not help"}
{"post_id":80442,"thread_id":61735,"title":"820-01700 external monitor not working in recovery mode","user_id":682,"username":"2informaticos","post_date":"2021-09-22 02:54:40","message":"See what happens if you restore it in DFU..."}
