{"post_id":14652,"thread_id":14652,"title":"[SOLVED]820-3437-B Green\/Amber Light no fan","user_id":61,"username":"wrbailey","post_date":"2017-02-10 22:00:11","message":"2013 Air board1.4ghz\n\nGreen Light\/Switches to amber, no fan.\n\nAll rails present up to PP5V_S5 which measures at 1.72V \n\ndiode measurement at pp5v_s5 is 0.438\n\nChecked around U7501 and it all \"looks\" fine. No obvious liquid damage to board. \n\nPP5V_S4RS3 is next on the power rails, but doesn't that come from the I\/O board? it is 0V (diode 0.421).\n\nKnown working I\/O board, measures fine on another board.\n\nAny help or ideas?"}
{"post_id":14653,"thread_id":14652,"title":"[SOLVED]820-3437-B Green\/Amber Light no fan","user_id":1,"username":"larossmann","post_date":"2017-02-10 22:41:18","message":"Before we get to troubleshooting PP5V_S5 missing, let's go over PP5V_S4RS3: it's your job to tell me why that rail's creation has nothing to do with the I\/O board.\n\nOnto PP5V_S5, which is main issue.\n\n1) Is U7501 receiving 8.4v on pin 23? This is required to power the chip. If 8.4v is NOT on pin 23, blown internal board via\/trace. Fix with wire.\n2) Is U7501 receiving 3.3v on pin 12? This SMC_PM_G2_EN signal tells the chip after it has turned on, that it should enable the PP5V_S5 rail. If not, then perhaps U7501 is bad and pulling it down, OR SMC is not creating it. Bad SMC perhaps.\n\nIf answers are both yes, then it's time to figure out why PP5V_S5 is low. You have ruled out a short to ground, which means bad chip. Replace U7501."}
{"post_id":14654,"thread_id":14652,"title":"[SOLVED]820-3437-B Green\/Amber Light no fan","user_id":61,"username":"wrbailey","post_date":"2017-02-10 23:32:01","message":"PIN 23 - 8.57V\nPIN 12 - 3.4V\n\nSo I am going with bad U7501.\n\nIt does look as though U7501 creates PP5V_S4RS3 as well... does it go to the i\/o board for USB power?"}
{"post_id":14655,"thread_id":14652,"title":"[SOLVED]820-3437-B Green\/Amber Light no fan","user_id":1,"username":"larossmann","post_date":"2017-02-11 00:30:33","message":"Ding ding ding."}
{"post_id":14659,"thread_id":14652,"title":"[SOLVED]820-3437-B Green\/Amber Light no fan","user_id":61,"username":"wrbailey","post_date":"2017-02-11 09:22:21","message":"Ha. Thanks. Any tips on replacing the U7501? Pretty much just like an ISL\/u7000?"}
{"post_id":14676,"thread_id":14652,"title":"[SOLVED]820-3437-B Green\/Amber Light no fan","user_id":61,"username":"wrbailey","post_date":"2017-02-11 22:25:00","message":"You'll be proud Louis... I had to use my brain! Haha. \n\nReplaced u7501 twice. 5v was not showing up either time (1.7v.) The chip was getting hot... I finally took diode measurements of all the pins on the board where the U7501 goes. I figured out the 3.3 lines were shorted to ground by Q7560. I replaced that and the short went away. Replaced the U7501 one more time and fan spins and passes ASD and boots, etc... \n\nThanks again for all your help and your \"teaching\" moment. The forum is an awesome resource and I hope you and Duke and all the other contributors stick around for quite a while!\n\nOn a side note, if you read this post. Do you still offer the week of training\/teaching in your NYC office? I'd still be interested in that...\n\nThanks!\n\nWill Bailey"}
