{"post_id":54762,"thread_id":54762,"title":"820-00165 (S0 state Brain Dead) Flawless physical condition.  NOT WATER!","user_id":5210,"username":"KC Micro Tronix","post_date":"2019-11-23 07:31:09","message":"This is the second time I have seen this.\n\nNormal boot up behavior is 350mA for a sec then jumping to 550mA and bouncing around as the CPU is working. In thermal when the 550mA happens you can see the memory come to life. In this board as in the last one I encountered it starts in at 350mA then bumps up to 425mA and just sits there with no CPU \/ Memory activity. I have already replaced the bios and verified all the clocks.\n\nI know that evidence points at the CPU but I have to know for sure before I condemn this board to donor status. I still have the other one that did this as well.\n\nI fired up the Tek784 and there is no data activity on MEM A or B CAB lines.  I also verified that the bios was being read by the CPU."}
{"post_id":54765,"thread_id":54762,"title":"820-00165 (S0 state Brain Dead) Flawless physical condition.  NOT WATER!","user_id":682,"username":"2informaticos","post_date":"2019-11-23 14:48:46","message":"If power on sequence is finished and board stuck after PCH_RESET_L is released, then should be communication problem in some data bus.\nCPU is the first suspect in this case.\nAny history available?\nYou can try to heat CPU with quality flux."}
{"post_id":54770,"thread_id":54762,"title":"820-00165 (S0 state Brain Dead) Flawless physical condition.  NOT WATER!","user_id":5210,"username":"KC Micro Tronix","post_date":"2019-11-23 16:56:40","message":"RESET_L is at a happy 3V3.\nI put the board in the rework machine pile.   This is not a CPU short.  I totally agree it's a faulty data line.  It's like to does not properly load the bios.  It does not even try to access RAM.  Unfortunately most of the lines I need to test are pads under the CPU or the memory modules."}
{"post_id":55424,"thread_id":54762,"title":"820-00165 (S0 state Brain Dead) Flawless physical condition.  NOT WATER!","user_id":427,"username":"overshoot","post_date":"2019-12-19 21:36:10","message":"I've seen you say in 2 posts that you could confirm that the Bios was being read by the CPU.\nHow do you achieve that please?"}
