[
    {
        "post_id":23506,
        "thread_id":23506,
        "title":"What is up with the 2015 13\" MacBook Pro Display failures?",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-07-26 11:21:34",
        "message":"This isn't about a specific board, but I have been inundated with 2015 820-4924 units with display issues. They either have no backlight, no display activity at all, or intermittent issues. A lot of them seem to be resolved with PRAM resets\/reseating the display connector, but there are still an inordinate amount of 2015 13\" units coming in with no liquid damage, no drop damage, and no display. When I check the boards, they're fine, but no video. About half the time, the display magically reappears after removing\/reinstalling the board into our test unit then back into customer machines.\n\nI know Apple introduced new displays for the 2015 models and there are EDID differences that cause earlier LCD assemblies to not work with the 2015 model. Is this same \"change\" responsible for the incredibly finicky nature of the display working\/not-working? If you search eBay for 2015 13\" LCD displays, you'll see a lot for sale as \"no display\", etc.\n\nWhat gives? Has anyone noticed this, and have you figured anything out? Each time I see one come into the shop with no liquid and no display, I get a little aggravated because I know it's most likely this random failure of display.\n\nJust curious if anyone else has experienced it."
    },
    {
        "post_id":23509,
        "thread_id":23506,
        "title":"What is up with the 2015 13\" MacBook Pro Display failures?",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2017-07-26 13:26:42",
        "message":"Did you check SMC_LID signal?"
    },
    {
        "post_id":23521,
        "thread_id":23506,
        "title":"What is up with the 2015 13\" MacBook Pro Display failures?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-07-26 19:52:36",
        "message":"I have had some bad LCD cables on these. They are all the same between A1502"
    },
    {
        "post_id":23530,
        "thread_id":23506,
        "title":"What is up with the 2015 13\" MacBook Pro Display failures?",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-07-26 20:57:59",
        "message":"Thanks, duke. I'll need to check that...it's certainly odd how many I've seen in such a short time."
    },
    {
        "post_id":23575,
        "thread_id":23506,
        "title":"What is up with the 2015 13\" MacBook Pro Display failures?",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2017-07-28 11:41:37",
        "message":"my best guess is the CPU doesn't like being boiled as a result of the fan not kicking in as quickly as it did on prior years."
    },
    {
        "post_id":23584,
        "thread_id":23506,
        "title":"What is up with the 2015 13\" MacBook Pro Display failures?",
        "user_id":135,
        "username":"bjf",
        "post_date":"2017-07-28 14:45:00",
        "message":"Buy a stack of LCD cables from China. You'll burn through them all. You can have a spill that's not remotely close to the LCD connector and it will still find a way of failing. It's as if they're using fuse wire in the cable, which they might be. I've found the issue in a few of the Retina models, but definitely the 13\" is where I really notice it most. And the cables are interchangeable between A1502 13\" and 15\" models and easy to replace which is convenient."
    }
]