[
    {
        "post_id":94281,
        "thread_id":63309,
        "title":"820-00928",
        "user_id":20112,
        "username":"iFix",
        "post_date":"2022-11-23 09:11:57",
        "message":"Hi.\n\nBackground: LCD was not showing an image at all, an issue with the speaker, and also the battery was inflated. I ordered a new LCD original(just LCD) unglued the old one and tested it all the time with the new LCD. When powered on with or without battery it shows a picture, sometimes it goes to log in(with battery) and works for a bit and then turns off, and sometimes on loading, it will just restart. When it restarts sometimes it will show only the backlight, sometimes nothing. I found corroded CB 211 and removed it and also the row of C3523 near U3500(resoldered all of them). I have replaced U9850(donor board), but still the same thing. I tried also a new battery just in case.  Note with the old LCD doesn't show a picture at all I tried it again after I tried with the new LCD. I noticed on the thermal camera it heats up around 55 degrees L7030 and Q7030. Also, the chipset sometimes goes up to 55-56degrees. \n\nAny ideas would be appreciated"
    },
    {
        "post_id":94286,
        "thread_id":63309,
        "title":"820-00928",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-11-23 10:22:42",
        "message":"55 degrees is not an elevated temperature.\n\nDid you test in SMC bypass and safe mode?\nTry new installation (from Internet Recovery) too."
    },
    {
        "post_id":94293,
        "thread_id":63309,
        "title":"820-00928",
        "user_id":20112,
        "username":"iFix",
        "post_date":"2022-11-23 23:38:28",
        "message":"Once I try to go into Internet recovery it gets frozen with some colors on the World icon, and sometimes even gets frozen in Boot. The screen stay on normal and the trackpad clicks, fans are spinning normally just the screen freezes. I was doing some more testing this morning and encountered this mentioned above..."
    },
    {
        "post_id":94294,
        "thread_id":63309,
        "title":"820-00928",
        "user_id":20112,
        "username":"iFix",
        "post_date":"2022-11-24 00:17:58",
        "message":"After a while when the board will heat up it refuses to show even an image. I'm suspecting the GMux or in the worst case the GPU"
    },
    {
        "post_id":94295,
        "thread_id":63309,
        "title":"820-00928",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-11-24 00:49:03",
        "message":"Looks like GPU problem..."
    },
    {
        "post_id":94298,
        "thread_id":63309,
        "title":"820-00928",
        "user_id":20112,
        "username":"iFix",
        "post_date":"2022-11-24 03:12:29",
        "message":"Thanks for the help :)"
    }
]