{"post_id":16145,"thread_id":16145,"title":"HP-15 (LA-A996P, rev1.0) can't see OS in any media (HDD, USB, etc)","user_id":136,"username":"george-a","post_date":"2017-03-08 07:35:22","message":"Hi guys,\n\nI know this is not Apple but I think duke handles those, too.\n\n\nThis one turns on properly, enters the BIOS if necessary but can not see OS in any attached media. Can see there is a HDD or a USB connected but won't load the OS (Windows, Linux, whatnot)\n\nLegacy boot is enabled, secure boot disabled in BIOS settings.\n\nI have reprogrammed the main BIOS as well as the controller firmware (KB9012) and the behavior remains the same.\n\nAny ideas?\n\nbr,\ngeorge"}
{"post_id":16162,"thread_id":16145,"title":"HP-15 (LA-A996P, rev1.0) can't see OS in any media (HDD, USB, etc)","user_id":2,"username":"dukefawks","post_date":"2017-03-08 11:34:01","message":"No idea, put back original BIOS cause of Windows activation codes. Enable UEFI, you really trying to boot 7 on this thing?"}
{"post_id":16204,"thread_id":16145,"title":"HP-15 (LA-A996P, rev1.0) can't see OS in any media (HDD, USB, etc)","user_id":136,"username":"george-a","post_date":"2017-03-09 02:42:12","message":"well I have the backup BIOS so that won't be an issue but it does not boot anything either Windows 7, or Linux for that matter.. I was just wondering if you have seen this behavior (of not seeing the OS in the HDD) before.. \n\ncheers dude. we move on :)"}
{"post_id":16221,"thread_id":16145,"title":"HP-15 (LA-A996P, rev1.0) can't see OS in any media (HDD, USB, etc)","user_id":2,"username":"dukefawks","post_date":"2017-03-09 04:51:18","message":"This should only boot win8\/10 in UEFI mode. I bet there is nothing wrong with this machine, just use the correct bootable device which is a UEFI USB stick with win10."}
{"post_id":16228,"thread_id":16145,"title":"HP-15 (LA-A996P, rev1.0) can't see OS in any media (HDD, USB, etc)","user_id":136,"username":"george-a","post_date":"2017-03-09 05:49:54","message":"but I have already changed that in the BIOS. I enabled legacy boot and disabled secure boot options. I have tested these laptops in the past with Live Linux USBs. They fail a lot, mostly their BIOSes get corrupted or their 3.3\/5V supply. I have repaired a few so far but only this one can't see any OS - I did not try Win10 UEFI but I guarantee you that I have setup the BIOS in such a way that its not obligatory."}
{"post_id":16234,"thread_id":16145,"title":"HP-15 (LA-A996P, rev1.0) can't see OS in any media (HDD, USB, etc)","user_id":2,"username":"dukefawks","post_date":"2017-03-09 06:08:15","message":"So you tried all the stuff that is hardly supported and not the one thing these machines are really made for. 99% it will work fine with UEFI boot."}
{"post_id":16307,"thread_id":16145,"title":"HP-15 (LA-A996P, rev1.0) can't see OS in any media (HDD, USB, etc)","user_id":136,"username":"george-a","post_date":"2017-03-10 08:52:13","message":"ok this was the solution: RE-ENABLE secure boot as if you will use UEFI boot media and then DISABLE it again (asks for a 4-digit code + ENTER). It now boots from legacy USB and HDD. mofo computer - you were right of course - I just didn't have a spare HDD with UEFI installation and since I made the correct BIOS settings for legacy boot my brain would not accept failure :D\n\nthanks duke."}
