{"post_id":97419,"thread_id":63696,"title":"820-3764-A, short","user_id":44922,"username":"Max7","post_date":"2023-03-11 13:22:23","message":"A water damaged logic board. Cleaned up and replaced quite a few parts. However, eventually hit this issue.\n\nUpon applying power to the board, after about 1 second, R7020 gets extremely hot. There is no short to ground on either side of the resistor and each side reads 60-70K to the ground. Resistor itself is fine at 47ohm. D7005 are fine, so does C7092, 91, 90. \n\nThe part I get confused is that ping 2 of the resistor reads 16.5V, and pin 1 ready 3.3v ! Pin 1 connects to DCIN ISOL BLEEDER circuit on the upper part of page 51. What does this circuit do ? Mosfet Q7010 was warming up a bit (with no shorts), replaced it just in case but made no difference. Q7020, Q7030 are not installed, adding more to the confusion. \n\nHow can I figure out the source of the over current going through R7020 ?\n\nThanks"}
{"post_id":97423,"thread_id":63696,"title":"820-3764-A, short","user_id":682,"username":"2informaticos","post_date":"2023-03-11 17:18:51","message":"You didn't say anything about PPBUS_G3H and 3V42_G3H.\nStart checking diode mode to ground on both; also check voltages, if exist.\n\nRemove R7020 and post voltage on both pads."}
{"post_id":97432,"thread_id":63696,"title":"820-3764-A, short","user_id":44922,"username":"Max7","post_date":"2023-03-12 09:59:42","message":"PPBUS_G3H = 1v, Diode mode voltage drop 0v\n3V42_G3H = 0.250v, Diode mode voltage drop 0.125v\n\nAfter removing R7020, pad 1 = 16.5v, pad 2 = 1v\nEDIT: I actually removed F7140 as well when I got the above reading, when I put it back pad 2 drops to 0v."}
{"post_id":97433,"thread_id":63696,"title":"820-3764-A, short","user_id":682,"username":"2informaticos","post_date":"2023-03-12 10:46:04","message":"\"ping 2 of the resistor reads 16.5V, and pin 1 ready 3.3v\n..........................................\n pad 1 = 16.5v, pad 2 = 1v\"\nWhere is the error?\nPlease, post accurate information from the beginning!\nYou had all the time 16.5V on pad 1 (coorect in fact).\n\nI repeated thousand times on the forum; STOP wrtiting end \"V\" on diode mode readings.\nWe don't need confusions.\n\n\"Diode mode voltage drop 0v\"\nNo idea what this means.\n\nOne of C7090-92 has leakage, or bad U7090.\nCheck U7090 pin 6 voltage, removing C7090-92 one by one.\nIf still low, change U7090; check voltage without resolder it first."}
