{"post_id":45954,"thread_id":45954,"title":"820-2936-B Battery not recognized","user_id":2316,"username":"Naevius","post_date":"2019-02-10 16:20:26","message":"I have a 820-2936-B board which was completely dead. There was a short on PP3V42_G3H, which was a short internally in the ISL. Replaced the ISL and the system booted.\nBut now it doesn't run on battery, and the system doesn't recognized a battery. The battery that was present was at 0V, so completely dead. Replaced with a known working battery, but still doen't see the battery.\n\nWith just the battery connected I am getting PP3V42_G3H, but nothing else. \n\nOn the battery connector (J6950) I am getting 3.42V on SMBUS_SMC_BSA_SCL (pin 4) and SYS_DETECT_L (pin 5), but 0V on SMBUS_SMC_BSA_SDA (pin 6).\nSo the clock for communication is likely present, but doesn't want to talk. Not sure what SYS_DETECT_L does, since is just seem to be a dud.\n\nSince the ISL was shorted and likely drained the battery completely there might have been 10.5V on the SMBUS_SMC_BSA_SDA, and damaging the SMC. I measured the SMBUS_SMC_BSA_SDA line form U6950 to the ISL, which is not broken. SMBUS_SMC_BSA_SDA measures 0.480V to ground in diode mode, so seems there is no short.\n\nJust to be sure I had a good ISL, I replaced it by another new one, same issue.\n\nAre there anymore things I can try before concluding the SMC is \"dead\"?"}
{"post_id":45955,"thread_id":45954,"title":"820-2936-B Battery not recognized","user_id":682,"username":"2informaticos","post_date":"2019-02-10 16:35:39","message":"SCL\/SDA lines must have less than 1% difference in diode mode to ground; check that (red probe to ground).\nDon't forget to disconnect BIL connector, if get bigger difference, or if still get 0V on SDA line.\nD6950 should be removed too; in case of bad measurement on battery bus.\nBut first of all, check R5280 integrity."}
{"post_id":45963,"thread_id":45954,"title":"820-2936-B Battery not recognized","user_id":2316,"username":"Naevius","post_date":"2019-02-10 17:21:22","message":"Checked R5280, seems fine (1990 ohms, should be 2k). Strangly enough I now have 3.42V on SMBUS_SMC_BSA_SDA, and 0.26V on SYS_DETECT_L. I'm a 100% sure it wasn't like that before. Still doesn't recognize or run on the battery tho.\n\nMeasurements before removing D6950:\nSMBUS_SMC_BSA_SDA 0.465V\nSMBUS_SMC_BSA_SCL 0.451V\n\nAfter removing D6950:\nSMBUS_SMC_BSA_SDA 0.445V\nSMBUS_SMC_BSA_SCL 0.458V\n\nThe measured values on diode mode very slowly rise while measuring. These values are after about 1 minute of measuring, and seem pretty stable.\n\n\nWhat does it imply that the values are more that 1% different from each other tho?"}
{"post_id":45964,"thread_id":45954,"title":"820-2936-B Battery not recognized","user_id":682,"username":"2informaticos","post_date":"2019-02-10 17:27:10","message":"SYS_DETECT_L should be low as correct.\n\nLet the board to cool before measuring diode mode on battery bus.\nStrange to get SDA, then SCL with lower value than the other line...\nAllow 20-30s after power is removed, for any continuity (diode mode, ohm mode) checking.\n\nPut good flux and reflow SMC.\nIf still no battery recognized, change SMC.\nYou can try reballing it first."}
{"post_id":46003,"thread_id":45954,"title":"820-2936-B Battery not recognized","user_id":2316,"username":"Naevius","post_date":"2019-02-11 15:27:33","message":"Reflowed the SMC, no change. I don't have a donor board for this, and not sure if it's worth it buying one for this old machine.\n\nI searched for the SMC itself (F2117LP20H) on Ali and Ebay, but pretty sure all the ones I found don't have the firmware in them. Do you know of a place where I can just buy the SMC?\n\nI'll try reballing the SMC tomorrow, but I have this feeling it's fried because 11V from the battery that probably got on the SMBUS_SMC_BSA_SDA line."}
{"post_id":46027,"thread_id":45954,"title":"820-2936-B Battery not recognized","user_id":682,"username":"2informaticos","post_date":"2019-02-11 19:09:07","message":"Such high voltage fried SMC for sure.\nBut normally this should be visible as abnormal resistance to ground on that line.\nIf you already removed\/replaced D6950 and changed ISL6259, then only SMC remains...\n\nLook on galaxyelectronics2015 eBay store; he has very good price for scrap boards.\nI mentioned him several times in the forum, including Skype details.\nDo a search on the forum, if you are interested..."}
{"post_id":46033,"thread_id":45954,"title":"820-2936-B Battery not recognized","user_id":2316,"username":"Naevius","post_date":"2019-02-11 20:00:32","message":"I ordered a donor board from him. Was $15 including shipping, so very good price. Just takes a month to get here\nThis will have to be continues at a later date I guess.\n\nThanks for sharing your knowledge 2informaticos, really appreciate it :)"}
{"post_id":46048,"thread_id":45954,"title":"820-2936-B Battery not recognized","user_id":682,"username":"2informaticos","post_date":"2019-02-12 04:53:34","message":"Before changing SMC, be sure no overvoltage on SCL\/SDA lines when battery is connected...\nRest of liquid spill under battery connector can easy kill the SMC."}
{"post_id":46940,"thread_id":45954,"title":"820-2936-B Battery not recognized","user_id":2316,"username":"Naevius","post_date":"2019-03-02 15:55:22","message":"The donor board came in.\n\nReballed and replaced the SMC. Now the system runs on battery, but won't charge. Now also the system doesn't want to run on just the charger.\n\nWith just the battery connected the system sees the battery, but when connecting the charger the light goes green, but the systen says 'charging off' where normally the battery percentage would be.\n\nWith just the charger connected PPBUS_G3H is 4.08V. PP3V42_S5 and PP3V3_S5 are good. I do get a green light on the charger. With the battery connected PPBUS_G3H is 12.27V.\nPPBUS_G3H seems to be created by the ISL using Q7030\/Q7035\/L7030. Took the ISL from the donor to replace my previously replaced one, but same issue.\n\nQ7030\/Q7035 seem ok, no short. L7030 measures 0.5 ohms, so probably fine.\nOn pin 5\/Q7030 I get 16V, but pin 1\/2\/3 has 4.08V. Also on F7040 I get 4.08V.\n\nTook the SMC off again, reballed and reflowed again, but same issue. Pretty sure the SMC is sitting fine of the board.\n\nResistance of PP3V42_S5 to GND is 2k ohms (0.267V in diode mode), so pretty low, but I don't think that is causing this issue. The 2k ohms resistance remained when the SMC was off the board.\n\nIs the SMC from the donor also dead? Can a SMC even cause this?"}
{"post_id":46943,"thread_id":45954,"title":"820-2936-B Battery not recognized","user_id":682,"username":"2informaticos","post_date":"2019-03-02 19:45:45","message":"Did you pick the SMC from same model board?\nCheck resistance between pins 17\/18 and 27\/28.\nBe sure R\/C7025 are both good.\n\nDid you test with original 60\/85W Magsafe 1 charger?"}
{"post_id":46947,"thread_id":45954,"title":"820-2936-B Battery not recognized","user_id":1153,"username":"JohnB8812","post_date":"2019-03-02 23:18:30","message":"Check resistance between pins 17\/18 and 27\/28 of the ISL6259 sounds like current sensing issue"}
{"post_id":46985,"thread_id":45954,"title":"820-2936-B Battery not recognized","user_id":2316,"username":"Naevius","post_date":"2019-03-04 14:54:09","message":"Pin 17\/18 was 600 ohms, traced down to faulty R7051, which should be 2.2 ohms, was ~600. After replacing this resistor the machine is working again.\n\nI would not have expected for a current sens issue to have this effect... so I've learned something.\n\nThanks again for your help :)"}
