{"post_id":86751,"thread_id":62393,"title":"2015 Macbook Pro 11,5 flickering display issue - no damage","user_id":35089,"username":"Mcole","post_date":"2022-02-27 11:12:21","message":"I have a 2 identical 2015 mbp 11,5 units and both have the AMD \/ Intel graphics setups. The 1st one works perfect with no issues at all. The 2nd unit after upgrading to Monterey from Big Sur developed a red flashing shadow effect (best way to describe it) like a red light source was being flashed from top left corner of screen towards bottom right corner. It would literally cast a \"shadow like effect\" across all icons on the desktop unless you moved the cursor and then the flashing stopped. This has progressed to vertical lines flashing and again stops when the cursor is moved. This flashing effect can be stopped by changing the setting to not allow graphics switching from AMD gpu to Intel gpu. So as long as unit is on AMD gpu only it works fine. Took 2nd unit apart and looked over board and its extremely clean, little dusty but otherwise clean, with no visible corrosion or damage. While researching possible causes of the aforementioned problem I happened to come across a video that Mr. Rossmann did about a mbp that had high fan spin and what appeared to be a sensor failure and ended up being a bad screen causing the problem. So being curious I took the screen from the 1st mbp, the one that worked perfect, and put it on the 2nd mbp and the 2nd one worked perfectly fine. I then took the screen from the 2nd mbp and placed it on the 1st mbp and it now had the exact same problem that the 2nd one did in the beginning. To test if it was something to do with a possible issue that the screen now somehow didn't \"like\" the signal from a Intel gpu I took the screen, that now appears to be bad, and connected it to a 2015 mbp 11,4 that only has the integrated Intel gpu and it had the same flickering issue. Placing the original mbp 11,4 screen on the 2nd mbp 11,5 also allows it to function normally. \nSo here are my questions - What is wrong with the 2nd mbp 11,5 screen that it works perfect when getting a signal from AMD gpu but has an issue when getting a signal from a Intel gpu? Did the upgrade from Big Sur to Monterey somehow cause an issue on this particular screen? Upgrading did require a firmware update as part of the upgrade and both mbp 11,5 units are running the latest version of Monterey 12.2.1 but only the 2nd unit is affected. Is there a way to correct this issue without replacing the screen assembly and how to prevent from happening to other similar units?"}
{"post_id":86757,"thread_id":62393,"title":"2015 Macbook Pro 11,5 flickering display issue - no damage","user_id":682,"username":"2informaticos","post_date":"2022-02-27 16:04:50","message":"First of all, welcome to the forum!\n\nIf you located the fault in LCD assembly for sure, then change it.\nYou connected another one with same Monterey and nothing bad happened.\nMaybe had problems from before.\n\nJust in case, do PRAM reset in both machines."}
{"post_id":86760,"thread_id":62393,"title":"2015 Macbook Pro 11,5 flickering display issue - no damage","user_id":35089,"username":"Mcole","post_date":"2022-02-27 19:28:33","message":"Thank you.\nI already did a pram reset on both mbp 11,5 systems and a smc reset on both devices as part of the initial diagnostics. Something in the screen assembly definitely isn't working correctly but trying to figure out what that something is. Didn't know if someone has come across this and been able to fix it before without replacing the screen assembly since it is not exactly cheap to replace. Have seen similar issues popping up from an update done in Big Sur in a couple of forums but nobody seems to know why or what is causing it and just gives the suggestion of replacing the screen. I mean the screens job is to just display a picture from the information sent from the gpu. So what signal from an Intel gpu does the screen not like, on 3 machines, but is perfectly fine from an AMD gpu? The screen was working perfectly fine before updating to Monterey so something changed in the screen but what? Just trying to figure out to prevent from happening again or if I get a replacement screen and it has the same issue the problem could be fixed."}
{"post_id":86761,"thread_id":62393,"title":"2015 Macbook Pro 11,5 flickering display issue - no damage","user_id":682,"username":"2informaticos","post_date":"2022-02-28 03:44:04","message":"There is no separate via for Intel\/AMD to internal LCD.\nInternal eDP video comes from Analog MUX.\nMaybe the upgrade changed something on display EEPROM.\nOpen a broken screen and check if pins 6\/7 of J8300 connect with such EEPROM."}
