[
    {
        "post_id":25330,
        "thread_id":25330,
        "title":"[SOLVED]820-00239 touchbar madness",
        "user_id":681,
        "username":"iambehr",
        "post_date":"2017-09-13 21:54:12",
        "message":"Hello,\nI got a new one in the shop today. Left side liquid damage. Replaced tons of ruined passives around U3200. Board would not get power from USB C charger before, now it gets power, charges, and boots.\nI had to reconnect pins 19 and 21 on the J4402 \"DFR Touch Connector\" due to corrosion eating the pads. So far all else looks OK.\nHowever, left side fan is not spinning at all and the right side fan is spinning on high. Internal diagnostics only report generic fan error. Diagnostic will spin the left side fan for a few seconds and stop.\nAnybody have an idea of what to check?\nLooks like there are separate left and right fan control and tach reporting channels, as well as separate left and right fin stack temp sensors.\nThe fan\/keyboard connector has escaped any damage.  \nMy best guess is left side temp sensor, and I will check that tomorrow.\n\nThanks,\n\nStefan"
    },
    {
        "post_id":25361,
        "thread_id":25330,
        "title":"[SOLVED]820-00239 touchbar madness",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-09-14 19:12:28",
        "message":"Temp sensors should be fine if diagnostics doesn't report error. I'm not even sure if on the 00239 the fans should spin when cold. Maybe the fast fan is the issue because of a tacho signal issue."
    },
    {
        "post_id":25583,
        "thread_id":25330,
        "title":"[SOLVED]820-00239 touchbar madness",
        "user_id":681,
        "username":"iambehr",
        "post_date":"2017-09-19 09:17:46",
        "message":"Board is on my low priority queue at the moment. \nSwitched fans and same behavior. Ridiculous but there is fan control circuitry on the back of the keyboard. The keyboard ssembly is a PCB substrate. I see no signs of corrosion on it however.\nStandard behavior is no fan spin I believe. With tpad unplugged both fans spin, right fan still at high speed."
    },
    {
        "post_id":25592,
        "thread_id":25330,
        "title":"[SOLVED]820-00239 touchbar madness",
        "user_id":681,
        "username":"iambehr",
        "post_date":"2017-09-19 12:29:01",
        "message":"[SIZE=14px][B]FIXED![\/B][\/SIZE]\n\n[SIZE=14px]All repairs listed:\n\nReplaced passives around U3200. Lots of ruined caps and resistors.\nRan wire to reconnect pins 19, 21, on the DFR Touch Connector.\nFan control at Q6050 was screwed up. Had to replace R6051 and run wire to reconnect it to pp3v3_s0.\n\nMy first time with a touchbar mac... and I hope, my last... haha.\n\nThanks,\n\nStefan[\/SIZE]"
    },
    {
        "post_id":25618,
        "thread_id":25330,
        "title":"[SOLVED]820-00239 touchbar madness",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-09-19 19:59:59",
        "message":"Nope, this is the future of repair and it is not looking good :("
    },
    {
        "post_id":53768,
        "thread_id":25330,
        "title":"[SOLVED]820-00239 touchbar madness",
        "user_id":2468,
        "username":"Greg",
        "post_date":"2019-10-23 17:23:46",
        "message":"[QUOTE=\"iambehr, post: 25583\"]Board is on my low priority queue at the moment.\nSwitched fans and same behavior. Ridiculous but there is fan control circuitry on the back of the keyboard. The keyboard assembly is a PCB substrate. I see no signs of corrosion on it however.\nStandard behavior is no fan spin I believe. With tpad unplugged both fans spin, right fan still at high speed.[\/QUOTE]\n\nHi sorry to revive this old thread but is this true about the keyboard? As i just revived one of these machines by removing a couple of shorted capacitors but the fans runs constant high and system very slow,\nWas told liquid into touchbar and keyboard both dont work, But track pad does work, is there a thermal sensor in touch bar or keyboard?"
    },
    {
        "post_id":53770,
        "thread_id":25330,
        "title":"[SOLVED]820-00239 touchbar madness",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-10-23 17:35:14",
        "message":"Please open new thread, don't revive such old one.\nAnd post there exact board model you have."
    }
]