[
    {
        "post_id":58379,
        "thread_id":58379,
        "title":"Touchbar Critical software update required",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2020-04-18 13:26:46",
        "message":"I'm just posting this here for reference as this is a common issue and there are many different causes. This is not about the network error but the error that occurred during installation of the update.\n\nThe critical software update is triggered if during normal OSX boot the T1\/T2 chip cannot successfully boot BridgeOS that controls the touchbar\/touchID\/camera\/ALS\/Dmic. \n\n1 BridgeOS can ONLY be installed on the internal SSD so if the onboard SSD is dead or the lifeboat jumper connector is missing this error will be triggered even if booting from an external USB drive.\n\n2 BridgeOS will also fail to initialize if there is a problem with the actual touchbar and it can even make the machine kernel panic when booted in OSX. Disconnect touchbar for testing, T1\/T2 can boot without it.\n\n3 The camera\/ALS is connected to the T1\/T2 chip and is the most common failure on the 13\" models. So unlikely as it seems, the LCD can also cause the critical software error. The problem is the crappy flex cable that causes the backlight issues on the 13\" LCDs also. So connect a known good LCD or disconnect it and use an external LCD.\n\n4 Disconnect the touchID, I have not seen this cause the error yet, but it does not hurt to disconnect it.\n\n\nIf after these steps you still get the update error, only then the board should be suspected. There are no common issues with the board besides corrosion or knocked off components."
    },
    {
        "post_id":85526,
        "thread_id":58379,
        "title":"Touchbar Critical software update required",
        "user_id":29141,
        "username":"tipoti",
        "post_date":"2022-01-24 22:36:43",
        "message":"I get the same error on the device with A1706 touch bar. I tried removing the internal screen and the result did not change. I tried removing all sockets on the motherboard and the result did not change. It only opens in safe mode. I don't understand why it won't enter DFU mode yet"
    },
    {
        "post_id":85529,
        "thread_id":58379,
        "title":"Touchbar Critical software update required",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-01-25 00:53:55",
        "message":"A1706 doesn't have a T2 chip..."
    },
    {
        "post_id":85551,
        "thread_id":58379,
        "title":"Touchbar Critical software update required",
        "user_id":29141,
        "username":"tipoti",
        "post_date":"2022-01-25 08:26:09",
        "message":"Critical software update error can be caused by what? I tried everything I wrote above."
    },
    {
        "post_id":85553,
        "thread_id":58379,
        "title":"Touchbar Critical software update required",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-01-25 08:30:09",
        "message":"Please open new thread with your problem..."
    }
]