[
    {
        "post_id":45626,
        "thread_id":45626,
        "title":"820-00165 Not Booting from any media",
        "user_id":2120,
        "username":"Melamanti",
        "post_date":"2019-02-04 00:57:36",
        "message":"Hello, \n\nGot a 820-00165 that had a not powering up issue, after some measuring around and after a burnt isl replacement the machine would then not charge the battery. After replacing the smc now it powers up, chimes, i get an asd without errors but it wont boot on any media.\nI connect the hdd it shows me the envelope with the question mark, i connect a yosemite install usb, it starts loading half way through it gets stuck but if you leave it going for like 5 minutes you can hear the infamous \"to use english for the main language\" thingie but the bar is still half way through and no install ui shows up.\nAny ideas?"
    },
    {
        "post_id":45627,
        "thread_id":45626,
        "title":"820-00165 Not Booting from any media",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-02-04 01:37:48",
        "message":"Try new BIOS with clean ME region.\nSearch the forum, I bet a dump is already posted somewhere..."
    },
    {
        "post_id":45634,
        "thread_id":45626,
        "title":"820-00165 Not Booting from any media",
        "user_id":2120,
        "username":"Melamanti",
        "post_date":"2019-02-04 02:56:42",
        "message":"I did download the bios you had uploaded, and i think somebody else stated it before me but that file is not ok.\nThe machine doesnt even chime with that bios.\nAnyone managed to get their hands on a clean me bios for these boards?"
    },
    {
        "post_id":45636,
        "thread_id":45626,
        "title":"820-00165 Not Booting from any media",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-02-04 04:42:57",
        "message":"Upload your BIOS backup somewhere..."
    },
    {
        "post_id":45637,
        "thread_id":45626,
        "title":"820-00165 Not Booting from any media",
        "user_id":2120,
        "username":"Melamanti",
        "post_date":"2019-02-04 05:22:33",
        "message":"No its ok, thank you. \nNot looking for a monkey see monkey do kind of help.\nYou already helped a lot just by pointing me to the right direction.\nDid some google search, was able to find many guides on how to clean the me region. \nI actually did it and the machine is now in perfect condition. Would be glad to help others if they need it. \nSimple as hell procedure once you get a hold of it.\nThanks again man."
    }
]