[
    {
        "post_id":6265,
        "thread_id":6265,
        "title":"820-3115 No CPU Vcore",
        "user_id":135,
        "username":"bjf",
        "post_date":"2016-09-01 10:37:00",
        "message":"This computer was pretty mangled by liquid-damage and ensuing shorts. I had it working fine and then it lost CPU Vcore after a couple weeks. I tested the voltages around U7400 and everything looks good. No CPUIMVP_PGOOD but I'm not sure what triggers that to come on. CPUIMVP_TONA and CPUIMVP_TONB resistors are good. Voltage is traveling through them properly - voltage measures fine at pins 1 and 48 on U7400. CPUIMVP_VR_ON is good. The 5V line is everywhere it needs to be. No output (0.005V) at PHASE! and UGATE1. Any ideas on a next move?"
    },
    {
        "post_id":6269,
        "thread_id":6265,
        "title":"820-3115 No CPU Vcore",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-09-01 11:15:29",
        "message":"Probably corrosion under the SMC or PCH. There is no diagnosis for this and that is why boards with this issue suck. Put some flux and some heat on SMC\/PCH, do NOT reflow, just 150C.\n\nBut could basically be any resistor or trace somewhere......."
    },
    {
        "post_id":6279,
        "thread_id":6265,
        "title":"820-3115 No CPU Vcore",
        "user_id":135,
        "username":"bjf",
        "post_date":"2016-09-01 14:44:45",
        "message":"I forgot to mention that the fan spins.\n\nOk, I'll try cleaning under those chips. What kind of flux do you recommend for this? I've been trying to use Amtech 559 and heating it up so it will liquify flow under the chip but I don't think it's working so well. I've used Kester too but it seems substantially more toxic."
    },
    {
        "post_id":6281,
        "thread_id":6265,
        "title":"820-3115 No CPU Vcore",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-09-01 15:24:16",
        "message":"I use 559, it's fine."
    }
]