{"post_id":28214,"thread_id":28214,"title":"[SOLVED]820-4668 - PP3V3_S4 low - If you power cycle the device ±50 times it will post","user_id":289,"username":"smiba","post_date":"2017-11-19 08:19:38","message":"[PLAIN][SOLVED]820-4668 - PP3V3_S4 low - If you power cycle the device ±50 times it will post[\/PLAIN]\n\nAlright, first time repairing an iMac here (What is the best way to do so on a bench by the way? I've tried to use my 5A bench power supply but the inrush on bootup is too high)\n\nHistory of the device: The customer bought an external CD player over USB, but after plugging this in this drive the system powered off and wouldn't power on again.\nAfter I thought I fixed the device I probed the USB ports, USB Port B is broken (It won't even power my USB Voltage detector) and Port A has a low voltage of 4.54V (Will power mouse and\/or keyboard just fine). Port C&D are just at 5V as expected.\n\nThe second LED (LE0302) will glow brightly for ±200ms before going to a dim brightness, at that point PP3V3_S4 will be hanging around 1.3-1.7V or so.\nI at first thought replacing U7600 would fix this issue and initially I thought that was the solution as after plugging in the device numerous times it suddenly worked and kept on working. Passed a full AHT test and kept on working for hours and being in suspend for half a day. I gave it back to the customer but sadly it died again a couple of hours later\n\nWhen I took the device apart again I noticed the leds staying on a little bit longer on each try, so I started doing what I did last time, plugging the device in --> Waiting for the led(s) to go bright and then dim --> Unplug & repeat.\nTo my surprise after about 50 times (motivated by my curiosity) the device actually posted and chimed again! And is once again working now. But obviously this is not a long term solution and is in no way how I can return this device to the customer.\nIt goes like this:\n\n0 times: LE0302 will flash really quickly and then glow dimly\n10 times: LE0302 will be on for about ±0.5 seconds and the glow dimly\n20 times: LE0302 will be on somewhere between 0.5 and 1 seconds before glowing dimply\n30 times: LE0302 will be on for about 1 second, sometimes the 3rd led will power on as well for 1-2 seconds before going off and LE0302 glowing dimly\n40 times: At this point the system might POST and chime or the 3rd led will be on for 3 seconds before LE0302 starts glowing dimly again\n50 times: The system will now POST and chime and keep on working. Reboots and switching between sleep mode will work fine.\n\nI have absolutely no idea what can be broken which will slowly restore its functionality? Any one any idea? Its confusing me quite badly. Only thing I can think about is that at some point a capacitor gets charged up far enough or something\nWhen PP3V3_S4 stays hanging around 1.3-1.7V, PP3V3_S5 will not drop if I recall correctly. (But can't test since its working again now....)\nMight U8400 be messing up? I don't remember if PM_EN_FET_P3V3_S4 stays high though, I think it did.\n\nCheers"}
{"post_id":28226,"thread_id":28214,"title":"[SOLVED]820-4668 - PP3V3_S4 low - If you power cycle the device ±50 times it will post","user_id":2,"username":"dukefawks","post_date":"2017-11-19 13:44:06","message":"I would first suspect one of the USB over current protection chips like U4600 or the one associated with the dead port."}
{"post_id":28240,"thread_id":28214,"title":"[SOLVED]820-4668 - PP3V3_S4 low - If you power cycle the device ±50 times it will post","user_id":289,"username":"smiba","post_date":"2017-11-19 17:04:34","message":"Thanks, I guess replacing it would be part of a quality repair anyways!\n\nAny tips on testing it on a bench? Because reassembling these boards in the iMac itself is a pain in the ass and I don't feel comfortable having the PSU with exposed 230V joints on my desk"}
{"post_id":28242,"thread_id":28214,"title":"[SOLVED]820-4668 - PP3V3_S4 low - If you power cycle the device ±50 times it will post","user_id":2,"username":"dukefawks","post_date":"2017-11-19 17:38:11","message":"I just use the guts of a scrapped machine for testing. Yes there will be wires hanging everywhere.....\n\nFor the love of God try and source REAL adhesive strips to put this thing back together. Most of the shit sold everywhere are Chinese rip offs and you will never get the LCD off again."}
{"post_id":28249,"thread_id":28214,"title":"[SOLVED]820-4668 - PP3V3_S4 low - If you power cycle the device ±50 times it will post","user_id":289,"username":"smiba","post_date":"2017-11-19 18:39:10","message":"No worries I did, thats why it hurts so much taking it apart again because they're not your regular $1 tapes. I still have nightmares about iPad screens so I'll never cheap out on tape haha\nGot apart with exactly the same amount of force then it came with, the tape is again easily removable and leaves no or almost no residue\n\nAlright I guess thats the only solution for the bench testing then, thanks! I'll replace U4600 + any other parts of that circuit if I find them to be bad and will report back"}
{"post_id":28251,"thread_id":28214,"title":"[SOLVED]820-4668 - PP3V3_S4 low - If you power cycle the device ±50 times it will post","user_id":2,"username":"dukefawks","post_date":"2017-11-19 20:53:01","message":"Could also be U4700 of course, I don't know which port is bad in your case."}
{"post_id":28258,"thread_id":28214,"title":"[SOLVED]820-4668 - PP3V3_S4 low - If you power cycle the device ±50 times it will post","user_id":289,"username":"smiba","post_date":"2017-11-20 03:39:57","message":"Port A damaged and Port B broken, should be U4600"}
{"post_id":29209,"thread_id":28214,"title":"[SOLVED]820-4668 - PP3V3_S4 low - If you power cycle the device ±50 times it will post","user_id":289,"username":"smiba","post_date":"2017-12-12 08:02:39","message":"Took a bit longer then planned due unexpected sickness.\n\nAnyways U4600 actually has a small hole inside of it and PP5V_S4_EXTA_ILIM was semi-shorted with only 16Ohms to ground. And PP5V_S4 went from 10.4Ohms to ground to >15kOhm\nNot surprised this can cause some issues :)\n\nIts currently running and i'll be monitoring the device for a little while before I return it to the customer"}
