[
    {
        "post_id":57986,
        "thread_id":57986,
        "title":"820-2879 Issues",
        "user_id":5175,
        "username":"tlough75",
        "post_date":"2020-04-04 20:26:36",
        "message":"So a customer of mine gave me a couple of 820-2879 boards to mess with and the first one works but has no backlight, the second one though seems to have more problems. It wasn't turning on at first so i removed it from the chassis to inspect it and found no real signs of liquid damage, and to measure PP3V42_G3H resistance to GND. That was measuring 220K so I assumed the MCP is ok. Well after I put the board back in it started up to the Apple logo and progress bar. After about half way the logo and progress bar slowly faded out to a white screen. My two questions are: Did I just witness the GPU or MCP die? Other question is, how would I be able to tell by measurements?"
    },
    {
        "post_id":57995,
        "thread_id":57986,
        "title":"820-2879 Issues",
        "user_id":5175,
        "username":"tlough75",
        "post_date":"2020-04-04 21:39:14",
        "message":"So I figured out by mistake that the LCD connector on the board is messed up. When I push on it the logo fades and comes back and does other weird things. I touched up the joints and it seems better but when I put the bar down from the cable it causes it to ness up again. I may just replace the connector. The board does have a solid Apple logo and progress bar but the bar slowly move to the end and then freezes. At least I got the image disappearing thing figured out."
    },
    {
        "post_id":57996,
        "thread_id":57986,
        "title":"820-2879 Issues",
        "user_id":5175,
        "username":"tlough75",
        "post_date":"2020-04-04 22:05:34",
        "message":"Did a PRAM Reset 3 times and that cleared up the slow booting issue. Now boots into OS login in like 3.5 seconds. So it looks like I just needed to talk myself through this one."
    },
    {
        "post_id":57997,
        "thread_id":57986,
        "title":"820-2879 Issues",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-04-05 02:42:04",
        "message":"So which board needs assistance now?"
    },
    {
        "post_id":58012,
        "thread_id":57986,
        "title":"820-2879 Issues",
        "user_id":5175,
        "username":"tlough75",
        "post_date":"2020-04-05 13:17:43",
        "message":"Actually they are both solved and working. I do have an 820-2530 that I need to maybe create a thread on. PP3V42 and PPBUS were .08 and no Magsafe light. Found pad under pin 5 of U6690 was corroded away so I placed a temporary solder bridge to chip and trace, now have chime and backlight but no image."
    },
    {
        "post_id":58013,
        "thread_id":57986,
        "title":"820-2879 Issues",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-04-05 14:34:05",
        "message":"Then open other thread, if needed..."
    }
]