[
    {
        "post_id":35178,
        "thread_id":35178,
        "title":"820-3332-A random shutdowns, fails memtest",
        "user_id":1104,
        "username":"Jay",
        "post_date":"2018-05-25 13:44:59",
        "message":"- No liquid damage\n- No drop damage\n- Minor dust on board\n- No solderballs found around RAM or other components\n\nI can't find any visual issues on this board. U8900 was resoldered as I do out of habit\/precaution with these boards.\n\nThe machine experiences random shutdowns. Powers on fine, POSTs, even passes the ASD RAM tests. AHT failed once and Memtest68 fails with hundreds of errors by the time it's done.\n\nIs there a way to match the address memtest gives to a specific RAM chip? Something else I should be looking for? With (as far as I know) nothing to go on all I can do is come here and ask for help :)"
    },
    {
        "post_id":35182,
        "thread_id":35178,
        "title":"820-3332-A random shutdowns, fails memtest",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-05-25 15:00:17",
        "message":"I don't know of any freely program that would point you to specific chip. Back in the G4\/G5 days there was Phoenix OS that would have tests like that but I have not seen that leaked for Intel machines. So yeah, probably need to pull and replace all RAM :( And after that it could still be an issue inside the board or the CPU. I wouldn't mess with it.\n\nLook up the RAMCFG1-4 straps and swap the resistors to pull them all high. I believe this will disable half the RAM so maybe you get lucky."
    },
    {
        "post_id":35185,
        "thread_id":35178,
        "title":"820-3332-A random shutdowns, fails memtest",
        "user_id":461,
        "username":"Gurmon",
        "post_date":"2018-05-25 15:10:08",
        "message":"I haven't seen a datasheet from intel that provide such mapping for ivybridge memory controllers\n\nI'd tackle this by replacing 16 chips at a time. if your lucky your first go will fix this. Of course depending on time and money your willing to put into buys the chips."
    },
    {
        "post_id":35188,
        "thread_id":35178,
        "title":"820-3332-A random shutdowns, fails memtest",
        "user_id":1104,
        "username":"Jay",
        "post_date":"2018-05-25 17:34:51",
        "message":"Thanks for the replies guys, looks like this one goes back on the shelf for now. Thread can be closed."
    }
]