{"post_id":82751,"thread_id":61977,"title":"A1990 No Image After Liquid, Board Chimes!","user_id":1547,"username":"CRC2018","post_date":"2021-11-16 14:01:02","message":"So i've got an A1990 with I think it's  820-01041 (will have to double check that) board. It was liquid damaged top area of the board above the cpu. Also the main screen cable was not damaged but the backlight cable which goes from the screen on one side was corroded. I have replaced the connectors on the screen flex and screen board to fix this. \n\nI've cleaned up all the areas of corrosion I could see, removed and resoldered any IC's which looked questionable as well. Board powers up takes 20V chimes but doesn't output anything to either the internal display or the external one. I'm aware that with the damage on the screen's board itself there may be an issue with the mux chip but that shouldn't affect external display surely? I do not have a known good screen for this model unfortunately - I may have a damaged one from a 2016 15\" Macbook Pro but i'm unsure if they are the same?\n\nI suppose it's possible the GPU is fried - there was corrosion around the power circuitry for the CPU\/GPU - would the board still chime if this was the case though?\n\nI don't see these T2 based boards very often so i'm really a bit unsure as to what to check next?"}
{"post_id":82752,"thread_id":61977,"title":"A1990 No Image After Liquid, Board Chimes!","user_id":682,"username":"2informaticos","post_date":"2021-11-16 15:22:01","message":"External monitor is driven by GPU.\nCorrosion on its area could damaged it.\n\nYou should change U9850 and see if still is possible to get video on internal LCD.\nA1706\/7 screens should serve for test."}
{"post_id":82794,"thread_id":61977,"title":"A1990 No Image After Liquid, Board Chimes!","user_id":1547,"username":"CRC2018","post_date":"2021-11-17 11:30:21","message":"I've tried an old broken screen from an A1706 - still no picture. I've ordered a new U9850 to try - i've done a bit more checking around and am not getting any voltage on L7410 or L7420. I presume these are for the CPU's internal GPU? The other coils are reading normal voltage - cpu ones 0.8V, gpu 0.9v. Both CPU and GPU are heating up as I would expect - the board appears to be trying to boot to something - the touchbar lights up with an ESC key on it and the caps lock lights up when I activate it."}
{"post_id":82797,"thread_id":61977,"title":"A1990 No Image After Liquid, Board Chimes!","user_id":682,"username":"2informaticos","post_date":"2021-11-17 12:25:18","message":"So the board looks like booted and active, didn't stuck after chime.\n\niGPU voltage (L7410\/20) appears when Intel high graphics load is detected.\nLet us know what happens after U9850 was changed."}
