{"post_id":38620,"thread_id":38620,"title":"A1425 not recognizing battery after battery repair","user_id":1818,"username":"MSMike","post_date":"2018-08-20 09:28:23","message":"I have a late 2012 macbook pro 13\" here.  The customer said that the battery was draining fast, so they replaced the battery.  After the battery replacement (tried two different ones), the macbook doesn't recognize the battery anymore.  It runs fine off of the charger, but when the charger is disconnected, the computer goes off.  Yes, the special screw that shorts out the two pads is in place and working properly (tested with a multimeter).  And the interposer plate is in place.  The plastic battery bracket is missing though...is that needed?  Any ideas?"}
{"post_id":38623,"thread_id":38620,"title":"A1425 not recognizing battery after battery repair","user_id":1153,"username":"JohnB8812","post_date":"2018-08-20 10:10:28","message":"PPBUS voltage with just the charger no battery?"}
{"post_id":38643,"thread_id":38620,"title":"A1425 not recognizing battery after battery repair","user_id":2,"username":"dukefawks","post_date":"2018-08-20 14:49:34","message":"All these batteries from China are pulled used garbage so a bad battery is likely. PPBUS voltage can also tell us more."}
{"post_id":38669,"thread_id":38620,"title":"A1425 not recognizing battery after battery repair","user_id":1818,"username":"MSMike","post_date":"2018-08-21 10:54:15","message":"I'm using an old pulled OEM battery from this same laptop.  Also, can you tell me what is the easiest point to measure the ppbus voltage?  I know iphone logic board repair, but not so much macbook repair.  And is openboardview the standard for software?"}
{"post_id":38670,"thread_id":38620,"title":"A1425 not recognizing battery after battery repair","user_id":1818,"username":"MSMike","post_date":"2018-08-21 11:31:39","message":"Gosh, I suck at this, but I got 12.27V on ppbus_g3h..."}
{"post_id":38671,"thread_id":38620,"title":"A1425 not recognizing battery after battery repair","user_id":1818,"username":"MSMike","post_date":"2018-08-21 11:46:48","message":"ppvbat is .34V.  when i measure my battery voltage directly at the connector, i'm getting 2V...it should be over 11V right?"}
{"post_id":38674,"thread_id":38620,"title":"A1425 not recognizing battery after battery repair","user_id":1153,"username":"JohnB8812","post_date":"2018-08-21 12:46:24","message":"If you're getting 12.27 without the battery, there is now and issue with the SMBUS data lines. Diode mode pin 2 of R5280 and R5281 to see if you have a short on one of the data lines. Typically it's the ISL or the SMC."}
{"post_id":38675,"thread_id":38620,"title":"A1425 not recognizing battery after battery repair","user_id":1818,"username":"MSMike","post_date":"2018-08-21 13:32:05","message":"Is there any way that I can diode mode those two pins without disassembling the logic board?  I'm still trying to get use to this openboardview."}
{"post_id":38676,"thread_id":38620,"title":"A1425 not recognizing battery after battery repair","user_id":1818,"username":"MSMike","post_date":"2018-08-21 13:32:40","message":"BTW, what voltage should ppbus be?"}
{"post_id":38677,"thread_id":38620,"title":"A1425 not recognizing battery after battery repair","user_id":1153,"username":"JohnB8812","post_date":"2018-08-21 13:55:35","message":"PPBUS should be 12.56 volts on this one. Being it's 12.27, it means the data communication between the SMC and ISL is not working properly."}
{"post_id":38701,"thread_id":38620,"title":"A1425 not recognizing battery after battery repair","user_id":682,"username":"2informaticos","post_date":"2018-08-22 14:20:25","message":"You must disconnect charger and battery, when measure resistance to ground.\nSo SCL\/SDA pins from battery connecter will remain exposed, easy to access.\nYou must get less than 1% difference between theyr values.\nLocate them in the boardview; and yes, (at least for me) openboardview is the best for Apple stuff.\nBTW, which is the 820-xxxx code of your board?"}
{"post_id":38715,"thread_id":38620,"title":"A1425 not recognizing battery after battery repair","user_id":1818,"username":"MSMike","post_date":"2018-08-22 16:45:09","message":"820-3642....."}
{"post_id":38727,"thread_id":38620,"title":"A1425 not recognizing battery after battery repair","user_id":1818,"username":"MSMike","post_date":"2018-08-23 10:08:41","message":"No Title\n\nso I'm getting .063V in diode mode on the SDA line and OL at pin 2 of the SDL line, but 0.638V at pin 61 and pin 44.  I'm still uncertain about what I'm doing here.  Any help would be appreciated."}
{"post_id":38729,"thread_id":38620,"title":"A1425 not recognizing battery after battery repair","user_id":1153,"username":"JohnB8812","post_date":"2018-08-23 10:28:49","message":"Are you measuring with just the board or is it plugged in to the housing? You should be measuring with nothing but the board if you're not."}
{"post_id":38742,"thread_id":38620,"title":"A1425 not recognizing battery after battery repair","user_id":1,"username":"larossmann","post_date":"2018-08-23 16:04:26","message":"PPBUS_G3H is 12.56v when the SMC(U4900) is able to communicate with the ISL6259 battery charger(U7000) on its data line. This data line also goes to the battery as can be seen on page 42 of the PDF schematic. When the SMC is fried or something is keeping this data line from functioning you'll get 12.23v on PPBUS_G3H. Measuring PPBUS_G3H, the voltage created by U7000, is the litmus test for whether that data line is working.\n\nSo what killed the data line? The bracket missing likely caused it to slide and let 12v go to the 3v SMC data line. This won't short it to ground, it'll fry the SMC though. SMC and ISL6259 should be replaced.\n\nAfter all of this you will find that the replacement batteries are likely total junk since this machine was only around for 3-4 months before Apple changed the design entirely, so there isn't much demand for anyone to find\/create batteries to them.\n\nYour homework is to find a good SMC from a donor 820-3462 board and put it on and check your PPBUS_G3H voltage after replacing the SMC. Do not plug the battery in yet as we want to know before anything else occurs whether this is a good SMC or not and if we have resolved our problem."}
