{"post_id":32137,"thread_id":32137,"title":"Macbook 15 2011 GPU, Fake or not? \"made in china\"","user_id":1186,"username":"Salvatore951","post_date":"2018-03-01 06:03:09","message":"I spent 320$ for 10 GPUs for macbook 15 2011 (5 x 6490m and 5x 6750m) I received them but it's written Made in China, date 1204 and 1208, while in the original broken one it's written Made in Taiwan.\nAre them fake? Seller told me that AMD has 5 manufacturers, 2 of them are located in china, is it true?\nI have always seen \"made in Taiwan\" on AMD chips, it sounds strange to me."}
{"post_id":32139,"thread_id":32137,"title":"Macbook 15 2011 GPU, Fake or not? \"made in china\"","user_id":316,"username":"G.Beard","post_date":"2018-03-01 06:39:20","message":"That's from SEE-IC right?\nI have no idea where these things are made but the chip is probably genuine. The story is it's been knocking about for a few years and probably kicked accross the floor a few times. I have been told that some litttle china man just found these somehwre forgotten about in a dark corner of the warehouse. Not sure how true that is but looking at the chips in the die it can't be far wrong.\nI think they have graded these chips on how beaten up they are and price accordingly.\n\nIf it's not from SEE, I have no idea.\nPersonally I'm not buying these graded chips. There are factory fresh chps floatting about."}
{"post_id":32140,"thread_id":32137,"title":"Macbook 15 2011 GPU, Fake or not? \"made in china\"","user_id":1186,"username":"Salvatore951","post_date":"2018-03-01 06:51:32","message":"yes, bought the from see-ic.com. Can someone confirm if they are fake or not, I Soldered two of these, macos loads fine beacause keyboard light up but I get no video."}
{"post_id":32141,"thread_id":32137,"title":"Macbook 15 2011 GPU, Fake or not? \"made in china\"","user_id":316,"username":"G.Beard","post_date":"2018-03-01 10:12:51","message":"[QUOTE=\"Salvatore951, post: 32140\"]yes, bought the from see-ic.com. Can someone confirm if they are fake or not, I Soldered two of these, macos loads fine beacause keyboard light up but I get no video.[\/QUOTE]\n\nDuke will be able to tell you that one but...\nThe fact that they are old and battered, might be an issue.\n\nAre you re-balling them with lead solder?\nUsing a profile or eye?\nRemoving all edge bonding from VRAM?"}
{"post_id":32236,"thread_id":32137,"title":"Macbook 15 2011 GPU, Fake or not? \"made in china\"","user_id":2,"username":"dukefawks","post_date":"2018-03-04 06:34:44","message":"They look fine. If you bought them as \"real new\" from SEE then chances are very good they are actually good. Cannot 100% confirm from a picture like that."}
{"post_id":32242,"thread_id":32137,"title":"Macbook 15 2011 GPU, Fake or not? \"made in china\"","user_id":316,"username":"G.Beard","post_date":"2018-03-04 14:46:11","message":"Do you re-ball with lead solder.\nDo you remove all edge bonding from VRAM.\nDo you use profiles or use your own sense.\n\nDon't buy these 2012 battered chips. I would not trust them to work even though they are likely genuine, they have had a hard life.\nI did buy one of these chips. It was the least battered and the highest price of these old ones and it worked but I have it on good authority that it would be a mistake to buy a shit load of them."}
