[
    {
        "post_id":77590,
        "thread_id":61429,
        "title":"820-3299 - 3 Beeps iMac - RAM Issue?",
        "user_id":1358,
        "username":"mccafe",
        "post_date":"2021-07-12 12:38:25",
        "message":"Hello guys,\n\nI have an 820-3299 that originally had a question mark issue. We decided to switch out the hard drive with an SSD and when putting it together, it no longer wants to boot and has 3 beeps, few seconds pause, and 3 beeps again until I power it down indicating RAM detected in bay but unable to use it? I've tried known good working RAM and still the same. I completely removed all RAM sticks and it would give me 1 beep indicating no RAM in bay. This SSD upgrade involves removing the board in order to remove the hard drive unfortunately so I am unsure if something had happened during the removal, but I'd like to troubleshoot the logic board and need to know where to start.\n\nThanks in advance for the help."
    },
    {
        "post_id":77604,
        "thread_id":61429,
        "title":"820-3299 - 3 Beeps iMac - RAM Issue?",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-07-12 15:23:58",
        "message":"Disconnect all, keep only 12V and speaker connected.\nCheck if still beeps."
    },
    {
        "post_id":77610,
        "thread_id":61429,
        "title":"820-3299 - 3 Beeps iMac - RAM Issue?",
        "user_id":1358,
        "username":"mccafe",
        "post_date":"2021-07-12 16:01:58",
        "message":"Disconnected everything except 12V, left speaker, CPU, couple RAM sticks and still 3 beeps. I also disconnected RAM sticks and it gives me 1 beep in this case. Put it back, 3 beeps.\n\nPPVDDQ_S3_DDR = 1.5 volts steady\nR5260 \/ R5261 = 3.3 volts for PCH \/ Memory Channel A & B SMBUS pull-up resistors\n\nOn a known working iMac, it looks like PPVDDQ_S3_DDR varies between 1.2 - 1.3 volts. I am guessing its because the RAM is actually being used. When the 3 beeps is happening, I have the two solid diagnostic LEDs on and I believe this indicates all sys power is good?\n\nCould this be related to a corrupted BIOS by any chance?"
    },
    {
        "post_id":77612,
        "thread_id":61429,
        "title":"820-3299 - 3 Beeps iMac - RAM Issue?",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-07-12 17:12:22",
        "message":"You can try BIOS, to discard it.\nDon't forget to make backup first.\n\nDid you test with one RAM module at time, on each slot?\nTry with PC3 and PC3L too; don't mix them."
    },
    {
        "post_id":77619,
        "thread_id":61429,
        "title":"820-3299 - 3 Beeps iMac - RAM Issue?",
        "user_id":1358,
        "username":"mccafe",
        "post_date":"2021-07-12 20:57:34",
        "message":"I’m going to search for a ROM to rule out the BIOS. Does anyone have a link to a download?\n\nI tried one stick, in each slot - no go. I’ll try with PC3 vs PC3L when I get the chance. Also, tried new CMOS battery."
    }
]