{"post_id":92853,"thread_id":63118,"title":"820-01700 no power, cycles between 5v and 19v","user_id":41132,"username":"nininunz","post_date":"2022-09-25 23:40:16","message":"Haven't had the chance to inspect yet. About to pull it out now. Only the second A2141 board I've worked on so not familiar with common problems. Figured I'd ask if this is indicative of anything specific. But it just jumps from 5v to 19v for a few seconds then the meter goes blank like it was short then back to 5v, repeat."}
{"post_id":92854,"thread_id":63118,"title":"820-01700 no power, cycles between 5v and 19v","user_id":682,"username":"2informaticos","post_date":"2022-09-26 00:08:33","message":"All ports have the same behaviour?\nBe sure to use original 96\/140W charger.\nAlso you can test connecting known good battery.\n\nIf still the same, check for short on all big coils."}
{"post_id":92855,"thread_id":63118,"title":"820-01700 no power, cycles between 5v and 19v","user_id":41132,"username":"nininunz","post_date":"2022-09-26 02:42:12","message":"Ok so messed with it for a bit and here to report back. Yes all ports behave the same. I inspected the board and noticed a loose cap on the mesa circuit (C4955) and reflowed it. There was a bit of dust on the board so I dunked it in the ultrasonic. Plugged the bare board into my BY-3200 cable and it fired right up. Put the board back in top case and it reverted to doing what it did before. I unplugged the battery and it fired right up to the internet recovery screen. So I'm assuming the problem is the battery. Is it a controller issue or are the cells just too low to register? I'd rather not replace an $80 battery if I can get away with charging it at the bare cell bypassing the control board."}
{"post_id":92858,"thread_id":63118,"title":"820-01700 no power, cycles between 5v and 19v","user_id":682,"username":"2informaticos","post_date":"2022-09-26 04:20:43","message":"Is probably bad battery.\nTo fully diagnose it, need special tools; something like this:\n[URL unfurl=\"true\"]https:\/\/www.laptopu.ro\/[\/URL]\nIt can even help to repair and reset batteries."}
{"post_id":92874,"thread_id":63118,"title":"820-01700 no power, cycles between 5v and 19v","user_id":41132,"username":"nininunz","post_date":"2022-09-26 17:49:07","message":"Just tried testing with a known good battery. Turns on and fires right up but refuses to charge. Still stuck in that 5v-19v cycle. Not sure where to go from here  ¯\\_(ツ)_\/¯"}
{"post_id":92875,"thread_id":63118,"title":"820-01700 no power, cycles between 5v and 19v","user_id":41132,"username":"nininunz","post_date":"2022-09-26 17:58:32","message":"Ignore me I'm dumb. Had my desktop psu current set low so it was maxing out and restarting the system. It actually works fine."}
