{"post_id":87184,"thread_id":62448,"title":"820-00164 No power to pin 3 @ J7000","user_id":32178,"username":"prodigy83","post_date":"2022-03-10 16:03:51","message":"I am stumped, I am getting power to pins 1 and 2 @ j7000 14.86v, but I get only .8mv @ pin 3.\nI have replaced L7560, U7090, and D7005, because they seemed to get pretty hot with the thermal cam. The LIO board I also replaced.\nI did inject voltage to a line which which led to the processor (forgot to write down where), and the processor did heat up, so it looks like that is working. \nI am a bit of a novice when it comes to checking resistance to ground, or anything really that is not a short ( I rely a lot on my thermal cam).\nHistory on the board is it did have liquid damage, but I believe I have cleared all this up. I had the board sitting in a drawer for a while, it looks like all the components are there. Where can I go from here? Thank you."}
{"post_id":87218,"thread_id":62448,"title":"820-00164 No power to pin 3 @ J7000","user_id":682,"username":"2informaticos","post_date":"2022-03-11 09:15:05","message":"Read about diode mode checking here:\n[URL unfurl=\"true\"]https:\/\/boards.rossmanngroup.com\/threads\/how-to-collection.60974\/[\/URL]\n\nWhat relation did you see between pin 3\/J7000 and L7560???\nDo you get PPBUS_G3H and 3V42_G3H?\n\nDo you habitually inject voltage without real reason?\nTell us which, if had any this time..."}
{"post_id":87355,"thread_id":62448,"title":"820-00164 No power to pin 3 @ J7000","user_id":32178,"username":"prodigy83","post_date":"2022-03-14 11:28:49","message":"Thank you, I have saved your article as a PDF for future help. I have watched Jessa's videos from iPad Rehab about placing the red probe on ground and using the black probe to measure. My issue is I just do not understand how to use this without having a \"known good\" board in my possession, which I often may not have. I tried watching Louis's slideshow presentation he made a few years back, but it is hard for me to follow.\nI only try to inject voltage when I know a short is somewhere, or if I think there may be a short \n\nI know pin 3\/J7000 has no correlation with L7560 however I would imagine that something like L7560 may be originally responsible because I was getting pulsing at first, until I removed the chip and replaced it. When I replaced it, the voltage on pin 3\/J7000 went to nada.\n\nIf I do inject voltage, I always start low, but never go over the voltage the chip is supposed to handle. So if it is 3V42, I never go over 3.42v. I usually find any shorts way before I would get to this, if there is a short that is. Am I doing this wrong?\n\n1.3mv @ pin 1\/F7700 for PPBUS_G3H.\n240.2mv @ pin 1\/J9500 for 3V42_G3H\nThanks"}
{"post_id":87372,"thread_id":62448,"title":"820-00164 No power to pin 3 @ J7000","user_id":682,"username":"2informaticos","post_date":"2022-03-14 14:51:53","message":"So you don't get PPBUS_G3H, nor 3V42_G3H.\nWhy then expect voltage at L7520 (5V_S4RS3)???\n\nPost diode mode to ground at F7140 and L7095.\nIf no short, post U7090 voltages; use surrounding components as test pads.\n\nBTW (for the future), you can perfectly write 0V instead of 1.3mV; which is a non-sense reading.\n0.24V looks also much better than 240.2mV.\nDo not think that 4\/6 digits multimeter helps more than 3 digits one..."}
