[
    {
        "post_id":84396,
        "thread_id":62147,
        "title":"A2289 (820-01987) Strange powering issue",
        "user_id":33944,
        "username":"PCSWILTS",
        "post_date":"2021-12-31 02:45:19",
        "message":"Hi, I'm new to board repairs but have been dealing with them and sending them to other companies for about 7 years.  This year I put myself on a micro soldering course and have been building myself up from console repairs, laptops, iphones and and now macs.  So - sorry if I sound a bit noob.\n\nThis is a strange one so I'll try and provide as much info as I can.  Mac came in because it is not powering on. When I plug a metre\/power into it it pulls 19.8-20v and cycles through the amp draw as if it is booting normally and at around 1.11a draw the Apple logo is seen and the mac boots perfectly (without pressing the power button to turn it on) and also works perfectly when logged in.\n\nIf you leave the mac at the login screen eventually it will power off, pressing the touchpad shortly afterwards turns the mac back on and it boots fine. \n\nIf you shutdown the mac it will not power on using the power button and it is drawing 0.01a at 20v.\nAt this point if I disconnect the battery and reconnect the battery the mac will switch on and boot fine as soon as you plug in the power cable.  If power cable is not plugged in, pressing the power button doesn't turn the mac on.\n\nI have tested a new battery but the problem remains exactly the same.  Battery is seen and charges to 100% and discharges as you would expect during use - once the mac is powered on it will run on battery fine.  If I hold the power button down when the mac is switched on it will switch the mac off. \n\nBoard is immaculate, no sign of any damage.\n\nIn summary, the mac powers on by plugging in the power cable only after disconnecting and reconnecting the battery.  Power button doesn't power the mac on at any stage but will power it off.\n\nThanks in advance."
    },
    {
        "post_id":84400,
        "thread_id":62147,
        "title":"A2289 (820-01987) Strange powering issue",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-12-31 03:04:19",
        "message":"First of all, welcome to the forum!\n\nAll iCore MacBooks power on automatically when charger is connected, if battery was disconnected.\nThis doesn't happen again, once machine was properly turned off from macOS.\nIf disconnect the battery, will occur again the same behavior.\n\nAll T2 MacBooks also turn on directly pressing any key, or trackpad; without touching power button.\nIt will go off if remains too much time in password screen.\n\nIf machine turns off holding down the power button for 4-5s, the button is good.\n\nYour machine, may have a hardware issue, but first step for ALL T2 machines is trying DFU mode.\nYou can go directly for Restore option, if no important data on its SSD.\nIf need to preserve the data, choose Revive; it will not erase the SSD."
    },
    {
        "post_id":84402,
        "thread_id":62147,
        "title":"A2289 (820-01987) Strange powering issue",
        "user_id":33944,
        "username":"PCSWILTS",
        "post_date":"2021-12-31 03:20:26",
        "message":"OK - Thank you - so is the issue possibly the Bridge OS?"
    },
    {
        "post_id":84404,
        "thread_id":62147,
        "title":"A2289 (820-01987) Strange powering issue",
        "user_id":33944,
        "username":"PCSWILTS",
        "post_date":"2021-12-31 03:33:10",
        "message":"If the issue were Bridge OS would re-installing OSX on the SSD fix the issue?"
    },
    {
        "post_id":84405,
        "thread_id":62147,
        "title":"A2289 (820-01987) Strange powering issue",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-12-31 03:41:50",
        "message":"You can't know until trying..."
    },
    {
        "post_id":84409,
        "thread_id":62147,
        "title":"A2289 (820-01987) Strange powering issue",
        "user_id":33944,
        "username":"PCSWILTS",
        "post_date":"2021-12-31 04:02:36",
        "message":"Understood!  I'll try installing updates today and go from there - much appreciated."
    },
    {
        "post_id":84412,
        "thread_id":62147,
        "title":"A2289 (820-01987) Strange powering issue",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-12-31 04:08:40",
        "message":"Follow the DFU tutorial steps.\n[URL unfurl=\"true\"]https:\/\/boards.rossmanngroup.com\/threads\/how-to-collection.60974\/[\/URL]"
    },
    {
        "post_id":84643,
        "thread_id":62147,
        "title":"A2289 (820-01987) Strange powering issue",
        "user_id":33944,
        "username":"PCSWILTS",
        "post_date":"2022-01-07 03:41:25",
        "message":"Hi, sorry for the delay, I had to purchase a T2 mac and have been waiting for that to arrive.  I loaded up Monterey on the new mac.  This morning I managed to revive the target machine but after around 70% completed of stage 4\/4 the screen went black , I left it for about 5 minutes before putting it back into DFU mode.  However, Apple configurator now shows  a padlock rather than DFU and no AC functions work.  The target device I have checked for EFI password which it doesn't have and the security settings are disabled.  Any advise would be appreciated - FYI currently no change to original problem."
    },
    {
        "post_id":84646,
        "thread_id":62147,
        "title":"A2289 (820-01987) Strange powering issue",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-01-07 06:01:18",
        "message":"Try Internet recovery (CMD + R) and reinstall the original macOS.\nSave first any important data."
    },
    {
        "post_id":84647,
        "thread_id":62147,
        "title":"A2289 (820-01987) Strange powering issue",
        "user_id":33944,
        "username":"PCSWILTS",
        "post_date":"2022-01-07 06:33:26",
        "message":"OK - So, I've created a time machine backup. I've reinstalled Big Sur - and updated to Monterey.  DFU mode is working now but revive didn't solve the issue.  I clicked restore which went through but now when turning the mac on I get the Globe asking me to connect to a wifi network which I do but then nothing happens - It eventually provides with an error.  Am I correct in thinking I've exhausted the options Apple configurator can offer?"
    },
    {
        "post_id":84656,
        "thread_id":62147,
        "title":"A2289 (820-01987) Strange powering issue",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-01-07 08:17:01",
        "message":"So you cannot reinstall original macOS from Internet?"
    },
    {
        "post_id":84690,
        "thread_id":62147,
        "title":"A2289 (820-01987) Strange powering issue",
        "user_id":33944,
        "username":"PCSWILTS",
        "post_date":"2022-01-08 00:42:23",
        "message":"No it's not installing from the net. I left the host Mac dowloading ipsw files yesterday. I'm going to try installing those using AC2. Will let you know how that goes."
    },
    {
        "post_id":84767,
        "thread_id":62147,
        "title":"A2289 (820-01987) Strange powering issue",
        "user_id":33944,
        "username":"PCSWILTS",
        "post_date":"2022-01-10 21:43:03",
        "message":"Cannot install IPSW files onto the Mac either. I've downloaded every Monterey and Big Sur file (not including Beta files) and I get the same error (see attached) every time. Mac won't boot to anything but the connect to a network screen and does nothing from there. So, now my concern is that we cannot install and operating system. Any advice at this stage would be great 🤣😭"
    },
    {
        "post_id":84768,
        "thread_id":62147,
        "title":"A2289 (820-01987) Strange powering issue",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-01-11 00:48:09",
        "message":"It should install original macOS from Internet recovery.\nDo not try installing from USB.\n\nStart the machine in Target Disk mode and see if is possible to check its SSD."
    },
    {
        "post_id":84773,
        "thread_id":62147,
        "title":"A2289 (820-01987) Strange powering issue",
        "user_id":33944,
        "username":"PCSWILTS",
        "post_date":"2022-01-11 01:14:52",
        "message":"OK, so the mac won't boot to recovery or from USB - it only boots to the \"select WIFI network\" mode with spinning globe.  If I connect to a network it does nothing and eventually error's (see attached) - I don't believe there is an issue with the SSD as prior to erasing it with Apple Configurator I had already taken a time machine backup and clean installed Monterey without issue.  Is it still possible to boot to target mode on this device as it is?  I did some digging and target mode seems to no longer be a thing on these M1 - seems you have to boot to recovery and \"share\" which I now can't do?"
    },
    {
        "post_id":84776,
        "thread_id":62147,
        "title":"A2289 (820-01987) Strange powering issue",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-01-11 02:08:16",
        "message":"Better to take it to Apple.\nThis machine should be in warranty.\n\nApple does hard work to produce unfixable machines actually..."
    }
]