{"post_id":32129,"thread_id":32129,"title":"[SOLVED]3332 black screen - Not U8900","user_id":316,"username":"G.Beard","post_date":"2018-02-28 21:09:48","message":"Hi.\n\nGot a board here that was liquid damaged.\nU9000 was shorted, replaced U9000 and caps.\nScreen-side eDP connector was totally fucked so replaced also (screen now works perfect on this and another machine).\nReplaced J9000\nReplaced U9100\nReplaced R9018\nTouched up U8900 with the iron too.\n\nThis machine will boot to installer and black screen. Close the lid and re-open once fans no longer spin, the screen then displays.\nBoot into OS gives black screen. Close the lid and re-open, still no image.\nBoot into Linux Mint, all good, no issue.\n\n\nLiquid damage was also around the GPU and VRAM.\n\nMy guess is some crap got under the GPU or VRAM but I'm posting in hope."}
{"post_id":32174,"thread_id":32129,"title":"[SOLVED]3332 black screen - Not U8900","user_id":1,"username":"larossmann","post_date":"2018-03-02 14:03:55","message":"In Linux mint which GPU is it using?"}
{"post_id":32210,"thread_id":32129,"title":"[SOLVED]3332 black screen - Not U8900","user_id":316,"username":"G.Beard","post_date":"2018-03-03 05:45:03","message":"[QUOTE=\"larossmann, post: 32174\"]In Linux mint which GPU is it using?[\/QUOTE]\n\niGPU I guess but....\n\nHmm, now in OS X if I plug in a mini display cable the internal screen wakes up. Internal will stay working if external is removed.\nRestart with internal only and back to the no output until I plug external display again.\nStart the machine up with external plugged in and both int and ext screens work.\n\nAny ideas?"}
{"post_id":32222,"thread_id":32129,"title":"[SOLVED]3332 black screen - Not U8900","user_id":316,"username":"G.Beard","post_date":"2018-03-03 15:10:47","message":"So it's working from the iGPU once external is plugged and unplugged.\nIt's working from the GPU when monitor is plugged.\nIt does fuck all when booted with only internal screen is in use unless monitor is plugged and unplugged.\n\nSo what is telling the output to wake up?"}
{"post_id":32234,"thread_id":32129,"title":"[SOLVED]3332 black screen - Not U8900","user_id":1,"username":"larossmann","post_date":"2018-03-04 00:46:50","message":"First obvious one is making sure SMC_LID is 3.4v throughout this process.\n\nNext, U9150 deals with eDP MUX, and eDP is what matters since this is what is going to the screen. I would be curious what LCD_MUX_EN and LCD_MUX_SEL are going to U9150 on your defective board vs. a known good.\n\nAn ancillary curiosity would be if U9210 or U9200 were damaged. DP_EXTB_MUX_EN and DP_EXTA_MUX_EN appear to exist to deal with external monitors. U9210 seems responsible for getting LCD recognition data passed between either the external\/internal GPU and thunderbolt port A\/thunderbolt port B. U9200 appears responsible for getting actual image signal from internal\/external GPU to thunderbolt port A\/thunderbolt port B. I am curious if these were damaged at all, if it could be causing screwiness with detection of the internal screen only when plugged\/unplugged.\n\nI would be curious what the SBI, SAI, ENB, ENA signals for each of these chips are on a working known good 3332 with internal LCD attached, and yours. I would be curious what any number of the enables around those two are like on a normal board vs. your malfunctioning one.\n\nI don't know the ins and outs to how this circuit works so I can't give an exact answer."}
{"post_id":32464,"thread_id":32129,"title":"[SOLVED]3332 black screen - Not U8900","user_id":316,"username":"G.Beard","post_date":"2018-03-12 03:19:53","message":"Tried SMC_LID before posting.\nThis is now my machine. This could take me a while so I'll go for the lottery repair approach and start throwing replacement parts at it until it works and THEN figure out what made the difference. This is not a highly cerebral approach, bet it works though.\n\nI'll post back if you're at all interested in what it actually was."}
{"post_id":32469,"thread_id":32129,"title":"[SOLVED]3332 black screen - Not U8900","user_id":2,"username":"dukefawks","post_date":"2018-03-12 05:46:52","message":"Check HPD line from LCD connector."}
{"post_id":32485,"thread_id":32129,"title":"[SOLVED]3332 black screen - Not U8900","user_id":316,"username":"G.Beard","post_date":"2018-03-12 15:58:18","message":"[QUOTE=\"dukefawks, post: 32469\"]Check HPD line from LCD connector. [\/QUOTE]\n\n:o.... Oh..... well this is embarrassing"}
{"post_id":32496,"thread_id":32129,"title":"[SOLVED]3332 black screen - Not U8900","user_id":2,"username":"dukefawks","post_date":"2018-03-12 17:43:51","message":"Uhm, is this fixed then?"}
{"post_id":32499,"thread_id":32129,"title":"[SOLVED]3332 black screen - Not U8900","user_id":316,"username":"G.Beard","post_date":"2018-03-12 18:46:24","message":"[QUOTE=\"dukefawks, post: 32496\"]Uhm, is this fixed then?[\/QUOTE]\n\n:confused: Yes.\n\n[U]Thank you for your help [\/U]and for reminding me I'm a dumbass!:)"}
