{"post_id":34095,"thread_id":34095,"title":"820-3115-B White Screen.","user_id":1511,"username":"ElliottC","post_date":"2018-04-25 11:51:56","message":"Long time subscriber of the YT channel, first time poster.  First off must thank Louis for all of his free advice, has helped me repair a number of machines now as a hobbyist (I'm by no means a professional, and this isn't my livelihood!).\n\nGot an 820-3115-B (2012 13\") here that was working absolutely fine until last week.  Categorically can say that there is no liquid damage on the board, but the logic board WAS removed from the chassis prior to the failure of the display to change out the trackpad.  Have checked the LVDS cable and connector on the board, both look to be OK.  Have also tried another known working display from another 820-3115-B I have here.\n\nThe MacBook boots absolutely fine and external display works as expected, I can also control the brightness of the backlight on the internal display (and the test internal display I tried also works this way) by using the F1\/F2 buttons on the keyboard.  The display turns off when the lid is closed, and back on when open, but there is just no picture on the internal display at all.\n\nShould I pass this machine back as a bad trip, or is there anywhere I can start to troubleshoot?  I much prefer no fan spin issues, I understand most of the troubleshooting steps for those thanks to Louis!  I've got the .brd and schematic for the board so that's not a problem.\n\nThanks in advance!"}
{"post_id":34110,"thread_id":34095,"title":"820-3115-B White Screen.","user_id":2,"username":"dukefawks","post_date":"2018-04-25 17:07:02","message":"Is there 3V on both sides of L9004? If L9004 is dead then check for a short on C9015 with and without LCD connected."}
{"post_id":34138,"thread_id":34095,"title":"820-3115-B White Screen.","user_id":1511,"username":"ElliottC","post_date":"2018-04-26 01:02:33","message":"Thanks Duke, looks like L9004 might have taken a hit (physically). No short on C9015 so can only assume the damage (was loose on the board) was physical not electrical!"}
