[
    {
        "post_id":102008,
        "thread_id":64262,
        "title":"Thinkpad X13 Gen 3 Not Charging via Thunderbolt - need TBT bios",
        "user_id":25485,
        "username":"it-solve",
        "post_date":"2023-10-15 02:17:41",
        "message":"Thinkpad X13 Gen 3 Not Charging via Thunderbolt after an update. Ran out of battery and stays at 5V Fan spins for a second when it switches on, but then the power button blinks 2 times and goes off. Dont have a fully charged battery to charge and flash over Windows. Although the TBT Utility doesn't have Gen 3 version, only gen1.\n\nBased on this feedback - [URL]https:\/\/www.badcaps.net\/forum\/showthread.php?t=82558&highlight=X13[\/URL] I have tried\n- I managed to extract a TBT.bin from Gen 1 version, but I don't think its compatible, as it's not even moving to 20V as before, but stays at 5V only - [URL='https:\/\/support.lenovo.com\/au\/en\/downloads\/ds553979-thunderbolt-firmware-update-utility-for-windows-10-version-1709-or-later-thinkpad-x13-gen-1-t14s-gen-1']https:\/\/support.lenovo.com\/au\/en\/dow...n-1-t14s-gen-1[\/URL]\n- Padded with FF until end to fill 16MB bin and still no success in loading\n- Flash all FF and tried to boot up, but it still stays at 5V\n- Tried holding the RST button with no battery installed as per [URL='https:\/\/www.badcaps.net\/forum\/showpost.php?p=1150370&postcount=3']https:\/\/www.badcaps.net\/forum\/showpo...70&postcount=3[\/URL]\n\nDoes anybody have gen3 firmware for the TBT or know if Gen1 is compatible and if I am doing something wrong?\n\nI think UB1 rom, is the TBT?\n\nMX25U12873F Lenovo Thinkpad X13 Gen 3 NM-E422 BIOS DUMP1.bin\n\nWhile this one is the SPI Rom I think?\n25R256JWEQ Lenovo Thinkpad X13 Gen 3 NM-E422 TBT DUMP2.bin\n\nFound the bord layout for this model but no schematic so cant confirm.\nLenovo ThinkPad X13 Gen 2 NM-D361 BoardView PDF is close by layout, but cant identify the second BIOS for the TBT. JBIOS looks same as main bios W25Q256JVEIQ\n\nShared the Dumps and Schematics here = [URL]https:\/\/1drv.ms\/f\/s!AqUpFIbofx3HmNk5vNk8RvNOUQP1YA?e=jAdX1T[\/URL]"
    }
]