{"post_id":70598,"thread_id":60662,"title":"820-00850 Broken Ribbon Cable Connector to Battery Daughter Board","user_id":29447,"username":"walczyk","post_date":"2021-01-22 00:14:48","message":"Hi everyone, I was wondering if I could get some help diagnosing my 13\" 2018 MBP. The bearings in the left fan failed and when I replaced it the ribbon cable connector on the logic board that connects to the battery daughter Board broke apart, the clasp fell off and then I broke the side off trying to replace it. Now the computer runs extremely sluggish, the fans are always running, and the battery is no longer detected. Does anyone know why it would run sluggish? MWhere can I source a connector like this? I saw a broken half of a logic board for $43 from china, but is there anyway to find the connector itself? As for removing the broken connector is it as simple as desoldering pins on both sides of the connector? I don't have a microscope or heated tweezers but I think I can do this on my own. Also I noticed on the daughter board that the ribbon cable slips out of its connector, I can't force it any further in so that it clasps more firmly on the cable, is that common? \n\nSorry for the rant, thank you for reading!"}
{"post_id":70605,"thread_id":60662,"title":"820-00850 Broken Ribbon Cable Connector to Battery Daughter Board","user_id":682,"username":"2informaticos","post_date":"2021-01-22 02:47:48","message":"First of all, welcome to the forum!\n\nYou can find the 6 pins connector in older boards, like 820-3476\/4924; J6601, microphone connector.\nShould be much easy to replace only the missing part."}
{"post_id":70608,"thread_id":60662,"title":"820-00850 Broken Ribbon Cable Connector to Battery Daughter Board","user_id":29447,"username":"walczyk","post_date":"2021-01-22 04:07:57","message":"Thank you for your reply and help! I just went and ordered a 820-3476 parts board for a good price. Do the symptoms sound correct? The battery didn't show up in MacOS and the computer ran extremely slow.  Thank you again for your help finding the connector! Do professional repair places often scavenge connectors from older boards?"}
{"post_id":70614,"thread_id":60662,"title":"820-00850 Broken Ribbon Cable Connector to Battery Daughter Board","user_id":682,"username":"2informaticos","post_date":"2021-01-22 05:31:50","message":"Scrap boards are the best option to get repair parts for Apple stuff.\n\nNew machines can have strange bahaviors, if no battery detected.\nSome of them don't even start."}
{"post_id":70663,"thread_id":60662,"title":"820-00850 Broken Ribbon Cable Connector to Battery Daughter Board","user_id":29447,"username":"walczyk","post_date":"2021-01-22 20:12:28","message":"Thanks so much 2informaticos! I'm pretty confident this will fix my board :) Your knowledge is SO valuable"}
