[
    {
        "post_id":89015,
        "thread_id":62650,
        "title":"820-01814 20v, but amps…",
        "user_id":37056,
        "username":"Zebulon",
        "post_date":"2022-05-02 19:41:36",
        "message":"The MacBook was working fine, but then it seemed like the battery was dying fast, almost suddenly, then it just stopped turning on.  The guy that owns it did a battery replacementI, but had no luck getting it running. After opening it up I noticed the lock clip missing from the battery connector on the battery controller board and the flex cable was just sitting there. I fixed the connector and the battery is now working, although I’m not sure if it’s charging or simply running off the power that was in it from out of the box. I get 20 volts but once the amps ramp up to 0.72, then zero out and start again. In a loop. It does not power up. I only see one big coil get warm under thermal cam, but not hot. Any ideas?"
    },
    {
        "post_id":89023,
        "thread_id":62650,
        "title":"820-01814 20v, but amps…",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-05-03 00:18:33",
        "message":"Did you try with 87W charger for sure?\nBoard turns on with charger alone, without battery?"
    },
    {
        "post_id":89032,
        "thread_id":62650,
        "title":"820-01814 20v, but amps…",
        "user_id":37056,
        "username":"Zebulon",
        "post_date":"2022-05-03 04:51:17",
        "message":"I just checked and it is 87w charger. No power to CPU rail with or without board connected. With everything connected in the housing it goes to 20v then ramps up to around 0.77a then goes back to zero and starts again. Board alone goes to 20v and goes up to around 0.05a and bounces around from 0.03a to 0.05a."
    },
    {
        "post_id":89036,
        "thread_id":62650,
        "title":"820-01814 20v, but amps…",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-05-03 07:25:19",
        "message":"Check for knocked off components, or other damage that could be caused by customer changing the battery.\n\nDo you get all AWAKE and SLPS2R voltages and steady?"
    },
    {
        "post_id":89057,
        "thread_id":62650,
        "title":"820-01814 20v, but amps…",
        "user_id":37056,
        "username":"Zebulon",
        "post_date":"2022-05-03 16:36:54",
        "message":"AWAKE voltage is 1.206 at  pin 1 of C7914 and  SLPS2R voltage is 0.799 at pin 1 of C7905 ... and both go to zero and back to those voltages after around 20 seconds. i do not see any knocked off components, but the MacBook died while it was being used and that's why he replaced the battery in the first place. A friend told him that would fix it. He took it to Apple and they said it needed a new logic board of course. In the attached image you can see L7030 and the T2 are the only components getting warm."
    },
    {
        "post_id":89065,
        "thread_id":62650,
        "title":"820-01814 20v, but amps…",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-05-04 02:07:27",
        "message":"There are more AWAKE and SLPS2R voltages on the board.\nLook at the small coils surrounding U7800.\n\nWhat is PPBUS_G3H behavior?\nCheck it when the mentioned voltages drop to 0V."
    },
    {
        "post_id":89078,
        "thread_id":62650,
        "title":"820-01814 20v, but amps…",
        "user_id":37056,
        "username":"Zebulon",
        "post_date":"2022-05-04 18:52:20",
        "message":"PPBUS_G3H is at 12.64v then drops to 12.33v when the amps drop to 0.00a from 0.05 now that it's just the board. When i first plug the board in it starts at 5.17v and 0.25a then goes to 20.2v and 0.05a. Coils look ok around U7800."
    },
    {
        "post_id":89082,
        "thread_id":62650,
        "title":"820-01814 20v, but amps…",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-05-05 01:00:27",
        "message":"\"Look at the...\"\nI said that to point you where AWAKE and SLPS2R voktages to check; not too \"look\" at them.\nCheck if all G3S and SSD voltages appear too.\nAlso check diode mode to ground on all big coils; including the \"small\" ones corresponding to SSD."
    },
    {
        "post_id":89089,
        "thread_id":62650,
        "title":"820-01814 20v, but amps…",
        "user_id":37056,
        "username":"Zebulon",
        "post_date":"2022-05-05 06:24:45",
        "message":"Ok, thanks for the info. I understand what you mean now. I had checked the diode mode to ground on all big coils, including the small ones corresponding to SDD, but wasn't sure exactly what the readings should be. I get some of the small ones that are 4.11 and some that are 0.11. The big ones seem to be higher numbers. I am pretty sure that I should have CPU power even while the board is out and just using the 87w charger, but the CPU rails are missing. Is there anywhere I can safely inject voltage or something to look for a short. Unfortunately I'm running out of time with this one."
    },
    {
        "post_id":89091,
        "thread_id":62650,
        "title":"820-01814 20v, but amps…",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-05-05 08:19:39",
        "message":"Before searching for CPU core, did you check RAM voltage at least?\n\nYou can't get the board working if no voltage at L7600 first."
    }
]