{"post_id":99961,"thread_id":63977,"title":"820-00928 internal display works only with external display connected","user_id":1427,"username":"Narek","post_date":"2023-06-15 10:56:29","message":"So this case is really weird. I got an 820-00928 after slight water damage around  J8500 and U8500\/U8501. I have replaced U8500\/U8501, J8500 and eDP connector on LCD side. Also put new eDP flex. I've found out, that EDP_AUXCH_C_P line is shorted, so I've replaced U9850. Now computer turns on, there is an image, but only on system loading screen. Before login screen show up both image and backlight dissapear. On touchbar there is an onformation, that external monitor is connected (but in fact there is nothing connected...) and choose what to do: clone or extend screen. Nothing happens if I press the options. If I turn on computer in safe mode image works all the time, I can log in to profile. If I connect external display it works too, there is an image on the screen and external display, but as soon as I disconnect external screen after 2-3 seconds internal screen gets black. I have replaced U9850 three times, I took them from the same board and 820-01700 board - no difference. I have tested another good screen and again - no difference."}
{"post_id":99966,"thread_id":63977,"title":"820-00928 internal display works only with external display connected","user_id":682,"username":"2informaticos","post_date":"2023-06-15 14:43:31","message":"Possibly iGPU problem.\nConnecting external monitor forces dGPU.\nAnd before loading OS, dGPU may still be in use with generic driver.\nIf that time iGPU is used, it probably crashes only when macOS try to load its driver.\n\nStart in diagnostic mode and check if any error pops up.\nYou can also try with Windows, or Linux.\nCheck if the problem appears when the driver is installed."}
{"post_id":99982,"thread_id":63977,"title":"820-00928 internal display works only with external display connected","user_id":1427,"username":"Narek","post_date":"2023-06-16 05:24:16","message":"Internal diagnostics doesn't show any errors. I will test it with mentioned windows or linux. But just from curiosity - maybe there is a way to trick the board (on the board side), that external display is connected?"}
