[
    {
        "post_id":6618,
        "thread_id":6618,
        "title":"Late 2013 Retina 13\" Screen - No Video",
        "user_id":135,
        "username":"bjf",
        "post_date":"2016-09-12 09:32:46",
        "message":"I have a late 2013 Retina 13\" that works fine with a good (but cracked) screen but I'm trying to repair a screen that had some damage to pins 1 and 2 and very slight damage to pins 3 and 4 on the LCD-side connector. After adding solder they all looked good so they were just covered with melted plastic. I replaced the connector and have a backlight now, but no video. I was extremely careful so as to not damage anything around the connector when removing it. Pins have all been double-checked - they're all solidly soldered. I have a known-good cable. Any ideas what could be happening with the signal once it hits the LCD?"
    },
    {
        "post_id":6622,
        "thread_id":6618,
        "title":"Late 2013 Retina 13\" Screen - No Video",
        "user_id":36,
        "username":"aprendiz",
        "post_date":"2016-09-12 10:02:37",
        "message":"You mean pins inside the display assembly??? If yes, how do this happen?? Shorted cable??? I guess display is trash now....."
    },
    {
        "post_id":6625,
        "thread_id":6618,
        "title":"Late 2013 Retina 13\" Screen - No Video",
        "user_id":135,
        "username":"bjf",
        "post_date":"2016-09-12 10:29:05",
        "message":"Yeah, the LCD connector on the actual display assembly. Had to be some type of spill, not sure though. Pins 1-4 (backlight pins) were blackened but recovered fine with new solder. I have continuity between pin 1 and the backlight connector to the left of the LCD connector. And the backlight does work, but no video signal. Everything else looks good but I'm trying to figure out where the problem might be. I can't figure out yet why the signal isn't getting through so I want to see if it's salvageable."
    },
    {
        "post_id":6628,
        "thread_id":6618,
        "title":"Late 2013 Retina 13\" Screen - No Video",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-09-12 11:13:35",
        "message":"If there is backlight the LCD must work. Remember that 2013+ machines boot to a black screen with just backlight. After 30 seconds you should get the question mark. If that does not happen I suspect a bad LCD assembly.\nTry with a known good assembly first."
    },
    {
        "post_id":6629,
        "thread_id":6618,
        "title":"Late 2013 Retina 13\" Screen - No Video",
        "user_id":135,
        "username":"bjf",
        "post_date":"2016-09-12 12:08:20",
        "message":"Yes, that was my thought and why I'm trying to save this. The backlight is definitely on. The original cracked screen works fine when I hold down the Option key. It goes right to the drive select screen. When I attach this screen and do the same thing I get just the blank screen. And it never goes to a blinking folder. It just has that dark blue\/black screen that normally comes up on these models. To be really sure I booted it into a system and hooked up an external monitor. Still nothing on the screen. Built-In screen is recognized normally."
    },
    {
        "post_id":6639,
        "thread_id":6618,
        "title":"Late 2013 Retina 13\" Screen - No Video",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-09-12 15:48:58",
        "message":"You are wasting time on a dead LCD. Buy a complete assembly and be happy."
    }
]