[
    {
        "post_id":90113,
        "thread_id":62785,
        "title":"2016 A1706 820-00239 - No internal video \/ external video works \/ system boots and operates perfectly otherwise \/ dead EDP_INT_AUX_N channel",
        "user_id":34271,
        "username":"crumblenaut",
        "post_date":"2022-06-10 20:51:15",
        "message":"Hey folks!\n\nThis is mostly a double-check before I call something prematurely.\n\nSystem is fully functional except for its internal display which has no image \/ no backlight.  Both.\n\nEDP_PANEL_PWR_EN is at 0V.  All supplies to U8500, U8501, and U8510 are present.  \n\nSo either that signal is being shorted to ground by U8510 - OR - after reading other posts it seems like the system may simply not be able to detect the internal display because I have 0.172V for all EDP_INT lines EXCEPT EDP_INT_AUX_N, which reads 0.001V.\n\nFrom [URL='https:\/\/boards.rossmanngroup.com\/threads\/820-00923-no-internal-video.62246\/post-85930']this response by the great 2informaticos[\/URL] I see someone with similar diode mode readings on a 2017 A1706, where with that low diode mode reading on EDP_INT_AUX_N, he calls time of death, saying that the CPU's eDP output is damaged because there are no series capacitors to protect data lines on that board, which is also the case on this one.\n\nThat's all there is to it, right? This is a desktop with a battery backup now?\n\nAgain, I'm pretty sure that that's all the case and I SUPER value your time, but I figure I owe my customer to double check in the interest of due diligence before failing to resolve something obvious, or offering a silly workaround for the customer if one might exist.\n\nI threw in as many keywords as I could so others can save everyone's time by not asking this in the future, eeeven just to double-check like me.  ;)  Hope that makes up for the potentially silly inquiry.\n\nThank you so much for your time!"
    },
    {
        "post_id":90114,
        "thread_id":62785,
        "title":"2016 A1706 820-00239 - No internal video \/ external video works \/ system boots and operates perfectly otherwise \/ dead EDP_INT_AUX_N channel",
        "user_id":34271,
        "username":"crumblenaut",
        "post_date":"2022-06-10 20:56:08",
        "message":"While I'm at it, any explanation for how that could happen to a completely untouched, no liquid exposure board would be awesome.  Besides the design flaw of a lack of a coupling cap to block DC from getting in there, that is.  \n\nIt really just has to have been some transient moisture or something that... maybe bridged the 3.3V line into the CPU across the R8503 nostuff gap one, but then left no corrosion or residue to suggest such a thing?  Or a manufacturing defect in the CPU?\n\nWild speculation is wholly welcome.  ;)"
    },
    {
        "post_id":90115,
        "thread_id":62785,
        "title":"2016 A1706 820-00239 - No internal video \/ external video works \/ system boots and operates perfectly otherwise \/ dead EDP_INT_AUX_N channel",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-06-11 01:42:36",
        "message":"That line is also near the backlight voltage on the T-CON board; placed on LCD assembly.\nSo the leakage could happened there.\n\nAny case, disconnect J8500 and check again diode mode to ground.\nIf still short, no doubt internal video is lost forever; unless change the CPU, of course."
    },
    {
        "post_id":90157,
        "thread_id":62785,
        "title":"2016 A1706 820-00239 - No internal video \/ external video works \/ system boots and operates perfectly otherwise \/ dead EDP_INT_AUX_N channel",
        "user_id":34271,
        "username":"crumblenaut",
        "post_date":"2022-06-13 11:14:28",
        "message":"Oh yeah, hah, yep!  That IS the backlight line right there, isn't it.   SIGH.\n\nThanks so much, man.  I really appreciate you weighing in with the conclusivity!"
    }
]