[
    {
        "post_id":103866,
        "thread_id":64471,
        "title":"820-02098-a A2442 No Power \/ Boot",
        "user_id":57852,
        "username":"economypilot",
        "post_date":"2024-01-20 09:55:38",
        "message":"Good Afternoon!\n\nI am new at this. My kitty cat spilled a glass of wine on my Macbook. Recently divorced and ex took like 80% of my assets and is still suing me ---- and I need this laptop to defend myself. The 20% I \"got\" is tied up in my house. Anyway - I have to fix this on my own if I'm going to have access to my files. I'm fairly logical and think I'm capable. I have a hot air station and have done quite a bit of soldering as I've built drones before, but I've only done minimal SMD work.\n\nMy charger doesn't light up when plugged in, and I do have a USB-C meter which shows the board is stuck at 5v and draws .006 amps.\n\nI have my boardview and schematics and I have confirmed there is a short between ground and my PPBUS-AON.\n\nI have visible corrosion around the components shown in the attached files but I am confused by the boardview in that location. The components in the boardview file are shown installed at angles that are not present on my physical board and appear to be different. This is what is throwing me off in moving forward at this point... do I have a slightly different board, or am I not understanding the boardview diagram?\n\nI'm attaching 3 images. A view of my physical board and the corrosion present, a stock image of my board with the area in question circled, and then the boardview file circled in the same area which seems to show a different layout (unless I have some ignorance about this).\n\nI guess I should also mention I have a Fluke 289 as my meter and I DO actually have a thermal camera although the one that I have is more geared toward building maintenance and construction I think it is sufficiently sensitive to be of help in making diagnostics."
    },
    {
        "post_id":103867,
        "thread_id":64471,
        "title":"820-02098-a A2442 No Power \/ Boot",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2024-01-20 11:14:55",
        "message":"First of all, welcome to the forum!\n\nThat corrosion should be the reason of the short.\nRP850 is practically connected to PPBUS_AON.\nClean that area and rebuil the traces, if necessary.\nThen check if the short still persists.\n\nMany boardviews have strange representation for several transistors and ICs.\nThat shouldn't be a problem to locate the signals by their names, not by components.\n\n[URL unfurl=\"true\"]https:\/\/drive.google.com\/file\/d\/1tMvWMQc6vVdPgIZdWXcP-S_g3yrems8S\/view?usp=sharing[\/URL]\nUse this one, if you prefer..."
    }
]