{"post_id":12407,"thread_id":12407,"title":"[MZ-JPU512T\/0A6] 512GB Samsung SSD repair, can someone probe two resistors for me?","user_id":289,"username":"smiba","post_date":"2017-01-06 19:54:45","message":"I'm not sure if this has actually been done before, but I'm trying to repair a SSD from a 2013 Macbook Pro. I bought a broken macbook long ago to repair and this SSD came with it. Since the 512GB ssd is going for quite the price on eBay it would be a waste to throw it out without trying to fix it myself first.\n\nAfter looking around I couldn't see anything that was seriously messed up, there was one resistor which looked slightly odd so I measured the area for a bit and found two what looks like shorts to ground.\nI'm not sure if those two resistors are indeed 0Ohm resistors or if they're broken. Can someone probe a working SSD for me to check if there is any resistance at that point? I would love to know what to replace them with, but just knowing these are not supposed to be tied to ground would be great already.\n\nCheck the pictures for more information\n\nThanks!\n(Also if there is any schematic or something online, please let me know)"}
{"post_id":12415,"thread_id":12407,"title":"[MZ-JPU512T\/0A6] 512GB Samsung SSD repair, can someone probe two resistors for me?","user_id":2,"username":"dukefawks","post_date":"2017-01-06 21:08:18","message":"If the resistor measures 0Ohm they will be fine. Resistors fail open or go up in value."}
{"post_id":14037,"thread_id":12407,"title":"[MZ-JPU512T\/0A6] 512GB Samsung SSD repair, can someone probe two resistors for me?","user_id":289,"username":"smiba","post_date":"2017-02-01 14:44:30","message":"No Title\n\nBack again, I would love it if someone could probe this capacitor.\n\nIt should be easy to find and no disassembly is required. Its on the top side (visible while plugged into motherboard). For me there is 12.5V running over it, which seems like an awful lot to have running on a SSD. It might be correct though but I don't have a schematic to verify.\n\nThanks!"}
