{"post_id":63514,"thread_id":59812,"title":"MacBook Air 13 \" 820-00165 no manufacture date presented","user_id":1101,"username":"ielectron","post_date":"2020-08-08 14:50:52","message":"Hi, \nI've got another MacBook Air 13 SMC was faulty and I replaced it now laptop works but it doesn't show manufacture date. I know that if someone has been messing with bios and SN this will heaped I didn't touch it but it look like someone try fix something so its possible bios has been reflashed with unknown EFI and SN. Is it possible to fix this issue without knowing what serial number was before or other ways to repair it ? \nOr should I just build a new bios with clean ME and put serial number with is showing now in device info?\nI have lid but it doesn't belongs this machine its  from another Mac and manufacture year is 2012 according to serial with is on it.. \nI've checked board but those models doesn't have any stickers on MB itself with serial just to see if matching. \n\nThanks in advice."}
{"post_id":63515,"thread_id":59812,"title":"MacBook Air 13 \" 820-00165 no manufacture date presented","user_id":682,"username":"2informaticos","post_date":"2020-08-08 15:00:39","message":"If machime works correctly, no need to clean ME.\nBut if Fsys area is corrupted, you will need to use new BIOS file, changing serial number.\nYou can swap your ME region, or clean ME in new file.\nAlso need to fix Fsys checksum, after changing serial number."}
{"post_id":63517,"thread_id":59812,"title":"MacBook Air 13 \" 820-00165 no manufacture date presented","user_id":1101,"username":"ielectron","post_date":"2020-08-08 15:28:00","message":"could you share clean ME bios please I will try do this the old links are not working"}
{"post_id":63518,"thread_id":59812,"title":"MacBook Air 13 \" 820-00165 no manufacture date presented","user_id":1101,"username":"ielectron","post_date":"2020-08-08 15:48:38","message":"or any chance you could fix this Fsys for me please here is this bios, I start reading now about it and looks like I will have to figur it out but I need this laptop have ready for tomorrow morning tested please if you could help me. \nMuch appreciated.\n[URL unfurl=\"true\"]https:\/\/drive.google.com\/file\/d\/1CAbjp_LBm1yyROjycZ7A4zKswRl0wecc\/view?usp=sharing[\/URL]"}
{"post_id":63520,"thread_id":59812,"title":"MacBook Air 13 \" 820-00165 no manufacture date presented","user_id":1101,"username":"ielectron","post_date":"2020-08-09 05:41:49","message":"I've tried do it myself but I don't know how do fix Fsys checksum, I tried new bios and swap ME region and change SN. Just tried this and still same no manufacture year, SN presented correctly I install fresh OSX because I didn't recognise SSD properly so everything is as it was. I don't have medusa so I've done this in hex editor."}
{"post_id":63521,"thread_id":59812,"title":"MacBook Air 13 \" 820-00165 no manufacture date presented","user_id":682,"username":"2informaticos","post_date":"2020-08-09 06:50:36","message":"Try and comment...\n[URL unfurl=\"true\"]https:\/\/drive.google.com\/file\/d\/1oDqTD88WxAr-wpnVql8aUdqpZlpGwH3o\/view?usp=sharing[\/URL]"}
{"post_id":63523,"thread_id":59812,"title":"MacBook Air 13 \" 820-00165 no manufacture date presented","user_id":1101,"username":"ielectron","post_date":"2020-08-09 09:13:17","message":"I've tried this bios, still not showing a year and laptop is a bit slower than it was when loading to system or opening apps, PRAM and SMC reset has been done, didn't install fresh OSX trying this on this installed this morning.\nLaptop is connected to network and I wait a few min because sometimes this want show up straight away.\nAlso I duble checked this SN on apple website and it is recognised correctly exist so its not a random one."}
{"post_id":63524,"thread_id":59812,"title":"MacBook Air 13 \" 820-00165 no manufacture date presented","user_id":682,"username":"2informaticos","post_date":"2020-08-09 09:40:21","message":"The file you uploaded is original backup of your board?\nThe serial number from it, matches the one from bottom cover?\nIf machine works flawlessly and shows correct serial number in \"About This Mac\", does matter the manufacture date so much???"}
{"post_id":63526,"thread_id":59812,"title":"MacBook Air 13 \" 820-00165 no manufacture date presented","user_id":1101,"username":"ielectron","post_date":"2020-08-09 10:02:24","message":"Yes its original backup file from board, SN of board its not matching bottom cover because bottom cover is from another MacBook Air from 2012. \nIf it will go for sale first what people looking at is what year and spec the laptop is in \"Abut This Mac\" so I was thinking to sort it out"}
{"post_id":63527,"thread_id":59812,"title":"MacBook Air 13 \" 820-00165 no manufacture date presented","user_id":682,"username":"2informaticos","post_date":"2020-08-09 10:22:59","message":"Serial number and specs do not appear listed on \"About This Mac\", apart of missing manufacture date?"}
{"post_id":63529,"thread_id":59812,"title":"MacBook Air 13 \" 820-00165 no manufacture date presented","user_id":1101,"username":"ielectron","post_date":"2020-08-09 10:43:21","message":"Serial and specs appear, only what's missing on \"About the Mac\" is the manufacture date"}
{"post_id":63533,"thread_id":59812,"title":"MacBook Air 13 \" 820-00165 no manufacture date presented","user_id":1101,"username":"ielectron","post_date":"2020-08-09 13:53:28","message":"Maybe this is the answer for question but I don't think its actually true myself, found this on apple forum \n\nHi Everyone\n\n\n\nWell, I have just called AppleCare. Very friendly and helpful.\n\n\n\nThe answer is – because my laptop was originally a build to order, the model\/year does not show up in “About This Mac”. MBAs purchased direct from a store will show the model\/year correctly.\n\n\n\nSo that’s how it works!\n\n\n\nThank you to everyone for your help ?\n\n[URL unfurl=\"true\"]https:\/\/discussions.apple.com\/thread\/7099653[\/URL]"}
{"post_id":63534,"thread_id":59812,"title":"MacBook Air 13 \" 820-00165 no manufacture date presented","user_id":682,"username":"2informaticos","post_date":"2020-08-09 15:03:10","message":"I remember to saw other machines with same behaviour, so no worry for that."}
