{"post_id":91677,"thread_id":62971,"title":"820-00850-A - No Power - 20V 0.02A","user_id":21454,"username":"GoodguyFR","post_date":"2022-08-05 09:17:09","message":"Hi people !\n\nI have a very clean board there, no liquid damage, that doesn't turn on. It seems it overheated around T2 Chip, on the back of it some resistors are kind of brownish (maybe it's just baked dust, IDK). I tried to restore T2 Chip but it is not enable to complete the process, always end with an error (tried with different host Mac, different OS, and official Apple cables).\n\nI made some mesurements :\n[LIST]\n[*]PPBUS : 12.7V\n[*]PP5V_G3S : 5.1V\n[*]PP3V3_G3H : 3.4V\n[*]PP1V8_G3S : 1.8V\n[*]PP1V2_S3 : 0V\n[*]PP0V6_S0_DDRVTT : 0V\n[\/LIST]\nAfter that I guessed the RAM was not supplied, so I check around his buck controller U8100. It is well supplied by 5V, but nothing comes out because it's not telling to (0V on pin 16 and 17). As these signals comes from the PMIC, I think it is the culprit, but I am not used to work on these models at the moment, so not really sure.\n\nI'd like to know if I missed something and if there is some steps to check before I remove the PMIC and try to replace it.\n\nThank you for your time, Bye"}
{"post_id":91681,"thread_id":62971,"title":"820-00850-A - No Power - 20V 0.02A","user_id":682,"username":"2informaticos","post_date":"2022-08-05 11:12:21","message":"Do you get SSD volatges?"}
{"post_id":91733,"thread_id":62971,"title":"820-00850-A - No Power - 20V 0.02A","user_id":21454,"username":"GoodguyFR","post_date":"2022-08-08 05:06:43","message":"Hi 2informaticos,\n\nHere are the SSD voltages that I have :\n[LIST]\n[*]PP2V7_NAND_SSD0 : 2.5V --> It seems I have a short there, 60ohms seems not right for this rail, I don't have a board to compare but on a A1706 board that is similar I have way more\n[*]PP1V8_SSD0 : 1.8V\n[*]PP0V9_SSD0 : 0.9V\n[\/LIST]"}
{"post_id":91736,"thread_id":62971,"title":"820-00850-A - No Power - 20V 0.02A","user_id":682,"username":"2informaticos","post_date":"2022-08-08 07:02:04","message":"You cannot expect RAM voltage, if DFU can't be completed.\nMay have internal T2 problem, or SSD.\n\nSometime DFU can be completed after several days trying.\nApple did a \"good job\" with the f***g T2."}
{"post_id":91784,"thread_id":62971,"title":"820-00850-A - No Power - 20V 0.02A","user_id":21454,"username":"GoodguyFR","post_date":"2022-08-11 07:15:19","message":"Well understood. I don't know how the DFU could suddenly be completed if I don't change anything on the board, is it kind of mystic shit ?\n\nJoke besides, I ordered SSD voltage regulator (U9000), worth the try, I'll keep you tuned on this."}
{"post_id":91794,"thread_id":62971,"title":"820-00850-A - No Power - 20V 0.02A","user_id":682,"username":"2informaticos","post_date":"2022-08-11 18:51:19","message":"You can use power on sequence from 01055, or 01598 boards; available on the forum.\nU9000 requires more than simple enable signal.\nIt is controlled by T2."}
