{"post_id":44433,"thread_id":44433,"title":"A1502 820-3476-A intermittent backlight","user_id":1804,"username":"bridportpcrepair","post_date":"2019-01-07 05:13:55","message":"Hi guys\n\nGot an A1502 here that has a backlight issue. No sign of any liquid damage on the board, all seems clean.\n\nThe screen has a display, but the backlight is intermittent. By that I mean that sometimes it will boot normally, screen will light, all is good.\n\nSometimes however it won't light up, it has a display but no backlight.\n\nIf I close the lid, the screen turns off as usual, opening it again results in no backlight most of the time.\n\nIs there any point I should be starting to look at first?\n\nPPV_OUT_S0_LCDBKLT (measured at Pin1 of LVDS connector) is 38v when functioning but reads at 11.5v when backlight is off.\n\nI dimly recall something about SMC_LID and the hall sensor - is that a common area I should look at?\n\nMany thanks"}
{"post_id":44434,"thread_id":44433,"title":"A1502 820-3476-A intermittent backlight","user_id":1804,"username":"bridportpcrepair","post_date":"2019-01-07 05:27:12","message":"Can't delete my post so I'll update - there IS liquid damage, didn't see the tiny spot of corrosion right underneath the backlight controller, will sort that and post back if there's still a problem!\n\nCheers!"}
{"post_id":44437,"thread_id":44433,"title":"A1502 820-3476-A intermittent backlight","user_id":682,"username":"2informaticos","post_date":"2019-01-07 06:18:26","message":"If cleaning board doesn't help, be sure to use original charger.\nMagSafe 1 to 2 adapter can cause that..."}
{"post_id":44439,"thread_id":44433,"title":"A1502 820-3476-A intermittent backlight","user_id":1804,"username":"bridportpcrepair","post_date":"2019-01-07 06:21:13","message":"Cleaning the board (removed the Q7700 IC and cleaned \/ resoldered), and the backlight driver, all seems well now with an instant backlight response rather than the delayed response I was getting before.\n\nHowever, wasn't aware of the Magsafe 1->2 adapter issue - will lodge that in the memory bank!!\n\nMany thanks"}
