[
    {
        "post_id":6984,
        "thread_id":6984,
        "title":"Macbook pro 15, 820 2330-A, no green light and no turn on",
        "user_id":423,
        "username":"Noguinfor",
        "post_date":"2016-09-20 09:31:07",
        "message":"Hi guys, \n\nHave a board 820 2330-A what i dont have green light.\nhave all voltages any less PP5V_S5_REG.. This lane have a short to ground ...\n\nany ideas what i look for?"
    },
    {
        "post_id":6994,
        "thread_id":6984,
        "title":"Macbook pro 15, 820 2330-A, no green light and no turn on",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-09-20 13:34:25",
        "message":"Green light is first thing you need. Voltage on pin 5 of U6915? I assume 3V42 is present on L6995!"
    },
    {
        "post_id":7022,
        "thread_id":6984,
        "title":"Macbook pro 15, 820 2330-A, no green light and no turn on",
        "user_id":423,
        "username":"Noguinfor",
        "post_date":"2016-09-21 06:36:38",
        "message":"ya i know. But this 1 wire circuit i don't understand very much. is different for example bard 820 - 2879 ... i have 17v pin 5 of U6915. and ya i have 3V42 on L6995."
    },
    {
        "post_id":7027,
        "thread_id":6984,
        "title":"Macbook pro 15, 820 2330-A, no green light and no turn on",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2016-09-21 09:37:01",
        "message":"Q6920 is going to let the SMC talk to the DC in board. In order for Q6920 to let this occur, being an N channel MOSFET, you want equal or higher voltage on the gate than on the source, so you want voltage to be there.\n\nWhat places voltage on Q6920? The voltage divider of R6917\/R6918. It'll lower the 16v from the charger to something like 8-9v. This is when all is working as it should. So, with a known good DC in board, measure pin 2\/5 of Q6920. Do you get 8-9v? Then this part of the circuit is doing its job - go away and check the SMC. Is PP3V42_G3H present? PP3V42_G3H is required for the SMC to turn on. Is the SMC turning on? SMC_RESET_L is required for the SMC to turn on.\n\nIf you do not have 8-9v on pins 2\/5 of Q6920, then we have a problem with the onewire circuit. So let's take a look and walk through this clusterfuck of a mess, because it is intimidating if you are used to the newer onewire circuit.\n\nIt all begins at U7000. Look at R7010\/R7011 - this voltage divider takes the 16v from the charger and turns it into 4v for the CHGR_ACIN pin of U7000. When CHGR_ACIN of U7000 has 4v, it allows CHGR_ACOK to remain at a high voltage. CHGR_ACOK is pulled up by R5087, and can be pulled down by U7000 if something isn't right. If CHGR_ACIN is coming into U7000, and you have CHGR_ACOK on output, then we're 90% of the way there. Occasionally U7000 will pull down CHGR_ACOK if current sensing circuit is not working, such as resistance between pins 17\/18 being over 4 ohms or resistance between pins 27\/28 being over 21 ohms, but that is not likely here. We can move on and check other things.\n\nIf CHGR_ACOK is present, let's go back to the onewire circuit, where they call it SMC_BC_ACOK. Remember Q6910, which we need to open to send charger power to the onewire circuit? This is a P channel MOSFET, which will open when the voltage on the gate is lower than the source. So let's see... R6911 takes the charger voltage and puts it straight on the gate. Gah, this will never open now! We have 16v on the source [I]and[\/I] the gate! However, R6912 turns this circuit into a [I]voltage divider![\/I] When R6912 has a path to ground, it will [I]lower [\/I]the voltage on the gate of Q6910!\n\nWhat gives R6912 a path to ground? Q6915. Q6915 is an N channel MOSFET[I](dual, actually, there's 2 transistors inside one package)[\/I], which will open when the voltage on the gate is higher than the source. So let's check pins 1 and 2 of Q6915. Pin 1 is ground(0v). Pin 2 is SMC_BC_ACOK - so as long as SMC_BC_ACOK is higher than 2v or so, it will open and allow our R6911\/R6912 voltage divider to work, which will allow Q6910 to pass power through.\n\n[B]COMMON FAULT: Q6910 fails internally and shorts pins 1\/2 together, which fucks up the voltage divider. [\/B]Check resistance between pins 1 & 2 of Q6910, if you get anything lower than 400kohms it's fucked. 250 ohms is common measurement for a fucked Q6910.\n\nNow, if this is all checking out so far, let's go over to R6917\/R6918. This voltage divider has a path to ground, by default, no transistor required to give it a path to ground like R6912\/Q6915. At pin 2 of R6917 is the output of this voltage divider which should dump 8-9v into Q6920's gate and allow it to open. This is simple and straightforward. Do you have 8-9v here? If you do, check everything I stated in the beginning about SMC\/PP3V42_G3H\/SMC_RESET_L. If you [I]DON'T [\/I]have anything here, then I want you to answer this question for me: what can take away the voltage from R6917 and send it to ground? No, not a bad R6917.. that is never the case. You're welcome to measure to confirm. ;)\n\nLook around, follow the lines... yes, Q6915! Q6915, our N channel MOSFET, provides a direct path from R6917 to ground, from pin 3 of Q6915 to pin 4. If pin 5, the gate, of Q6915 has a high voltage on it, it will send ONEWIRE_EN directly to ground. What causes this? Usually a fucked up U6915 from someone plugging the charger in and touching wrong contacts somewhere.\n\nYou will have to go through and troubleshoot this to figure out what is actually wrong."
    },
    {
        "post_id":7035,
        "thread_id":6984,
        "title":"Macbook pro 15, 820 2330-A, no green light and no turn on",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-09-21 09:51:18",
        "message":"17V is ok. SMC might not be running, what is your PPBUS voltage 12.3 or 12.56?"
    },
    {
        "post_id":7094,
        "thread_id":6984,
        "title":"Macbook pro 15, 820 2330-A, no green light and no turn on",
        "user_id":423,
        "username":"Noguinfor",
        "post_date":"2016-09-22 02:33:21",
        "message":"First off all tank you for answering, \n\nLouis is right, the problem is it the fuking U6915 ... i have a high voltage on pin 5 Q6915.. :( , i dont have the component in stock and dead boards.. i will have to wait 2\/3 weeks for component.\n\nDuke i have 12.69 on PPBUS. Its dead SMC?"
    },
    {
        "post_id":7112,
        "thread_id":6984,
        "title":"Macbook pro 15, 820 2330-A, no green light and no turn on",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2016-09-22 08:55:09",
        "message":"12.56-12.6v on PPBUS_G3H is good. the SMC sets the final voltage for PPBUS_G3H after U7000 turns on, it's only when it's 3% lower than it usually is that the SMC is not on.\n\nIf you want to just see if this will work before new parts come in, remove U6915\/Q6915\/Q6910 and put a 100k resistor between pins 1 and 6 of Q6910.\n\n[B]Obviously do not give it back to the customer like this[\/B], but this at least lets you give a status update to them if they call while you're waiting for parts that the rest of the machine works. If the rest of it is fucked or it beeps or something then no point in ordering parts for it."
    },
    {
        "post_id":7122,
        "thread_id":6984,
        "title":"Macbook pro 15, 820 2330-A, no green light and no turn on",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-09-22 10:00:51",
        "message":"u6915 can be found on every macbook board from 2009 or earlier. It's also on the old A1181 white macbook board."
    }
]