{"post_id":31139,"thread_id":31139,"title":"820-00239 VDH002 \"There may be an issue with a storage device.\" error","user_id":135,"username":"bjf","post_date":"2018-02-05 18:19:33","message":"I'm getting VDH002 \"There may be an issue with a storage device\" error when running the online test. Liquid-damaged board. Ultrasonic-only fix. It turns on but just keeps booting to a recovery screen and saying I need to run an update, and that I can't use the Mac until that update runs. It then errors out every time. I can't boot to an external, it goes to that screen every time. I attached pre-ultrasonic pics. Any thoughts\/ideas?"}
{"post_id":31145,"thread_id":31139,"title":"820-00239 VDH002 \"There may be an issue with a storage device.\" error","user_id":2,"username":"dukefawks","post_date":"2018-02-05 21:27:45","message":"Did you plug in the life boat jumper connector thing on J9600? You can remove it and isolate the SSD from the rest of the system. It should then be able to boot from external drive.\n\nI'm afraid this will be a SSD that went into read only mode so that would be pretty terminal."}
{"post_id":31170,"thread_id":31139,"title":"820-00239 VDH002 \"There may be an issue with a storage device.\" error","user_id":135,"username":"bjf","post_date":"2018-02-06 20:03:26","message":"Ok, I actually didn't have that connector on there. I reconnected it but no change. If I try internet recovery, it doesn't recognize the drive. I did a PRAM reset. I can't do SMC because the power button is not registering for some reason. I keep running into that problem with different boards and buttons too. Not sure what's happening there. Touch ID is working, but no power button. Either way, any other thoughts on this?"}
{"post_id":31171,"thread_id":31139,"title":"820-00239 VDH002 \"There may be an issue with a storage device.\" error","user_id":2,"username":"dukefawks","post_date":"2018-02-06 20:54:57","message":"The SSD is probably dead. Inspect the SSD area. If you have the \"life boat reader\" available you can use that to see if the SSD can be read that way. If you have a local AASP they may have one too.\n\nInspect J9600 for damage and all the data lines and caps (C8610 and friends) to\/from U9600 for continuity and diode mode on the caps on both sides."}
{"post_id":32099,"thread_id":31139,"title":"820-00239 VDH002 \"There may be an issue with a storage device.\" error","user_id":468,"username":"ALB-Repairs","post_date":"2018-02-28 10:56:34","message":"Did you ever get anywhere with this? I have one that does exactly the same, even comes to the same screen with the lifeboat connector removed.\nIt will boot in safe mode and can run first aid with no issues. \nThis was liquid damaged, USB C controller chip removed to trace down passives and find there value by comparing it to the other USB C controller on the opposite side. so it considering the work gone in, i would really like to get this one running"}
{"post_id":32103,"thread_id":31139,"title":"820-00239 VDH002 \"There may be an issue with a storage device.\" error","user_id":135,"username":"bjf","post_date":"2018-02-28 13:31:09","message":"I would try it again with the connector attached. I was told by a technician here that he's gotten past that screen by just trying it multiple times. And he's had that happen on multiple Touch Bar models. Maybe try it with the battery connected? Based on what I've seen with other newer models, it wouldn't surprise me if the battery needs to be connected. I didn't have a good battery at the time and unloaded the computer as-is. Next time I will completely assemble the computer with all functional parts and then try to get past that screen. At this point, that's my best advice."}
