{"post_id":54206,"thread_id":54206,"title":"820-4924 Powers on most times sometimes it wont","user_id":2508,"username":"No-Clean","post_date":"2019-11-05 12:19:26","message":"Ok this one is driving me crazy because almost each time I plugged it the board will turn on, but if I left it off for a while it wont. Board is clean no liquid damage and overall looks as new. Now I have it connect it to the PS and it is not turning on, so I measured and it turns out:\n\nU7501 is not getting any voltage on pin 4 the enable pin, I am stock here I don't know why, any help will be greatly appreciated."}
{"post_id":54211,"thread_id":54206,"title":"820-4924 Powers on most times sometimes it wont","user_id":682,"username":"2informaticos","post_date":"2019-11-05 14:52:07","message":"Missing SMC_PM_G2_EN?\nTry original 60\/85w Magsafe 2 charger."}
{"post_id":54213,"thread_id":54206,"title":"820-4924 Powers on most times sometimes it wont","user_id":2508,"username":"No-Clean","post_date":"2019-11-05 15:00:47","message":"Correct, it works when I use the original charger most times, but sometimes randomly it just does not start, I have a hard time making it NOT start when plug into the charger that is why it is so hard to troubleshoot."}
{"post_id":54218,"thread_id":54206,"title":"820-4924 Powers on most times sometimes it wont","user_id":682,"username":"2informaticos","post_date":"2019-11-05 18:38:41","message":"Does it fail to start with original charger?\nPost basic signals of power on sequence when machine doesn't start."}
{"post_id":54255,"thread_id":54206,"title":"820-4924 Powers on most times sometimes it wont","user_id":2508,"username":"No-Clean","post_date":"2019-11-06 21:58:48","message":"Yes it fails to start with original charger, but a long time has to go after you turn it on, if it is on it will work fine after that, it is not till you leave it off over night that it won't start up again. I think I figure it out, will report back tomorrow."}
{"post_id":54291,"thread_id":54206,"title":"820-4924 Powers on most times sometimes it wont","user_id":2508,"username":"No-Clean","post_date":"2019-11-07 16:44:48","message":"Ok I got the board to NOT turn on while removed from the Mac and realized ppbus was low like 12.2v or so, I reflowed the SMC and the Mac is now working, I did not reballed it because it looked clean all around, a reflow was good enough. \n\nThanks!"}
