{"post_id":23935,"thread_id":23935,"title":"820-00163 no chime","user_id":170,"username":"rob777","post_date":"2017-08-08 04:00:43","message":"ok been working on this 820-00163 for a couple days now. It has orange and green lights on charger. fans spin but no chime and no display. Have checked with working display just in case it didn't chime or something in this model. \n\nHistory is i I replaced the display 12months ago. It has now come back dead and customer says 'just happened'... there is not any evidence of liquid damage anywhere whatsoever. \n\nSo I thought vcore but after measuring all the following I'm completely stuck now. \n\nppvcc_s0_cpu 1.8v\npp1v35_s3 1.3v\npp1v5_s0 1.5v\npm_slp_s3_l 3.3v\npp3v3_s0 3.4v\npp3v3_s5 3.4v\npp1v35_s3rs0 1.4v\npp5v_s0 5v\npp5v_s3 5v\nsmc_cpupkg_vsense 1.9v\n*****pm_1v5_pgd_l 0v ****** not sure if reading this correctly all_sys_pwrgd 3.4v\ndelay_1v5s0_pgd 3.4 **** shouldn't this be 1.5v here at r8137\npp1v35_s3rs0_cpu_ddr 1.4v\n\ni don't know where to go from here. Would really appreciate some guidance please. \n\nThanks a lot. I'm guessing I'm looking for a reason why the CPU isn't turning on but I can't find one."}
{"post_id":23960,"thread_id":23935,"title":"820-00163 no chime","user_id":2,"username":"dukefawks","post_date":"2017-08-08 21:41:11","message":"USB mouse lighting up? Why was the LCD replaced?"}
{"post_id":23967,"thread_id":23935,"title":"820-00163 no chime","user_id":170,"username":"rob777","post_date":"2017-08-08 21:59:32","message":"Yes a mouse lights up, always wondered what that suggests as I've seen you ask that a few times before. \nLcd was smashed"}
{"post_id":24013,"thread_id":23935,"title":"820-00163 no chime","user_id":2,"username":"dukefawks","post_date":"2017-08-09 21:15:03","message":"USB mouse indicates USB initializes. It does depends on the mouse though. Try if a PRAM reset works from an external keyboard and see if caps lock key works.\n\nI do suspect that this board will have failed due to the drop a year ago. Ripped trace under some BGA is a very real possibility."}
