{"post_id":60969,"thread_id":59493,"title":"Macbook Air 2018\/2019 Trackpad and Audio Board question","user_id":24780,"username":"bradinboise","post_date":"2020-06-13 12:43:59","message":"Hello all, is there any schematics out there for sale for just the track pads and audio boards? I have the schematic for the main logic board but do not see anything in that schematic that shows the components on the trackpad and audio board. Also as a side note, this is my first attempt to repair these units. I know that each keyboard key is individually lit up with its own LED, but I can't see where the power comes from to turn on the keyboard backlights. I think it comes from the trackpad but cannot confirm. Both of my units do not have any LED lights on the keyboard and the main logic board works correctly except for the keyboard lights. And as far as the audio board, only the left speaker works but with headphones plugged in, both sides of the headphones work fine. I tried the audio board in another unit and same thing, only the left speaker works. Thanks"}
{"post_id":60971,"thread_id":59493,"title":"Macbook Air 2018\/2019 Trackpad and Audio Board question","user_id":682,"username":"2informaticos","post_date":"2020-06-13 12:53:48","message":"Nothing available :(\n\nYou probably have bad audio connector, or some small coils broken, if exist in that board.\n\nThe keyboard has its electronic circuitry embbeded in the new models.\nYou should change it directly."}
{"post_id":60976,"thread_id":59493,"title":"Macbook Air 2018\/2019 Trackpad and Audio Board question","user_id":24780,"username":"bradinboise","post_date":"2020-06-13 13:46:03","message":"Thanks for the fast response. On this model for the no keyboard back light I also noticed and have seen some other random reports that in the keyboard settings, there is nothing about changing the back light on the keyboard for low light?? It is totally missing. Like the OS doesn't see the keyboard backlight?? I reset the smc\/T2 and VRAM and still is missing in the keyboard settings. Do you think the OS is corrupt? It is running the latest Catalina OS. Thanks"}
{"post_id":60984,"thread_id":59493,"title":"Macbook Air 2018\/2019 Trackpad and Audio Board question","user_id":682,"username":"2informaticos","post_date":"2020-06-13 17:40:22","message":"Strange to be software issue, but easy to test; just boot known good macOS from USB..."}
{"post_id":61317,"thread_id":59493,"title":"Macbook Air 2018\/2019 Trackpad and Audio Board question","user_id":24780,"username":"bradinboise","post_date":"2020-06-22 23:29:24","message":"Fixed one issue, replaced audio board with another known good board and both speakers in the chassis are working. Also the microphone did not work either with the other board, forgot to mention that earlier. However, on the no keyboard backlight issue, I still cannot figure it out. I took the good logic board out of the one macbook air A1932 2018, and stuck it into another 2018 A1932 and no keyboard backlight. I tried another known good trackpad and cable, and still no backlight. So I tried loading OS with USB dongle and still no backlight. In each case when you tap F5 or F6 the little keyboard icon on the screen does not show up. Tried reinstalling the OS again from scratch, still no icon on screen and no backlight! I'm up for any suggestions. I guess I might have 2 bad keyboards, just weird I guess. Thanks"}
{"post_id":61318,"thread_id":59493,"title":"Macbook Air 2018\/2019 Trackpad and Audio Board question","user_id":24780,"username":"bradinboise","post_date":"2020-06-23 00:33:06","message":"Forgot to add something else with this unit I noticed, I can never get the little LED light to light up on the logic board D6959. I get 3.0v at point \"A\" with battery plugged in and the charger plugged in. If I use my DVOM in diode test mode it will light only in one direction with the probes. So I would think the LED is working. I checked both resistors R6955 and R6959 both are good. Again I don't know if this is relevant to my no keyboard backlight issue, but I thought I would throw that in just in case. Thanks"}
{"post_id":61327,"thread_id":59493,"title":"Macbook Air 2018\/2019 Trackpad and Audio Board question","user_id":7922,"username":"tcampbell34","post_date":"2020-06-23 08:31:49","message":"I had the same exact issue you are describing with no keyboard backlight on a 2018 A1990 Macbook Pro. Checkout my post. [URL]https:\/\/boards.rossmanngroup.com\/threads\/820-01041-no-power.57810\/#post-58009[\/URL]\n\nThe only way I was able to get it to come back was installing Mojave 10.14.0 on it from a USB drive. After that, the keyboard backlight came back, but if I tried to upgrade the OS to Mojave 10.14.6 or to Catalina, the keyboard backlight would disappear again. So in order to keep keyboard backlight working, I had to leave it on 10.14.0. Unfortunately, I was not able to figure out anyway around this."}
{"post_id":61393,"thread_id":59493,"title":"Macbook Air 2018\/2019 Trackpad and Audio Board question","user_id":24780,"username":"bradinboise","post_date":"2020-06-24 20:17:44","message":"Thanks for the help. Can you give me the place on the web that had that version available. I double checked the Apple site and could not find Mojave 10.14.0\n\n\nThanks"}
{"post_id":61400,"thread_id":59493,"title":"Macbook Air 2018\/2019 Trackpad and Audio Board question","user_id":7922,"username":"tcampbell34","post_date":"2020-06-24 23:35:31","message":"I don't remember the website I found it on but I remember it was difficult to find. I still have the file I used so try this one.\n[URL]https:\/\/drive.google.com\/file\/d\/1VAgT0mTNdpVNtaLRqRPdOdNEOrJXf3fK\/view?usp=sharing[\/URL]\n\nIf you get and error that the installer is damaged, its because you have to change the system date to trick it into thinking 10.14.0 is the latest version of MacOS. Disconnect from wifi and run the command below in terminal to change the system date and then try the installer again and it should work fine.\ndate -u 1001040018"}
{"post_id":61493,"thread_id":59493,"title":"Macbook Air 2018\/2019 Trackpad and Audio Board question","user_id":24780,"username":"bradinboise","post_date":"2020-06-26 16:30:25","message":"Thanks for your help, but still no keyboard backlight. I did not mention earlier that on this unit I replaced a cracked LCD with another from Ebay. I did not think the LCD would have anything to do with the keyboard backlight. But after reading some other blogs the past few days, there is a direct correlation with a replaced LCD and keyboard backlight, the True Tone, automatic brightness, etc. A few bloggers are saying with the T2 chip in these that the screens are paired to the keyboard and logic board!! What?? One person said the only way that apple fixed his keyboard backlight issue was that apple replaced all 3, keyboard-logic board-LCD screen even though there was not anything wrong physically with the LCD. Some are saying that putting a 2019 LCD on a 2018 MacBook Air will cause the keyboard backlight not to work. So I'm also missing the automatic brightness after looking for it. Seems to be also related to the absent light sensor in the LCD. I do not see anything in the schematic relating to the ambient light sensor unless it is all on communication lines at the LCD connector. Does anybody out there know how to test the ambient light sensor? I'm not sure where else to go to figure this out right now other than trying to test\/repair the ambient light sensor. Thanks"}
{"post_id":61497,"thread_id":59493,"title":"Macbook Air 2018\/2019 Trackpad and Audio Board question","user_id":2,"username":"dukefawks","post_date":"2020-06-26 18:01:48","message":"Keyboard backlight does not work when the Ambient light sensor is not working. You might have an LCD with bad ALS....\n\nBut if your MIC is also not working then it could be related to the T2 chip as it controls both of them. Do a full clean install, that means wiping the whole SSD, in Disk Utility select under \"view\" show all devices. Then erase the SSD as an APFS volume. Just booting from USB will not solve anything as the T2 chip can only boot from internal SSD\nThe T2 chip has it's own little partition and boots a separate version of iOS."}
{"post_id":61499,"thread_id":59493,"title":"Macbook Air 2018\/2019 Trackpad and Audio Board question","user_id":24780,"username":"bradinboise","post_date":"2020-06-26 20:20:08","message":"Thanks! Yea I found out about that booting from the usb thing. What a joke! Anyway as far as the microphone that was repaired when I replaced the audio board. The keyboard back light is the last issue I'm dealing with. I found out that the LCD assembly I purchased from Ebay to fix my cracked LCD, was NOT a late 2018 model, it was from a TrueTone 2019 model. I was reading that these are different LCD internally from the 2018 models and has a different Apple part number for the same color. Is that your experience?"}
{"post_id":61502,"thread_id":59493,"title":"Macbook Air 2018\/2019 Trackpad and Audio Board question","user_id":24780,"username":"bradinboise","post_date":"2020-06-27 00:14:33","message":"Can someone that has access to a late 2018 MacBook Air use the string below in the terminal window and let me know what part number comes up please.\n\nioreg -lw0 | grep IODisplayEDID | sed \"\/[^<]*<\/s\/\/\/\" | xxd -p -r | strings -6\n\nI'm trying to see if there is a way of telling the difference between the two LCD's\n\nAnd if anybody has other strings to use to find part numbers for like the ambient light sensor or other parts that would be great.\n\nAnd by the way dudefawks thanks for your suggestion on the erasing the ssd. I tried that and it did not work.\n\nThanks"}
