{"post_id":60987,"thread_id":59494,"title":"820-2936 not charging","user_id":2508,"username":"No-Clean","post_date":"2020-06-13 22:02:06","message":"On other posts I see that each time the not charging comes up many ask to measure resistance between pins 17\/18 and 27\/28 of U7000, can someone please explain how to troubleshoot charging issues in this older boards please.\n\nI have made notes for several issues like SMC problems, backlight etc. and each time I get a board with such problems I just visit my notes and get those boards out pretty fast, but when it comes to charging issues I seem to spend a lot of time since I still don't have a clear understanding about it, if anyone has a step by step or a basic guide that will be greatly appreciated.\n\nFor now on this board:\n\nResistance between pins 17\/18 and 27\/28 of U7000 is 0.556mohms and 20ohms\nPPbus is 12.29v"}
{"post_id":60993,"thread_id":59494,"title":"820-2936 not charging","user_id":682,"username":"2informaticos","post_date":"2020-06-14 04:23:28","message":"\"Resistance between pins 17\/18 ... 0.556mohms\"\nI doubt you can really measure 556 microhm (which means 0.556 miliohm).\nHowever 0.5 ohm is also strange; you should get 2 ohm aprox there.\n\n\"PPbus is 12.29v\"\nThat's the reason battery is not charging; bad communication on battery bus.\nCheck voltage and diode mode on SCL\/SDA lines.\nSometime is a problem with BIL (J6955), or D6950.\n\nKeep in mind, forum goal is to help in the repair process.\nFor training courses, contact Rossmann staff..."}
{"post_id":61007,"thread_id":59494,"title":"820-2936 not charging","user_id":2508,"username":"No-Clean","post_date":"2020-06-14 14:13:57","message":"Thanks, I contacted LR a while back and they were not offering training any longer and with flying restrictions in my country it looks like it wont be till next year that I get a chance to travel again.\n\nlooks like online training is my only choice, I need to find a good teacher ;) willing to train me via skype or some other medium.\n\nYour guidance led me to have a look at J6955 and there I found out that R5280 was knocked-out by the customer trying to replace the battery himself, fixed that and done!"}
