[
    {
        "post_id":30619,
        "thread_id":30619,
        "title":"820 2915 what do you think ?",
        "user_id":441,
        "username":"aurel476",
        "post_date":"2018-01-20 05:27:29",
        "message":"[URL]https:\/\/www.youtube.com\/watch?v=twHCu36--I8[\/URL]\n\nprobably fake, solder wires around mux area + extraction gpu"
    },
    {
        "post_id":30621,
        "thread_id":30619,
        "title":"820 2915 what do you think ?",
        "user_id":441,
        "username":"aurel476",
        "post_date":"2018-01-20 09:42:56",
        "message":"No Title"
    },
    {
        "post_id":30625,
        "thread_id":30619,
        "title":"820 2915 what do you think ?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-01-20 11:58:51",
        "message":"Possible, but you would need to run at least 6 wires around the MUX to bypass all the LVDS channels. Also EDID data lines are MUXED and the backlight control in done by the MUX. I'm not going to waste time to see if this will work or not. \nThe real solution would be a BIOS\/SMC mod as that is where everything is controlled on a hardware level."
    },
    {
        "post_id":30627,
        "thread_id":30619,
        "title":"820 2915 what do you think ?",
        "user_id":441,
        "username":"aurel476",
        "post_date":"2018-01-20 14:00:44",
        "message":"please show me where put solder wires i will try"
    },
    {
        "post_id":30630,
        "thread_id":30619,
        "title":"820 2915 what do you think ?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-01-20 14:32:08",
        "message":"Look at diagram and see where LVDS comes from the PCH and should go to the LCD. But no need to solder them as the first thing you should get to work is EDID and backlight. Look how EDID is MUXed, I already tried to tie it so that on boot EDID went to the PCH but there was no backlight. The default of booting on GPU needs to be changed and the only way to do that is a hack that does not work after a PRAM reset."
    },
    {
        "post_id":30631,
        "thread_id":30619,
        "title":"820 2915 what do you think ?",
        "user_id":289,
        "username":"smiba",
        "post_date":"2018-01-20 16:46:50",
        "message":"The obvious details like serial number on the board and on the machine eventually booting match so I'm honestly thinking they may have succeeded.\n\nIts more then the two wires in your post though, you see the video is cut and they suddenly have a bunch of wires running around the MUX as well. Who knows what else they've changed what we can't see.\n\nI don't believe the device will work 100% with just a few wires though (for example I don't think connecting a monitor will work anymore), as the programming of the SMC and\/or BIOS still assumes its running with a dGPU in mind. But I never looked into it so who knows."
    },
    {
        "post_id":30634,
        "thread_id":30619,
        "title":"820 2915 what do you think ?",
        "user_id":441,
        "username":"aurel476",
        "post_date":"2018-01-21 12:39:38",
        "message":"thanks, i will try ;)"
    },
    {
        "post_id":30635,
        "thread_id":30619,
        "title":"820 2915 what do you think ?",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-01-21 16:28:53",
        "message":"You should run 8 pairs for LVDS A and B channel, data and clock (16 wires).\nTwo more wires for EDID (LVDS_DDC lines), bypassing any issue with U9270 (if required).\nI personally forced PEX_CLKREQ_L to 0V, didn't help (R8795 removed).\nI also forced GPU_RESET_R_L to 0V (R8000 removed), didn't help.\nI moved R9645 to R9646 (changing GMUX_CFG0), no way...\nI didn't see any way to force down PEG_CLKREQ_L without damaging board, or removing GMUX.\nRemove GMUX is not an option, as it controls backlight based on LPC signals from SMC...\nSo needs to run at least 18 wires and maybe still needs to change some rsistors position.\nI will probably try it one day, not so soon...\nAs Duke said, modded BIOS\/SMC should do the trick, but who can mod it?"
    },
    {
        "post_id":30636,
        "thread_id":30619,
        "title":"820 2915 what do you think ?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-01-21 16:37:36",
        "message":"The real solution will be in BIOS. The MBP13 2011 has the exact same BIOS. I bet the BIOS looks at the SMC to decide how to boot up the system and do the MUX stuff and GPU stuff. For anyone with access the the BIOS source files this mod would not be that difficult, but to reverse engineer all this is pretty hopeless. The solutions that are out there right now are hacks and will not survive a PRAM reset and who knows about future software updates. The only way to make this work is to make the hard\/software think it is actually a 13\" MBP. Swapping a 2936 SMC on the board may actually give some result, but there will then be fan issues and possible sensor issues."
    }
]