[
    {
        "post_id":56145,
        "thread_id":56145,
        "title":"820-00239 Macbook Pro Touchbar Repair",
        "user_id":21923,
        "username":"mon2",
        "post_date":"2020-01-23 14:03:00",
        "message":"Hi. Been at this Macbook Pro repair for a while. The unit just decided to not power up one day so it was brought in to us for repair. Tested with a Type C PD tester and an external power supply which originally dialed up 20V contract but the current draw was very low (close to 0 mA). After reviewing, the ISL9239 (U7000) was removed; pads cleaned; found a few bad tantalums that were shorted downstream and they have been now replaced. As the ISL9239 is a bear to solder on without the Amtech flux which we currently do not have nor a microscope, wish to ask a few questions before proceeding further:\n\n1) Is the ISL9239 required to be present to allow for the 20V power delivery contract to be enabled?\n\n2) In tracing the schematic, see that the EN (PM_EN_P3V3_G3H) of the Maxim 3v3 LDO (U6903) originates from ISL9239 (U7000). However, what if U7000 is not stuffed and U6903 is manually enabled. Then should the external 20V power delivery contract be negotiated?\n\nAs far as we can tell, the ISL9239 (U7000) is the battery charger but also enables the Maxim 3v3 LDO (U6903) but not sure if the OS boot code will ping the (missing) U7000 Buck (boost?) regulator and quit if the I2C coms time out due to retries so thought to ask here...\n\nThe dual diode @ D6902 was damaged and has been replaced.\n\nAt this time, only +5v0 from the outside power supply is fed into the board but is also at a low current draw (a few mA).\n\nThanks for any feedback you can supply."
    },
    {
        "post_id":56151,
        "thread_id":56145,
        "title":"820-00239 Macbook Pro Touchbar Repair",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-01-23 17:29:32",
        "message":"You cannot get correct PPBUS_G3H without U7000; it controls the buck\/boost MOSFETs.\nNo reason to force 3V3_G3H before replacing U7000.\nU7000 also controls SMC reset signal..."
    },
    {
        "post_id":56258,
        "thread_id":56145,
        "title":"820-00239 Macbook Pro Touchbar Repair",
        "user_id":21923,
        "username":"mon2",
        "post_date":"2020-01-28 08:13:10",
        "message":"Thanks @[URL=\"https:\/\/boards.rossmanngroup.com\/member\/682-2informaticos\"]2informaticos[\/URL] for your prompt comments. Will work on the replacement of U7000 today.\n\nA few more questions:\n\n1) Can you comment on F7000? Is that a one-time fuse or a polymer (resettable) fuse? The original is in tact but wish to know if it can be replaced and with which part number (if known)?\n\n2) What are the resistor values for R7015 (0201 schematic states 750K) & R7016 (0201 schematic states 255K) but reading (without U7000 installed) on 2 different ohm meters:\n\nR7015 = 189K \/ 192k\nR7016 = 186K \/ 190k\n\nfor this resistor voltage divider. Fairly confident these resistors are the factory originals. Can order in some 750k \/ 255k to replace. This resistor voltage divider is to lower the voltage to a safe value for the DC\/DC U7000 to detect the presence of an external voltage rail but wish to validate the resistor values that should be present."
    },
    {
        "post_id":56261,
        "thread_id":56145,
        "title":"820-00239 Macbook Pro Touchbar Repair",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-01-28 10:26:00",
        "message":"Onboard measured values are not exact for high ohm resistors.\nYou should remove R7015 to get correct value for R7016 onboard; measuring R7015 out of board then.\nI don't recommend you to bother with that divider; unless you note some corrosion on its area.\n\nF7000 is a normal fuse.\nI always replace the fuses with enamelled\/magnet wire; choosing its diameter accordingly with the expected current."
    },
    {
        "post_id":56263,
        "thread_id":56145,
        "title":"820-00239 Macbook Pro Touchbar Repair",
        "user_id":21923,
        "username":"mon2",
        "post_date":"2020-01-28 10:57:40",
        "message":"Thank you again! Was concerned about the \"off value\" for this area and did exactly as you suggested, removed the high side resistor and it indeed does measure around 750K (as per the schematic) and the south side as per the schematic. The in-circuit value was throwing off the reading. Sorry for this error on judgement.\n\nNot required yet but will see if I can source a drop in replacement from Mouser \/ Digikey \/ Arrow.\n\nNext on this hit list is to replace U7000 which will be fun. Thanks again for your assistance."
    },
    {
        "post_id":56320,
        "thread_id":56145,
        "title":"820-00239 Macbook Pro Touchbar Repair",
        "user_id":21923,
        "username":"mon2",
        "post_date":"2020-01-30 09:50:36",
        "message":"Hi. This nightmare continues...\n\n1) replaced U7000 - oh what fun this was\n\n2) replaced D6902 BAT30CW dual diode as +5v0 was not passing through from anode to cathode. After replacement, Pin 3 (cathode) on diode = +5v0.\n\n3) External USB meter shows 5v0 @ 0 Amp like the other thread on this forum for the same motherboard.\n\nU6903_10 (Enable from U7000) = 0.91 volts\nU6903_2 (SUP) = 4.8 \/ 4.9 volts\n\nPPV3V3_G3H = 3.4 volts\n\nF7000 (fuse) @ 0.05 volts\n\nAny suggestions on what to test \/ replace next to restore this motherboard for the proper power rails?\n\nOriginally brought in for no power on display although USB Type C would cycle to 20v but at 0A. Found some bad caps (tantalums) the hard way and they have been replaced. U7000 was damaged in the process but has been replaced again today.\n\nSo far testing only one side of the Type C breakout dual port.\n\nWhy would the current draw remain @ 0A?\n\nThanks again."
    },
    {
        "post_id":56322,
        "thread_id":56145,
        "title":"820-00239 Macbook Pro Touchbar Repair",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-01-30 12:22:44",
        "message":"Strange to get 3V3_G3H with 0.9V at enabe pin of U6903.\nU7000 sends usually 5V there.\nAre you sure about these values?\n\nDo you get SMC_RESET_L and BUF_SMC_RESET_L?"
    },
    {
        "post_id":56347,
        "thread_id":56145,
        "title":"820-00239 Macbook Pro Touchbar Repair",
        "user_id":21923,
        "username":"mon2",
        "post_date":"2020-01-31 08:43:40",
        "message":"Hi.\n\n1) after more reflow of U7000, now 3v3_G3H is @ 3v42 with enable pin @ 5v0 (fed by U7000).\n\n2) the above is good but now the power is cycling every 3-5 seconds  on this power rail (ON\/OFF). The external Type C in-line meter goes black and then power cycles again. Believe that we are drawing too much current? Although the meter is reading as 0 mA on the 5v0 rail that is the default voltage out of our external Type C power adapter.\n\nAny suggestion on what to test next? Would love to be at least at the repair level of allowing this board to select the 20V PD contract. This motherboard may also have been nuked by the flexgate issue (just read that in another post here) - the fun never ends as long as we are buying..."
    },
    {
        "post_id":56352,
        "thread_id":56145,
        "title":"820-00239 Macbook Pro Touchbar Repair",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-01-31 10:16:58",
        "message":"Check for short, or low value in diode mode at all power rails; don't forget all big coils and page 78, Power FETs.\n\nCompare all diode mode readings of the CD3215 chips.\nAll USB-C ports have the same behaviour?"
    },
    {
        "post_id":56355,
        "thread_id":56145,
        "title":"820-00239 Macbook Pro Touchbar Repair",
        "user_id":21923,
        "username":"mon2",
        "post_date":"2020-01-31 13:33:25",
        "message":"Thanks.\n\nRemoved the current sense resistor R7020 (0.01 ohms) and the main 5v0 rail from the external adapter holds without shutting down. Also, the current draw is no longer zero but around 11 mA.\n\nIn checking the diode mode method (first time testing this way) - found that C10G1 is being shorted to ground. Removed this 220uf - no change and still showing shorted to ground.\n\nRemoved C1164 - which is also showing a short to ground - no difference.\n\nAny suggestions on what to test next? The removed caps appear to be fine out of circuit. Man there is some heavy ground plane in this region.\n\nCould remove more caps with hopes to finding a shorted cap or more.\n\nCould one of the SIC635 mosfets (in this same area) be sick? Pun intended. Will try to trace in the schematic as to what the SIC635 mosfets are responsible for in the design.\n\nThanks again for your advice.\n\nUpdate:\n\nRemoved L7210 off one leg since it was the easiest part to remove.\n\nThe open side of the inductor (mates with the U7210) shows a short to ground.\n\nThe cap side (C10G1; PPVCC_S0_CPU) is still showing a short to ground (with C10G1 removed).\n\nIs this a bad omen? Could the CPU itself be bad?\n\nWait...L7220 is still in the circuit. So this IOT green design (32A capable so CR2032 friendly??) is using 2 DC-DC buck regulators to power this rail. Let me at this L7220 and will report back...\n\nBoth L7210 & L7220 are moved from motherboard, still the PPVCC_S0_CPU rail is being shorted to ground.\n\nSo it could be due to one of the many caps on this rail (sheet 10 of the schematic)?\n\nTime to start drinking...\n\nWould a thermal camera help to show which cap is causing this short? Given that the power supply rail (5v0) cycles every few seconds, would the thermal camera even show the bad boy cap? Read that the offshore thermal camera (QIANLI) is one of the FLIR sensors in a box so the phone camera version (by FLIR) could work as well?\n\nDepressing :("
    },
    {
        "post_id":56364,
        "thread_id":56145,
        "title":"820-00239 Macbook Pro Touchbar Repair",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-01-31 18:04:32",
        "message":"L7210\/20 are both on CPU VCORE.\nThere could be very low value as normal; compare with another board."
    },
    {
        "post_id":56441,
        "thread_id":56145,
        "title":"820-00239 Macbook Pro Touchbar Repair",
        "user_id":21923,
        "username":"mon2",
        "post_date":"2020-02-04 14:30:07",
        "message":"Hi. Removed fuse F7000 and appear to have the 5v0 to be stable (no more power cycling); PP3V3_G3H @ 2.94 volts and is steady (no power cycling).\n\nPPDCIN_G3H_CHGR @ 5.2 volts\n\nHowever, concerned about the following 2 voltages:\n\nTBA_CSI_P @ 2.8 volts\n\nTBA_CSI_N @ 2.4 volts\n\nGiven that PPDCIN_G3H_CHGR @ 5.2 volts, should TBA_CSI_P & TBA_CSI_N not also be around 5 volts? Perhaps I have not soldered the current sense resistor R7020 properly?\n\nUnfortunately do not have a known-good-board so cannot compare notes. Is there a document that offers the diode mode readings for this motherboard? Even a paid service that has such readings?\n\nQ: Do you offer service for repairing this motherboard? Can you send a PM on rates and where to send if you offer this service?"
    },
    {
        "post_id":56444,
        "thread_id":56145,
        "title":"820-00239 Macbook Pro Touchbar Repair",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-02-04 17:25:19",
        "message":"CSI_P\/N must have practically same voltage.\n100mV difference will mean 10A current flows through R7020!!!\nSupposing R7020\/21\/22 have correct values.\n\n\n\"PP3V3_G3H @ 2.94 volts\"\nNo good, if you measured at pin 2\/L6900.\n\nWhat about I asked in previous post?\n\n\nBTW, you can send PM if want..."
    },
    {
        "post_id":56453,
        "thread_id":56145,
        "title":"820-00239 Macbook Pro Touchbar Repair",
        "user_id":21923,
        "username":"mon2",
        "post_date":"2020-02-05 08:05:18",
        "message":"Hi. Your quota for the PM has been exceeded :) I can see why :)\n\nCould you send us an email and we can reply with more details?\n\nsupport   softio  com"
    }
]