[
    {
        "post_id":16019,
        "thread_id":16019,
        "title":"820-2915 - Q7030 burning??",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-03-06 14:18:14",
        "message":"Hey everyone,\n\nNot sure if this is expected behaviour.\n\nI replaced the ISL6259 (U7000) chip because PPBUS_G3H was <5V. I measured all resistors related and they came back fine.\n\nAfter replacing ISL6259 the system had a fan spin and I placed it back into the system for testing, but to my surprised the flux that I hadn't cleaned started smoking right where Q7030 is at!\nThe system keeps running without issues and PPBUS_G3H and PPDCIN is stable at their expected voltages, but I don't think Q7030 is supposed to get this hot, or is it?\n\nJust gotta be sure before I give it back and it burns a house down ;)\n\nThanks!"
    },
    {
        "post_id":16025,
        "thread_id":16019,
        "title":"820-2915 - Q7030 burning??",
        "user_id":726,
        "username":"jason_microsoldering",
        "post_date":"2017-03-06 14:26:38",
        "message":"Dead ISL6259 buck killed switching mosfets. Compare resistance to ground on PPBUS_G3H with known good and make sure that it isn't partially short, then if it's ok replace Q7030 and Q7035 for good measure."
    },
    {
        "post_id":16030,
        "thread_id":16019,
        "title":"820-2915 - Q7030 burning??",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-03-06 15:08:47",
        "message":"No (semi-)short on PPBUS_G3H, will replace Q7030 and Q7035.\n\nThanks!"
    },
    {
        "post_id":17556,
        "thread_id":16019,
        "title":"820-2915 - Q7030 burning??",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-03-30 05:02:41",
        "message":"3 weeks ago, wow!\n\nAnyways the flux around Q7030 is still smoking away.\n\nI gotta wonder if its normal for those mosfets to get this hot? I mean the system is running alright and boots into the system\n\nCould it be a broken replacement ISL6259?"
    },
    {
        "post_id":17593,
        "thread_id":16019,
        "title":"820-2915 - Q7030 burning??",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-03-30 14:33:11",
        "message":"Not normal, bad ISL or bad soldering. Check diode mode at the gate of Q7030 to see if there is actually a connection to the ISL."
    },
    {
        "post_id":17708,
        "thread_id":16019,
        "title":"820-2915 - Q7030 burning??",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-04-02 12:28:09",
        "message":"With errors like this you always hope it isnt your soldering, this is one of those cases where it indeed was my soldering.\n\nThe traces had continuity across them and the connections looked good, however giving a good sweep with some solder across them fixed the issue.\n\nThanks for your time, my bad!"
    }
]