{"post_id":14579,"thread_id":14579,"title":"[SOLVED]2014 13\" Retina sees battery won't charge","user_id":61,"username":"wrbailey","post_date":"2017-02-09 12:31:41","message":"2014 13\" retina. \n\nSees battery. Says not charging. Has the lightening icon on the tool bar. Shows cycles (66) and total capacity of battery. Says 0 capacity left. \"Battery Not Charging\" and says \"Replace Battery Now\"\n\nis this a battery issue? Or could this possibly be a board repair? I've never run into this issue before and not sure if it falls under Louis' normal battery issue videos... definite liquid exposure all over board, in many places. However boots and runs just fine except for the battery...\n\nany ideas or wisdom appreciated.\n\nthanks!"}
{"post_id":14580,"thread_id":14579,"title":"[SOLVED]2014 13\" Retina sees battery won't charge","user_id":36,"username":"aprendiz","post_date":"2017-02-09 13:01:43","message":"\"Replace Battery Now\" lol :)"}
{"post_id":14581,"thread_id":14579,"title":"[SOLVED]2014 13\" Retina sees battery won't charge","user_id":61,"username":"wrbailey","post_date":"2017-02-09 13:19:12","message":"So are you saying the liquid killed the battery? I know the retina model have exposed battery \"boards\" so I'm not saying it couldn't be a bad battery. I don't have spare retina batteries or spare top case assemblies with batteries. I wouldn't want to possibly destroy a good battery when removing it, if it isn't at fault. Was thinking the communication or possibly current sensing issues could cause the computer to refuse to charge the battery. I have had batteries in A1278 go from \"service soon\" to stating they're fine \"normal\" after board repairs."}
{"post_id":14583,"thread_id":14579,"title":"[SOLVED]2014 13\" Retina sees battery won't charge","user_id":316,"username":"G.Beard","post_date":"2017-02-09 14:34:32","message":"[QUOTE=\"wrbailey, post: 14581\"]So are you saying the liquid killed the battery? I know the retina model have exposed battery \"boards\" so I'm not saying it couldn't be a bad battery. I don't have spare retina batteries or spare top case assemblies with batteries. I wouldn't want to possibly destroy a good battery when removing it, if it isn't at fault. Was thinking the communication or possibly current sensing issues could cause the computer to refuse to charge the battery. I have had batteries in A1278 go from \"service soon\" to stating they're fine \"normal\" after board repairs.[\/QUOTE]\n\nIf the liquid hit a place to cause over current and the battery chip detected it then yes. Or if it killed then FETS yes. Or if it broke the little internal thermal cut-offl fuse type things inside the IC that connect the pins to the die then yes.\n\nWhy remove the battery to test a new one?...  Rest the new battery on top and plug it in\n\nI used to use lighter fluid to soften the adhesive before going at it with the painting knife... Only once have I fucked it up and ran around the room with a MacBook fire ball battery time bomb about to explode :)"}
{"post_id":14584,"thread_id":14579,"title":"[SOLVED]2014 13\" Retina sees battery won't charge","user_id":61,"username":"wrbailey","post_date":"2017-02-09 15:14:25","message":"Guess I'll order some spare retina batteries. But like I said I don't have any at the moment, which is why I was trying to see if it could be the board and not the battery.\n\nThanks for the suggestion with the battery removal..."}
