[
    {
        "post_id":50576,
        "thread_id":50576,
        "title":"820-3332 Fails on ID0R only on battery",
        "user_id":1423,
        "username":"captainmac",
        "post_date":"2019-07-09 05:45:19",
        "message":"Been a while since i needed help, but here's one that's been bugging me for a couple of days.\n\n820-3332 that had some damage due to probably a knockoff charger, had to replace R6920,R6905,D6905 and basically carpetreplaced a lot of things around U6990.\nGot it back to life, works perfectly, only to notice in final testing that the fan would occasionally run high out of the blue (when machine is just sitting idling).\n\nRan ASD, and noticed that when i run the sensor-tests while connected to AC (Genuine 85W Magsafe 2), all sensors pass, however, running the same tests off of the battery, the ID0R sensor fails.\nIt's reading 4,080A with charger connected, and reading 0.000A when only on battery (it should read between 0.65 and 4.671A according to hardwareprofile in ASD)\n\nI've searched here and found a couple things i've already tried so far:\nReplaced R5441 and C5441 together,\nChecked continuity from R5441 pin 1 to U7000 pin 9: checks out.\nR5441 pin 1 reads 0,45V\nChecked currentsensing by the ISL and for the heck of it replaced the ISL twice.\nR7021\/22 check out and their traces to both  R7020 and ISL appear fine.\n\nJust finished replacing the SMC as a final check before asking here.. No difference.\n\nAny other ideas?\n\nThanks in advance!"
    },
    {
        "post_id":50578,
        "thread_id":50576,
        "title":"820-3332 Fails on ID0R only on battery",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-07-09 10:15:54",
        "message":"ID0R is not relevant on battery only.\nCHGR_AMON signal is about the current flowing from charger to the machine.\nObviously null in this case..."
    },
    {
        "post_id":50579,
        "thread_id":50576,
        "title":"820-3332 Fails on ID0R only on battery",
        "user_id":1423,
        "username":"captainmac",
        "post_date":"2019-07-09 10:33:06",
        "message":"FFS.. makes sense. \nso basically the EFI ASD is trolling me by giving this false error..? I?ve never seen the error pop up in other machines though.\ngoing to try and see what?s causing this thing to have an occasional high fan spin then. Fck me, I?ve been going over this for so long thinking that this is what?s causing the fans to ramp up.."
    },
    {
        "post_id":50580,
        "thread_id":50576,
        "title":"820-3332 Fails on ID0R only on battery",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-07-09 10:44:30",
        "message":"Run HWMonitor and see which sensor is high when the fans kick on. Probably the CPU or GPU which is normal it's a MacBook they are supposed to heat up"
    },
    {
        "post_id":50583,
        "thread_id":50576,
        "title":"820-3332 Fails on ID0R only on battery",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-07-09 11:07:42",
        "message":"Check if fan spins high only when GPU is enabled.\nHWMonitor should help you.\nBTW, 129 degrees indication on GPU is normal, when Intel graphics is used."
    },
    {
        "post_id":50586,
        "thread_id":50576,
        "title":"820-3332 Fails on ID0R only on battery",
        "user_id":1423,
        "username":"captainmac",
        "post_date":"2019-07-09 12:37:45",
        "message":"Alright thanks a lot both of you, will check tomorrow and report back here!"
    },
    {
        "post_id":50594,
        "thread_id":50576,
        "title":"820-3332 Fails on ID0R only on battery",
        "user_id":1423,
        "username":"captainmac",
        "post_date":"2019-07-10 05:04:41",
        "message":"Had it run for a couple of hours after reassembly today, and it hasnt done the sudden loud fan-spin anymore.. \nPasses ASD (besides the one error), runs pretty hot according to HWMonitor, under stress the CPU and GPU go up to about 106C, jesus, but ok, I'm calling this a fix and moving on to the next one! \n\nThanks both of you guys!"
    }
]