[
    {
        "post_id":25725,
        "thread_id":25725,
        "title":"820-2390 16.3 V PPBUS_G3H, Runs on AC, Doesn't Work With Battery",
        "user_id":868,
        "username":"computercaverva",
        "post_date":"2017-09-20 20:31:52",
        "message":"Older board that suffered the random no power issue. Replace the 330 tantalum capacitor, board came back to life. Fans would run on full speed, ran ASD and found High Voltage PBUS error and Palmrest Temperature Sensor error. After doing to some researching I disconnected the Wifi \/ Bluetooth cable from the board and the fans run normally. I will be looking into possible drains on the shared data line voltages for that one. \n\nWhere I'm a little lost is that PPBUS_G3H is 16.3V which is rather high. The computer runs when the battery is disconnected and the MagSafe is connected. The second a battery is connected there is no longer a green light and the Mac will not charge or run. The Mac will run however if there is no MagSafe connected but the battery is.\n\nI am getting 3.4V on the battery connector data lines. The schematic I have says that the BATT_CONN voltage should be 8.6V on one page and then says 12.6V. I am getting 8.3V so I do not know if this is within spec if it should be 8.6V or if its low and should be 12.6V.\n\nSorry for the saga here, also the board is dusty but no signs of liquid damage. There are red contacts \/ probe points in one area a No Stuff connector spot right next to the WiFi Bluetooth cable socket."
    },
    {
        "post_id":25750,
        "thread_id":25725,
        "title":"820-2390 16.3 V PPBUS_G3H, Runs on AC, Doesn't Work With Battery",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-09-21 16:48:29",
        "message":"PPBUS is way to high so probably shorted Q7030\/31 and U7000. Check resistance between pins 17\/18 27\/28 of U7000. PPBUS should be 8.4V on these boards."
    },
    {
        "post_id":25793,
        "thread_id":25725,
        "title":"820-2390 16.3 V PPBUS_G3H, Runs on AC, Doesn't Work With Battery",
        "user_id":868,
        "username":"computercaverva",
        "post_date":"2017-09-22 09:45:35",
        "message":"Duke spot on with the Q7030\/31 replaced both after making sure that the ISL voltages and resistances were good other than PPBUS. Board now recognizes and charges the battery, now onto the data lines! Does that seem like a valid place to look for the temperature sensor error?"
    },
    {
        "post_id":25805,
        "thread_id":25725,
        "title":"820-2390 16.3 V PPBUS_G3H, Runs on AC, Doesn't Work With Battery",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-09-22 12:49:41",
        "message":"Palmrest temp sensor would be a trackpad issue."
    }
]