{"post_id":79018,"thread_id":61594,"title":"820-01987 No Backlight","user_id":386,"username":"wirelessplanet","post_date":"2021-08-19 13:33:39","message":"I have a computer that came in water damaged, powers on with no backlight. Corroded area was around C8560, rest of the board is clean. R8452 was missing w\/ no pads & U8472 Hole in it. We jumped R8452 to R8453 & R8450. During the replacement of U8472, R8455 & R8481 may have been blown off. I could only find one resistor. Schematic does not say no stuff for either. Does anyone have a picture of that area of the board or does anyone know if both need to be on the board."}
{"post_id":79026,"thread_id":61594,"title":"820-01987 No Backlight","user_id":682,"username":"2informaticos","post_date":"2021-08-19 14:13:02","message":"\"We jumped R8452 to R8453 & R8450.\"\nConsult schematic, there is no contact between R8450\/53.\nRebuild the traces based on schematic.\nAll R8450-53 must be present.\n\nU8472 burnt with hole in, T2 could be damaged now.\n\nReplace all damaged components and be sure to get good traces."}
{"post_id":79028,"thread_id":61594,"title":"820-01987 No Backlight","user_id":386,"username":"wirelessplanet","post_date":"2021-08-19 14:26:56","message":"i checked the traces from the board and double checked with the schematic.  can you help me understand because i checked it and i thought it was connected.\n\nTopside of r8452 is connected to pp5v_g3s which is also connected to r8453\nbottom side of r8452 is connected to I2C_BKLT_SCL which is connected to r8450\n\nif you could explain where i went wrong i would appreciate it!"}
{"post_id":79029,"thread_id":61594,"title":"820-01987 No Backlight","user_id":682,"username":"2informaticos","post_date":"2021-08-19 14:38:27","message":"\"We jumped R8452 to R8453 & R8450\"\nThis sounds like you've put all 3 resistors in contact; there is no common point.\n\nIf you did it as explained in last post, is OK."}
{"post_id":79034,"thread_id":61594,"title":"820-01987 No Backlight","user_id":386,"username":"wirelessplanet","post_date":"2021-08-19 15:25:41","message":"okay, i put back R8455 and R8481 but i still don't have backlight.  can you help me rule everything else out before i have to replace t2?  the board is booting up and everything else is working exepct backlight.  wouldn't this mean t2 is sill good?"}
{"post_id":79039,"thread_id":61594,"title":"820-01987 No Backlight","user_id":682,"username":"2informaticos","post_date":"2021-08-19 16:09:12","message":"T2 works, but nobody can assure its backlight adjust output is still good; hope it is.\n\nDid you replace all, including U8472?\nPost its voltages.\nDo you get EDP_BKLT_EN?"}
