[
    {
        "post_id":21230,
        "thread_id":21230,
        "title":"820-2850 Green Light, No Power, Fluctuating PPBUS",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-06-02 15:47:20",
        "message":"I'm having a hard time with this particular board. It's an 820-2850 with no power:\n\n1. PPBUS_G3H bounces from 12.6v down to 0v, then back up. SMC_PM_G2_EN is also pulsing, as are my S5 rails.\n2. PP3v42_G3H stable at 3.42v. Green light solid.\n3. Resistance at U7000 (17\/18, 27\/28) is normal (~3ohm and ~20ohm). Pin 3 of U7000 solid (does not bounce\/fluctuate).\n4. No power from charger or battery, however, PPBUS does NOT pulse when a battery is connected only (i.e., with battery plugged in, ppbus stays steady), however, the board still will not power on with battery.\n5. I can't find a short anywhere; I've checked pp3v3_s5, pp5v_s5, pp3v3_s3, pp5v_s3, pp5v_s0, pp3v3_s0, pp1v05_s5, PPBUS, PP3v42, etc. Couldn't find a short anywhere that might be causing the board to cycle.\n6. SMC_RESET_L is stable at 3.4v, however, it drops to 3.3v for a split second every time the board cycles\/rails fluctuate.\n7. I replaced the SMC, but no change.\n8. I replaced U7000\/Q7030\/Q7035 simultaneously (pin 23 fluctuates, but pin 3 does not, so I thought maybe U7000\/Q7030\/Q7035 were having issues), but no change.\n9. R7020\/R7050 measure fine.\n\nReally at a loss on this one. I'm still leaning towards a short somewhere, but I don't know where else to check. Any help with what direction to go would be appreciated--thank you as always!"
    },
    {
        "post_id":21242,
        "thread_id":21230,
        "title":"820-2850 Green Light, No Power, Fluctuating PPBUS",
        "user_id":296,
        "username":"jadao",
        "post_date":"2017-06-03 02:21:39",
        "message":"Everything ok for ppdcin, Q7080\/Q7085 U7000 pin 2, D7005, R7005, R7000?\n\nQ7030-pin5 steady?\n\nMake sure R7012 measures ok and make sure also R7013 is no stuff."
    },
    {
        "post_id":21265,
        "thread_id":21230,
        "title":"820-2850 Green Light, No Power, Fluctuating PPBUS",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-06-04 03:09:58",
        "message":"Is S5_PWRGD coming high?"
    }
]