{"post_id":6462,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":416,"username":"brooke.j","post_date":"2016-09-07 17:26:15","message":"Hi,  I have been looking for a schematic for 802-00165-A and I'm not happy with the last place I bought from so can you suggest somewhere or is that not permitted here?  Here is what I know: Minor liquid damage board looks great. -Powers on with no backlight but works with external monitor.  -The backlight fuse is good (tested and open)  but I don't have a schematic to test the wled. - Does anyone know the pin voltages?  \n\nThanks"}
{"post_id":6463,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":416,"username":"brooke.j","post_date":"2016-09-07 17:53:53","message":"Ok now I have the board view and schematic.  So I think I'm on the right path.  I have another board here (same one) for parts and I'm hoping I can take the WLED driver off of it, if that is what the issue is.  Any suggestions or comments are greatly appreciated."}
{"post_id":6465,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":416,"username":"brooke.j","post_date":"2016-09-07 18:32:09","message":"and I see this awesome video by Louis [url]https:\/\/www.youtube.com\/watch?v=ijpyNGOz6as[\/url] that shows how to replace it but can someone tell me how exactly can I test it?"}
{"post_id":6466,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":2,"username":"dukefawks","post_date":"2016-09-07 18:35:40","message":"Start here and post some voltages.\n[url]https:\/\/www.rossmanngroup.com\/boards\/forum\/board-repair-troubleshooting\/1145-macbook-air-no-backlight-troubleshooting-guide[\/url]"}
{"post_id":6469,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":416,"username":"brooke.j","post_date":"2016-09-08 00:22:47","message":"Perfect,  New here so didn't know where to look.  Of course there is a sticky on the subject.  I'll start probing asap."}
{"post_id":6634,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":416,"username":"brooke.j","post_date":"2016-09-12 17:05:38","message":"Ok I just want to say that if you tell me once I won't make the same mistake again.  I measured the fuse by putting red probe on power coming into fuse and black on ground and blew the fuse.  Probably a noob mistake.  I'll replace the fuse and move on.  I have a basic understanding of measuring voltage and I\"m here to learn.  I'm probably stupid because for the life of me I can't google anything that says to test differently for voltage.  Also great sticky on voltages but where do I test for the 39v-49v, at the lvds connector right?  Total dumbass I know but thx for the help."}
{"post_id":6635,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":416,"username":"brooke.j","post_date":"2016-09-12 17:06:59","message":"Hi, don't know if you get notified of new posts so I just thought I'd ping ya."}
{"post_id":6636,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":416,"username":"brooke.j","post_date":"2016-09-12 17:25:51","message":"Ok so I blew a perfectly good fuse, no prob I've replaced those before. Without changing the fuse I notice that Pin 1 of the Backlight fuse Reads 8v. Should I be getting12.6v?"}
{"post_id":6637,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":416,"username":"brooke.j","post_date":"2016-09-12 17:32:53","message":"I'm an idiot.  For some reason I had my probes connected to my multimeter wrong. Gotta get some fluke full proof gear.  OK lesson learned."}
{"post_id":6641,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":2,"username":"dukefawks","post_date":"2016-09-12 17:51:01","message":"8.4V is normal in Air models."}
{"post_id":6642,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":416,"username":"brooke.j","post_date":"2016-09-12 17:54:47","message":"Awesome!  Ok back to probing.  Thx."}
{"post_id":6683,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":416,"username":"brooke.j","post_date":"2016-09-13 17:58:27","message":"Hi again, should I be testing the PP3V3 on the LCD connector to post voltages outlined in Louis' sticky post? Or or should I be testing PPHV_S0SW_LCDBKLT?  Where is the best place to test the backlight voltage?"}
{"post_id":6686,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":416,"username":"brooke.j","post_date":"2016-09-13 19:05:16","message":"[COLOR=#333333][FONT=Verdana][SIZE=13px]I tested at Q7707\nEDP_BKLT_EN = 0v\nBKLT_PLT_RST_L = 3.35v[\/SIZE][\/FONT][\/COLOR]"}
{"post_id":6687,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":416,"username":"brooke.j","post_date":"2016-09-13 19:12:31","message":"Hi guys. Can you tell me what component I need to test so that I can give you the voltage readings you asked for? I'm a little lost but not dumb so that's why I joined this forum in hopes of filling in the missing pieces. I'm really grateful to have any help you can spare.  Thank you"}
{"post_id":6693,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":1,"username":"larossmann","post_date":"2016-09-13 23:37:49","message":"Q7706 is a transistor that will let the power from the backlight fuse(PPBUS_G3H) through to the system during conditions that power should be let through to the system(system is on, not sleeping, etc). This transistor is a P channel MOSFET that will allow power to flow from the source(pin 4) to the drain(pin 1\/2\/5\/6) if the voltage on the gate(pin 3) is less than the voltage on the source(pin 4).\n\nSo look at how this is set up. R7788 takes the 8.5v from pin 4(source) and brings it to the gate(pin 3), so that the voltage on both pins is equal, which means it'll never open. Fuck. :( This is what R7789 & Q7707 are for. R7788 by itself just takes 8.5v from the source and puts it on the gate of the transistor. However, when R7789 is given a path to ground, R7788 and R7789 become a [I]voltage divider[\/I] that lowers the voltage on the middle point between them. R7789 will send some power to ground from R7788, which will lower the voltage at pin 3 of Q7706 to 3v, but only if pin 2 of R7789 is given a path to ground.\n\nSo we know in order for Q7706 to allow power through to the backlight circuit, its gate(3) has to be lower voltage than its source(4). This means that R7789 has to be given a path to ground. Q7707 sits between R7789 and ground, though! Q7707 is a set of two transistors, but these are a little different than Q7706. These are N channel mosfets. These will let power flow from source to drain when the voltage on the gate is around equal or higher than the voltage on the source.\n\nSo let's check the source here... source is ground, aka 0v. So anything on the gate at all should cause it to open. \n\nSo BKLT_PLT_RST_L is 3.3v, which is great, but EDP_BKLT_EN is 0v, which is bad.. this means it isn't going to open, which means R7789 doesn't get to send some of the 8.5v from pin 3(gate) of Q7706 to ground, which means Q7706 will never open. aka no backlight. \n\nNow, we have to think about what would cause this. EDP_BKLT_EN comes from the PCH\/CPU chip, U0500. Under what circumstances would the CPU say [I]\"hey don't make a backlight!\" [\/I]??\n\nMaybe if it thinks the computer is closed? \n\nSo now we have to figure out when it thinks the computer is closed. find SMC_LID and measure it. This should be 3.4v when the laptop is open, and 0v-0.5v when the laptop is closed. In practice, a voltage as low as 3.1v-3.2v can fuck with the backlight circuit in my experience. So measure SMC_LID, while the computer is on, and open, to confirm that the board thinks the machine is open for use.\n\nEDP_BKLT_EN could not be being created because of something like that. However, it could also be getting created, but be shorted to ground by something that is malfunctioning. A short circuit to ground means that some fucked up component or pathway is sending a signal to ground(the black hole for electricity for the purposes of our discussion where if it goes it will never to be seen again)\n\nCorrosion can also short EDP_BKLT_EN to ground as well. You have to find places where EDP_BKLT_EN has a path to ground. Q7707 is one of those places, the CPU is one of those places, R1430 is one of those places.. I'm not saying the latter two are at ALL common, but anything is possible.\n\nIn terms of making measurements, here's where we will just be hardasses and say you just have to figure out some of this shit on your own. We can point you in the right direction but as duke always says \"engaging brains\" is necessary here. In the sticky he linked you to there are literally colored lines and arrows pointing to specific points. I say you should measure voltage at backlight output, and when you look at the page, the last point is [I]PPHV_S0SW_LCDBKLT. [\/I]This also shows up on the LCD connector on pins 3\/4 and when you look at the LCD connector page, is the only logical signal that could have anything to do with backlight. You will have to be able to close these small gaps in logic on your own and be a detective in some ways or you'll be fucked, even with our advice. \n\nBest of luck!"}
{"post_id":6726,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":416,"username":"brooke.j","post_date":"2016-09-14 17:31:15","message":"HOLY SHIT!! Thank you so much for that!! You totally made it make sense now.  I was testing at the lcd connector on pin 3 (no voltage btw) and doing most of what is described but I just needed someone to put it all into context. I'm a very visual learner and the way you explained it made a great picture in my head now that I have been getting familiar with the schematics and .brd....I don't feel like a tool anymore.  WOW Thank you thank you thank you.  And please tell me to get my head out of my ass if I ask a stupid question and correct me or tell me I have my head up my ass because of X,Y, and Z.  One last thing. If I do need to replace the LP8550 is should I be getting 926-LP8550TLE\/NOPB or 926-LP8550TLX\/NOPB\n from mouser.com? OH I SEE THAT YOU CAN ORDER MIN 1 OR MINIMUM 3,000 IN RESPECT TO THE PART NUMBER (is that the only difference?)"}
{"post_id":7299,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":416,"username":"brooke.j","post_date":"2016-09-26 16:33:44","message":"Blah blah blah"}
{"post_id":7300,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":416,"username":"brooke.j","post_date":"2016-09-26 17:56:09","message":"Hi, again. I've taken this two weeks to really study and make sure I am able to diagnose in the correct way that will help the forum. (mostly you and Louis so far) to help me without talking to a total moron.  Check out my new posts. I hope I've narrowed it down to the Q7707.  Thx"}
{"post_id":7301,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":416,"username":"brooke.j","post_date":"2016-09-26 18:05:46","message":"OK I've been studying and I think I'm ready for some advice that won't be wasted on a total n00b!\nHere is what I did.  \n-I checked the SMC_LID  = 3.42v\n-I changed the WLED DRIVER (JUST TO SEE IF I COULD DO IT) I did it twice and didn't muck up any pads. I used this part from mouser.com: \n\n[COLOR=#000000][FONT=Verdana]926-LP8550TLE\/NOPB[\/FONT][\/COLOR]\n[COLOR=#000000][FONT=Verdana]MFG Part No:LP8550TLE\/NOPB[\/FONT][\/COLOR]\n[COLOR=#000000][FONT=Verdana]LP8550TLE\/NOPB[\/FONT][\/COLOR]\n[COLOR=#000000][FONT=Verdana]TI LED Lighting Drivers[\/FONT][\/COLOR]\n[COLOR=#000000][FONT=Verdana]US HTS:8542390000 ECCN:EAR99 COO:MY[\/FONT][\/COLOR]\n\nThe part went on great and I didn't burn it and I also saw it float around on top to make sure all balls were liquid.\n\nI was getting 3.4 on the third pin of LCD connector on and off. Which is weird. Then I decided to make sure that the LVDS connector was soldered well and had no corrosion.  After that I plugged in the display and it blew the backlight fuse.  \n-Replaced backlight fuse. Now no 3.4v on LCD connector.\n\nHere are my readings now.\n\nR7788  PIN  1 = 7.88V\n             PIN 2 = 7.66V\n\nR7789  PIN 1 = 7.66V\n             PIN 2 = 7.56V\n\n\n\nQ7707  PIN 3  = 7.58v  ( should it  be lower? )\n             PIN 2 (BKLT_PLT_RSTL) = 3.34v\n             PIN 5 (EDP_BKLT_EN) was giving me 3.4v and now is 0v after unplugging LCD connector.\n\nSo it looks like the voltage is getting lower from Q7707 but is it now low enough?  I know that there could be a short somewhere but if you think replacing Q7707 might be the right direction?\n\nThank you again for all your help.  I have put in mad hours to learn more and not have your time wasted."}
{"post_id":7302,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":36,"username":"aprendiz","post_date":"2016-09-26 18:31:46","message":"You have a bad display and\/or cable and now maybe a bad connector again (hope not), EDP_BKLT_EN only will be present if display is detected, when you get EDP_BKLT_EN and BKLT_PLT_RST_L you will have the right voltage at gate of Q7706...\n\nTry with a known good display assembly.."}
{"post_id":7305,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":416,"username":"brooke.j","post_date":"2016-09-26 19:48:51","message":"I plugged the display back in and no backlight fuse blew.  When I first turned on the computer pin 3 of connector was at 7.6v then slowly it went down to 1.6.  Do you still think this is due to the display?"}
{"post_id":7313,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":36,"username":"aprendiz","post_date":"2016-09-26 21:56:02","message":"The reason of a blown fuse is because a short on that line, this is why blew the fuse as you described on post #12...\n\nStill think it is a bad display and\/or cable.."}
{"post_id":7322,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":416,"username":"brooke.j","post_date":"2016-09-27 12:12:17","message":"cool thx I'll see if I can pull a screen.  I wish there was a spreadsheet on which screens you can interchange.  Google fu is not turning up many hits."}
{"post_id":7356,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":1,"username":"larossmann","post_date":"2016-09-27 23:40:28","message":"any air screen can work on any other air. do not substitute a screen from any other unibody macbook or retina here or it will fuck everything up."}
{"post_id":7368,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":416,"username":"brooke.j","post_date":"2016-09-28 15:51:29","message":"Thx Louis I remember that now from one of your videos. Wasn't going to even try because I do watch and listen."}
{"post_id":7640,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":416,"username":"brooke.j","post_date":"2016-10-04 15:20:34","message":"Well new screen and still no backlight.  Ugh....  Anything else I could try?"}
{"post_id":7645,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":2,"username":"dukefawks","post_date":"2016-10-04 16:20:37","message":"Right lets start over here.\n\nWhat is the voltage on pin 3,4 on LCD connector. LCD plugged in of course on not with the lid closed."}
{"post_id":7654,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":416,"username":"brooke.j","post_date":"2016-10-04 21:05:53","message":"Totally let's start over LOL!  Ok so Pin 3,4 is 7.6V But as the board is left on it slowly drops.  This must be the sleep Feature?   Just FYI there is no HD installed.  I have one if that makes it better?"}
{"post_id":7656,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":416,"username":"brooke.j","post_date":"2016-10-04 21:40:28","message":"Which is crazy because I was getting 3.4v.  Maybe I just murdered the WLED and didn't know it?"}
{"post_id":7661,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":2,"username":"dukefawks","post_date":"2016-10-05 02:10:53","message":"Do you have an LCD plugged in while measuring? Also check SMC_LID"}
{"post_id":7754,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":416,"username":"brooke.j","post_date":"2016-10-06 15:16:16","message":"I have the LCD Plugged in.  SMC_LID is 3.4v,  PIN 3,4 of LCD is 8.5v.  So it looks like the lcd is getting too much?"}
{"post_id":7755,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":416,"username":"brooke.j","post_date":"2016-10-06 16:07:34","message":"Ok so I'l start over. Thank you again for all the help. This is with the LCD plugged in.\n\nQ7707 PIN 2 = 3.4v, PIN 5 = 3.4v\nLCD connector PIN 3,4 is 8.5v\nSMC_LID = 3.4v\nQ7706 PIN 3 = 2.8v (close enough right?) PIN 1,2,5,6 = 8.5v"}
{"post_id":7757,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":2,"username":"dukefawks","post_date":"2016-10-06 16:26:00","message":"That all looks fine. Now check BKL_EN and BKL_PWM."}
{"post_id":7758,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":416,"username":"brooke.j","post_date":"2016-10-06 16:28:41","message":"I've also cleaned the dam WLED driver too much and now if I wanted to replace it I don't know which way it goes.  Can anyone help with that?  Thx"}
{"post_id":7759,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":416,"username":"brooke.j","post_date":"2016-10-06 16:31:18","message":"Oh I can figure it out from the data sheet (I hope)!!"}
{"post_id":7762,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":2,"username":"dukefawks","post_date":"2016-10-06 18:39:04","message":"You have the board view for that. Please measure what I asked."}
{"post_id":7771,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":416,"username":"brooke.j","post_date":"2016-10-07 00:14:47","message":"Ok I didn't see that post sorry I'll check those. Just a thought... there is only one LP8550 on mouser?  Just want to make sure I got the right one.  The numbers on top are different than on the original WLED."}
{"post_id":7772,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":416,"username":"brooke.j","post_date":"2016-10-07 00:53:53","message":"BKL_EN = 2.8v  BKL_PWM = 0.3v  \nMeasured at PIN 1 of R7715 and PIN 2 of R7704 respectively"}
{"post_id":7777,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":2,"username":"dukefawks","post_date":"2016-10-07 03:35:44","message":"BKL_PWM should be higher. Do a PRAM reset to be sure it is not that first. Then check resistance to GND on BKL_PWM.\nIf that all seems ok, remove R7704 and connect BKL_PWM to 3V somewhere, like C7711 and see if that brings it back."}
{"post_id":7841,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":416,"username":"brooke.j","post_date":"2016-10-08 02:01:26","message":"Thanks duke for hanging in there with me.  I'll get on that right away.  This forum and you super awesome!"}
{"post_id":7914,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":416,"username":"brooke.j","post_date":"2016-10-09 19:26:29","message":"After PRAM Reset BKL_PWM went up to 1.4v. So I did what you said. Connected 3.4v from C7711 PIN 1 to R7704 PIN 2 (R7704 removed) That means I'm putting 3.4 V into the WLED driver. Did I read the schematic correctly? I figured I didn't want to double up on the voltage and I saw that R7704 was going into the WLED so I hope I got that logic right. Something curious happens with Q7707 PIN 5 EDP_BKLT_EN is 3.4v at start but then quickly goes to 0v and PIN 3,4 of LCD goes from 8.5v to 0v quickly too. This is with the LCD plugged in. Just to point something out that I know I'm going to get shit for. I bought a used \"working\" LCD to test because someone mentioned that the original might be bad. Would that make any difference if somehow this \"working LCD I bought is bad. Also could I have just mangled the WLED driver replacement? I've Replaced it 3 times, desoldered the pads (all of them look nice) and have tried to get it perfect. Not heating it forever and seeing the chip move so that I know all balls are melted. But Maybe I'm just f'n it up or something."}
{"post_id":7916,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":2,"username":"dukefawks","post_date":"2016-10-09 20:00:23","message":"Check SMC_LID again, it should stay high. If it goes low then also EDP_BKLT_EN will go low."}
{"post_id":7990,"thread_id":6462,"title":"Macbook Air 802-00165-A Good backlight fuse, bad wled?","user_id":416,"username":"brooke.j","post_date":"2016-10-11 16:03:11","message":"Well this ship has sailed. I'll be sending it you Mr. Robot.... I mean Mr. Rossmann LOL!! Hey at least you guys give great advice and then get more business when rookies like me can't fix it. On the bright side my Crest500HT showed up and I put a Macbook retina in it that would boot but had Vertical lines going up and down the screen. I was thinking it needed to be scrapped because I don't have a BGA machine to do GPU's (nor do I want to) so I threw it in the crest with some Branson and PRESTO! Working computer for free because a client just gave it to me for parts (didn't even want to spend the money on fixing) I've been testing it for 2 days and left on all night. I just have to explain that this computer had coffee spilled into it. Then the client put it in the oven at 100 degrees and forgot about it and it was actually on!!! I did recover the data from the HDD for him so not to bad.  \n\nSo if it's a game to see who can fix the most computers this month its Crest=1 Me=0. Well played Crest. Well Played. LOL!!"}
