{"post_id":94722,"thread_id":63369,"title":"820-00138-A missing components","user_id":32898,"username":"javier_herart","post_date":"2022-12-10 13:43:07","message":"I bought this board on ebay and it arrived damaged (see attached image, damaged and donor board). \n\nAll resistors\/caps close to j8300 were ripped, I cannot see the trace in all of the pads so not sure if I could install the components from a donor board. \n[U]The boardview wont match the board, could you give a hand to identify what are resistors missing? [\/U]\n\n(Its hard for me to return the board, that is why I am considering fixing it) .\n\n\nThanks!"}
{"post_id":94725,"thread_id":63369,"title":"820-00138-A missing components","user_id":682,"username":"2informaticos","post_date":"2022-12-10 15:26:09","message":"You must solder C8328\/9 for pins 10 & 11.\nAll C8350-8 caps are not critical, forget them.\nYou can make a short instead of R8300 (0 ohm).\n\nThe boardview is from 00163 and many other components correspond.\nThe big problem is to verify continuity for the pins 2-8 with the other points on the board; pin 3 with R7758\/60, for example.\nMay have luck if you find them on the boardview.\n\nThe connection traces are inside the board.\nIf the points are underneath the ripped pads of the caps, will need to run wires; if you cannot reuse these points."}
{"post_id":94778,"thread_id":63369,"title":"820-00138-A missing components","user_id":32898,"username":"javier_herart","post_date":"2022-12-12 18:24:37","message":"Thanks a lot. \n\nI added 3 missing resistors and the board seems to be working fine with the screen. \n\nI see that there is no green light on the charger, the charger is detected and the battery is charging, just no light green\/orange light. Any idea? (known good charger)"}
{"post_id":94779,"thread_id":63369,"title":"820-00138-A missing components","user_id":32898,"username":"javier_herart","post_date":"2022-12-12 18:35:10","message":"Thanks for your help. \n\nI added 3 resistors and the board seems to be working, however the battery is not charging, no green\/orange light, I do see the lightning on the battery icon. Any help?"}
{"post_id":94780,"thread_id":63369,"title":"820-00138-A missing components","user_id":682,"username":"2informaticos","post_date":"2022-12-13 02:54:19","message":"You must get the amber light on Magsafe first.\nSMC needs to communicate with 1-wire memory from the charger, in order to enable charging.\n\nInspect U7000\/1 area and their traces.\nTried another DCIN board?"}
{"post_id":94922,"thread_id":63369,"title":"820-00138-A missing components","user_id":32898,"username":"javier_herart","post_date":"2022-12-17 18:49:50","message":"It seems DCIN board was not completly connected...\n\nthanks!"}
