[
    {
        "post_id":12429,
        "thread_id":12429,
        "title":"[SOLVED]Core i5 13\" Mid-2012 - Model\tA1278 (EMC 2554*)   Won't recognize known good HDD",
        "user_id":169,
        "username":"TexpertLLC",
        "post_date":"2017-01-07 04:15:17",
        "message":"[PLAIN][SOLVED]Core i5 13\" Mid-2012 - Model\tA1278 (EMC 2554*)   Won't recognize known good HDD[\/PLAIN]\n\n[SOLVED]\n\nGot a MBP in for repair, it's the Core i5 13\" Mid-2012 - Model A1278 (EMC 2554*) Issue is that it won't recognize known good HDDs. I have tried 2 different SATA flex cables. The drive seems to get power, I can feel it spinning but it does not populate in Disk Utility and will not boot. As suggested in a previous thread, I have reset the SMC but this has not corrected the issue. There are not signs of liquid exposure, and the connector looks to be okay. I guess I could have 2 bad flex cables, but not sure how likely that is. Any insight is appreciated."
    },
    {
        "post_id":12458,
        "thread_id":12429,
        "title":"[SOLVED]Core i5 13\" Mid-2012 - Model\tA1278 (EMC 2554*)   Won't recognize known good HDD",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-01-07 17:56:22",
        "message":"Did you use the 2012 type flex cable? They are wider and different from all other models. As this is the most common failure you must be 100% sure that you are using a good cable."
    },
    {
        "post_id":12472,
        "thread_id":12429,
        "title":"[SOLVED]Core i5 13\" Mid-2012 - Model\tA1278 (EMC 2554*)   Won't recognize known good HDD",
        "user_id":169,
        "username":"TexpertLLC",
        "post_date":"2017-01-08 08:12:36",
        "message":"Thanks. I have verified that I am in fact using 2012 type flex cable. It did however come off a donor machine. Is there a way to test the cable with mutli-meter? I have tiny tipped fluke leads, that with enough effort I can probably get on the appropriate pins.  Thanks again man you guys are a life saver and that is why I stay subscribed even for the advice one every few months, make it worth the $1\/day."
    },
    {
        "post_id":12477,
        "thread_id":12429,
        "title":"[SOLVED]Core i5 13\" Mid-2012 - Model\tA1278 (EMC 2554*)   Won't recognize known good HDD",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-01-08 11:40:45",
        "message":"Look up the pinout for the HDD sata connector. Beep out the 4 data lines (A+,A-,B+, B-) to the small connector."
    },
    {
        "post_id":12482,
        "thread_id":12429,
        "title":"[SOLVED]Core i5 13\" Mid-2012 - Model\tA1278 (EMC 2554*)   Won't recognize known good HDD",
        "user_id":169,
        "username":"TexpertLLC",
        "post_date":"2017-01-08 14:00:51",
        "message":"Looks like both of these cables I have are bad.  I get 3 of 4 beeps on one of them, and 1 of 4 beeps on the other.  Ordering a new cable, hope its good and will respond with update.  Thanks again."
    },
    {
        "post_id":12641,
        "thread_id":12429,
        "title":"[SOLVED]Core i5 13\" Mid-2012 - Model\tA1278 (EMC 2554*)   Won't recognize known good HDD",
        "user_id":169,
        "username":"TexpertLLC",
        "post_date":"2017-01-10 06:09:47",
        "message":"New cable solved the issue, again I can't thank you guys enough for offering this service and the YouTube channel.   I have learned so much in the last six months.   Look forward to how much I will learn in the next six months. :cool:"
    }
]