{"post_id":57018,"thread_id":57018,"title":"820-2879 Sensor Issue","user_id":1547,"username":"CRC2018","post_date":"2020-02-24 12:24:57","message":"Got an A1278 in today after not seeing any for a while 820-2879 board. History as follows:\nCame In dead - customer claims tried to change battery to fix macbook - still dead.\nI open it and find a ton of flux on the bios chip, also notice u3990 has been removed and Q7085 is not soldered on straight. I go ahead and replace U3990 from a donor board, realign Q7085 and then proceed to try and power up - no power still, I checked PPBUS which was at 0.8v, replaced the ISL which brought PPBUS back and board was powering up but no display so having known the BIOS chip has been messed around with before I pulled it to reprogram, found BIOS chip itself completely dead wouldnt even read in my programmer so i've programmed a new BIOS chip and soldered onto the board. \nBoard is now powering up but fans running on full speed - have done both SMC and PRAM resets but same, now loaded ASD which told me there is a problem with sensor TN1D - all other sensors pass. Out the board comes again and I put it in the ultrasonic and then try it again - now Apple ASD passes so I think great it's all fixed now, 1 minute later fans on it are running at full speed again and ASD (which was still booted up) reporting a problem with TN1D sensor again which I believe is for the nVidia Chipset. \nWould like some pointers as to where to check now - it was working fine immediately after ultrasonic and board looks clean - no obvious signs of liquid damage other than the previous repairer had put thermal paste all over the place which i've cleaned off."}
{"post_id":57020,"thread_id":57018,"title":"820-2879 Sensor Issue","user_id":682,"username":"2informaticos","post_date":"2020-02-24 14:40:10","message":"Looks like bad MCP; is a 10 yo chip.\n\nReflow it with good flux, just to burn eventually accumulated crap underneath\nUltrasonic bath possibly didn't clean all first time; you can also repeat, after reflow."}
{"post_id":57065,"thread_id":57018,"title":"820-2879 Sensor Issue","user_id":1547,"username":"CRC2018","post_date":"2020-02-26 04:39:16","message":"Reflowed and same behaviour assuming bad MCP at this point - given it's working fine otherwise would there be some way of routing some other sensor into U5535 maybe the cpu one? \nWas thinking if I disconnected pins 2 and 3 of u5535 and routed them to pins 2 and 3 of u5515 I could trick the SMC into thinking the MCP is reading normally?"}
{"post_id":57068,"thread_id":57018,"title":"820-2879 Sensor Issue","user_id":682,"username":"2informaticos","post_date":"2020-02-26 04:51:01","message":"Try just removing U5535..."}
{"post_id":57127,"thread_id":57018,"title":"820-2879 Sensor Issue","user_id":1547,"username":"CRC2018","post_date":"2020-02-28 04:14:05","message":"Tried Removing U5535 - same behavior also tried routing the CPU sensor into U5535 which also resulted in the same error. At this point I am thinking either SMC issue or something is broken somewhere inside the board.\n\nLuckily I have another 820-2879 board which had just a mild case of liquid damage so i've managed to fix that one up for the customer instead - that one had a strange fault SMC_N_Follow had a 30ohm short to ground and as such board would start but then shut off immediately - fixed by disconnecting pins 3 and 4 from u2594 and pad 1 of R2598 and then running a jumper wire between them which allowed it to work correctly."}
