[
    {
        "post_id":5162,
        "thread_id":5162,
        "title":"820-00165 No PP5V_S4RS3, green light OK, no FAN spin.",
        "user_id":136,
        "username":"george-a",
        "post_date":"2016-08-08 07:38:47",
        "message":"Hi guys,\n\nI started a new thread as the one similar to my problem is.. ehmmm similar which can lead to a messed up existing thread. So here is exactly what happens to mine:\n\nIt came with LD but almost impossible to notice. I did a UC but nothing changed.\n\n1) Green -> Orange Light OK\n2) 3V42, PPBUS, PPVRTC, 5V_S5, 3V3_S5, 3V3_SUS, PP1V05_SUS OK\n3) SMC seems alive, various lines produce pulses, voltages are there, there is 32KHz clock going in, maybe I need to check something more specific?\n4) SPI looks and feels good\n5) P5VS4RS3_EN missing => PM_SLP_S4_L also missing\n\nAlso it does not start with C1300 & C1303 removed.\n\nThank you in advance,\n\ng"
    },
    {
        "post_id":5166,
        "thread_id":5162,
        "title":"820-00165 No PP5V_S4RS3, green light OK, no FAN spin.",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2016-08-08 11:01:34",
        "message":"Are the probe points to the left\/down from the SPI ROM looking clean? A break there is common since it is along the edge."
    },
    {
        "post_id":5167,
        "thread_id":5162,
        "title":"820-00165 No PP5V_S4RS3, green light OK, no FAN spin.",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2016-08-08 11:06:00",
        "message":"Also the signal side of R1303, R1302, R1301, and R1300 never drop below 3v, right? I had one where PCH_INTVRMEN was 2.9v, just for the f of it i shorted one of the 3.3v ones next to it to PCH_INTVRMEN and it turned on and worked forever..\n\nbut this can be anything. PCH issue, corroded trace around BIOS, SMC keeping SMC_ADAPTER_EN & PM_BATLOW_L low, \n\nIs PM_SLP_S4_L plain 0v dead, or jumping up and down?"
    },
    {
        "post_id":6142,
        "thread_id":5162,
        "title":"820-00165 No PP5V_S4RS3, green light OK, no FAN spin.",
        "user_id":136,
        "username":"george-a",
        "post_date":"2016-08-29 07:43:08",
        "message":"Hi louis, guys,\n\nI checked the resistors you mentioned and all are at 3.2+ but I found a corroded pad beside the BIOS chip for line SPI_CS0_L which I bridged but still no fan spin. I also checked surrounding pads but there is continuity.\n\nPM_SLP_S4_L looks dead, not jumping up&down.\n\nyou think this broken line (SPI_CS0_L) could have corrupted the BIOS? is a re-flashing attempt worth it?\n\napologies for the long delay between responses.\n\n\nEDIT: weird behaviour detected. After plugging in the charger a few times the light went GREEN->off (instead of ORANGE) and the fan started spinning and the CPU got hot. Repeating the procedure with the magsafe adapter makes the light go Green -> Orange and no fan spin. A few tries later fan spin again. Then nothing... Any clues?\n\nEDIT2: SMC_SENSOR_PWR_EN also missing.. maybe irrelevant?"
    },
    {
        "post_id":6161,
        "thread_id":5162,
        "title":"820-00165 No PP5V_S4RS3, green light OK, no FAN spin.",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2016-08-29 18:14:37",
        "message":"Look where that signal goes to on both sides and see if something is corroded further down."
    }
]