[
    {
        "post_id":85875,
        "thread_id":62287,
        "title":"garbled image on 3332 board after U8900 fix",
        "user_id":1423,
        "username":"captainmac",
        "post_date":"2022-02-02 06:56:43",
        "message":"This board came in for the all-too-common U8900 issue: upon arrival the machine worked fine, but would crash once the board switched from Integrated to Dedicated GPU (the typical MUX issue).\nI have redone the solder on U8900, but after reassembly, the screen is showing distorted\/garbled image. I have tested with another compatible screen, but the issue is the same there.\nSee my attached image for what i mean by distorted\/garbled image.\nAny ideas what may cause this issue? I have triple-checked the soldering on U8900 and its surrounding components: all looks flawless.\nAny ideas where to start chasin this issue?"
    },
    {
        "post_id":85876,
        "thread_id":62287,
        "title":"garbled image on 3332 board after U8900 fix",
        "user_id":1423,
        "username":"captainmac",
        "post_date":"2022-02-02 06:57:42",
        "message":"i should also mention that i have swapped U8900 for another chip from a donor; but unfortunately, the issue remains the same.\nI have inspected the board for any knocked off components but no dice.."
    },
    {
        "post_id":85879,
        "thread_id":62287,
        "title":"garbled image on 3332 board after U8900 fix",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-02-02 07:04:04",
        "message":"Image problem may be caused by GPU, or VRAM.\nMaybe a BGA chip from graphics area reacted to hot air."
    },
    {
        "post_id":85962,
        "thread_id":62287,
        "title":"garbled image on 3332 board after U8900 fix",
        "user_id":1423,
        "username":"captainmac",
        "post_date":"2022-02-04 03:58:49",
        "message":"Yes, you were right.. disabled the GPU with my Medusa, and the issue is gone.. Dammit, this is a no-fix then."
    },
    {
        "post_id":85968,
        "thread_id":62287,
        "title":"garbled image on 3332 board after U8900 fix",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-02-04 06:41:45",
        "message":"Is an old laptop.\nThe client should understand that using only iGPU is good enough."
    }
]