{"post_id":87506,"thread_id":62478,"title":"820-00163 is on and working but turns off screen during startup","user_id":511,"username":"kevinklinkmuller","post_date":"2022-03-16 09:35:17","message":"It's as if the lid is closed, except during boot i can close the lid and open at it'll react properly. Once you see the mouse, the screen goes off. Works on HDMI perfectly. When unplugging HDMI it'll come up on the MacBook  screen for a split second before shutting off again. It's not just backlight, it's definitely no image. Have tested it without anything connected too and it's still the same so it's definitely not the IO board"}
{"post_id":87517,"thread_id":62478,"title":"820-00163 is on and working but turns off screen during startup","user_id":682,"username":"2informaticos","post_date":"2022-03-16 11:19:03","message":"Did you try known good (compatible) LCD assembly?\nDid PRAM reset?\nOriginal 85W Magsafe 2 charger?\nWhat is SMC_LID level, when the issue appears?"}
{"post_id":87745,"thread_id":62478,"title":"820-00163 is on and working but turns off screen during startup","user_id":511,"username":"kevinklinkmuller","post_date":"2022-03-22 06:26:09","message":"Ok you are correct, it's actually the screen. so strange. Just plugged in a cracked tester screen and it goes all the way no problem. This is weird how the screen seems perfect until after startup.\n\nDo you think it could be the LVDS connector? Think it's worth testing and replacing?"}
{"post_id":87746,"thread_id":62478,"title":"820-00163 is on and working but turns off screen during startup","user_id":682,"username":"2informaticos","post_date":"2022-03-22 06:59:16","message":"I doubt to be connector issue, once works perfect with other LCD assembly.\nTry to connect back original and see what happens."}
{"post_id":88033,"thread_id":62478,"title":"820-00163 is on and working but turns off screen during startup","user_id":511,"username":"kevinklinkmuller","post_date":"2022-03-28 15:28:47","message":"Just wanted to update this thread for others, it actually turned out to be the LVDS cable. Very odd behaviour from a cable fault but it's fixed so that's good!"}
