{"post_id":47775,"thread_id":47775,"title":"820-4924 Another brain dead board","user_id":427,"username":"overshoot","post_date":"2019-03-25 11:26:35","message":"ok, I got that board from eBay (maybe the seller is from this forum, who knows... ;-) ) Looked too good to be true.\nAnyhow, it looked mint on the auction pictures and it does also under the microscope. Only one resistor was detached but I did re-attached it (maybe during transport)\n\nCPU_VCore is present.\nBoard draws nearly an amp, but often .8amp and CPU is burning hot. It is supposed to be a Core i7 so I am wondering if it is normal?!\nResistance to ground on Vcore is 8ohms which seems ok for an i7.\n\nOn 20 times, I did try to start it, I got no life out of it, only once on an external display using Thunderbolt (which gave me hope)\nBut since then, nothing.\nIt won't chime, USB mouse lights up.\n\nI am thinking this board might have been smashed somehow (some CPU balls could be detached) or CPU is giving up.\nI did try a different Bios but same thing.\nBoard looks like it has never been reworked. Only that small resistor... when I saw it, I thought \"easy win\"... hahaha\n\nAny idea on what else to check?"}
{"post_id":47781,"thread_id":47775,"title":"820-4924 Another brain dead board","user_id":682,"username":"2informaticos","post_date":"2019-03-25 12:57:58","message":"First of all, tell us which resistor are you talking about.\nUse pendrive OSX with LED Link; if flashes, that confirms USB activity 100%.\nTry few PRAM reset, just in case.\n\nYou can also try new BIOS, just in case..."}
{"post_id":47795,"thread_id":47775,"title":"820-4924 Another brain dead board","user_id":427,"username":"overshoot","post_date":"2019-03-26 00:54:28","message":"Resistor was R7279 near U7200.\nUSB adaptor just gets power, no blinking whatsoever.\n\nPRAM reset won't work, no chime, USB light stays on.\n\nI've just did try a clean ME bios found on the forum board with no difference."}
{"post_id":47809,"thread_id":47775,"title":"820-4924 Another brain dead board","user_id":682,"username":"2informaticos","post_date":"2019-03-26 06:13:36","message":"Looks like cracked balls\/traces, if board starts sometime.\nThis could be wasting time project..."}
