{"post_id":52832,"thread_id":52832,"title":"820-3437 PPBUS_G3H @ 2.2v","user_id":5175,"username":"tlough75","post_date":"2019-10-02 12:40:26","message":"OK, so I have an 820-3437 board that is taking 20 milliamps. I did a quick power on before I discovered a small amount of corrosion to the right of U7600. I checked the resistance of the 4 resistors, (8164, 7613, 7614 & 7610). all values check with the exception of R7613 which measures 20K instead of 47.5K. I measured L7630 and found pin 1 to be shorted to ground. I'm assuming my options are: Replace R7613 and check PPBUS after, Pull Q7630 and check for short again or toss this POS in the donor pile. Just looking for suggestions before I bin it. BTW no fan spin but have light on the charger."}
{"post_id":52833,"thread_id":52832,"title":"820-3437 PPBUS_G3H @ 2.2v","user_id":5175,"username":"tlough75","post_date":"2019-10-02 12:47:07","message":"I wonder if I got lucky, it looks like the shorted side of L7630 is not on the CPU side. would that be a correct assessment?"}
{"post_id":52847,"thread_id":52832,"title":"820-3437 PPBUS_G3H @ 2.2v","user_id":5281,"username":"Milwaukee Mac Repair","post_date":"2019-10-02 15:50:40","message":"U7100 would be my focus. Check V In @ pin 2 of Q7130. Now check chgr_ugate and chgr_lgate voltages. Chgr_lgate should be 0.00x mV at most...while chgr_ugate should be same as ppbus_g3H is expected to be. These are really pulsed DC averaged readings for the gates of the dual FET. Pull and read ohms to ground at pin 2 of F7140. Pump your OWN PPBUS_G3H voltage into pin 2 with your own power supply.and look for hot spot \/ gated short, spy the current draw \/ behavior. If you find that you need to replace your ISL6259: your stock of that chip is probably old. The contacts on the underside of the chip are not going to take to tinning well. Use an acidic flux on the contacts under the new ISL6259. Something like Rubyfluid. With small soldering pen and your own bismuth \/ tin low-melt no lead solder. I specify no-lead because lead wets flat, no - lead fills gaps nicely. Flow the chip into place, let it set. push tweezers onto top of chip when cold, reflow and squish out excess solder. Clean-up squished-out solder blobs with knife-edge tip with 220C air and fresh flux, wetting ends of all chip contacts to board pads nicely. That's a VERY picky and important chip!"}
{"post_id":52856,"thread_id":52832,"title":"820-3437 PPBUS_G3H @ 2.2v","user_id":5175,"username":"tlough75","post_date":"2019-10-02 19:18:52","message":"So after cleaning & freshening up the solder joints on the 4 resistors by U7600, I now have a spinning fan as well as correct power rail voltages. Now I am going to reassemble and test the computer. Thanks!"}
{"post_id":52858,"thread_id":52832,"title":"820-3437 PPBUS_G3H @ 2.2v","user_id":682,"username":"2informaticos","post_date":"2019-10-02 19:39:20","message":"\"chgr_ugate should be same as ppbus_g3H is expected to be.\"\nIs not the only one wrong assumption.\nThat MOSFET (like any other from a buck converter) requires 5V pulse between G-S; calculate again!\n\"These are really pulsed DC averaged readings for the gates of the dual FET\"\nYeah, 5V amplitude PWM G-S.\n\n\"Chgr_lgate should be 0.00x mV at most\"\nRe-calculate this too.\n\nHowever, never need to check voltage on Gate pin of the MOSFETs from a buck converter.\n\n\"Pump your OWN PPBUS_G3H voltage into pin 2 with your own power supply\"\nPlease, co NOT recommend this to anybody else; snd STOP to do this yourself.\nToo many times has been explained on the forum how to (and how to NOT ) inject voltage on the PPBUS_G3H.\nIf you are ready to fry the CPU, do it on your risk!"}
{"post_id":52869,"thread_id":52832,"title":"820-3437 PPBUS_G3H @ 2.2v","user_id":5175,"username":"tlough75","post_date":"2019-10-02 21:45:16","message":"Yeah i didn't do any of that. I cleaned the corrosion. The board started working. I put computer back together and started installing OS but before it could finish I got a black screen with text saying cpu could not finish instruction or kernal something... I restarted and now bar under Apple logo freezes and is showing like asliver of white. Drawing normal current though. Stupid me i should have taken a picture of the fault. Still learning"}
{"post_id":52874,"thread_id":52832,"title":"820-3437 PPBUS_G3H @ 2.2v","user_id":682,"username":"2informaticos","post_date":"2019-10-03 04:19:06","message":"Test if machine works good with USB OSX.\nIf not, try to clean ME region."}
{"post_id":52910,"thread_id":52832,"title":"820-3437 PPBUS_G3H @ 2.2v","user_id":5175,"username":"tlough75","post_date":"2019-10-03 12:25:18","message":"Will do that next"}
