[
    {
        "post_id":75660,
        "thread_id":61220,
        "title":"MacBook Pro (15-inch, 2017) A1707 820-00928 \"Only boots Safe Mode\/Critical Update\/Bootloop\" (no visible damage)",
        "user_id":30961,
        "username":"PapaRayRay",
        "post_date":"2021-05-21 21:54:10",
        "message":"[COLOR=rgb(147, 101, 184)]Unfortunately [\/COLOR]to hopefully provide all crucial data I have to quickly run it from the beginning :sleep: (I'll try and give only highlights):\n                               Came in from other shop for \"only booting in safe mode\" with a fresh install of Big Sur. I confirmed this issue with my eyes several times, tried a repair install which didn't happen because it struggled to boot to any bootable installer\/OS; I [COLOR=rgb(84, 172, 210)]set the computer aside[\/COLOR] for a day or two before getting to it.  When I got to it- [COLOR=rgb(251, 160, 38)]lo [\/COLOR][COLOR=rgb(243, 121, 52)]and [\/COLOR][COLOR=rgb(41, 105, 176)]behold[\/COLOR][COLOR=#000000]: it magically worked properly, no issues at all; Big Sur in all its glory. It continued to work for about a week; turned it on and off and played YouTube etc. every day. After some failed SuperDuper clones from an older computer they wanted the clone from, we restore from a  Time Machine backup of that older computer via Migration Assistant to a working fresh Catalina install. After restore back to only booting in safe mode. This time able to go to recovery and Catalina is available- repair install\/data restore = SUCCESS ;) WELP let's go to Big Sur! It ran through a \"critical update\" for like two minutes then went back to normal update. It got too late, left it alone after restart initialized, plugged in, updating. Came back in the morning. [\/COLOR][FONT=courier new][COLOR=rgb(0, 0, 0)][I]Now its worse. [\/I][\/COLOR][\/FONT][FONT=arial][COLOR=#000000]Now its a combination of, spazzes out chiming repeatedly for a lot of times then shuts off or it goes to load the apple then loops or just stays black; chiming every time. Not able to select a boot device, no recovery, no Diagnostics. I tried plugging in an external monitor because something I read on another post while making sure I'm not posting something that's already been posted here. I tried with\/without battery, with\/without power plugged in. It does except SMC and PRAM resets on the times that it’s not just “spazzing out,” but it doesn’t fix anything. Google\/YouTube no help. I've repeatedly looked over the board under the microscope hoping to see something obvious, nothing catches my eye. I suspect EFI chip? But I'm aware I could be way off. I don't really know where to start poking around with the multimeter on this one or if its necessary. \n                               \n[I]                                             I hope that's not too long and explains the issue clearly.[\/I] I've never been a forum member anywhere I normally just read them, why? idk who cares. If there's anything I could do differently when presenting a topic that would benefit me and everyone who may share a problem, please let me know. [\/COLOR][\/FONT]"
    },
    {
        "post_id":75661,
        "thread_id":61220,
        "title":"MacBook Pro (15-inch, 2017) A1707 820-00928 \"Only boots Safe Mode\/Critical Update\/Bootloop\" (no visible damage)",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-05-22 02:01:44",
        "message":"If the problem appeared after a macOS update, I recommend to try known good BIOS, as first step.\n[URL unfurl=\"true\"]https:\/\/drive.google.com\/file\/d\/1YKKdpd0DtpobU8OOCfcS21hrKN10yTUH\/view?usp=sharing[\/URL]\nDon't forget to make a backup of your actual BIOS first."
    },
    {
        "post_id":75667,
        "thread_id":61220,
        "title":"MacBook Pro (15-inch, 2017) A1707 820-00928 \"Only boots Safe Mode\/Critical Update\/Bootloop\" (no visible damage)",
        "user_id":30961,
        "username":"PapaRayRay",
        "post_date":"2021-05-22 06:00:07",
        "message":"Just to be clear, there’s no way to do this with out a bios programming device of some sort correct? I am ordering one.\nIf so in order to save time is it possible to use an EFI\/firmware\/bios chip from another identical model, which likely has a fine bios?"
    },
    {
        "post_id":75672,
        "thread_id":61220,
        "title":"MacBook Pro (15-inch, 2017) A1707 820-00928 \"Only boots Safe Mode\/Critical Update\/Bootloop\" (no visible damage)",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-05-22 07:57:35",
        "message":"Good enough for test.\nFinally, need to clean ME region, change SSN and fix Fsys checksum."
    },
    {
        "post_id":75690,
        "thread_id":61220,
        "title":"MacBook Pro (15-inch, 2017) A1707 820-00928 \"Only boots Safe Mode\/Critical Update\/Bootloop\" (no visible damage)",
        "user_id":30961,
        "username":"PapaRayRay",
        "post_date":"2021-05-22 11:20:11",
        "message":"Thank you, I’ll revisit this thread when device arrives or something changes, Ima keep it alive because I will revisit it."
    }
]