{"post_id":79500,"thread_id":61642,"title":"2014 Mac Mini","user_id":26621,"username":"grmacs","post_date":"2021-08-30 15:06:58","message":"This one is dead. I get 12V from 4 pins on power supply to board. Is center pin of the powersupply connector supposed to have any power? No fan spin or chime. I have 3v3_s5 and nothing at what I believe is the PP5V_S4 coil. Diode on that coil is .402 and diode check around U7501 seem to be comparable to 820-3662 board. No signs of liquid and nothing noticeably bad on board. CHecked to see if maybe any caps loose (if it were dropped or something) but best guess is maybe supposed to be voltage from center pin on the power supply and that is issue...."}
{"post_id":79501,"thread_id":61642,"title":"2014 Mac Mini","user_id":682,"username":"2informaticos","post_date":"2021-08-30 15:22:07","message":"Unfortunately, no schematics available for Minis.\nDo you note any pulse at big coils?\nCheck at the same time when press the power button."}
{"post_id":79503,"thread_id":61642,"title":"2014 Mac Mini","user_id":26621,"username":"grmacs","post_date":"2021-08-30 15:34:11","message":"No pulses at other large coils with power button, just steady 3.3V on the one. So I take it no voltage at middle pin of power supply connector is normal? I did verify that the power button closes the circuit correctly so it works at least. I tried SMC bypass just to see but guessing wont work on a mini..."}
{"post_id":79505,"thread_id":61642,"title":"2014 Mac Mini","user_id":682,"username":"2informaticos","post_date":"2021-08-30 16:04:10","message":"Check for short on the 5V USB power rail.\nShorted caps there is classic issue..."}
{"post_id":79510,"thread_id":61642,"title":"2014 Mac Mini","user_id":26621,"username":"grmacs","post_date":"2021-08-30 16:39:39","message":"No luck on those but was a good thought. Not seeing familiar PP3V42 components but I do have dropping values around the SMC. Any idea if this board should have PP3V42_G3H? Some spots I'm getting 3.38V but I think that is actually PP3V3_S5... If the dropping voltage measurements are supposed to be PP3V42, that would be my issue. Not seeing the familiar coil like whats on A1398 board or 00165. Most of the test points though around the SMC checking with diode are around .712 range... not sure if that could be a tell of any sort. Not shorts though anyway"}
{"post_id":79514,"thread_id":61642,"title":"2014 Mac Mini","user_id":26621,"username":"grmacs","post_date":"2021-08-30 17:09:31","message":"Not sure how I missed this before. ONe of the coils (looks like L7630 circuit from a 820-3476 board maybe??? P1V05 SO?) It appears I have a dead short on that line zero ohms resistance to ground."}
{"post_id":79522,"thread_id":61642,"title":"2014 Mac Mini","user_id":682,"username":"2informaticos","post_date":"2021-08-31 02:57:37","message":"You can't get 3V3_S5 without 3V42_G3H; so that's not the issue.\n\nLift that coil one side and see where the short remains.\nWhat is the exact ohm resistance of the short?"}
{"post_id":79533,"thread_id":61642,"title":"2014 Mac Mini","user_id":26621,"username":"grmacs","post_date":"2021-08-31 06:20:44","message":"Will do. It is a dead short: 0 ohms"}
{"post_id":79534,"thread_id":61642,"title":"2014 Mac Mini","user_id":682,"username":"2informaticos","post_date":"2021-08-31 06:38:16","message":"Just in case, remove RAM and check again.\n\nCould be CPU; can confirm after coil is lifted."}
{"post_id":79543,"thread_id":61642,"title":"2014 Mac Mini","user_id":26621,"username":"grmacs","post_date":"2021-08-31 07:03:55","message":"This is 2014… so soldered on"}
{"post_id":79550,"thread_id":61642,"title":"2014 Mac Mini","user_id":26621,"username":"grmacs","post_date":"2021-08-31 08:27:21","message":"Not good... pulling that coil up, the short is CPU side and I pulled what looks like a R7640 and the leg of that that is shorted is the one that sends power to CPU. Pulled the caps from and resistors near there from that leg just on a hope and a prayer and the short is still there so it appears the short is in the CPU."}
{"post_id":79563,"thread_id":61642,"title":"2014 Mac Mini","user_id":682,"username":"2informaticos","post_date":"2021-08-31 11:20:31","message":"CPU VCORE may have very low value to ground.\nBut not low value for other CPU voltage, like PCH power."}
{"post_id":79577,"thread_id":61642,"title":"2014 Mac Mini","user_id":26621,"username":"grmacs","post_date":"2021-08-31 12:35:37","message":"Yes the resistance here is actually zero ohms"}
