{"post_id":59751,"thread_id":59359,"title":"A1369 - 820-00426 - 0.2A after liquid damage. Short on PPBUS_G3H","user_id":25485,"username":"it-solve","post_date":"2020-05-18 07:32:44","message":"Hey Guys\n\nCame across this with liquid damage around Phase 1\/2 chips U7320 and U7330. I don't have this schematic, but 820-3787 seems to be as close as I can get.\nSeems like there is short on PPBUS_G3H ad I can feel quarter of U7320 heating up.\nRemoved F7140\/F7141 to isolate the short and seems like its on the CPU side.\n\nLifted L7320 and short is gone. So I was wondering have you guys seen these phase chips failing? Could I have dead CPU, especially with the liquid around this area?\n\nAlso, my hot air recently failed and I replaced it with doggy AOUYE 968 I had laying around. I am not sure if the hot air is weak or the area is shorting all to ground, but I cannot even get the solders to melt on this chip. Whole board gets hot but the bloody chip is not coming out.\nHave you experienced anything like this before? Planing to order this[URL='https:\/\/www.unionrepair.com\/quick-881d-1300w-hot-air-desoldering-rework-station.html'] quick 881 1,3KW from unionrepair[\/URL]. Is it still best for my buck?\n\nThanks"}
{"post_id":59753,"thread_id":59359,"title":"A1369 - 820-00426 - 0.2A after liquid damage. Short on PPBUS_G3H","user_id":682,"username":"2informaticos","post_date":"2020-05-18 08:03:58","message":"Most likely dead CPU now.\nIf short on PPBUS_G3H disappeared when lifted L7320, then U7320 is the culprit.\nLift L7310\/30 too and checl exact ohm value to ground at R7320; compare with working board, if possible.\n\n\"I cannot even get the solders to melt on this chip \"\nMatbe don't even need to remove it, if CPU is dead.\n\nBut you can practice, just in case.\nFirst, remove CPU heatsink.\nNext, preheat logic board on large area, especially opposite side of U7320; a small preheater, Mlink 853A helps a lot.\nI recommend to practice on scrap boards first.\nOnce chip is removed, apply only bit of leaded solder on central pad.\nIs also good to pass with lead on top of other pads..."}
{"post_id":59758,"thread_id":59359,"title":"A1369 - 820-00426 - 0.2A after liquid damage. Short on PPBUS_G3H","user_id":25485,"username":"it-solve","post_date":"2020-05-18 08:20:33","message":"Thanks for your reply.\n\nLifted the mentioned coils and all three R7310\/20\/30 are giving 0.16ohm to ground. My Fluke's precision is 0.10ohm\n\nI don't have the same board however, I have 820-3662 (without dedicated GPU) which turns on but have picture issues (overheated so much that heatsink support legs got desoldered from the board, not sure if CPU reflow can save it )\n\nIt seems to be having the same 3 phases and the same chips.\nI lift up the coils on 820-3662 and measured at R7310\/20\/30 and got 16-17ohm. Would that mean dead CPU on 820-00426?\n\nThanks for the tips, much appreciated."}
{"post_id":59769,"thread_id":59359,"title":"A1369 - 820-00426 - 0.2A after liquid damage. Short on PPBUS_G3H","user_id":682,"username":"2informaticos","post_date":"2020-05-18 12:56:07","message":"No CPU can have less than 1 ohm!!!\nSo your board is trash now.\nYou can practice on it..."}
