{"post_id":11699,"thread_id":11699,"title":"820-00426 smc area started smoking after plugging in battery","user_id":90,"username":"ytesfay80","post_date":"2016-12-21 00:31:04","message":"I have this 15\" MBP Retina which says this is a 2016 version when I google the LB number. When I got it initially it would would not turn on with the battery plugged in so I had to unplug the battery, plug the charger in and hit the power button for it to turn on. The power button was kind of inconsistent. I was able to boot as guest user and plug the charger in and it said to \"replace now\".\n\nI got the new battery but before plugging it in I removed the logic board and put flux and heated the corroded areas of the keyboard connector as well as around R9192\/U9600.\n\nThe ISL6259 area around the battery current sensing were all damaged so I replaced the ISL along with all the caps\/resistors on the right side(C7101 to R7152).\n\nI had to use a schematic for an 820-3787 since I don't have a schematic for this model. I believe they are very similar judging by the donor board I am using.\n\nAfter all that I went to test this out. I plugged in the display cable, keyboard cable and the new battery and while I was in the process of plugging in the trackpad cable I started seeing smoke come from the SMC area and I quickly unplugged the battery. \nThings smelled burned and the keyboard backlight part was slightly melted right around the smc area which is why I know the smc was the fault.\n\nI removed the edge bonding and saw that Pin 2 of L5001 and Pin 1 of C5001 both have burned pads. Again I had to use a 820-3787 boardview to find that out and I am not sure where I can run a wire for those since the pad is gone.\n\nNow when I plug in a charger I get no light on the charger.\n\nI'm not sure why the SMC area would smoke up like that when there was no liquid damage around it nor did I do any repairs in that area. All I did was plug in a battery."}
{"post_id":11703,"thread_id":11699,"title":"820-00426 smc area started smoking after plugging in battery","user_id":2,"username":"dukefawks","post_date":"2016-12-21 06:42:02","message":"You had power connected while plugging shit in, why?? I'm guessing you fried the SMC and L5001."}
{"post_id":11716,"thread_id":11699,"title":"820-00426 smc area started smoking after plugging in battery","user_id":90,"username":"ytesfay80","post_date":"2016-12-21 11:59:33","message":"I don't know why I didnt think that was an issue. I didn't get to plug the trackpad cable in before it started smoking. \nI've never replaced an SMC before nor do I have the tools. Could you advise me on where I should get the tools and if its possible for me to take an SMC from an 820-3662 or 820-3787 because I don't have a donor for this board number."}
{"post_id":11720,"thread_id":11699,"title":"820-00426 smc area started smoking after plugging in battery","user_id":2,"username":"dukefawks","post_date":"2016-12-21 12:14:27","message":"You need an exact donor board. You need experience, so practice on scrap board. I assume Louis has videos on replacing SMCs. Links to reball stencils are in the Tools section."}
