{"post_id":20300,"thread_id":20300,"title":"Imac 820-3302 0.4 ohms short to ground on PP12V_s5","user_id":623,"username":"MaxFix","post_date":"2017-05-16 10:48:33","message":"Hey, I'm working on this board, which measures 0.4 ohms from PP12v_g3h to ground, measured on pin 4\/5\/6 of J600 . When i put 12v on PP12v_g3h i get a little heat on Q7870. I removed it, measured again, now the 0.4 ohms is on PPbus12v_S5. I put the 12v again on PPbus12v_s5, but no luck with warm components.\nTo make sure none of the lower s5 rails are shorted i disconnected L7710, L7610, L7650. after that i still measure the 0.4 ohms on PP12V_S5. I've done the same with the mosfets for these circuits, still no change.\nAre there any sensible options to continue this? Currently the only thing i can think of is to one by one remove all capacitors related to the PP12V_S5 rail and see when the short disappears. I feel like i'm missing something very obvious."}
{"post_id":20315,"thread_id":20300,"title":"Imac 820-3302 0.4 ohms short to ground on PP12V_s5","user_id":2,"username":"dukefawks","post_date":"2017-05-16 13:15:20","message":"at 0.4 Ohm and injecting 12V something must almost catch fire. Suspects are high side FETs. First measure from 12V_S5 to all main coils and see if there is one that is 0.4 Ohm or lower. \n\nU9410 and 9610 are also on 12V_s5"}
{"post_id":20466,"thread_id":20300,"title":"Imac 820-3302 0.4 ohms short to ground on PP12V_s5","user_id":623,"username":"MaxFix","post_date":"2017-05-18 04:54:53","message":"I checked 12v_s5 to all coils (including the ones for U9410 and 9610 this time), but none measure 0.4 ohms. With the highside mosfets i'm assuming you mean Q7650, Q7610 and Q7710? If so i will take them off to check.\n\nWe use a power supply that limits the current, so i set it to 3A at 12v, but the output voltage will drop to .4v or something, so no risk of fires."}
{"post_id":20501,"thread_id":20300,"title":"Imac 820-3302 0.4 ohms short to ground on PP12V_s5","user_id":2,"username":"dukefawks","post_date":"2017-05-18 13:47:28","message":"I don't care what voltage you set it too. Crank it up and monitor current draw, this will determine how much is is generated. If you are putting 3A into the board something must heat up or there must be a dead short inside the board."}
{"post_id":23445,"thread_id":20300,"title":"Imac 820-3302 0.4 ohms short to ground on PP12V_s5","user_id":623,"username":"MaxFix","post_date":"2017-07-25 09:22:10","message":"We have given up on this one. Replaced the motherboard, and everything is ok again."}
