{"post_id":51360,"thread_id":51360,"title":"820-00165-A  \"trash pile project board\"","user_id":5210,"username":"KC Micro Tronix","post_date":"2019-08-11 18:39:39","message":"I was given a box full of MacBook board by one of my customers. They are boards that 'ALL\" have been worked on \"some brutally\" by someone. I have fixed half a dozen of them or so and basically learned what I was doing on them. This weekend I was caught up on my work so I went digging in the \"toy box\" for something to do. Often I go back to boards I could not figure out a few months ago only to figure them out now that I have more experience but this one has me stumped. It is a 1.8G 8G board so I am really motivated to figure it out. I am currently out of these boards and need some badly.\n\nHere is what is was doing when I first got my hands on it. \"It would turn on for about 10 or so seconds \"pulling lower than normal current 275mA instead of the usual 450-550mA\" then it would shut off. The previous tech had bypassed SMC_DELAYED_PWRGD on U1950 by bypassing it so they could get PM PCH SYS PWROK out of the and gate.  They ran a jumper from pin 6 of U1950 to pin 5 so PM S0 Good would complete the \"AND\" gate on U1950. I undid this do discover the PM PCH PWROK signal was not present.\n\nI re-flashed the bios and this did fix this problem. I now get a PM PCH SYS PWROK out of U1950 with out it being hot-wired!  I was excited but... Current draw is still lower than normal 275mA and after about 10 seconds or so it does power off again and cycle just like it did before I removed the hacked \"And\" gate.\n\nThe CPU never sends the EDP_PANEL_PWR signal to the display section.\n\nAm I kicking a dead horse here? I really don't know where to look from here other than a SMC or CPU and I really don't want to go there and smoke another hour.\n\nI would appreciate any guidance."}
{"post_id":51362,"thread_id":51360,"title":"820-00165-A  \"trash pile project board\"","user_id":682,"username":"2informaticos","post_date":"2019-08-11 19:32:19","message":"All voltages apear in these 10s, even VCORE?\nDid you try SMC bypass?\nReflashed BIOS with clean ME?\nLook for USB activity.\nTest the board alone, w\/o LIO flex, nor TP connected."}
{"post_id":51368,"thread_id":51360,"title":"820-00165-A  \"trash pile project board\"","user_id":1153,"username":"JohnB8812","post_date":"2019-08-12 08:06:30","message":"Sounds like PCH issue to me"}
{"post_id":51376,"thread_id":51360,"title":"820-00165-A  \"trash pile project board\"","user_id":5210,"username":"KC Micro Tronix","post_date":"2019-08-12 11:37:17","message":"All rails are up.\nOnly the board and my mag safe charger are used.\n\nI am learning how to wipe and reload the PCH now.  Using LBE   Will report back."}
{"post_id":51378,"thread_id":51360,"title":"820-00165-A  \"trash pile project board\"","user_id":682,"username":"2informaticos","post_date":"2019-08-12 12:36:31","message":"Medusa programmer is the best to clean ME region.\nLBE does NOT really clean ME region, just replaces it with stock\/generic\/unconfigured ME region."}
