{"post_id":55185,"thread_id":55185,"title":"Any T2 Touch ID MacBook   \"found out something very interesting today\"","user_id":5210,"username":"KC Micro Tronix","post_date":"2019-12-10 17:48:46","message":"I drop off MacBooks at a local authorized repair center for things like flex gate and butterfly keyboards as they fix them for free.   I was talking to the repair guy today about Touch ID buttons and they \"CAN\" be reprogrammed if the machine has a T2 chip!   They cannot be reprogrammed or changed if it does not.  \n\nSo Apple can't fix a Touch ID button like a phone if it is not a T2 chip machine.  The entire Logic board has to be replaced.  But if it has a T2 chip they can reprogram it with a machine they have.  The machine connects to the logic board and Apple's servers and will reprogram a new or replacement button.\n\nI may have access to this hardware in the future because one of my business partners is looking into purchasing a Apple authorized service center and I am curious about the process.\n\n\nI thought this information was interesting and wanted to share with the group."}
{"post_id":55194,"thread_id":55185,"title":"Any T2 Touch ID MacBook   \"found out something very interesting today\"","user_id":682,"username":"2informaticos","post_date":"2019-12-11 04:06:24","message":"Apple posted the method to recover new machines when T2 firmware gets corrupted.\nI suppose in the same way Touch ID button can be paired with T2 too.\nThe bad machine must be wired (USB 3) with a good one connected to Apple server.\n\nDid you try to replace Touch ID on the non T2 machines?"}
{"post_id":55201,"thread_id":55185,"title":"Any T2 Touch ID MacBook   \"found out something very interesting today\"","user_id":5210,"username":"KC Micro Tronix","post_date":"2019-12-11 11:12:30","message":"i have had bad touch ID on non T2 caused by water damage.  Fixed one with a bad LED flash controller.   But we were unable to get them paired or repaired by apple.   This is the first I heard of the new T2 being able pair a new touch ID button.   I thought it was interesting.   Would love to get my hands on that machine."}
{"post_id":55205,"thread_id":55185,"title":"Any T2 Touch ID MacBook   \"found out something very interesting today\"","user_id":682,"username":"2informaticos","post_date":"2019-12-11 14:57:29","message":"If you have two devices with firmware, is sufficient to \"adjust\" one to accept the other.\nThat explain the case of T2 machines, where the T2 firmware can be \"adjusted\" from Apple server.\nI suppose ID Touch firmware is not \"touched\" in this case by firmware update."}
