{"post_id":22727,"thread_id":22727,"title":"A1278 dvd preventing orange light","user_id":700,"username":"Nick","post_date":"2017-07-08 13:52:55","message":"Hi, i got something weird this morning, a1278 MacBook pro (screws sodomized by the previous shop that failed to fix it) it simply had a faulty magsafe board, changed it and got green light. But it didn't turn on. So I removed it from the body and when I applied the charger it turned on. Attached battery and orange light.\n\ntried to put it back in and after a bit of trials I saw that the machine works perfectly when the DVD reader cable is detached. Connecting it makes the machine fail to charge and turn on.\n\nbefore I buy a new dvd reader, can it be a problem on the board? What should I check out? Thank you"}
{"post_id":22728,"thread_id":22727,"title":"A1278 dvd preventing orange light","user_id":624,"username":"Alan.L","post_date":"2017-07-08 14:48:07","message":"try plug the dvd reader flex cable only without the actual dvd reader connected. could be just the flex cable is the culprit?\n\ncheck pin 10 and pin 15 of J4500 is it shorted to ground when you have the flex connected?"}
{"post_id":22737,"thread_id":22727,"title":"A1278 dvd preventing orange light","user_id":2,"username":"dukefawks","post_date":"2017-07-08 18:46:03","message":"Only thing that would cause this is that the 5V to the DVD is shorting out."}
{"post_id":22747,"thread_id":22727,"title":"A1278 dvd preventing orange light","user_id":700,"username":"Nick","post_date":"2017-07-09 06:42:48","message":"Thanks guys, will check it out on Monday"}
{"post_id":22765,"thread_id":22727,"title":"A1278 dvd preventing orange light","user_id":700,"username":"Nick","post_date":"2017-07-10 02:58:54","message":"WHAT THE FUCK?!?\n\nthat's it. this guy gets a free repair. He paid me with the first biggest laugh of the week. \n\n[img]http:\/\/i.imgur.com\/SAlfQ5z.jpg[\/img]\n\n[img]http:\/\/i.imgur.com\/3ygxaX5.jpg[\/img]\n\n[img]http:\/\/i.imgur.com\/cauoaQQ.jpg[\/img]"}
