[
    {
        "post_id":31892,
        "thread_id":31892,
        "title":"820-00045, No Power",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2018-02-21 14:39:32",
        "message":"Working on a 2nd 12\" Retina in 2 days, after not seeing any for a year (!!). Still not very comfortable with these boards, so I apologize for any stumbling\/confusion on my part. If I missed anything (different power rails on this one, etc), just let me know. Feel free to be short\/impatient with me, I don't mind at all:\n\n1. No liquid damage, unit \"just wouldn't turn on one day\".\n2. PP3v3r3v0_AON is measuring 2.44v, no short present (rtg 18kOhm).\n3. pp3v3_g3h is .015v; no short here either.\n4. chgr_acin is 1.286v\n5. ppdcin_g3h is 5.15v, which I believe is correct with no battery connected. If this is incorrect, please let me know.\n6. R7110\/11 are giving some funny readings, but they match another board I have here, so I think it might be normal. If I need to remove these to measure, let me know.\n\nIf I missed anything, please let me know. Thanks in advance for any help! I really appreciate it.\n\nAlso, as an aside: Do you guys work on these 12\" retina boards with hot air or soldering tweezers? If we start getting more of these in, I'd like to be better equipped to work on them easily. We don't mess with iPhone\/iPad repairs, but I imagine they're similar (~) to these 12\" retina boards."
    },
    {
        "post_id":31895,
        "thread_id":31892,
        "title":"820-00045, No Power",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-02-21 18:59:20",
        "message":"PP3v3r3v0_AON should be 3.3V of course. The usual culprit pulling it down is U4700, maybe pull it and see if 3V3 comes up. Hot air is all I use with this stuff."
    },
    {
        "post_id":31915,
        "thread_id":31892,
        "title":"820-00045, No Power",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2018-02-22 06:11:27",
        "message":"Great, thanks duke. I'll give that a try today. Have been nervous about working on these, but as long as I protect connectors well I should be fine. Will update later today--thanks."
    }
]