{"post_id":16196,"thread_id":16196,"title":"[SOLVED]A1466 MacBook only sometimes sees the magsafe charger","user_id":631,"username":"razorwoods","post_date":"2017-03-08 20:14:37","message":"I'm working on a Early 2015 Macbook Air A1466 that had very minor liquid damage to the keyboard 2 months ago.  The keyboard was replaced and all seemed fine until it came back today and it wouldn't charge.  Using genuine apple magsafe 60w charger it would react and shows the charge icon on the screen BUT the magsafe doesn't show any green or orange light at all and wouldn't actually charge the battery either.  Then if you used a 85w charger it would show green then switch to orange and charge normally.  Then every now and then the 60w would work and the 85w wouldn't.  Everything else seems to work normally including all the ports, WiFi, display, etc... As mentioned the chargers we're using are genuine apple purchased chargers.   Can you point me in the right direction on where to start looking?"}
{"post_id":16198,"thread_id":16196,"title":"[SOLVED]A1466 MacBook only sometimes sees the magsafe charger","user_id":558,"username":"arghhh","post_date":"2017-03-08 22:34:22","message":"Replace IO board and flex."}
{"post_id":16213,"thread_id":16196,"title":"[SOLVED]A1466 MacBook only sometimes sees the magsafe charger","user_id":719,"username":"pcsrepair","post_date":"2017-03-09 03:46:16","message":"Had a problem like this once, it was corrosion on the IO-Board cable."}
{"post_id":16256,"thread_id":16196,"title":"[SOLVED]A1466 MacBook only sometimes sees the magsafe charger","user_id":631,"username":"razorwoods","post_date":"2017-03-09 15:05:57","message":"Turned out to be the I\/O Board Cable.  Didn't catch it at first because if you pull it off and put it back on it works for a short time.  We were able to get it to fail by pressing on the board side connector while the cable was connected.  If you fidgeted with it a little the magsafe would disconnect.  It's weird since under the scope there's no signs of liquid or any other damage at all to the cable but replacing it certainly did seem to resolve the problem.  Thanks for the help."}
