[
    {
        "post_id":90930,
        "thread_id":62881,
        "title":"820-00850 Battery Service Recommended issue",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2022-07-11 07:32:24",
        "message":"Hello. I got a 820-00850 in that is fully functional but the battery has the \"Service Recommended\" message on it. Battery was still charging and working fine though and it was not swollen or anything. I replaced the battery with a brand new one, and still it gives me the same message with the new battery. I checked the battery with Coconut battery app and it shows the battery has 0 cycles and 99.6% capacity remaining, so everything seems fine. The new battery also charges and powers the computer normally. I then tried another know good battery from another Mac, and this battery also tells me that service is recommended, so I believe the issue is on the board somewhere. The board is completely clean and basically looks brand new. I tried putting it in DFU mode and did both T2 firmware revive and restore options and still the same issue. Not sure what I should check next, so any help would be appreciated. \n[ATTACH]60687[\/ATTACH]"
    },
    {
        "post_id":90938,
        "thread_id":62881,
        "title":"820-00850 Battery Service Recommended issue",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-07-11 08:00:03",
        "message":"Such problem was reported when upgrade to Big Sur, or Monterey.\nDid you install original macOS from Internet Recovery?"
    },
    {
        "post_id":90943,
        "thread_id":62881,
        "title":"820-00850 Battery Service Recommended issue",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2022-07-11 09:13:27",
        "message":"I just installed Catalina using internet recovery and the battery shows as normal in Catalina. I then booted using an external drive with Monterey and it now says service recommenced. So it does seem to be something with Monterey, but the same battery works with other macs using Monterey, so it still seem to be something on the board causing the issue."
    },
    {
        "post_id":90949,
        "thread_id":62881,
        "title":"820-00850 Battery Service Recommended issue",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-07-11 10:47:31",
        "message":"Software issue caused by upgrade..."
    }
]