[
    {
        "post_id":71848,
        "thread_id":60805,
        "title":"820-4924 beeping 3 times",
        "user_id":24760,
        "username":"2click",
        "post_date":"2021-02-18 13:22:11",
        "message":"This board had problems on an 3v3 S3 line, that was fixed, it turned on and was beeping 3 times (as when you have a RAM problem). I decieded to reprogram the BIOS and now I get the same 3 beeps but as if it was a problem with the BIOS... it goes up to .410 A but does nothing. Never had a similar problem... please help!"
    },
    {
        "post_id":71853,
        "thread_id":60805,
        "title":"820-4924 beeping 3 times",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-02-18 14:56:12",
        "message":"Not many RAM chips there.\nWorth to reball them."
    },
    {
        "post_id":71868,
        "thread_id":60805,
        "title":"820-4924 beeping 3 times",
        "user_id":24760,
        "username":"2click",
        "post_date":"2021-02-18 19:40:06",
        "message":"Just reballed the ram chips, no change.\nThe 3 beeps have space of around 3 seconds between each. According to me that means BIOS, but the I have tried 3 different bios from vinafix and it is not working... any advice?"
    },
    {
        "post_id":71870,
        "thread_id":60805,
        "title":"820-4924 beeping 3 times",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-02-19 00:45:07",
        "message":"I bet we have some clean ME BIOS posted for that board on the forum.\nIf you cannot find it, try this.\n[URL unfurl=\"true\"]https:\/\/drive.google.com\/file\/d\/18m-YhIlNhX4Uf5njH8KHmRGZelvEXnD_\/view?usp=sharing[\/URL]"
    },
    {
        "post_id":71879,
        "thread_id":60805,
        "title":"820-4924 beeping 3 times",
        "user_id":1057,
        "username":"piernov",
        "post_date":"2021-02-19 04:27:45",
        "message":"What makes you suspect BIOS if you get RAM beeps? It's not impossible but it's much more likely to be something up with RAM power rails (VTT…), RAM reset signal, RAM itself, a random knocked off component (RCOMP or VREF resistors…), CPU or a broken trace\/via for example."
    },
    {
        "post_id":71919,
        "thread_id":60805,
        "title":"820-4924 beeping 3 times",
        "user_id":24760,
        "username":"2click",
        "post_date":"2021-02-19 17:25:58",
        "message":"Pregunta:\nsi inyecto voltaje en P3V3S3_EN puedo dañar algo?\nquitando Q8150 ALL_SYS_PWRGD me daba un voltaje de 1.8V, por lo que inyecte voltaje en las lineas PP5V_S0, tuve que reemplazar U8080 porque se estaba calentando, despues inyecté en PP3V3_S0 y no encontré corto, por último en PP3V3_S3 y se calentaba U8010, retirando U8010 el consumo en la linea desapareció, pero después de cambiarlo seguia teniendo un consumo, por lo que intente inyectar voltaje en P3V3S3_EN, lo cual me llevó a U7820 y PCH ya me había pasado antes y habíamos concluido que el procesador está muerto.\nAhora en este caso, después de hacer todo eso, de nuevo tengo los 3 beeps que indican problemas con memoria Ram, te agradecería me ayudes a encontrarle sentido a este caso.\n\nSaludos"
    },
    {
        "post_id":71920,
        "thread_id":60805,
        "title":"820-4924 beeping 3 times",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-02-19 18:32:47",
        "message":"Compare diode mode reading at DDR power rail with good board.\nReplace RAM chips; if no change, then probably bad CPU..."
    }
]