[
    {
        "post_id":50258,
        "thread_id":50258,
        "title":"820-3435 11\" Air 2013 no keys no trackpad",
        "user_id":1517,
        "username":"jurgenkoppen",
        "post_date":"2019-06-26 17:30:38",
        "message":"This one had endured a tropical rainforest, which fried the display, but was still working on external monitor. I think, if I remember correctly, even keyboard and trackpad worked then on external monitor. So I installed a new LCD, and it boots up fine, except now the keys and trackpad do not respond. All else is fine. Maybe just the cables? Also need to mention that C2837 was corroded and came off. It is part of DP_TBTSNK_ML, Thunderbolt circuit, if I understand correctly. Would that influence the trackpad and keys? The cable looks clean and so do all the contact points on the trackpad and the board..."
    },
    {
        "post_id":50263,
        "thread_id":50258,
        "title":"820-3435 11\" Air 2013 no keys no trackpad",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-06-26 19:38:31",
        "message":"Try new trackpad\/flex first. If no change, check 3v3_S4 and 5 volt line going to the trackpad connector"
    },
    {
        "post_id":50264,
        "thread_id":50258,
        "title":"820-3435 11\" Air 2013 no keys no trackpad",
        "user_id":1517,
        "username":"jurgenkoppen",
        "post_date":"2019-06-26 19:48:50",
        "message":"Thank you John. I will give that a try. Louis has a video where he says that if the MBA keyboard registers before boot chime, ( such as holding options) but not after, that I am basically screwed. He had many of these machines and never resolved it , I guess on a logic board level... So i can hope it is a component like the cable...This machine here also intermittently does not register the mag2 adapter...light on sometimes, but no always"
    },
    {
        "post_id":50283,
        "thread_id":50258,
        "title":"820-3435 11\" Air 2013 no keys no trackpad",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-06-27 06:57:22",
        "message":"The Magsafe light issue points to corrosion.\nYou must check the board and clean it better.\nAlso try known good LIO board\/flex.\n\nTest trackpad\/keyboard disconnecting LIO.\nSee if you can access boot menu."
    },
    {
        "post_id":50289,
        "thread_id":50258,
        "title":"820-3435 11\" Air 2013 no keys no trackpad",
        "user_id":1517,
        "username":"jurgenkoppen",
        "post_date":"2019-06-27 09:09:12",
        "message":"Thank you 2 info, I found a spec of debris in the L\/O cable.Removing it it now keeps the mag light on. When I then disconnected L\/O cable, and started it booted to desktop. Still no keyboard though...and fans running high. I cleaned the ends of the TP\/KB cables and terminals, no cigar..."
    },
    {
        "post_id":50307,
        "thread_id":50258,
        "title":"820-3435 11\" Air 2013 no keys no trackpad",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-06-27 15:13:31",
        "message":"Fan can spin high because of LIO board\/flex too.\nSo TP\/KB not working on OSX, nor in boot menu?"
    },
    {
        "post_id":50316,
        "thread_id":50258,
        "title":"820-3435 11\" Air 2013 no keys no trackpad",
        "user_id":1517,
        "username":"jurgenkoppen",
        "post_date":"2019-06-27 18:45:35",
        "message":"The keys do not work even before the chime anymore, as they did before once when I booted into Safe mode and brought up the boot menu via option. So no KB norTP either way. That is with L\/O connected."
    },
    {
        "post_id":50318,
        "thread_id":50258,
        "title":"820-3435 11\" Air 2013 no keys no trackpad",
        "user_id":1517,
        "username":"jurgenkoppen",
        "post_date":"2019-06-27 19:06:15",
        "message":"And then again, it just now decided to boot for me via command R into recovery via bluetooth keyboard and USB mouse...So some keys must work before chime..."
    },
    {
        "post_id":50324,
        "thread_id":50258,
        "title":"820-3435 11\" Air 2013 no keys no trackpad",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-06-28 06:37:25",
        "message":"In OSX T\/KB work under SPI mode.\nBefore logged in, USB mode is enabled.\nIf file vault is enabled, on password screen USB mode is still available.\nNot working TP\/KB anymore should be bad TP connector\/flex\/board, or missing some voltage to connector..."
    }
]