[
    {
        "post_id":47800,
        "thread_id":47800,
        "title":"820-00165 No green light, No boot- Liquid ingress evident",
        "user_id":1879,
        "username":"RESQ-MYTECH",
        "post_date":"2019-03-26 02:19:25",
        "message":"Hi all. There is a simiar post up in the last 5 hours by [USER=\"1061\"]Don Anton[\/USER]  but I do not wish to hijack his one. However I have a similar problem but with slightly different circumstances..\nAbove mentioned logic board. Corrosion on U5110\/ C5120\/R5127\/C5101\/ C5126 and the area around C7799\/C7712\/C7713\/Q7707. Also Pins 3\/4\/5 on J8300 corroded away. For the interim not worried about the 2nd area but I have changed U5110\/ C5120? R5127\/ C5101\/C5126.\nInitally I had no voltage on PPBUS_G3H and PP3v42_G3H was 3.42v. After changing the 5 components even though I got PPBUS_G3H back @ 8.4v I still have no green led or fan spin.\nAfter reading Don's post I removed U5110 and I get the same result of green LED for about 3-4 secs then to orange, fan spin for about 2 sec before it slows to a stop. I dont get the 1\/4 spin. it full spins for the 2 sec's.\nI have checked C5125 where i have a voltage of 0.058v capacitance of 9uF and 3.369v at both pins on R7100. It does read 0 ohms\n\nI have removed U5110 as did Don and I get the following reading:-\nPin 1 - 3.42v\npin 2 - 0.0v\npin 3 - 0.0v\npin 4 - 0.027v\npin 5 - 3.389v\npin 6 - 0.0v\npin 7 - 3.418v\npin 8 - 0.052v\n\nAny Guidance is gratefully received as usual.\nThanks in advance."
    },
    {
        "post_id":47802,
        "thread_id":47800,
        "title":"820-00165 No green light, No boot- Liquid ingress evident",
        "user_id":1879,
        "username":"RESQ-MYTECH",
        "post_date":"2019-03-26 02:50:07",
        "message":"In addition, the above u5110 readings are with the component removed....\nreadings with the componted in situ are:-\nPin 1 -3.42v\nPin 2 -0.0v\nPin 3 -3.090v\nPin 4 -0.0v\nPin 5 -0.0v\nPin 6 -2.998v\nPin 7 -3.316v\nPin 8 -0.002v\n\n[USER=\"1061\"]Don Anton[\/USER] has now marked his issue as solved and I have just carried out the same test. I do get a 3.42v reading at pin 1 of C5120 and i show no short to ground."
    },
    {
        "post_id":47804,
        "thread_id":47800,
        "title":"820-00165 No green light, No boot- Liquid ingress evident",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-03-26 03:21:26",
        "message":"You must get 3V at pin 8.\nBut should get Magsafe light even without that voltage.\nCheck for short\/low value to ground there.\nMain problem is SMC_LSOC_RST_L stays low in your case.\nCheck it without trackpad connected and remove also C4836."
    },
    {
        "post_id":47815,
        "thread_id":47800,
        "title":"820-00165 No green light, No boot- Liquid ingress evident",
        "user_id":1879,
        "username":"RESQ-MYTECH",
        "post_date":"2019-03-26 05:14:20",
        "message":"Thanks for the quick reply. Def not got 3v at pin 8. track pad is disconnected as logicboard out of the machine. removed C4836. As you know my highly advanced ISO-TECH IDM 505 meter has an issue with reading in diode mode but the crappy meter shows 0010 with c4836 conncted and 0004 with it disconnected. If its any help, with the good meter in continuituy mode which shows ohms on the screen... pin 8 shows 2.3 ohm. in the interest of as much info as possible in resistance mode it shows 0.3 ohms with c4836 disconnected"
    },
    {
        "post_id":47816,
        "thread_id":47800,
        "title":"820-00165 No green light, No boot- Liquid ingress evident",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-03-26 05:31:25",
        "message":"C4836 is not related with pin8.\nRemove U5110 and check if short still present at pin 8.\nIf yes, check C5021 and C5125; you can remove these before U5110..."
    },
    {
        "post_id":47818,
        "thread_id":47800,
        "title":"820-00165 No green light, No boot- Liquid ingress evident",
        "user_id":1879,
        "username":"RESQ-MYTECH",
        "post_date":"2019-03-26 06:24:23",
        "message":"C4836 is replaced. Removed U5110. pin 8 good meter shows O.L is cont mode. In diode it shows -----. cheap meter now shows 558. S just in case I put another ( 3rd one) U5110 back on. both meters show the same as what is in this post, so i suspect the previous U5110 to be iffy. However, still no LED on magsafe. 3 volts does hit pin 8 but falls away rapidly to settle at 1.8v"
    },
    {
        "post_id":47821,
        "thread_id":47800,
        "title":"820-00165 No green light, No boot- Liquid ingress evident",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-03-26 07:43:42",
        "message":"Do you get stable 3V at SMC_RESET_L?\nPins 6 & 7 should have high level always.\nIf AVREF_SMC drops, then remove C5021\/26 too.\nIf still goes down, bad SMC; supposing U5110 is OK now..."
    },
    {
        "post_id":47840,
        "thread_id":47800,
        "title":"820-00165 No green light, No boot- Liquid ingress evident",
        "user_id":1879,
        "username":"RESQ-MYTECH",
        "post_date":"2019-03-27 01:21:23",
        "message":"with U5110 not in situ i get a steady 3v. as soon as u5110 goes back on I get 0.02v on smc_reset_l\nPlease can I confirm the dsignations of the 2 caps you say to remove... I can see C5021 on the board view but not C5026"
    },
    {
        "post_id":47843,
        "thread_id":47800,
        "title":"820-00165 No green light, No boot- Liquid ingress evident",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-03-27 03:28:51",
        "message":"Sorry, is C5126.\nAlso change C5101."
    }
]