[
    {
        "post_id":40760,
        "thread_id":40760,
        "title":"820-2915 GPU VCORE Problem",
        "user_id":64,
        "username":"Dozer",
        "post_date":"2018-10-16 09:33:15",
        "message":"hello, \n\ni have a 2915 with gpu problem. i replacede the gpu, now the picture is ok\n\nand ASD is passing all.\n\nif i start from my ssd in sierra and i start the benchmark software Heaven to test the gpu. i can see it switsching and it is loading and just in the moment it should start the screen goes black.\n\ni replaced already the 3. GPU but nothing is changed.\n\nI measure the PPVCORE_GPU  C8942 Pin 1, usually i Have there 1.12.and afte gpu turn on 0.92V\nNow I have there 1.22V and after turn on 1.02 V\n\nafter the software running \"heaven\" when the screen turn black I read on C8942 Pin1 0V\n\nI replaced already U8900 and measured all resistors around it . found nothing.\n\nneed some help please"
    },
    {
        "post_id":41175,
        "thread_id":40760,
        "title":"820-2915 GPU VCORE Problem",
        "user_id":1539,
        "username":"ThisIsWes:AASP",
        "post_date":"2018-10-25 02:08:25",
        "message":"ASD passing doesn’t mean much more than your system will boot and handle minimal tasks. Wasn’t designed to really stress it. Usually if they can boot into ASD they will pass. \n\nYou probably have the power setting set to low power\/automatically switch between graphics - when using basic tasks it uses the intel graphics and will switch to the AMD when needed (like heaven openGL). \nYou could disable the ‘automatically switch between’ feature but I think we can guess the outcome. \n\nif I understand you correctly, you’ve swapped the GPU 3 times? Chances are something is fried, blown off, or broken traces\/ missing pads under the GPU. \n\nHave you successfully replaced other 2915 GPUs?\nGPU VCORE should drop to 0.9v when the GPU is initialized."
    },
    {
        "post_id":41213,
        "thread_id":40760,
        "title":"820-2915 GPU VCORE Problem",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-10-25 17:28:40",
        "message":"\"usually i Have there 1.12.and afte gpu turn on 0.92V\nNow I have there 1.22V and after turn on 1.02 V\"\nIn both cases the drop reaction is correct.\nYou cannot expect to measure the exact value in every board.\nValue change depending of board, or multimeter used.\nYou will also get different value in the same coil, depending which pin you touch; only one has pure DC voltage!\nImportant is that you detected the correct reaction.\nIf you really want to take such kind of measurements as refference, be sure to always test in the correct coil point.\n\n\"after the software running \"heaven\" when the screen turn black I read on C8942 Pin1 0V\"\nSo GPU crashes under load.\nI think really new chip is no more available. Offer to the client the fixed Intel grapchics, explaining the problem."
    }
]