{"post_id":8311,"thread_id":8311,"title":"[SOLVED]missing PM_SLP_S4_L on 820-2330","user_id":149,"username":"Fizzl92","post_date":"2016-10-20 10:08:22","message":"Hello,\nfirst of all sorry for my bad english ;). I have a Problem with an older 820-2330. It has a green light on the charger but didn´t turn on. I short the pads on R5015 but nothing happens. Than i checked the Powerrails and PPV5_S3 is 0V (everything til there was fine). I followed this path to U7201. Vin of U7201 is 12,6V, Vref is 1,9V, Entrip2 is 0,7V (i guess thats ok) and Entrip1 is 0V. (PP3V3_S3 on right side of U7201 is there) I followed Entrip1 to U7210 and came to the conclusion, that i need PM_SLP_S4_L to get Entrip1 pass U7210. Pin 5 (PM_SLP_S4_L) is 0V. Than i checked if PP1V05_S5_MCP turns the MCP on and it´s reading is 1,1V. U7750 and C7771 seem to be fine to. I can´t see any waterdamage or other visible damage on the board. At this point i don´t know where to look next. It would be realy great if someone could give me an advice what to check next in a case like this. \nBest regards\nFelix"}
{"post_id":8340,"thread_id":8311,"title":"[SOLVED]missing PM_SLP_S4_L on 820-2330","user_id":2,"username":"dukefawks","post_date":"2016-10-20 13:54:04","message":"Doe PM_PWRBTN_L toggle when you short the power pads?\nOh and the obvious one, are you using a REAL GENUINE APPLE 85W charger?"}
{"post_id":8373,"thread_id":8311,"title":"[SOLVED]missing PM_SLP_S4_L on 820-2330","user_id":149,"username":"Fizzl92","post_date":"2016-10-21 01:44:57","message":"Thank you for your fast reply! I´ll check this on monday and let you know. Charger should be original. I have 3 different, i´ll check that also"}
{"post_id":8518,"thread_id":8311,"title":"[SOLVED]missing PM_SLP_S4_L on 820-2330","user_id":149,"username":"Fizzl92","post_date":"2016-10-24 04:22:03","message":"Hello,\nthe charger is original apple. I don´t know why but in the moment as i was measuring and shorting the pads at the same time PM_PWRBTN_L droped from 3,4V to 0V and the board srarts to spin the fans and seems to work normally. I shorted the pads many times bevore and noting happend so i have no idea wat fixes it. Is this commom failure and will it have this problem again in near future?\nThank you very much for your help\nFelix"}
{"post_id":8519,"thread_id":8311,"title":"[SOLVED]missing PM_SLP_S4_L on 820-2330","user_id":2,"username":"dukefawks","post_date":"2016-10-24 04:48:45","message":"Replace C7771 to be sure that it will not fail again."}
{"post_id":8737,"thread_id":8311,"title":"[SOLVED]missing PM_SLP_S4_L on 820-2330","user_id":149,"username":"Fizzl92","post_date":"2016-10-27 10:34:14","message":"I replaced C7771. Thank you for your help!"}
