[
    {
        "post_id":48529,
        "thread_id":48529,
        "title":"Samsung 512GB 16+12 SSD with possible rail short, need GND pad verification",
        "user_id":1524,
        "username":"Paul Daniels",
        "post_date":"2019-04-21 03:10:36",
        "message":"While I don't like my chances, for once in my life I've encountered a SSD with an actual shorted rail of sorts (about 0.2R).\n\nIt's a Samsung 512GB 16+12 SSD (A1466\/A1502\/A1398 2013+ type). If it was a normal PC type SSD, even at 512GB, I'd just walk away but these ones are possibly worth trying to fix, especially given it appears to be \"just a short\" (famous last words).\n\nIn the pictures, the green marked caps are all seemingly on the same shorted rail.\n\nI have removed two (seeming) input decoupling caps (22uF each) in the hope one of them was going to be shorted, as one did have visual defects but alas, it was not at fault).\n\nAttached is a picture of what I'm trying to work out ( which side is ground;  *strongly suspecting* pads closest to the connector are the GND side but I'd prefer that to be confirmed before I do anything daft )\n\nNone of the caps get warm\/hot during operation, so I'm suspecting the power gets cut off before it gets anywhere. Am planning on putting perhaps 0.3~0.5V in one this rail and see if anything gets warm. Unsure what the voltage limit would be (though obviously with the short it won't get very far).\n\nRegards,\nPaul."
    },
    {
        "post_id":48534,
        "thread_id":48529,
        "title":"Samsung 512GB 16+12 SSD with possible rail short, need GND pad verification",
        "user_id":1524,
        "username":"Paul Daniels",
        "post_date":"2019-04-21 19:05:50",
        "message":"EDIT: Fresh morning, good lighting, worked out that the left-hand side of the pads in the 3rd picture are GND. Applied 0.5V to the pads @ 2A max and found the culprit as circled in the picture attached.\n\nReplaced it with a 4u7 10V 0402 cap as a 'overall precaution', would be interesting to find out what the proper value should be\n\n[ATTACH alt=\"Click image for larger version  Name:\timage3279.png Views:\t0 Size:\t832.1 KB ID:\t48537\" type=\"full\" width=\"30%\"]48537._xfImport[\/ATTACH]"
    }
]