{"post_id":22489,"thread_id":22489,"title":"820-3437 powers on no video","user_id":451,"username":"jgraffis","post_date":"2017-07-03 14:30:44","message":"I'm working on a 820-3437 that powers on no video on internal or external. It does a PRAM reset but does not chime, it also does an SMC rest.\n\ncustomer states that they plugged a usb drive in and the machine shut off. i could not find liquid damage either.\n\ni checked u8300 and had no voltage on pin 4-5 check to find I'm also missing voltage on pin1. pin 2-3 have 3.3v. r1431 resistance to ground is 0.527.ppvcomp_so_cpu is 1.0v on pin 1 of r0530 pin 2 was .442v. \n\nseems like u0500 is not working fully. Any ideas?"}
{"post_id":22501,"thread_id":22489,"title":"820-3437 powers on no video","user_id":2,"username":"dukefawks","post_date":"2017-07-03 16:56:19","message":"How do you know it does a PRAM reset? Disconnect IO board flat cable to rule out an IO board issue. It will power on without green\/orange light. There will of course be no chime as all audio is on the IO board."}
{"post_id":22507,"thread_id":22489,"title":"820-3437 powers on no video","user_id":451,"username":"jgraffis","post_date":"2017-07-03 17:30:31","message":"I'm guessing on the pram reset as the machine will turn off then back on while holding the keys down. maybe its not actually doing the reset or not fully? just reporting info. i changed the io board out powers on and runs no video with or without the io cable attached."}
{"post_id":22509,"thread_id":22489,"title":"820-3437 powers on no video","user_id":2,"username":"dukefawks","post_date":"2017-07-03 17:38:43","message":"Use a known good IO board and cable and see if the chime comes back. Measure data lines of both USB ports on diode mode."}
{"post_id":22510,"thread_id":22489,"title":"820-3437 powers on no video","user_id":451,"username":"jgraffis","post_date":"2017-07-03 19:33:54","message":"Does same thing with tested IO board and cable. power on. no chime\n\non j4600 in diode mode\npin 1 0.456\npin 2 0L\npin 3 0L\npin 5 0.629\npin 6 0.627\npin 8 0.328\npin 9 0.328\n\non j9500 in diode mode\npin 3 0.435\npin 6 0L\npin 8 0L\npin 23 0.447\npin 36 0.374\npin 38 0.374\npin 44 0.323\npin 42 0.323"}
{"post_id":22512,"thread_id":22489,"title":"820-3437 powers on no video","user_id":515,"username":"SMMRepair","post_date":"2017-07-03 20:52:48","message":"Try a new WiFi board, just in case. If the WiFi board was liquid-damaged, it can cause this sort of issue. Had 2 several weeks back that powered on to backlight, but no chime or video data, and turned out the wifi card had an issue. Extremely minor corrosion (literally 1 burned\/corroded cap), but enough to cause that issue (probably pulling a 5v rail down or something)."}
{"post_id":22604,"thread_id":22489,"title":"820-3437 powers on no video","user_id":451,"username":"jgraffis","post_date":"2017-07-05 12:23:28","message":"removed wifi card, no change."}
{"post_id":22614,"thread_id":22489,"title":"820-3437 powers on no video","user_id":2,"username":"dukefawks","post_date":"2017-07-05 20:46:53","message":"I have no idea, if this really happened while connecting a USB device I would look there. Measure both data pins on diode mode on both ports."}
{"post_id":22638,"thread_id":22489,"title":"820-3437 powers on no video","user_id":451,"username":"jgraffis","post_date":"2017-07-06 15:53:02","message":"its kind of a tough one. i didn't find any short to ground on the usb ports and from what i can tell they both work when i plug in an external with a light on. i am missing EDP_PANEL_PWR. Which makes me thins something is going on with the processor or a component in that line. but didn't think that would make it not chime."}
{"post_id":22652,"thread_id":22489,"title":"820-3437 powers on no video","user_id":2,"username":"dukefawks","post_date":"2017-07-06 21:14:07","message":"Chime is the first thing you need so you know the board is finishing POST. If you connect a USB HDD can you see activity that it boots from it?"}
{"post_id":22692,"thread_id":22489,"title":"820-3437 powers on no video","user_id":451,"username":"jgraffis","post_date":"2017-07-07 15:59:50","message":"with usb hdd i do get a solid light, but not any activity like it flashing. Which it normally should do. So i don't believe that it is passing post. I'm not real familiar with the power rails required for post, but it is getting at least some what there as i have the S0 rail working. not sure but don't think that if the surge came from a device that got connected it would cause this. Seems more like the machine didn't like have anything connected to the usb port. i was kinda expecting one of those customers that claims no liquid dmg but really did spill some thing on it, but the board is clean."}
{"post_id":22704,"thread_id":22489,"title":"820-3437 powers on no video","user_id":2,"username":"dukefawks","post_date":"2017-07-07 19:05:22","message":"If CPU Vcore is present then probably the CPU\/PCH got fried when plugging in the USB device."}
{"post_id":22709,"thread_id":22489,"title":"820-3437 powers on no video","user_id":451,"username":"jgraffis","post_date":"2017-07-07 19:19:53","message":"I've got 1.7v on C109B pad 1. so I'm guessing bad PCH. confirm?"}
{"post_id":22732,"thread_id":22489,"title":"820-3437 powers on no video","user_id":2,"username":"dukefawks","post_date":"2017-07-08 18:36:00","message":"I have no other ideas then the USB connecting killed the PCH."}
{"post_id":22784,"thread_id":22489,"title":"820-3437 powers on no video","user_id":451,"username":"jgraffis","post_date":"2017-07-10 13:32:45","message":"I'm thinking the same thing. thanks for the help. looks like i got a new donor board."}
