{"post_id":94376,"thread_id":63325,"title":"820-01041-A PFM006 PPN001 error code","user_id":32539,"username":"waterchill","post_date":"2022-11-28 07:38:24","message":"So I have here this macbook pro 15\" A1990 which produces this error codes in the diagnose mode. The fans are spinning high and the macbook is very slow. What I read about this error, that changing the touch pad will solve this. So I put this mainboard in an second functional macbook and the error is exactly the same. I have installed the TG Pro software and I'm missing the point \"palm rest\". It looks like there is a failure on the mainboard not on the externals. Any solution for this? Does it make sense to change the smc or is it possible to change this? I don't know maybe it is locked with a serial number or so. Thanks"}
{"post_id":94381,"thread_id":63325,"title":"820-01041-A PFM006 PPN001 error code","user_id":682,"username":"2informaticos","post_date":"2022-11-28 11:00:40","message":"SMC functions are included in T2; so no way to change SMC.\n\nAny history available?\nDid you use different trackpad flex for test in the other shell?\nAlso, battery was different too?\n\nTest with external monitor, disconnecting internal LCD.\nThis way you can discard an ALS failure."}
{"post_id":94393,"thread_id":63325,"title":"820-01041-A PFM006 PPN001 error code","user_id":32539,"username":"waterchill","post_date":"2022-11-29 03:33:51","message":"Thanks for replay. There is no really history, over night this error appeared. Nothing special, no water, no drop. I changed the board 1:1 in other shell so battery, display touch pad and all other things were different. Today I have disconnected the display and conected to external monitor. Same issue. By the way what is ALS failure?"}
{"post_id":94394,"thread_id":63325,"title":"820-01041-A PFM006 PPN001 error code","user_id":682,"username":"2informaticos","post_date":"2022-11-29 04:22:24","message":"Ambient Light Sensor (when fails) is known to cause weird issues to various thermal sensors.\n\nIf trackpad and ALS have been discarded, check SMC I2C \"2\" S0 bus (page 51); diode mode to ground and voltage.\nInspect all chips and adjacent components involved on this bus.\nAlso check U6861 and related resistors."}
