[
    {
        "post_id":78278,
        "thread_id":61503,
        "title":"Macbook Serial issues 820-01949",
        "user_id":27167,
        "username":"drmacbookth",
        "post_date":"2021-07-31 03:38:52",
        "message":"Hi guys, I have a weird one. Macbook came in with liquid damage and as always we register it with the serial number on the bottom plate which showed:   MacBook Pro (13-inch, 2020, Four Thunderbolt 3 ports) \n\nWe changed a charge port and power button that didnt work as well. We informed the customer the fingerprint will not work. One issue is, after we login it shows a different serial number and 2018 instead 2020 so customer says we have changed the board. Board was not changed, luckily we have proof in the form of pre-repair pics that show liquid in exact the same spot. Question, does changing the power button also change the serial number. Any insight in how this works?\n\nThanks!"
    },
    {
        "post_id":78285,
        "thread_id":61503,
        "title":"Macbook Serial issues 820-01949",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-07-31 09:50:24",
        "message":"A basic rule on the forum is to post 820-xxxxx code.\nCheck if actual board correspond with machine model."
    },
    {
        "post_id":78339,
        "thread_id":61503,
        "title":"Macbook Serial issues 820-01949",
        "user_id":27167,
        "username":"drmacbookth",
        "post_date":"2021-08-02 03:37:21",
        "message":"I did not have the board at hand, that's why I have not mentioned the model, but it is 820-01949. I am 100% sure this was what was brought in as exactly the same pin on the charge port is corroded, I made a pictures of it. So the discussion is not if this is the correct board. Its a 820-01949 2020 model, the housing matches it has a physical ESC key which 2018 does not have. Only in the software \"about this Mac\" the serial number does not correspond with the bottom plate and states 2018 not 2020. Board specs are 2020 model. So I cannot explain the customer how the serial number \"changed\". He did bring it to Apple before coming to us and when he brought it in I only registered the bottoms serial which showed 2020 mac pro. We have changed the charge port, power button and reinstalled the software. Now I have no clue why software says different serial and 2018 and customer thinks we \"did something\" to his board that by the way Apple said could not be repaired...... ?‍♂️. I was wondering if a change of fingerprint button from a 2018 Mac could cause this (although I ordered a 2020 button from china)."
    },
    {
        "post_id":78340,
        "thread_id":61503,
        "title":"Macbook Serial issues 820-01949",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-08-02 03:48:26",
        "message":"Serial number is wrote onn the SoC ROM (U4770).\n00850 is the closest schematic\/boardview available.\nIf that chip is untouched, then board has its original serial number."
    },
    {
        "post_id":78366,
        "thread_id":61503,
        "title":"Macbook Serial issues 820-01949",
        "user_id":27167,
        "username":"drmacbookth",
        "post_date":"2021-08-02 21:38:59",
        "message":"Was the 820-01949 available with 2018 year? I just dont get how it can show its a 2018 mac for this board number. I do get you can reprogram the chip, but i dont even know how to do that."
    }
]