[
    {
        "post_id":22440,
        "thread_id":22440,
        "title":"2011 iMac 27\" 6970M solution",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-07-02 14:23:10",
        "message":"I think by now we can give up all hope of ever seeing 216-0811000 becoming available at sensible prices. I have already posted this solution elsewhere, but since I have made some updates and thought I should put it here on the forum.\nThis involves swapping the GPU for a 215-0798006 and flashing the ROM with my modified VBIOS. The 0798000 and 0798006 are available and there are even 1649 date code 0798006 to be found. There are 2 VBIOSes, one for the 1GB models and one for 2GB. You should flash the ROM on an external programmer, it may be possible with some flash utility in OSX, but I will not figure that out for you.\nYou should also make a modification to the ODD thermal sensor. The modified VBIOS does not throttle the GPU and it runs hotter than the original chip. Apple did not implement the thermal diode on the GPU to ramp up the ODD fan. You have to move the ODD thermal sensor to the GPU heat sink as can be seen in the picture. It can be clamped between the heat sink and the bracket. I attach it wit some thin double sided tape to the heat sink and a piece of tape on the top to prevent shorting out to the bracket. Place it exactly as in the picture, this will give a balanced result of fan noise and heat.\n\nThis solution works fine is OSX and the card is still reported as a 6970M. If in a rare case someone is running windows you may have to mess with the .INF files of the driver to make it recognized as an HD6870.\n\nIf anyone is going to try this let me know how it works for you."
    },
    {
        "post_id":22449,
        "thread_id":22440,
        "title":"2011 iMac 27\" 6970M solution",
        "user_id":461,
        "username":"Gurmon",
        "post_date":"2017-07-02 21:47:30",
        "message":"I got +60 of these out there now. With zero comebacks. \n\nLately I've been reballing 215-07980006 chips to leaded before soldering. Getting better results with the chip sitting flat on the card, otherwise was difficult getting the corner balls to melt.\n\nOne thing to point out diagnostics indicate a missing GPU die temp sensor signal. However doesn't seem to affect the way the machine runs. \n\nThanks for this Duke...."
    },
    {
        "post_id":22456,
        "thread_id":22440,
        "title":"2011 iMac 27\" 6970M solution",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-07-03 06:25:19",
        "message":"There is indeed no thermal diode in the 215 chips on the pins where there is one in the 216 part. Let me see if I can come up with a hack to make the die temperature at least report something. This may also solve the throttling issue so I can enable that again in the VBIOS. This will probably involve cutting a few traces and running some wires.\n\nAlso screw you ATi, there is no reason to change something like this between 215 and 216 chips :("
    },
    {
        "post_id":22463,
        "thread_id":22440,
        "title":"2011 iMac 27\" 6970M solution",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-07-03 09:14:14",
        "message":"Both EFI and OS 3S145 report no missing sensors here. I can see there must be an issue with die GPU die sensor, but which diagnostic is finding the fault?"
    },
    {
        "post_id":22471,
        "thread_id":22440,
        "title":"2011 iMac 27\" 6970M solution",
        "user_id":461,
        "username":"Gurmon",
        "post_date":"2017-07-03 10:59:11",
        "message":"MRI is reporting these missing sensors.\n\nIm doing another iMac tomorrow, so will take pictures and PM you those.\n\nDo you have AST server setup ?"
    },
    {
        "post_id":22505,
        "thread_id":22440,
        "title":"2011 iMac 27\" 6970M solution",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-07-03 15:05:35",
        "message":"So it seems like the SMC is not measuring anything related to the MXM card. No voltage, no current and no temperature. I can only conclude that the system needs to see a supported GPU for it to enable those sensors. Since the DEVID needs to be changed for the 215 chips to work there is nothing I can do about this with regards to the video card. The ODD sensor modification is the best solution at the present moment to at least have some thermal control.\n\nIf anyone at Apple wants to \"share\" the SMC source code I'd be grateful!  Without the SMC source this sensor issue is not going to be solved."
    },
    {
        "post_id":23387,
        "thread_id":22440,
        "title":"2011 iMac 27\" 6970M solution",
        "user_id":64,
        "username":"Dozer",
        "post_date":"2017-07-24 08:09:41",
        "message":"No Title\n\nI tryed that, thank you duke for your great work!\n\nin fancontrol there is a GPU diode to see"
    },
    {
        "post_id":23392,
        "thread_id":22440,
        "title":"2011 iMac 27\" 6970M solution",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-07-24 08:29:17",
        "message":"Yes fan control sees them but the SMC does not use them as the DEVID of the GPU is wrong."
    },
    {
        "post_id":25487,
        "thread_id":22440,
        "title":"2011 iMac 27\" 6970M solution",
        "user_id":64,
        "username":"Dozer",
        "post_date":"2017-09-18 07:48:29",
        "message":"i tryed that solution already many times. working realy good.\n\nnow i get back a not working card.\n\ni looked up the card and the gpu, the side near the pcie contacts, is pressed down until the board. i thought that is a random thing, but now i got back already the 4.! with a pressed down gpu on that side.\n\nwhat i do wrong? is it possible that the gpu is running that hot ?"
    },
    {
        "post_id":25500,
        "thread_id":22440,
        "title":"2011 iMac 27\" 6970M solution",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-09-18 09:12:56",
        "message":"Did you modify the thermal sensor like I showed in the picture?"
    },
    {
        "post_id":25551,
        "thread_id":22440,
        "title":"2011 iMac 27\" 6970M solution",
        "user_id":64,
        "username":"Dozer",
        "post_date":"2017-09-19 04:48:44",
        "message":"usually yes.\n\nbut this are cards from a shop, they put it in the case themself. can that be the problem?"
    },
    {
        "post_id":25563,
        "thread_id":22440,
        "title":"2011 iMac 27\" 6970M solution",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-09-19 05:50:41",
        "message":"Of course that is the problem......do you think I do that modification for fun?\n\nAlso stick the sensor to the back of the card on the heat sink next to where the original sensor is, that is the best location. Make sure it can't fall off!!!!"
    },
    {
        "post_id":26298,
        "thread_id":22440,
        "title":"2011 iMac 27\" 6970M solution",
        "user_id":145,
        "username":"Sykulski",
        "post_date":"2017-10-03 09:52:46",
        "message":"I’ve used this method with success already many times. But now I got a case where customer is using Windows Bootcamp. After the GPU replacement the computer hangs in boot loader immediately after choosing the Windows partition to boot. A Google search let me know it is because of the edited firmware on the graphics card that causes this issue. \n\nIs there a way to get it to boot into the customers Windows system or do we need to re-install Windows Bootcamp all together?\n\nThanks"
    },
    {
        "post_id":26321,
        "thread_id":22440,
        "title":"2011 iMac 27\" 6970M solution",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-10-03 14:38:00",
        "message":"I do not support bootcamp. In theory it should work and just boot up with the generic VGA driver. I guess bootcamp got fucked up somehow."
    },
    {
        "post_id":38333,
        "thread_id":22440,
        "title":"2011 iMac 27\" 6970M solution",
        "user_id":1186,
        "username":"Salvatore951",
        "post_date":"2018-08-13 01:12:13",
        "message":"how can I update rom with this gpu? Can someone explain me procedure, please?"
    },
    {
        "post_id":38338,
        "thread_id":22440,
        "title":"2011 iMac 27\" 6970M solution",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-08-13 03:21:58",
        "message":"\"You should flash the ROM on an external programmer\"\n\nLike any normal BIOS chip. Remove it and plug it into programmer, like TL866, etc..."
    },
    {
        "post_id":38665,
        "thread_id":22440,
        "title":"2011 iMac 27\" 6970M solution",
        "user_id":1186,
        "username":"Salvatore951",
        "post_date":"2018-08-21 08:17:54",
        "message":"i am using TL866, but it doesn't detect memory model and it reads a blank file. I tried all position, pin with a small circle in the corner should be pin 1. Please can someone explain me how to flash rom with this video card, I have no experience with Gpu rom."
    }
]