[
    {
        "post_id":46548,
        "thread_id":46548,
        "title":"820-00165, Brief Fan Spin, Green\/Orange Light, Liquid",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2019-02-21 09:45:13",
        "message":"Working on a frustrating 820-00165 board with symptoms that are...not ideal:\n\n1. Board powers briefly and all rails (ALL_SYS_PWRGD & VCORE included) pulse for <1 second.\n2. Brief fan spin accompanies power pulse, then nothing. Fan stops, all rails after S5 drop completely (S5 rails remain present\/steady), no power.\n3. No shorts found; VRTC present.\n4. Tried a known-good (bootable) generic BIOS and no change. I use this BIOS to test with all 00165 boards with similar symptoms, so the BIOS is good. Didn't work, so replaced original BIOS.\n5. U1950 very clean, tried another to be sure, no change.\n6. There was one tiny spot of liquid to U5110, so I replaced it even though all pins measured properly on the old U5110.\n7. I suspected SMC at first (due to liquid to U5110), but since all my rails pulse, and my S5_PWRGD (SMC_PM_G2_EN, etc) remains when all other rails drop out, and ppbus is proper, I don't think the SMC is the culprit. Someone please correct me if I'm wrong in this assumption.\n8. I did test board with battery connected, as I've seen some people claim the 00165 sometimes needs battery connected (have never, ever experienced this, but tried it anyway).\n9. Since the board does not cycle (it powers for split second, then off), I'd more suspect an issue with a reset_L signal possibly, instead of a shorted rail. I'd suspect a cycling symptom if the issue was a short.\n\nI'm out of ideas. The brief pulse gives me hope the CPU isn't dead, but I'm wondering if the PCH is bad. No liquid to VRTC area or SPI area at all. Checked typical U6100\/area for any signs if damage, but nothing. Strongly leaning towards PCH on this one...but hope I'm wrong! :)\n\nAny help appreciated."
    },
    {
        "post_id":46551,
        "thread_id":46548,
        "title":"820-00165, Brief Fan Spin, Green\/Orange Light, Liquid",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-02-21 09:49:41",
        "message":"If you had liquid near U5110, possible liquid on JTAG have you removed it? When it pulses does the charger light go from green to orange? I suspect also possible crap under the SMC that needs to be washed out."
    },
    {
        "post_id":46556,
        "thread_id":46548,
        "title":"820-00165, Brief Fan Spin, Green\/Orange Light, Liquid",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2019-02-21 10:26:44",
        "message":"JTAG is fine, no liquid near it, but removed just for the hell of it and no change. Charger light constant, no crap under SMC. Confident the issue isn't the SMC, but went ahead and replaced it to eliminate, and no change. Exact same behavior.\n\nSuspecting PCH at this point. I also noted that PL_RESET_L is 0v and PM_SYSRST_L is .05v. I do believe PM_SYSRST_L should be 3.3v, but unsure if this results from 3v3_s0, which is missing anyway. SMC puts out PM_SYSRST_L, but since we've eliminated SMC, I'd suspecting U0500 at this point. Not going to spend too much more time on this one, since symptoms are so atypical.\n\nAny other final ideas appreciated!"
    },
    {
        "post_id":46566,
        "thread_id":46548,
        "title":"820-00165, Brief Fan Spin, Green\/Orange Light, Liquid",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-02-21 12:25:43",
        "message":"Does pins 7 & 3 of U1950 go high when you get voltages on the board?\nDid you try to start in SMC bypass mode?\n\nAlso try the board alone, without LIO flex; keep only 5 pins DC cable connected.\nIt still should start when charger connected; no green light, of course.\nBe sure to use original 60\/85W Magsafe 2 charger; NO adapter 1-->2!!!"
    },
    {
        "post_id":46815,
        "thread_id":46548,
        "title":"820-00165, Brief Fan Spin, Green\/Orange Light, Liquid",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2019-02-27 13:19:34",
        "message":"Thanks for the help as always. Tried all of that--no DC-In cable, etc. SMC bypass does nothing. We always use 85W Magsafe2 charger. You can assume it won't be an \"obvious\" or simple thing like wrong charger or JTAG...we know to check all of this. I just want to prevent the preliminary back-and-forth posts about the basic things and get into the meat of the issue.\n\nPins 3\/7 pulse as well; as mention, ALL signals (including ALL_SYS) pulse immediately, then drop. Everything after SUS disappears immediately after the pulse. Fan spins for a split second, then nothing.\n\nCan you explain why PL_RESET_L and PM_SYSRST_L are both low? Wouldn't this result in the board being reset constantly (and thus no power)? Thanks in advance."
    },
    {
        "post_id":46831,
        "thread_id":46548,
        "title":"820-00165, Brief Fan Spin, Green\/Orange Light, Liquid",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-02-28 04:01:21",
        "message":"The mentioned reset signals should appear after power on sequence is complete.\nMissing them is not a reason to reset the board.\nSMC pulls down PM_SYSRST_L because of a power issue, or PCH is bad and kills that signal.\nCheck first C1806.\n\nPLT_RESET_L will appear later, to initialize the platform blocks.\n\nLiquid spill could affected some data lines for PCH\/CPU and there is no measurment to denote this 100%.\nAfter changing SMC, PCH remains as suspect.\nBut one corroded resistor could be the issue too."
    },
    {
        "post_id":46840,
        "thread_id":46548,
        "title":"820-00165, Brief Fan Spin, Green\/Orange Light, Liquid",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2019-02-28 08:09:38",
        "message":"Thanks so much. Yes, that's what I figured. I've combed over the board extremely thoroughly and things are \"beautiful\"--no damage at all. I honestly don't even think the liquid contacted\/damaged U5110 originally, but I did note a tiny drop there so replaced anyway (despite U5110 signals all proper).\n\nI will check C1806\/area well and confirm. I do suspect issue is PCH on this one; I haven't had good luck at all with boards that have rails missing beyond the SUS rails. Very often ends up being a dead PCH\/CPU on these. Thanks so much for the help, I really appreciate it."
    }
]