[
    {
        "post_id":25921,
        "thread_id":25921,
        "title":"MBP 15\" 2015 - 820-00163 Graphic issues only with the integrated Iris GPU",
        "user_id":680,
        "username":"phuketmymac",
        "post_date":"2017-09-26 09:19:08",
        "message":"Hello,\n\nThat board was messed up by an Indian shop which I will keep the name secret.\nThe issue is it has graphical glitches when you are not moving the mouse, and that only when using the integrated GPU, Iris.\n\nPlease check the video I've made : [URL]https:\/\/youtu.be\/OOYrZO6wDvA[\/URL]\n\nBoard has been reworked near the Mux chip and AMD GPU but not that bad.\n\nAny idea on what could cause that please?"
    },
    {
        "post_id":25944,
        "thread_id":25921,
        "title":"MBP 15\" 2015 - 820-00163 Graphic issues only with the integrated Iris GPU",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-09-26 16:20:15",
        "message":"That is a bad CPU."
    },
    {
        "post_id":25957,
        "thread_id":25921,
        "title":"MBP 15\" 2015 - 820-00163 Graphic issues only with the integrated Iris GPU",
        "user_id":680,
        "username":"phuketmymac",
        "post_date":"2017-09-26 21:06:54",
        "message":"Sad news to start the day... ;-)\n\nI need to ask... you are absolutely sure of that or that's just a guess?"
    },
    {
        "post_id":26014,
        "thread_id":25921,
        "title":"MBP 15\" 2015 - 820-00163 Graphic issues only with the integrated Iris GPU",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-09-27 17:55:51",
        "message":"Nothing is 100% sure, but Intel video is generated in the CPU. Maybe maybe maybe it could be a MUX issue but I highly doubt it."
    },
    {
        "post_id":30389,
        "thread_id":25921,
        "title":"MBP 15\" 2015 - 820-00163 Graphic issues only with the integrated Iris GPU",
        "user_id":680,
        "username":"phuketmymac",
        "post_date":"2018-01-13 20:32:10",
        "message":"I've just realized by going back on that board that one chip U8310 was ripped off the board (related to the TCON circuitry). I've also noticed that some resistors near the screen connector were reworked (also related to the TCON circuitry).\nSo basically they've tried to fix TCON and remove the U8310 chip since they couldn't do it (I guess).\n\nI've put back U8310 and cleaned the area around the connector but I do sometimes get a partial picture (seems related to a non functionning TCON circuitry)\n\nI will try working on that.\n\nThough... before I start wasting my time on fixing TCON, could what you've saw on the video be related to TCON or it is just another issue?\n\nThanks."
    },
    {
        "post_id":30394,
        "thread_id":25921,
        "title":"MBP 15\" 2015 - 820-00163 Graphic issues only with the integrated Iris GPU",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-01-14 17:01:42",
        "message":"I really am not sure if it would affect the LCD image like that. I guess it is possible. I guess bridging U8310 to put 3V directly to the LCD should be ok for testing. But there is not that much to this whole circuit so fixing it properly is not that much work. Certainly worth a try, but no guarantees."
    }
]