[
    {
        "post_id":42699,
        "thread_id":42699,
        "title":"SSD doesn't work anymore (after I tried upgrading it)",
        "user_id":2090,
        "username":"feklee",
        "post_date":"2018-12-01 03:34:20",
        "message":"The machine is a MacBook Pro 13\" late 2012 (Model: A1425, Order: MD212). I tried upgrading the original 128GB SSD with a 500GB Samsung 860 EVO connected with an mSATA adapter (NewFrog product ID [URL=\"https:\/\/www.newfrog.com\/product\/high-quality-msata-ssd-adapter-for-apple-retina-79094\"]79094[\/URL]). Issue:\n\n[I]The MacBook did not boot from the new Samsung SSD. After swapping back in the original SSD it doesn’t boot either.[\/I]\n\nFortunately:\n\n[I]The machine can still be booted via USB from the Samsung SSD in a USB-SSD adapter: Prior to the upgrade, I copied the entire system over using Carbon Copy Cloner.[\/I]\n\nDetails:\n[LIST]\n[*]I created a Time Machine backup. So in case both SSDs fail, at least no data is lost.\n[*]I precisely followed instructions from a YouTube video: [URL=\"https:\/\/www.youtube.com\/watch?v=jYbwdcLr0gg\"]How to Upgrade the SSD in a 13-inch MacBook Pro w\/ Retina display (Late 2012–Early 2013) UPDATED[\/URL]\n[*]During the process I opened and closed the machine several times.\n[*]Every time, before touching the SSD assembly, I made sure that the battery is disconnected. In fact I put a piece of paper in between the battery connector and its receptacle.\n[*]I carefully unplugged the fragile SSD connector using one of my finger nails.\n[*]I avoided bending the cables, being fully aware that they’re fragile.\n[*]The first time that I put the Samsung SSD into the adapter, I didn’t push it all the way in. (to my excuse: the adapter is simply too short)\n[*]I always made sure that I was grounded.\n[*]I’m in Berlin, Germany.\n[*]If further diagnosis is needed: I do own a multimeter as well as a Hantek 6022BE USB scope.\n[*]It’s the MacBook of my girlfriend. I’m a ThinkPad user since 2000 (only briefly owned the first Unibody MacBook Pro 15\", bought in late 2008).\n[\/LIST]\n\nMy thoughts:\n[LIST]\n[*]I read that the SSD cables in MacBooks are notoriously fragile. Possibly, the first thing to try is replacing the SSD cable (AFAIK 821-1506-B).\n[*]In the worst case, when the Samsung SSD was not pushed into the adapter, a short was caused. Here I wouldn’t know what to do or how to diagnose the issue.\n[\/LIST]\n\n[I]Any suggestions?[\/I]"
    },
    {
        "post_id":42701,
        "thread_id":42699,
        "title":"SSD doesn't work anymore (after I tried upgrading it)",
        "user_id":2090,
        "username":"feklee",
        "post_date":"2018-12-01 03:40:35",
        "message":"No Title\n\nPhotos of the first three times that I opened the machine. Afterwards, I put back in the original SSD, which – as mentioned – doesn’t work anymore as well. In fact, it is not detected after booting via USB."
    },
    {
        "post_id":42712,
        "thread_id":42699,
        "title":"SSD doesn't work anymore (after I tried upgrading it)",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-12-01 04:05:31",
        "message":"You will need schematic and boardview of 820-3462 MLB.\nThen need to measure around J4500 (SATA connector):\n\nLook for power rails first, PP3V3_S0_SSD_FLT and PP5V_S0_HDD_FLT."
    },
    {
        "post_id":42719,
        "thread_id":42699,
        "title":"SSD doesn't work anymore (after I tried upgrading it)",
        "user_id":2090,
        "username":"feklee",
        "post_date":"2018-12-01 06:01:38",
        "message":"Thanks for your suggestions! I ordered a replacement cable now. Hope this does the trick."
    }
]