[
    {
        "post_id":68320,
        "thread_id":60388,
        "title":"820-00923 possible graphics issues",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-11-25 06:42:46",
        "message":"Hello. I have a 820-00923 board that is liquid damaged. The liquid spill seems to have only affected the side of the board with J4402 on it. J4402 was badly damaged and so was the flex cable for the touchbar. I have removed the damaged J4402 from the board for now, and the computer turns on but I am also having some kind of issue with the image\/graphics. Once the computer boots, its seems to be a little slow or the graphics are choppy. Also, the dock and the top menu bar have a white background instead of the usual transparent background. It is as if the \"Reduce transparency\" option is enabled in Accessibility settings, but I checked and it is not. I went to Youtube and it lets me play a video fine, but it did crash on me once while trying to load a video. I have tried a PRAM reset but it did not help. I have ran apple diagnostics and it reports no issues found. I cannot find any other signs of damage on the board beside the damage to J4402. Any idea what might cause these symptoms?"
    },
    {
        "post_id":68360,
        "thread_id":60388,
        "title":"820-00923 possible graphics issues",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-11-25 15:28:18",
        "message":"Disconnect internal LCD and test with external monitor."
    },
    {
        "post_id":68378,
        "thread_id":60388,
        "title":"820-00923 possible graphics issues",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-11-25 21:35:55",
        "message":"Same issue with just a external monitor attached."
    },
    {
        "post_id":68387,
        "thread_id":60388,
        "title":"820-00923 possible graphics issues",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-11-26 01:49:03",
        "message":"Then must be CPU, or RAM issue.\nYou can try to reflow\/reball RAM chips."
    },
    {
        "post_id":68590,
        "thread_id":60388,
        "title":"820-00923 possible graphics issues",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-12-01 07:42:58",
        "message":"Well I ran a ram test and it passed so I am not really convinced it’s a ram issue. I tried to erase the disk and reinstall MacOS but that did not seem to help. The computer just seems to be running slow and lagging, and its sometimes will completely freeze up and then send me back to the login screen. I checked HWmonitor and all the temps seem normal. I ran etreCheck and it tells me there is a runaway process. I checked activity monitor and the “WindowsServer” process is always at the top of the list. It's CPU usage varies but it’s CPU Time is always very high, even after restarting the computer. The “Kernal_task” process also shows as using a large number of threads. Could this be CPU related or maybe some issue with a sensor that HWmonitor does not monitor?\n[ATTACH]59577[\/ATTACH]"
    },
    {
        "post_id":68602,
        "thread_id":60388,
        "title":"820-00923 possible graphics issues",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-12-01 09:41:43",
        "message":"Try starting in diagnose mode.\nAkso try safe mode."
    },
    {
        "post_id":68609,
        "thread_id":60388,
        "title":"820-00923 possible graphics issues",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-12-01 10:49:11",
        "message":"Diagnostic mode reports no issues found everytime. The computer is still slow in safe mode also. WindowServer process is always running and when I open Youtube and start playing a video, it jumps up to over 150% CPU usage. \n[ATTACH]59578[\/ATTACH]"
    },
    {
        "post_id":68622,
        "thread_id":60388,
        "title":"820-00923 possible graphics issues",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-12-01 14:42:04",
        "message":"Check what happens installing Windows.\nDoes it go slow only after install some specific driver?"
    },
    {
        "post_id":68797,
        "thread_id":60388,
        "title":"820-00923 possible graphics issues",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-12-05 07:21:06",
        "message":"I have Windows installed on a external SSD and I booted this computer from that drive and it still seems to be a little sluggish but not as bad as in Mac OS. The default display resolution in Windows is set to 2880x1800, and it does not allow me to change it. I checked device manager and it shows an error for the graphics driver. Intel Iris Plus Graphics 650, \"Windows has stopped the device because it has reported problems (Code 43)\". I have booted other macbooks using this same drive and the graphics driver works fine on them, and I can adjust the display resolution.\n\nI also just noticed that the back right USB port is working intermittently. Sometimes it works fine for charging and USB activity, and then sometimes it will not work at all for either charging or USB. Could a bad CD3215 also somehow cause an issue with the graphics?"
    },
    {
        "post_id":68798,
        "thread_id":60388,
        "title":"820-00923 possible graphics issues",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-12-05 07:39:52",
        "message":"I doubt that.\nUnless external drive is not connected through that port.\n\nLooks like you have a problem with iGPU..."
    }
]