{"post_id":19383,"thread_id":19383,"title":"2013 mbpR SSD randomly boots to questionmark folder","user_id":90,"username":"ytesfay80","post_date":"2017-04-29 04:15:17","message":"I have this 2013 13\" mbpR that had no liquid damage but boots to a question mark folder and the customer said they took it to apple and was told the logic board could be the issue. They also already tried reinstalling an OS. When I received it and powered it on it booted to the questionmark folder. I then booted into my MacOS on my USB stick and when I held the Option key the SSD drive didn't show up at all nor did it show up in the disk utility or with a terminal command.\n\nI removed the SSD and plugged it into my OWC external usb enclosure and I was able to see the drive on disk utility. I erased the drive and installed Mac OS Sierra on it. Once it finished I booted once from the usb enclosure and once internally plugged in and both times it booted upon startup. After about an hour it again booted to the questionmark folder. I had to turn it on and off a couple times before it booted into the OS.\n\nI wiped and reinstalled the OS on the SSD and again it is doing the same thing. When I wait like 30mins-1hr and turn it on it will boot to a questionmark folder and I have to turn it off and back on before it works again. In ASD EFI the test passed as well as the S.M.A.R.T test.\n\nI've plugged in another 128gb sandisk SSD(Mac OS X El Capitan) and that boots fine everytime I plug it in so I'm not sure if this is a drive, logic board issue or the Operating System\n\nSandisk SSD: SD6PQ4M-256G-1021H\n\nPicture #1 is while the SSD was plugged into OWC external case after installing OS on it."}
{"post_id":19421,"thread_id":19383,"title":"2013 mbpR SSD randomly boots to questionmark folder","user_id":90,"username":"ytesfay80","post_date":"2017-04-30 06:10:36","message":"Now I just noticed that when I try to wake up the machine from sleep mode it freezes and shows the spinning wheel and I can't login so I have to shut it down."}
{"post_id":19432,"thread_id":19383,"title":"2013 mbpR SSD randomly boots to questionmark folder","user_id":2,"username":"dukefawks","post_date":"2017-04-30 07:35:01","message":"\"I've plugged in another 128gb sandisk SSD(Mac OS X El Capitan) and that boots fine every time\"\n\nI guess that solves this issue."}
