[
    {
        "post_id":30391,
        "thread_id":30391,
        "title":"820-00045 - Not getting into S4",
        "user_id":289,
        "username":"smiba",
        "post_date":"2018-01-14 15:17:38",
        "message":"Hey everyone\n\nThis device came in with the regular PP3V3R3V0_AON short to ground, I first suspected U7600 so I removed it but the short did not go away.\nAfter lifting up and soldering back 2 other chips (I think around U4450) I finally found the suspect on the other side of the board: U4700.\n\nAfter replacing U4700 and placing on a new U7600 the board has AON and PPBUS_G3H as well as the other G3H voltages (PPBUS_G3H, PPVRTC_G3H, PP5V_G3H_LDO, PPVBUS_E85, PPDCIN_G3H).\nIt did not go further then S5. I tried powering on the device by shorting SMC_ONOFF_L to ground as I was not sure if this device powers on by default. I used R5115 which is a little pad almost underneath the battery connector (Thats the right one, right?)\n\nJust to confirm I was not just being dumb I placed the machine back together but with no luck, the power button didn't boot it ether.\nAfter taking the device apart again PP3V3R3V0_AON was shorted again, which I directly traced back to the replaced U4700. I replaced it once again (why do they die so easily?) with a new one and we're back at no S4. (But we do have S5)\n\nPPBUS_G3H: OK\nPPVRTC_G3H: 3.28V\nPP5V_G3H_LDO: 4.98V\nPPVBUS_E85: OK\nPPDCIN_G3H: OK\nPP3V3_S5: 3.28V\nPP3V3_S4: 0V\nPP5V_S4: 0V\n\nOne weird thing I have to mention is that at some point PP5V_S0 was steady at about 4.2V (not just stray capacitance as it did go to 0V when disconnecting the power) even though all the S0\/S3\/S4 voltages were not there. Not sure if its important but it was definitely odd.\n\nWhere to look? Thanks!"
    },
    {
        "post_id":30396,
        "thread_id":30391,
        "title":"820-00045 - Not getting into S4",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-01-14 17:10:20",
        "message":"Check how PPVBUS_E85 (15V) is right next to PP5V1_S4SW_CC1 and thus E85_CC1 on J4700. Want to guess what happened? Also want to guess how fried this board is? The whole pin layout on J4700 is a big fat failure with high voltage pins right next to low voltage ones, shitty engineering. Anything on 5V1 line is suspect at this point."
    },
    {
        "post_id":30410,
        "thread_id":30391,
        "title":"820-00045 - Not getting into S4",
        "user_id":289,
        "username":"smiba",
        "post_date":"2018-01-15 10:52:22",
        "message":"Anything that's most suspect?\nI'm honestly not fully suspecting PP5V1_S4SW as this board did not have any water damage.\nIts not that we're only missing PP5V1_S4SW but all S4 voltages are not being created due them not receiving their proper enable signals.\n\nThe customer has data on here that was not backed up and they would love to recover it, I assume just moving over the two NAND chips is not enough and I would also need to move over the SSD controller?\n\nAnyways if this is close to being unsolvable other then with random luck replacing ICs I'll drop it, I don't charge enough for wasting my time on crap like this\n\n(Also dropping this would finally give me some time to work on that 820-3662 board!)"
    },
    {
        "post_id":30417,
        "thread_id":30391,
        "title":"820-00045 - Not getting into S4",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-01-15 12:40:25",
        "message":"What is PPVBUS_E85 currently?"
    },
    {
        "post_id":30567,
        "thread_id":30391,
        "title":"820-00045 - Not getting into S4",
        "user_id":289,
        "username":"smiba",
        "post_date":"2018-01-18 08:16:10",
        "message":"PPVBUS_E85 was 19.9V when I posted that response but it measures as 5.14V now.\nPP3V3R3V0_AON is at 3.14V which is a bit low, when I posted that response it was 3.31V\n\nNo idea why every time I fix it a couple of hours later something else dies again, what a crap. Especially U4700 loves to die.\nI'm assuming that right now _AON is too low and the device is not communicating with the charger which is keeping it at 5V\n\nHonestly I feel like this board is a goner, probably some other chip is dying or some internal connection is going bad, but with everything being BGA and quite densely packaged I feel like this is just not worth the time.\n\nAny advice on getting data off it? Or is that also close to impossible?"
    },
    {
        "post_id":30575,
        "thread_id":30391,
        "title":"820-00045 - Not getting into S4",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-01-18 14:10:56",
        "message":"U4700 is normally killed by shit Chinese charger or shit USB cable. 3.14V is too low and probably the SMC is not starting as reset will be kept low because of under voltage. \nI don't know of a way to get the data off besides swapping over the NAND and possibly the controller."
    }
]