{"post_id":26982,"thread_id":26982,"title":"820-3662 intermittent shutdown issues.","user_id":1153,"username":"JohnB8812","post_date":"2017-10-18 22:25:19","message":"Hello to Louis, Duke, and all of you guys in the repair community! I'm somewhat new to board level repairs on Mac, so I may not be the most knowledgeable on some things, but I have a particular board right now that is giving me issues. The computer itself turns on and runs, but it does shutdown at random times. I removed the board from the housing and tested it, however, without anything plugged in but the charger, the fan does not spin at all. I probed the board for the main power rails and did not get PP5V_S4. It was also missing various other S4 rails, and from testing U7501, the chip was not being told to turn on. I would think usually this would mean dead CPU, but the board still turns on? I have read through other posts on the forum, and it seems the 820-3662's have this problem, but I just wondered if I'm on the right track or if I'm missing something on this one? \n\nNOTE: Zero liquid damage on the board at all HOWEVER, a screw mount for one of the fans is completely ripped off the board and stuck to the fan. The customer took it to the Apple Store before they brought it to my store saying Apple said dead board. Would the screw mount have anything to do with this one?"}
{"post_id":26988,"thread_id":26982,"title":"820-3662 intermittent shutdown issues.","user_id":2,"username":"dukefawks","post_date":"2017-10-19 03:50:10","message":"You are not using a real genuine 85W charger and that is why it is probably not turning on now.\nThese random issues with 3662 and also 3787 boards are hopeless, I have no solution for these at the moment."}
{"post_id":27007,"thread_id":26982,"title":"820-3662 intermittent shutdown issues.","user_id":1153,"username":"JohnB8812","post_date":"2017-10-19 09:05:51","message":"I’m pretty sure you’re right on that Duke because usually there is a 60W charger hooked up by the soldering station lol whoops. But yeah I wish there was a solution for the problem like with the 2009 17” but alas no dough to be made"}
{"post_id":27018,"thread_id":26982,"title":"820-3662 intermittent shutdown issues.","user_id":2,"username":"dukefawks","post_date":"2017-10-19 16:08:04","message":"60W chargers have no business on the work bench. Go get 2 ORIGINAL adapters at the Mac store, 85W magsafe 1 and a magsafe 2. No Ebay or Amazon garbage!"}
{"post_id":27180,"thread_id":26982,"title":"820-3662 intermittent shutdown issues.","user_id":1153,"username":"JohnB8812","post_date":"2017-10-23 14:11:26","message":"Yeah we actually only have OEM chargers at our repair store because aftermarkets heat up and catch fire. True story they are garbage."}
