{"post_id":2898,"thread_id":2898,"title":"820-3437 - No green light","user_id":94,"username":"kronos23","post_date":"2016-05-21 19:26:42","message":"Found PP3V42_G3H missing on U7090. Confirmed it was being powered on pin 6 - 16.5V. Replaced from donor, still no PP3V42_G3H. Any ideas ?"}
{"post_id":2903,"thread_id":2898,"title":"820-3437 - No green light","user_id":1,"username":"larossmann","post_date":"2016-05-21 20:00:25","message":"Is 16v present on pin 8 of U7090? Is there a short to ground on pin 2 of L7095? Is R7095\/R7096 voltage divider for feedback intact? More information!!\n\n\nAlso, you don't have PP3V42_G3H, but what do you have? 2.6v? 1.8v? 1.1v? 0v? What shows up on that line?"}
{"post_id":2904,"thread_id":2898,"title":"820-3437 - No green light","user_id":94,"username":"kronos23","post_date":"2016-05-22 09:14:15","message":"I have 0.253 on PP3V42_G3H, confirmed the circuit is shorted to ground. Removed U7090, C7098, C7099 and C 7094. Still short to ground. Any ideas ?"}
{"post_id":2908,"thread_id":2898,"title":"820-3437 - No green light","user_id":1,"username":"larossmann","post_date":"2016-05-22 09:43:09","message":"shove 3.42v on pin 2 of L7095 and check what gets hot."}
{"post_id":2911,"thread_id":2898,"title":"820-3437 - No green light","user_id":94,"username":"kronos23","post_date":"2016-05-22 09:46:46","message":"Injected 3.42V DCPS shows a current draw of 2 amps but I cant feel anything heating up"}
{"post_id":2912,"thread_id":2898,"title":"820-3437 - No green light","user_id":94,"username":"kronos23","post_date":"2016-05-22 10:00:49","message":"I do't have freeze spray. Tried alcohol method as well. Cant seem to find a hot spot on the board. It is all cool to the touch."}
{"post_id":2915,"thread_id":2898,"title":"820-3437 - No green light","user_id":94,"username":"kronos23","post_date":"2016-05-22 11:18:50","message":"Short was found in the IO cable. Replaced it now I have the below readings on U7090:\nPin 1 - 1.912\nPin 2 - 2.275\nPin 3 - 11.27\nPin 4 - 2.307\nPin 5 - 0.000\nPin 6 - 15.89\nPin 7 - 3.417\nPin 8 - 15.92"}
{"post_id":2932,"thread_id":2898,"title":"820-3437 - No green light","user_id":94,"username":"kronos23","post_date":"2016-05-22 21:58:35","message":"got U7090 fixed. it was a bad solder job. Now PP3V42_G3H is stable. Still no green light. Moving onto U5110, I found that SMC_Reset_L - 3.315V however on pin 1 of R7100 I get nothing."}
{"post_id":2933,"thread_id":2898,"title":"820-3437 - No green light","user_id":1,"username":"larossmann","post_date":"2016-05-22 22:03:26","message":"First thing to do is investigate SMC_RESET_L not being high. Is it pulsing, or is it stable? If it is stable on ONE part of the board, why is it not on another? If a signal that is present on one part of the board is not present on another, figure out why. You may have to run a jumper wire to make it present on another.\n\nMy guess is that your lack of green light is most likely fucked up flex cable to dc in board. if the flex cable was causing the short to ground it only makes sense that the dc in board is fucked. so, your homework IS\n\na) try a known good dc in board and flex cable\nb) check the pins on the dc in board connector ON THE LOGIC BOARD(not the dc in board) on the SMC_BC_ACOK, SYS_ONEWIRE, and PP3V42_G3H pins. Don't just look, poke them with a tweezer. If the pin moves, fix it.\nc) Tell me what SMC_BC_ACOK measures on the main logic board.\n\nand, for extra credit,\n\nd) Tell me what SMC_BC_ACOK measures on the known good DC in board you just plugged in.\ne) Tell me what PP3V42_G3H measures on the known good dc in board you just plugged in.\n\nNow I know what you might be thinking. There is no schematic or boardview for the dc in board. so how will I do this? Look at U6901 & U6900 on any A1278 from 2009-2012... then look really hard on the DC in board of the air. Do you see anything that looks familiar ;)\n\nSometimes if I am dealing with an absolute doucherag that will not wait for me to buy the proper dc in board for an older air, I'll just fix their old one and run a bunch of wires from the main logic board to the dc in board. It works!\n\nHappy hunting"}
{"post_id":2934,"thread_id":2898,"title":"820-3437 - No green light","user_id":94,"username":"kronos23","post_date":"2016-05-22 22:32:36","message":"Went poking around and shorted the magsafe pins killed the magsafe......will get another one and give measurements tomorrow but I can see my old friend U6900 and U6901 on the magsafe board."}
{"post_id":2935,"thread_id":2898,"title":"820-3437 - No green light","user_id":94,"username":"kronos23","post_date":"2016-05-22 22:51:27","message":"​Ok I managed to get everything faster than I thought.\nRan wire from pin 7 on U5110 to Pin 1 of R7100 but even though they are connected I have 0.001 at R7100 and 3.315v on pin 7 of U5110 ? How is this even possible ? confirmed continuity.\na) using known good board and flex\nb) pins are in solid\nc) SMC_BC_ACOK on main board - 0.000\nd) SMC_BC_ACOK on dc board - 0.000\ne) PP3V42_G3H ON dc board - 3.412V"}
{"post_id":2940,"thread_id":2898,"title":"820-3437 - No green light","user_id":94,"username":"kronos23","post_date":"2016-05-23 09:37:18","message":"Found the problem was U7100. Replaced it and got SMC_BC_ACOK on the DC in board. Confirmed Sys_Onewire is present. Still no green light though :("}
