{"post_id":84478,"thread_id":62152,"title":"820-00928 No power, 20v 370ma","user_id":7922,"username":"tcampbell34","post_date":"2022-01-03 13:29:10","message":"This board had some minor corrosion on the back side of the board near the LCD connector, but the LCD connector itself is clean. Original issue was a short on PPBUS, which I cleared by replacing C7395. Then when I tried to turn it on, it was taking 20v 1.8amp without the battery and was not posting. PCH and UA600 were getting warm on thermal cam. I was getting about 1v on CPU_Vcore and .9v on GPU_VCORE rails at this time. I then decided to replace UA600 and after that, I was no longer getting any voltage on GPU_VCORE, but the board was fluctuating between 400-600ma. Now CPU_VCORE was 0.65v and I confirmed the board had USB activity now, but no video due to no GPU voltages. I realized that I did not solder UA600 very well so I replaced it again and then I was back to the same issue I had before. Board was taking 20v 1.8amp and not posting but I had 1v on CPU vcore and 0.9v on GPU vcore. Seems like something with the GPU is blocking the CPU from posting. PCH still gets a little warm, but not too hot so it might be normal. I decided to UC the board incase of some crap under a BGA chip, but now I have lost CPU vcore voltages. Now I am stuck with the board at 20v and about 370ma. What seems odd to me is I have PLT_RST_L at 3.3v but have 0v on PPVCC_S0_CPU. Here are some more voltages:\n\nALL_SYS_PWRGD - 3.22\nSMC_DELAYED_PWRGD - 3.41\nPM_PCH_SYS_PWROK - 3.31\nLPC_PWRDWN_L - 3.32\nPLT_RST_L - 3.32\nPLT_RST_L_BUF - 3.319\nCPU_VCCST_PWRGD - 0.988\nCPU_VR_EN_R - 3.23\nPPVCC_S0_CPU - 0\nPM_DSW_PWRGD - 3.41\nPM_PCH_PWROK - 3.32\n\nL7030 - 12.66\nL8000 - 1.023\nL7960 - 0.964\nL8020 - 1.801\nL7900 - 1.2\nL7600 - 5.15\nL7660 - 3.329\nL8410 - 0\nL7410 - 0\nL7420 - 0\nL7211 - 0\nL7221 - 0\nL7231 - 0\nL7330 - 1.051\nLA640 - 0\nLA650 - 0\nLA350 - 0\nLA300 - 145ma\nLB700 - 0\nL3500 - 0"}
{"post_id":84479,"thread_id":62152,"title":"820-00928 No power, 20v 370ma","user_id":682,"username":"2informaticos","post_date":"2022-01-03 13:56:46","message":"Something happened on the ultrasonic process.\nCheck for knocked off components, or broken traces."}
{"post_id":84481,"thread_id":62152,"title":"820-00928 No power, 20v 370ma","user_id":7922,"username":"tcampbell34","post_date":"2022-01-03 14:29:56","message":"Yea I know but I have already checked for knocked off components and broken traces and I did not find anything. I have a Crest ultrasonic cleaner that I use all the time without any issues, so I don't think the UC would have broken any traces."}
{"post_id":85648,"thread_id":62152,"title":"820-00928 No power, 20v 370ma","user_id":7922,"username":"tcampbell34","post_date":"2022-01-27 15:36:41","message":"I got around to finally replacing the PCH on this board and now I have got CPU Vcore back but its stuck at 1.1v and no GPU Vcore voltages. Is it safe to remove UA600 from the board and try and turn it on without this chip just for test, or would that cause some kind of damage?"}
{"post_id":85649,"thread_id":62152,"title":"820-00928 No power, 20v 370ma","user_id":682,"username":"2informaticos","post_date":"2022-01-27 18:08:28","message":"Do NOT do that.\nNever-ever let an high-side MOSFET with floating Gate on air!!!"}
{"post_id":85806,"thread_id":62152,"title":"820-00928 No power, 20v 370ma","user_id":7922,"username":"tcampbell34","post_date":"2022-02-01 09:25:49","message":"Yea I figured that was not a good idea, which is why I asked first. I replaced UA600 one last time with a new one and then I put the board through the ultrasonic cleaner again because it was covered in flux and then let it dry over night. To my surprise, now it is turning on a gives me an image on the screen but it has vertical pink and green lines across the screen. I tried a clean ME bios and PRAM reset, since I replaced the PCH, but that did not fix the issue. Diagnostic reports no issues found, but if I try to boot to the internal SSD, it loads halfway and then kernel panics. If I try to boot to a external copy of macOS, it looks like it fully boots because the keyboard backlight and touchbar become active and work, but the screen still shows an apple logo with the progress bar stuck. I had a board like this a while ago and I actually fixed it by replacing the GPU VRAM chips. Is there a way I can figure out if its the GPU VRAM or the GPU itself that is bad?\n\n[ATTACH]60398[\/ATTACH]"}
{"post_id":85812,"thread_id":62152,"title":"820-00928 No power, 20v 370ma","user_id":682,"username":"2informaticos","post_date":"2022-02-01 10:06:38","message":"Can be crap under GPU, or VRAM chips; ultrasonic bath not always clean all.\nBut can also be a corroded resistor, or trace."}
