[
    {
        "post_id":48314,
        "thread_id":48314,
        "title":"What is this cable from the LCD Assembly? 2018 Air.",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2019-04-10 09:24:01",
        "message":"Working on a 2018 Air Retina with liquid-damage. Was able to miraculously repair the board without schematics by matching circuits, etc., but ran into one issue I won't be able to resolve. One of the smaller cables\/connectors coming from the LCD assembly has been burned beyond repair. The pins shorted and blew a hole into the cable and the connector on the finger board. Anyway, I got the unit back together and just isolated that cable and secured it (unconnected) out of the way. Surprisingly, the unit boots right up and LCD works \"normally\" from what I can tell. I will of course advise the customer of the damage, but wanted to know what exactly to tell them with regards to possible damage and\/or issues from the damaged cable. I've attached a photo with the cable\/connector circled in red. Is it some kind of polarizer or camera-related connection? Is it identical to the same cable\/connector on the left-side of the LCD assembly? Unfortunately, T2 settings are preventing use of an external drive...so going to have to wait until customer provides password to see what the effects are.\n\nAny advice appreciated!"
    },
    {
        "post_id":48317,
        "thread_id":48314,
        "title":"What is this cable from the LCD Assembly? 2018 Air.",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-04-10 09:52:28",
        "message":"Yeah wait till customer gives password. My guess is going to be camera, but I could be wrong."
    },
    {
        "post_id":48339,
        "thread_id":48314,
        "title":"What is this cable from the LCD Assembly? 2018 Air.",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2019-04-11 09:02:11",
        "message":"I was able to confirm the cable was in fact iSight. iSight will never work again on this unit\/assembly, but at least the display works!"
    }
]