{"post_id":63605,"thread_id":59829,"title":"A1398 - Firmware Problems","user_id":26765,"username":"sws","post_date":"2020-08-11 20:24:59","message":"Hello-\n\nI posted similar on ghostlyhaks yesterday but I'm not sure if the site is no longer as active or where people went, so I thought I'd ask here too.  I have an A1398 that indicates \"Unavailable\" as its Serial Number within About this Mac.  Everything seems to work fine on the computer other than anything that needs the serial, like iMessage and oddly, payments using a Chase Visa.  Anyway, I grabbed three matching dumps off the board and the result looks odd to me, as in, I can't figure out where the serial should go.  I normally look for the string hwc and\/or ssn to find the serial but neither are found.  I was able to match the sha1sum between dumps, so I don't think it's an anomaly or bad read.\n\nI used a dump from ghostlyhaks that should have matched, added the serial, checked the length of the file, etc.  On boot, that version had a long, 20-second pause before doing anything, through multiple resets of NVRAM\/PRAM and SMC.  So I rewrote one of the existing dumps back to the board and it's working again, but still with no serial.\n\nThe particulars for this machine are EMC 2881 820-3787-A with an i7 2.8ghz processor.  I can upload the file if someone would be willing to take a look at it.\n\nSteve"}
{"post_id":63610,"thread_id":59829,"title":"A1398 - Firmware Problems","user_id":682,"username":"2informaticos","post_date":"2020-08-12 03:24:01","message":"If serial number is changed, Fsys checksum MUST be fixed, just to avoid this kind of problem.\nYour Fsys area is corrupted, if serial number is not present.\n\nUpload somewhere your backup BIOS and post desired serial number."}
{"post_id":63618,"thread_id":59829,"title":"A1398 - Firmware Problems","user_id":26765,"username":"sws","post_date":"2020-08-12 08:45:41","message":"Late last night I was able to fix it with blank board serializer.  I haven't tried a re-read of the BIOS yet but might when I have time next, just for curiosity.\n\nSteve"}
