{"post_id":13735,"thread_id":13735,"title":"820-2915-b no backlight","user_id":628,"username":"speedyaction","post_date":"2017-01-27 07:09:59","message":"Hi. i have 820-2915-b no backlight. i replaced lcd connector and also u6701 and still no backlight .\nF9700- 12v pin 1 and pin 2\nR9731- pin 1 0.430v and pin 2 0.122v\nQ9707- pin 2 3.34v pin 5 0.036v\nQ9706- pin 1,2,5,6 0.0053v\n\nany help?"}
{"post_id":13746,"thread_id":13735,"title":"820-2915-b no backlight","user_id":558,"username":"arghhh","post_date":"2017-01-27 13:16:39","message":"Screen isn't being detected. Is it plugged in when you are measuring?"}
{"post_id":13753,"thread_id":13735,"title":"820-2915-b no backlight","user_id":2,"username":"dukefawks","post_date":"2017-01-27 13:52:39","message":"Is there an image on the LCD? Check with flashlight."}
{"post_id":13797,"thread_id":13735,"title":"820-2915-b no backlight","user_id":628,"username":"speedyaction","post_date":"2017-01-28 03:12:54","message":"screen is connected and is apple logo coming up. of course i checked with flash light"}
{"post_id":13798,"thread_id":13735,"title":"820-2915-b no backlight","user_id":628,"username":"speedyaction","post_date":"2017-01-28 04:59:34","message":"is u9600 have anything to do with backlight?\ni even reballed gpu and still no backlight but picture on screen is display. also i changed another  lcd connector and still no backlight. tested with second working screen and nothing"}
{"post_id":13803,"thread_id":13735,"title":"820-2915-b no backlight","user_id":2,"username":"dukefawks","post_date":"2017-01-28 06:27:30","message":"You reballed the GPU? WHAT?!\nDone..."}
{"post_id":13808,"thread_id":13735,"title":"820-2915-b no backlight","user_id":628,"username":"speedyaction","post_date":"2017-01-28 06:49:23","message":"so you think is gpu fault then?"}
{"post_id":13811,"thread_id":13735,"title":"820-2915-b no backlight","user_id":2,"username":"dukefawks","post_date":"2017-01-28 07:33:33","message":"I have no idea, you are just \"doing\" things and not using brains. Reballing the GPU is NEVER an option, always use new. But this was never a GPU issue to start with, as I said use brains."}
{"post_id":13812,"thread_id":13735,"title":"820-2915-b no backlight","user_id":628,"username":"speedyaction","post_date":"2017-01-28 07:42:12","message":"i know m8. i never started from gpu. i done all testing tricks and gpu was last thing i done. am waiting for new chipset coming from china so i dint had this model left so has to try reballed. i changed 3 screens, replaced two connectors, two ic and all that but still not back light so i done gpu last. but is still this same problem. i know you are much more better with fixing boards. am just start learning this 1 year ago and of course will; do lots of mistakes like everybody do  . that how is it work. not sure what to do now to get this back light back again."}
{"post_id":13822,"thread_id":13735,"title":"820-2915-b no backlight","user_id":628,"username":"speedyaction","post_date":"2017-01-28 12:28:01","message":"really need to fix this board today. can you help duke?"}
{"post_id":13825,"thread_id":13735,"title":"820-2915-b no backlight","user_id":1,"username":"larossmann","post_date":"2017-01-28 13:06:35","message":"Replacing U9701 makes no sense here. Q9706 takes PPBUS_G3H's main 12.6v and sends it through to the backlight circuit. If Q9706 is not opening, then you will get no voltage on the backlight circuit. We can't blame U9701 for not working and replace it when it isn't receiving the power required to turn on. This is like changing a lightbulb while the switch is set to off. Turn the switch on, [I]then[\/I] see if the lightbulb works.\n\nSo why isnt Q9706 sending power to the backlight circuit? Q9706 is a P channel MOSFET, meaning power will flow through it when the voltage on the gate is lower than on the source. Look at pin 3. R9788 takes the 12.6v that is on the source and places it right on pin 3. This will set Q9706 to \"off\", and not allow it to pass power, as the voltage on the source and the gate ate identical.\n\nHow would we lover the voltage on Q9706's gate at pin 3 so that it will turn on? Look at R9789. If we take R9789 and put it to ground right after R9788 now we have a voltage divider. Voltage dividers lower voltage! A hah. So why isn't it lowering? R9789 needs a path to ground in order for R9788\/R9789 to [I]be [\/I]a voltage divider. What gives R9789 a path to ground? Q9707.\n\nQ9707 is the opposite of Q9706. It's an N channel MOSFET. It will turn \"on\" when the power on the gate is equal to or higher than the source. BKLT_PLT_RST_L, once it is 3.3v, ,will be higher than the 0v(ground) on pin 1, which will open the first transistor. LCD_BKLT_EN, when 3.3v, will be higher than the 0v on the source(ground pin 4) and open the second transistor. This will give R9789 a path to ground, making R9788\/R9789 a voltage divider, which will lower the voltage on pin 3 of Q9706 to around 5v, which will allow it to open.\n\nBefore this occurs, there is no point in troubleshooting anything after Q9706. It just won't work.\n\nLCD_BKLT_EN is missing in your case. This comes from U9600. What does U9600 do? Look at the beginning of the schematic. This is responsible for taking the video signal from the integrated intel graphics & the AMD GPU and sending it off to either displayport external screen or internal LCD. U9600 is going to be responsible for brightness control, as well as turning the screen on. So let's go over the cases under which U9600 might not send out LCD_BKLT_EN.\n\nAnytime you see an image and SMC_LID is high - meaning, the machine does not think the lid is closed, LCD_BKLT_EN should be high as well. Is SMC_LID a solid 3.4v? If it is, and you are doing something with the machine like clicking the mouse or touching the keyboard, then LCD_BKLT_EN should be present. If not, try resetting PRAM. This always fixes it for duke because he's luckier than I am - I always wind up having a fucked up mux. :( If it isn't a low SMC_LID value, or a PRAM reset, then U9600 is the next culprit.\n\nIf you want to \"cheat\" and see if the rest of the backlight circuit works, you can wire pin 5 of Q9707 and pin 1 of R9704. If you get a backlight then it is most likely a U9600 issue. This is obviously a cancerous thing to do because you will have full brightness all the time, but allows you to see that the rest of everything in front of U9600 is working.\n\nMost likely replacing a U9600, which of course comes with firmware, which means salvaging one from a donor board and reballing it, which is a horrorshow. and then selling to the customer that you're not refunding them for the board repair when the GPU dies a month later. I don't envy you right now. ;)\n\nAs duke said, there has to be a logical reason to everything. If you don't get it, post, but replacing chips that aren't even getting power and hoping it turns on is the opposite of the logical reasoning required to fix this."}
{"post_id":13826,"thread_id":13735,"title":"820-2915-b no backlight","user_id":628,"username":"speedyaction","post_date":"2017-01-28 13:54:56","message":"great lesson m8. now i understand how is it work now. i see your video when you say about two signals enable on q9707 must be present and i check for it and find out that LCD_BKLT_EN is missing  now i wired pin 5 of Q9707 and pin 1 of R9704 and i have back light so now i know u9600 is faulty.  i dont have stencil  for this ic so i will just leave it like it is us long is working. Also i will replace gpu for customer any way when i get delivery from china after chines new year with new machine zm-r6200c. Thanks again for all this info. that was the best way to explain how this all work.   Problem fixed\n\ncan you pls correct my title ?:) 820-2915  lol"}
