{"post_id":59762,"thread_id":59360,"title":"820-00840 runs from battery but not boots","user_id":1482,"username":"BCN_Techs","post_date":"2020-05-18 09:42:54","message":"I got this one very badly damaged near keyboard and speacker area (J6603 and J4801). Not liquid damage, just some \"friend-tecnichian\" tried to repair it. Computer wasn't booting due short (PP5V_S0 on J4810). Found it, replaced both connector, now it starts and work normal untill u sleep it. After that image desappear. I can still clicking sound of up\/down volume but here is no image ( can see it on external display, not always, sometimes image disappear on both displays)\n\n\nThe only way to boot it with his displays and working (untill sleep it again\" is disconnect-connect battery and plug charger than i will start, and will charge the battery all will be ok. I also tried to just start from battery but it doesnt work too. \n\n\nAny idea?"}
{"post_id":59766,"thread_id":59360,"title":"820-00840 runs from battery but not boots","user_id":682,"username":"2informaticos","post_date":"2020-05-18 12:44:01","message":"Board doesn't even try to start with battery only?"}
{"post_id":59772,"thread_id":59360,"title":"820-00840 runs from battery but not boots","user_id":1482,"username":"BCN_Techs","post_date":"2020-05-18 15:29:45","message":"No, nothing happens. But board sees battery, Charges it and works from it until sleep or shut downs. After that image disappear but computer still working"}
{"post_id":59778,"thread_id":59360,"title":"820-00840 runs from battery but not boots","user_id":682,"username":"2informaticos","post_date":"2020-05-18 16:45:08","message":"Seems that we do not understand.\nI didn' ask if board boots on battery only.\nI asked if starts.\nA board turned on is not the same as working board.\nI suppose it turns on in your case, but I wanted to confirm that.\n\nSTART and BOOT are different things!"}
{"post_id":59801,"thread_id":59360,"title":"820-00840 runs from battery but not boots","user_id":1482,"username":"BCN_Techs","post_date":"2020-05-19 05:03:08","message":"you mean if it enteres in S0 mode ?"}
{"post_id":59804,"thread_id":59360,"title":"820-00840 runs from battery but not boots","user_id":682,"username":"2informaticos","post_date":"2020-05-19 05:08:43","message":"A board starts power sequence even if stuck in S3.\nWe usually say the board doesn't start if stuck in S5.\nBut sometime we get confused about starting and working boards.\n\nA board can go to S0, but not always working.\nSo need to describe exact state of the board."}
{"post_id":59811,"thread_id":59360,"title":"820-00840 runs from battery but not boots","user_id":1482,"username":"BCN_Techs","post_date":"2020-05-19 08:56:55","message":"Well, sorry for delay. I was working on that board and finally it is running from battery. It was keyboard issue. The only issue is now remains is image problem. \n\nI start from battery login in to systems and close notebook. After wake up for first moments it is just backlight issue and i can see display without light. But in few seconds it completly shuts down ( display, computer is still working fine).  display issue?"}
{"post_id":59816,"thread_id":59360,"title":"820-00840 runs from battery but not boots","user_id":682,"username":"2informaticos","post_date":"2020-05-19 10:06:52","message":"Both image and backlight go off?\nYou can have problem with Hall sensors..."}
{"post_id":59820,"thread_id":59360,"title":"820-00840 runs from battery but not boots","user_id":1482,"username":"BCN_Techs","post_date":"2020-05-19 10:15:15","message":"yes. Display is ok because i have new displays and happenning same thing. \n\nPlaying with external monitor sometimes closing\/opnening and disconnecting external monitor image appear but never backlight. \n\n\nWill check now that sensor. Thanks."}
{"post_id":59821,"thread_id":59360,"title":"820-00840 runs from battery but not boots","user_id":1482,"username":"BCN_Techs","post_date":"2020-05-19 11:01:26","message":"I checked U5255 and near components but nothing unusual is there. How that circuit works? when you close then open cover it sends signal through U5255 and tells display to power on? \n\n\nit's almost impossible to measer HALL_SENSOR_LEFT  and RIGHT because it is on other side of the board and can't see any test point on other side."}
{"post_id":59825,"thread_id":59360,"title":"820-00840 runs from battery but not boots","user_id":1482,"username":"BCN_Techs","post_date":"2020-05-19 11:12:16","message":"LID_OPEN is 3.4 when open and 0 when close, doesnt matter how money time i close and opne it. Cant find the way to measure SMC_LID_RIGHT SMC_LID_LEFT \n\n\nmay be smc issue?\n\n\nP.S: ALso J5250 was bad and had been cleaned and now seems be ok."}
{"post_id":59829,"thread_id":59360,"title":"820-00840 runs from battery but not boots","user_id":1482,"username":"BCN_Techs","post_date":"2020-05-19 11:44:52","message":"Sorry for few messages but i am checkind and can see that SMC_LID_RIGHT is very low 0.04 and SMC_LID_LEFT is 3.3V. \n\n\nP.S. Solved. I followed right signal way and get to J5250 and changed flex. Now it is working fine. If any changes be sure i will back:D\n\n\nThanks again informaticos."}
