[
    {
        "post_id":22075,
        "thread_id":22075,
        "title":"820-2915 Liquid Damage, All S0 Power Rails Present No Post",
        "user_id":868,
        "username":"computercaverva",
        "post_date":"2017-06-21 21:01:40",
        "message":"Got in an A1286 820-2915 board that had a liquid spill that soaked into the optical drive area, went through the cleaning regiment and the board powers on green light, fans spin, no chimes, ram error beeps, or other signs of posting like USB mouse lighting up. All S0 powers rails are present, sometimes when connected the fans spin at full speed, other times controlled."
    },
    {
        "post_id":22077,
        "thread_id":22075,
        "title":"820-2915 Liquid Damage, All S0 Power Rails Present No Post",
        "user_id":557,
        "username":"MDY",
        "post_date":"2017-06-21 22:37:27",
        "message":"CPU powered? Check for corrosion."
    },
    {
        "post_id":22099,
        "thread_id":22075,
        "title":"820-2915 Liquid Damage, All S0 Power Rails Present No Post",
        "user_id":868,
        "username":"computercaverva",
        "post_date":"2017-06-22 12:13:10",
        "message":"No corrosion around CPU, after leaving the board overnight when I first connected it to power all I got was quarter fan spin. I replaced the ISL chip and the quarter fan spin continued. Pulled the RAM and the fans ran at full speed for about a minute then cut off. Any ideas never seen this before!"
    },
    {
        "post_id":22100,
        "thread_id":22075,
        "title":"820-2915 Liquid Damage, All S0 Power Rails Present No Post",
        "user_id":637,
        "username":"TCRScircuit",
        "post_date":"2017-06-22 12:24:14",
        "message":"So it has quarter fan spin? Check power to RTC and inspect clock chip"
    },
    {
        "post_id":22251,
        "thread_id":22075,
        "title":"820-2915 Liquid Damage, All S0 Power Rails Present No Post",
        "user_id":868,
        "username":"computercaverva",
        "post_date":"2017-06-26 18:47:43",
        "message":"So I finally dug this board back out of the pile of work this evening and now when I connect the MagSafe theres a Greenlight and some times it experiences Quarter Fan spin, sometimes it lights up green light but doesn't do anything fan wise, other times it gets a green light fan runs and the CPU and GPU get hot and the computer ramps up the fan like its trying to prevent overheating. Possibly an ISL issue, or the Clock IC? Also the Clock Chips looks to be in good condition no corrosion, the voltage readings are:\n\n1: 3.336v\n2: 3.336v\n3: 0v\n4: 0.277v\n5: 0v\n6: 0v\n7: 0v\n8: 0.057v\n9: 0v\n10: 0v\n11: 0v\n12: 0.417v\n13: 3.473v\n14: 0.001v\n15: 0v\n16: 0v\n\n(When these readings were taken the board was experiencing quarter fan spin)"
    },
    {
        "post_id":22281,
        "thread_id":22075,
        "title":"820-2915 Liquid Damage, All S0 Power Rails Present No Post",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-06-27 18:07:42",
        "message":"This will be very annoying. As the problem is intermittent it is likely that there is corrosion under some chip. Inspect the board where the corrosion was, common suspects on these boards are around SMC\/PCH and R7402."
    }
]