{"post_id":38678,"thread_id":38678,"title":"820-3332 GPU IG0R Sensor Error","user_id":624,"username":"Alan.L","post_date":"2018-08-21 14:07:54","message":"I bought this board untested from eBay, when I got it and the board was fully working. \nI've notice C8363 and C8360 tantalum caps has knocked off when I got the board, so i decided to replace these caps from a donor board but I accidentally soldered both caps in the wrong polarity. I power it up and i get a blank screen. so I check the cap and I realised this must have shorted the PP1v5R1V35 line. I took the caps out and soldered the right polarity this time. i power the board up but i still get blank screen. PPVCORE_GPU was 0v, then i decide to touch up the solder on u8900. but i was still getting a blank screen. i then replace u8900 and bingo i got a picture \n\nThen i decide to run ASD and 1 sensor error comes up:\n\n\n[IMG type=\"full\" width=\"200px\"]https:\/\/i.imgur.com\/86pdtmU.jpg[\/IMG]\n\n[URL=\"https:\/\/i.imgur.com\/4KRPgoC.jpg\"][IMG type=\"full\" width=\"200px\"]https:\/\/i.imgur.com\/4KRPgoC.jpg[\/IMG][\/URL]"}
{"post_id":38756,"thread_id":38678,"title":"820-3332 GPU IG0R Sensor Error","user_id":624,"username":"Alan.L","post_date":"2018-08-23 18:02:33","message":"bump, i still need help with this."}
{"post_id":38805,"thread_id":38678,"title":"820-3332 GPU IG0R Sensor Error","user_id":1,"username":"larossmann","post_date":"2018-08-25 00:08:49","message":"What does R5410\/U5410\/R5413 area look like? I am guessing C5413 leaking and pulling the value down.\n\nDuke is on vacation and I got a concussion so replies will be slow for a while until he comes back or my dizziness\/constant headache goes away."}
{"post_id":38806,"thread_id":38678,"title":"820-3332 GPU IG0R Sensor Error","user_id":682,"username":"2informaticos","post_date":"2018-08-25 04:50:47","message":"Check U5410 and its traces tu R5410.\nThe problem should be on the input, as the error message reports high reading.\nBe sure R5410 is correct R003. Incorrect R005 can cause this kind of error.\nIs also possible that GPU sinks more current than expected. In such case, try to use R002 for R5410.\nIf doesn't help, a resistor in parallel with C5413 (must be calculated\/tested) can reduce the signal."}
{"post_id":38812,"thread_id":38678,"title":"820-3332 GPU IG0R Sensor Error","user_id":624,"username":"Alan.L","post_date":"2018-08-25 07:02:23","message":"they all looks good and all within spec. i even replaced U5410 and c5413.\n\ni will try r002 for r5410"}
{"post_id":38813,"thread_id":38678,"title":"820-3332 GPU IG0R Sensor Error","user_id":624,"username":"Alan.L","post_date":"2018-08-25 07:31:47","message":"worked!. thank you 2informaticos and Louis ;)\n\n[img]https:\/\/i.imgur.com\/s56QJIp.jpg[\/img]\n\n[img]https:\/\/i.imgur.com\/ZCOZSBf.jpg[\/img]"}
{"post_id":38816,"thread_id":38678,"title":"820-3332 GPU IG0R Sensor Error","user_id":624,"username":"Alan.L","post_date":"2018-08-25 10:01:33","message":"I need help editing the serial number of this eBay board to match the serial number to the one on the bottom cover.\nThe system serial number has become \"not available\" after editing the SPI ROM. the board can read original serial number but not mine one.\n\nthis usually works for me but not this time....\n\nThis is what I've done so far: I removed the ROM from the eBay board and put it into my EPROM programmer. I then used that to dump the ROM and opened the resulting file in a hex editor. I located the eBay board serial number in the file and changed it to the desired number. I made sure not to add any extra spaces or anything, and made sure the string was still located at the same offsets as the original. I saved the file and wrote it back onto the ROM. i have even tried just writing zeros then use Blank Board Serializer to write the number that way, but it just had an error and wouldn't do anything.\n\nThis is the ROM, ME region is all good, just want the serial number to change:\n\n[URL=\"https:\/\/drive.google.com\/open?id=1uiiEmMvejOlK_y7EDqSnZe8yz428_pFF\"]https:\/\/drive.google.com\/open?id=1ui...SnZe8yz428_pFF[\/URL]\n\nthe serial number i want. : C02JC22TDKQ4"}
