{"post_id":43451,"thread_id":43451,"title":"820-00045a No Power on any power lines Retina MacBook 2015","user_id":2135,"username":"shassh","post_date":"2018-12-17 08:10:33","message":"Hi all,\n\nI have a 2015 Macbook A1534 Retina which started off having issues charging and receiving power from charger - now wont charge or receive 14.5v.\n\nI have tried another cable and charger with no luck, the little LED on the board (next to the battery connector) does not light up with no power going to any of the rails, as opposed to the common stuck on 5v issue - this is not that. I am getting 0 volts.\n\nAfter leaving the battery disconnected a while and reconnecting, the little juice which was left in the battery allowed for a very brief on time, showing the battery low symbol, and the power LED was on without being plugged.\n\nAs a test I plugged in a normal usbc 5v charger and I get the power light on, and I get voltages through the motherboard. However its not enough to charge an extremely dead battery. The screen did show the charging symbol but I think was not enough power to charge and drained the battery completely.\n\nI know that the motherboard and charger need to negotiate the power (5v or 14.5v), it seems like it knows to turn off 5v, but somehow unable to turn on 14.5v, unlike the common stuck on 5v issue.\n\nI’ve checked for shorts, i cannot see anything obvious, nothing getting hot, but no LED light, no power in any rails.\n\nAnyone have any experience on something similar?\n\nAll help will be greatly appreciated.\n\nThanks in advance."}
{"post_id":43455,"thread_id":43451,"title":"820-00045a No Power on any power lines Retina MacBook 2015","user_id":2135,"username":"shassh","post_date":"2018-12-17 09:37:43","message":"Just to add, I have tried another USBc port, which gave the same results. Checking the power output from the charger through the port (disconnected from the mother board) i still get 0 volts through +VBUS line on USBc, I am assuming the charger gives 0 volts until it knows which power to switch to? \n\nCould it be the charger is not \"detecting\" its being connected to something?"}
{"post_id":43465,"thread_id":43451,"title":"820-00045a No Power on any power lines Retina MacBook 2015","user_id":682,"username":"2informaticos","post_date":"2018-12-17 11:52:08","message":"Test the board with charger only, battery disconnected.\nIf board works on 5V cable, then the issue should be on the input stage, or charger itself.\nThe USB-C charger doesn't give voltage without load.\nDid you check F4700?"}
{"post_id":43473,"thread_id":43451,"title":"820-00045a No Power on any power lines Retina MacBook 2015","user_id":2135,"username":"shassh","post_date":"2018-12-17 12:50:33","message":"Hi thanks for your response.\n\nI have tested the board with charger only, 2 different chargers (one new), and 2 different USB-C ports (one new). Still no power. \n\nF4700 checked and is fine, no short to ground either\n\nIts almost as if the motherboard\/charger are not detecting each other.\n\nAnything I could check further?\n\n[QUOTE=\"2informaticos, post: 43465\"]Test the board with charger only, battery disconnected.\nIf board works on 5V cable, then the issue should be on the input stage, or charger itself.\nThe USB-C charger doesn't give voltage without load.\nDid you check F4700?[\/QUOTE]"}
{"post_id":43483,"thread_id":43451,"title":"820-00045a No Power on any power lines Retina MacBook 2015","user_id":682,"username":"2informaticos","post_date":"2018-12-17 15:08:06","message":"Check if Q\/D4750 are both OK.\n\nBTW, there is no reason to quote an entire post from few cm above..."}
{"post_id":43488,"thread_id":43451,"title":"820-00045a No Power on any power lines Retina MacBook 2015","user_id":2135,"username":"shassh","post_date":"2018-12-17 16:04:09","message":"Ive done a few tests, apologies for being a noob.\n\nF4700, C4750, C4755, R47551, R47561 = all seem fine, though 0v\nD4750 = fine, though I havent removed it - it looks fine - 0v\n\nQ4750 = looks okay, but is the top of it (the shiny layer - I was curious) supposed to be on PPDCIN_G3H? I checked the top of Q4750 with R4750 pins on diode mode:\n\nPPDCIN_G3H = 0\nPPDCIN_E85_SS = 062\n\nCheers"}
{"post_id":43489,"thread_id":43451,"title":"820-00045a No Power on any power lines Retina MacBook 2015","user_id":682,"username":"2informaticos","post_date":"2018-12-17 16:31:09","message":"\"D4750 = fine, though I havent removed it - it looks fine - 0v\"\nI don't exactly understand you...\nI meant to measure between D4750 pins, in diode mode.\n\n\"PPDCIN_G3H = 0\"\nWhat this means?\nCan't be short (diode mode), as it works on 5V USB cable.\nAnd I didn't ask for voltage there; you already posted no voltage present.\n\n\"PPDCIN_E85_SS = 062\"\nIs this diode mode?\n\nI hope you disconect charger and battery when check continuity (diode mode\/ohm scale) on the board..."}
{"post_id":43495,"thread_id":43451,"title":"820-00045a No Power on any power lines Retina MacBook 2015","user_id":2135,"username":"shassh","post_date":"2018-12-17 16:43:38","message":"All checks were done with charger and battery disconnected. Following readings in diode mode.\n\nD4750 = 682, with no connectivity with probes the opposite way around. So assume diode is good.\nPPDCIN_G3H rail = 0, full connectivity with the top on Q4750 - I'm not sure if that's normal or not.\nPPDCIN_E85_SS rail = 062, with the top on Q4750 - again I'm not sure if that's normal or not.\n\nCheers"}
{"post_id":43498,"thread_id":43451,"title":"820-00045a No Power on any power lines Retina MacBook 2015","user_id":682,"username":"2informaticos","post_date":"2018-12-17 17:00:47","message":"Post power rails to ground on diode mode; not to other point.\nTest Q4750 on diode mode between its pins, not to ground."}
{"post_id":43501,"thread_id":43451,"title":"820-00045a No Power on any power lines Retina MacBook 2015","user_id":2135,"username":"shassh","post_date":"2018-12-17 17:32:16","message":"I was just a bit confused why the top of Q4750 was conductive to those lines - still learning.\n\nFollow lines tested with diode mode to ground:\nPPDCIN_G3H = 504\nPPDCIN_E85_SS = 504\nPPDCIN_E85_SS_DIV = No reading.\n\nQ4750 pin 1 and pin 4 = 683\nQ4750 pin 1 and pin 2 (and pin 3) = 723\nQ4750 pin 4 and pin 2 (and pin 3) = 061\n\nHope that's more informative. Cheers"}
{"post_id":43502,"thread_id":43451,"title":"820-00045a No Power on any power lines Retina MacBook 2015","user_id":682,"username":"2informaticos","post_date":"2018-12-17 17:37:47","message":"I recommend you change U4700; it makes the charger detection..."}
{"post_id":43504,"thread_id":43451,"title":"820-00045a No Power on any power lines Retina MacBook 2015","user_id":2135,"username":"shassh","post_date":"2018-12-17 17:51:17","message":"Thank you for your help. Will try that and let you know how it goes ."}
{"post_id":43505,"thread_id":43451,"title":"820-00045a No Power on any power lines Retina MacBook 2015","user_id":2135,"username":"shassh","post_date":"2018-12-17 18:08:02","message":"I'd like to ask, looking at the schematic suggests SLG4AP645[U][B]A[\/B][\/U]V chip, however on the chip on the board it has 645[U][B]B[\/B][\/U]V D5002 URD stamped on it. Will a SLG4AP645[U][B]A[\/B][\/U]V work on it or will I need specifically SLG4AP645[U][B]B[\/B][\/U]V, B being a lot harder to source.\n\nCheers"}
{"post_id":43511,"thread_id":43451,"title":"820-00045a No Power on any power lines Retina MacBook 2015","user_id":682,"username":"2informaticos","post_date":"2018-12-17 18:55:22","message":"No idea.\nYou can try it if is the same size.\nSometime digits termination reffers to package size and type, temperature..."}
{"post_id":43527,"thread_id":43451,"title":"820-00045a No Power on any power lines Retina MacBook 2015","user_id":2135,"username":"shassh","post_date":"2018-12-18 04:16:03","message":"I've gone ahead with B, just incase. Will update when I receive them. Thanks for you help ."}
{"post_id":44016,"thread_id":43451,"title":"820-00045a No Power on any power lines Retina MacBook 2015","user_id":2135,"username":"shassh","post_date":"2018-12-28 06:37:48","message":"Just another update,\n\nSo changing the U4700 IC did fix the issue, for a little while then it died again. Changed for the second time and it's still going however usb storage devices are not recognised.\n\nThe original usbc charge\/data cable seems bad to me, when I connect my mobile phone the MacBook, the MacBook charges from my phone with cable connected one way, but not the other. The phone doesn't show anything. Tried a new cable and the MacBook doesn't charge in any orientation, but nothing happens. Very odd.\n\nIs it possible that the original cable was an issue, which has caused the USBC port to malfunction and cause U4700 IC issue?\n\nI checked the port, I seem to have full connectivity to ground in what I believe is pin A5 CC1, but not on pin B5 CC2. This seems odd to me.\n\nAny vitals to check for no usb detection?\n\nEither way I have a new USBC port on the way.\n\n?????"}
{"post_id":44023,"thread_id":43451,"title":"820-00045a No Power on any power lines Retina MacBook 2015","user_id":682,"username":"2informaticos","post_date":"2018-12-28 08:54:02","message":"Disconnect USB-C port from logic board.\nThen check resistance for C4706\/07.\nIf still short on any, bad solder under U4700.\nNot common bad capacitor, but you can check them, just in case.\nCC1\/2 are used to detect external device type."}
{"post_id":44050,"thread_id":43451,"title":"820-00045a No Power on any power lines Retina MacBook 2015","user_id":2135,"username":"shassh","post_date":"2018-12-28 12:45:58","message":"Just had a look, no short on either capacitor. \n\nMaybe it's the SBU1\/2 pins on the port. I'm not sure. But I disconnected the port fully and tested the pin CC1\/2 or SBU1\/2 (I can't tell which it is) .One of these is short to ground without anything connected to the port .\n\nI checked voltages on f4700 I get ~14.4v, but if I spin the cable around I get ~5v. \n\nOh, and my sound card 820-4940-B started crackling on speakers and died. Headphones still work.\n\nI hate this MB :-|"}
{"post_id":44051,"thread_id":43451,"title":"820-00045a No Power on any power lines Retina MacBook 2015","user_id":2135,"username":"shassh","post_date":"2018-12-28 13:01:14","message":"Even weirder, I thought just in case there are bad solders I will reflow u4700, put everything back together. Same issue with the cable giving 14.5v one way, but it's the OTHER way around (I initially marked it so I knew).\n\nWhat the hell is going on..."}
{"post_id":44057,"thread_id":43451,"title":"820-00045a No Power on any power lines Retina MacBook 2015","user_id":682,"username":"2informaticos","post_date":"2018-12-28 13:58:58","message":"Did you check for short on CC1\/2?\nWhich one was shorted before?"}
{"post_id":44079,"thread_id":43451,"title":"820-00045a No Power on any power lines Retina MacBook 2015","user_id":2135,"username":"shassh","post_date":"2018-12-28 18:54:40","message":"See attachment. It's the pin (red) which had short to ground (green). But it seems to be only that pin, not the same in the other side. It's either the CC1\/2 or SBU1\/2 pin. why only one is shorted I don't know . But could explain why the cable only works one way with 14.5v. \n\nI have a suspicion that a bad cable has caused a fault inside the port, which then caused malfunction in u4700.\n\nWith or without the port connected there is no short on C4706\/07. Maybe the red pin is SBU1\/2 and not CC1\/2?\n\nFor moment the cable functioned the opposite way around (mentioned above) but then went back to the previous way around. It's never worked both ways so far. \n\nWhat circuitry is in these ports? It'll be a while until I receive the new one. \n\nCheers"}
{"post_id":44094,"thread_id":43451,"title":"820-00045a No Power on any power lines Retina MacBook 2015","user_id":682,"username":"2informaticos","post_date":"2018-12-29 03:02:11","message":"Check where SBU1\/2 arrive to J4700.\nThen see if the short is on the logic board."}
