{"post_id":94364,"thread_id":63323,"title":"A2141 820-01700 Is this dead CPU - 0.5V 0.01A Short on PPBUS_G3H","user_id":25485,"username":"it-solve","post_date":"2022-11-26 14:44:43","message":"Short on ppbus_g3h line\nRemoved the fuses and injected 1V, CPU glares up. Customer needs data desperatly.\n\n[ATTACH type=\"full\"]60873[\/ATTACH]\n\nDead CPU?"}
{"post_id":94365,"thread_id":63323,"title":"A2141 820-01700 Is this dead CPU - 0.5V 0.01A Short on PPBUS_G3H","user_id":682,"username":"2informaticos","post_date":"2022-11-26 15:16:06","message":"Very likely...\n\nHow many times need someone to tell you STOP to inject voltage into PPBUS_G3H in this manner.\nDon't say 1V is safe voltage; just a childish excuse.\nYou only need ohm scale measurment to detect CPU power supply problem; why to inject voltage first???\n\nNow find the burnt CPU power supply chip and check VCORE resistance to ground, after removed it."}
{"post_id":94366,"thread_id":63323,"title":"A2141 820-01700 Is this dead CPU - 0.5V 0.01A Short on PPBUS_G3H","user_id":25485,"username":"it-solve","post_date":"2022-11-26 20:00:14","message":"I just got A1707 with the same type of short circuit on the PPBUS_G3H line, and 1V injection detected a shorted cap on the audio line.\n\nI agree with what you said, but can we clarify what internal ohm shortage or case scenarios we should look for before any injection? Even on low voltages. Removing all CPU GPU MOSFETs\/Coils before any injection surely is not cost-effective.\n\nWe surely cannot open a new thread each time we want to diagnose a short."}
{"post_id":94369,"thread_id":63323,"title":"A2141 820-01700 Is this dead CPU - 0.5V 0.01A Short on PPBUS_G3H","user_id":682,"username":"2informaticos","post_date":"2022-11-27 04:20:41","message":"You don't need to completely remove anything.\nOnce you detect the short between PPBUS_G3H and any big coil, just lift (one side) the corresponding coil.\nPPBUS_G3H resistance to ground should go up then.\nBe aware, CPU and GPU have 2-3 coils for the same rail, so need to lift all common coils.\n\nIn some cases (rarely), the burnt chip\/MOSFET cause short to ground too.\nLifting coils don't help like above then."}
