{"post_id":91798,"thread_id":62986,"title":"A1398 820-3332 tries to turn on 0A - 0.4A - 0A after previous black screen issue and shorted Q7510","user_id":25485,"username":"it-solve","post_date":"2022-08-12 03:09:32","message":"Hi Guys, \n\nHave this board that has a black internal screen but used to work on the external screen. A graphic load software won't start on the external screen. \nThought it could be a U8900 cold joint issue and resoldered it, in the process resoldered U7400 as well. Afterwards, the board won't even turn on and would stay at 0.28A with and without a battery. \n\nFound short on Q7510. Not sure if the heat somehow triggered it, went and replaced it. Now it tries to turn on and switches off with a battery, keeps repeating it -  0A - 0.44A - 0A\n\nMeasured that \nSMC_PM_G2_EN - jumps 0 - 3.3V and repeats, together with P3V3\/P5V_S5_EN signals.\n\nWent through the board to hunt for shorts but couldn't locate any. \nSMC_PM_G2_EN is SMC output line, how I can check if losing voltage before?\n\nPP3V42_G3H - 3.4V"}
{"post_id":91799,"thread_id":62986,"title":"A1398 820-3332 tries to turn on 0A - 0.4A - 0A after previous black screen issue and shorted Q7510","user_id":682,"username":"2informaticos","post_date":"2022-08-12 05:14:38","message":"SMC will disable the signal, if detects a problem on the board.\n\nExternal monitor is driven by discrete GPU only.\nHow could U8900 cause missing internal video???\nYou've caused more damage on the board doing something not related with your problem.\nResoldering U8900 is a must do on this board; but not generating another problem!\n\nTouching U7400 with initial problem, was bad idea.\nSome bad solder caused Q7510 fried.\n\nRemove R7940 and test the board again.\nAlso try starting in SMC bypass mode.\n\nYou may need to change U7400 now.\nCheck all its resistors and traces to Q7510."}
{"post_id":91800,"thread_id":62986,"title":"A1398 820-3332 tries to turn on 0A - 0.4A - 0A after previous black screen issue and shorted Q7510","user_id":25485,"username":"it-solve","post_date":"2022-08-12 07:21:45","message":"Had this before with a 2013 A1398 model as described by TCRS - [MEDIA=youtube]FF7wsStjyj4:435[\/MEDIA]. Resoldering pads resolved the problem in that case. Thought this could be the same as it wasn't showing internal video, but external seemed to be working.\n\nAgree. I should not have touched U7400. The low resistance on its pins deceived me.\n\nRemoved R7940 and tried SMC Bypass (if this is the one) by shorting C5710, doesn't even attempt to turn on.\n\nResoldered U7400 a couple of times now and seem to make good contact. Traced the PHASE1\/2 and UGATE2, traces seems to be fine\nu7400 is listed as ISL95831 on the schematic but MAX15199 on the board. Seems I can grab ISL95831 from A1286, is that same as the MAX?"}
{"post_id":91803,"thread_id":62986,"title":"A1398 820-3332 tries to turn on 0A - 0.4A - 0A after previous black screen issue and shorted Q7510","user_id":682,"username":"2informaticos","post_date":"2022-08-12 12:19:22","message":"Compare schematics, to choose equivalent IC.\n3332 uses same chip as 3115 and 3330 (MAX15119).\n2915 has different layout (MAX17511).\nISL95831 is not compatible with them."}
{"post_id":92329,"thread_id":62986,"title":"A1398 820-3332 tries to turn on 0A - 0.4A - 0A after previous black screen issue and shorted Q7510","user_id":25485,"username":"it-solve","post_date":"2022-09-05 02:07:12","message":"I have replaced the U7400. No fan spin stays at 0.28A and can see the replaced Q7510 gets hot.\nBut have very low resistance on CPUIMVP_PHASE1\/2 - 1Ohm. Is it expected?\n\nAlso seems like it blow the Q7510 again, shall i replace it one more time? I have lifted the coils around the CPU and lower side is the CPU side.\n\n[ATTACH type=\"full\" alt=\"1662361282768.png\"]60761[\/ATTACH]\n\nWith removed Q7510 it turns on and spins the fans\n[ATTACH type=\"full\"]60762[\/ATTACH]"}
{"post_id":92331,"thread_id":62986,"title":"A1398 820-3332 tries to turn on 0A - 0.4A - 0A after previous black screen issue and shorted Q7510","user_id":682,"username":"2informaticos","post_date":"2022-09-05 04:45:27","message":"CPU may have very low resistance to ground as normal; just compare with other similar board.\n\nHowever, burning Q7510 probably fried the CPU."}
