{"post_id":47023,"thread_id":47023,"title":"820-4924 ppvcc_s0_cpu","user_id":2120,"username":"Melamanti","post_date":"2019-03-05 09:38:53","message":"Good Evening, \n\nCustomer brought in a 820-4924 with a green light and nothing going on other than that.\nAfter some digging around i found out that it had no ppbus_g3h.\nRestored that and now the machine wont do anything else.\nDid some measuring around and i found that PPVCC_S0_CPU, is shorted.\nIs there something i m missing or does that mean that the cpu is fried?\nMachine has been ultrasoniced and of course messed around by previous stores."}
{"post_id":47025,"thread_id":47023,"title":"820-4924 ppvcc_s0_cpu","user_id":1153,"username":"JohnB8812","post_date":"2019-03-05 10:43:27","message":"How do you know it's shorted? The CPU VCore line is a LOW voltage line it should have a low resistance\/diode mode reading normally....why did it have no PPBUS was there a short corrosion etc? If shorted, what component?"}
{"post_id":47027,"thread_id":47023,"title":"820-4924 ppvcc_s0_cpu","user_id":682,"username":"2informaticos","post_date":"2019-03-05 10:53:13","message":"\"i found out that it had no ppbus_g3h.\nRestored that\"\nWhat exactlly did you find there?\n\nDo you get Magsafe light, any S5, or SUS voltage?"}
{"post_id":47054,"thread_id":47023,"title":"820-4924 ppvcc_s0_cpu","user_id":2120,"username":"Melamanti","post_date":"2019-03-06 03:52:03","message":"When i say it's shorted i mean that resistance to ground is 0?hm. Diode mode reading is 0.00v.\nI restored ppbus_g3h by replacing q7310-7311-7320-7321. As I said before this board has been messed with already.\nUsing an original 60w magsafe 2 adapter i get a green light that turns amber as it should.\nUsing a dc power supply at 16.5V 4A , it shows a reading of 0.150A as soon as you plug the charger but it drops to 0.020 in a matter of seconds.\nI suppose that something is preventing it from starting.\nThere is nothing getting hot.\nThere is pp5v_s5 but no pp3v_s5.\nI have checked everything corresponding to that line and everything seems in place. \nMy assumption is that a power line beyond that, meaning an s4 or s3 line is having an issue and that's why it is not powering up.\nI have also replaced u7501, and the smc from an excact same donor board."}
{"post_id":47056,"thread_id":47023,"title":"820-4924 ppvcc_s0_cpu","user_id":682,"username":"2informaticos","post_date":"2019-03-06 06:51:28","message":"\"I restored ppbus_g3h by replacing q7310-7311-7320-7321\"\nImportant thing, which you didn't consider to mention in first post.\nPretty sure you have dead CPU now; less than 1% chance to survive VCORE overvoltage.\nDon't waste more time with this board..."}
{"post_id":47064,"thread_id":47023,"title":"820-4924 ppvcc_s0_cpu","user_id":1153,"username":"JohnB8812","post_date":"2019-03-06 08:02:41","message":"If Q7310 was shorted, this board is done. CPU got 12.6 volts RIP."}
