{"post_id":3195,"thread_id":3195,"title":"[SOLVED]3 beeps in 5 seconds","user_id":191,"username":"zockysworkshop","post_date":"2016-06-02 19:31:58","message":"I have 820-3115-b logic board with no water damage signs the guy that send it to me told me that has knock down capacitor C7251 150UF 20% 6.3V POLY-BIA-SM i replace it but when i turn on the computer i still get 3 beeps. I've checked the RAM put few different ones I've checked the RAM slots under the microscope they look good i checked all rails are present also double checked for PVCORE_S0_CPU and i have that too. I was doing research online for the beeps i find out on apple website for trouble shooting that those beeps can indicate problems with RAM or the MCP. Kinda confused now. Any ideas ? Thank you"}
{"post_id":3205,"thread_id":3195,"title":"[SOLVED]3 beeps in 5 seconds","user_id":36,"username":"aprendiz","post_date":"2016-06-03 16:27:20","message":"maybe the board was dropped, my guess is bad PCH.... No MCP on this boards..."}
{"post_id":3266,"thread_id":3195,"title":"[SOLVED]3 beeps in 5 seconds","user_id":1,"username":"larossmann","post_date":"2016-06-04 17:39:44","message":"I would say bad PCH or the board is cracked somewhere and this will be hell. If you move the board around see if it boots in different positions but I sincerely doubt this will go anywhere."}
{"post_id":3276,"thread_id":3195,"title":"[SOLVED]3 beeps in 5 seconds","user_id":6,"username":"turbo","post_date":"2016-06-05 03:37:40","message":"its the ram power rail , i had the same problem, fixed it with changing the chip, i think u7300 not sure. pls chk schematic..."}
{"post_id":3280,"thread_id":3195,"title":"[SOLVED]3 beeps in 5 seconds","user_id":2,"username":"dukefawks","post_date":"2016-06-05 08:31:34","message":"Check voltage on L7330. If that is ok use a RAM slot tester to see if any data lines are open."}
{"post_id":3353,"thread_id":3195,"title":"[SOLVED]3 beeps in 5 seconds","user_id":191,"username":"zockysworkshop","post_date":"2016-06-08 10:31:06","message":"So I checked for PPDDR_S3_REG on point 2 on L7330 it was missing and i saw that PPDDR_S3_REG is coming from U7300 also checked the pins 12 and 2 for voltage, and i had voltage on pin 12 but not on 2 so i couldn't find where that voltage is generated so i replaced the U7300 and solved my problem. Thanks for your help guys :)"}
