{"post_id":30124,"thread_id":30124,"title":"[SOLVED]820-00426 No Backlight","user_id":1153,"username":"JohnB8812","post_date":"2018-01-05 14:18:06","message":"Got this one in with no backlight (note said sent out for backlight repair before but not fixed). Inspected board no liquid damage and no sign of previous rework. Backlight output was 0 volts and in diode mode on pin one of the LCD connector I got 0.169-0.18. Replaced LCD connector but no change.\nFuse has 12.6 volts on both side. \nMachine boots into an OS and has image, BUT no backlight.\n\nWould LED driver be the next logical conclusion?\n\nThank you for the help"}
{"post_id":30125,"thread_id":30124,"title":"[SOLVED]820-00426 No Backlight","user_id":316,"username":"G.Beard","post_date":"2018-01-05 16:12:56","message":"You've tried another screen cable and inspected the iPEX connector on the screen side first of course?\nMade sure no beep from pin 1 to ground with cable plugged and unplugged?\nTested with another screen of the same model (numbers under the clutch cover \/ WiFi thing)\nBeeped out pin 1 to ceramic caps to make sure the trace is good?\n\nSomeone will likely tell you how to do fault find properly but I don't bother to figure out issues when it's just as quick to slap another backlight circuit on there (the most likely failed parts of course and after I have tested everything other than the board).\nIf it does not work, then start using brain and looking into PWM and feedback traces, etc."}
{"post_id":30142,"thread_id":30124,"title":"[SOLVED]820-00426 No Backlight","user_id":2,"username":"dukefawks","post_date":"2018-01-05 20:40:17","message":"LCD needs to talk to the backlight driver on the board. First is to try with a known good LCD assembly for the correct year of course."}
{"post_id":30144,"thread_id":30124,"title":"[SOLVED]820-00426 No Backlight","user_id":1153,"username":"JohnB8812","post_date":"2018-01-05 20:46:00","message":"Ok will do grabbed a test 2015 from a friend today since we did not have one. Wanted to test before LCD connector replacement but tried it on the off chance it was the connector. Will test with known good next time I see the board"}
{"post_id":30216,"thread_id":30124,"title":"[SOLVED]820-00426 No Backlight","user_id":1153,"username":"JohnB8812","post_date":"2018-01-08 12:42:40","message":"Tried known good LCD and success! Backlight works! (Gonna convince friend to let me keep the test screen lol) Mark as solved!"}
{"post_id":30223,"thread_id":30124,"title":"[SOLVED]820-00426 No Backlight","user_id":2,"username":"dukefawks","post_date":"2018-01-08 13:10:19","message":"Try another LCD cable on the faulty LCD before totally scrapping it."}
{"post_id":30227,"thread_id":30124,"title":"[SOLVED]820-00426 No Backlight","user_id":1153,"username":"JohnB8812","post_date":"2018-01-08 13:28:10","message":"It's a customer's that was mailed in, and I don't have any spare LCD cables, but I did tell them to do that because could be that simple."}
