[
    {
        "post_id":55177,
        "thread_id":55177,
        "title":"820-3115B running slow ASD error NDC001 but camera seems to be ok",
        "user_id":12,
        "username":"Ictc",
        "post_date":"2019-12-10 10:48:55",
        "message":"I got this previous liquid damaged machine back after 6 months of normal usage. The machine runs slow at boot and after logon as an effect of a sensor failure perhaps. The camera seems to work, the only strange thing I noticed in the beginning were some spikes on video using photo boot. I also checked with the oscilloscope the signal directed to the camera line smc and i2c bus and also the power line which has no spikes at all. I couldn't find a replacement camera in stock just to give a try but I'm afraid the problem arise somewhere else. Anybody has an hint to share wit me in order to find the right spot to look at?\nPs. what also sounds strange is that fan spins normallyin every conditions. No matter if other periferrals are disconnected, the fan spins normally and never boost up. Maybe some older issue with smc I had to replace after the previous liquid damage?"
    },
    {
        "post_id":55178,
        "thread_id":55177,
        "title":"820-3115B running slow ASD error NDC001 but camera seems to be ok",
        "user_id":12,
        "username":"Ictc",
        "post_date":"2019-12-10 11:03:12",
        "message":"forgot to mention that SMC reset actually made the fan spins at maximum speed as expected. As far as  I know, sensor issues cause fan spins faster and in my case this doesn't happen. May be the issue is not related to a sensor but only the smc? Is there a way to know it for sure?"
    },
    {
        "post_id":55179,
        "thread_id":55177,
        "title":"820-3115B running slow ASD error NDC001 but camera seems to be ok",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-12-10 12:02:12",
        "message":"If you doubt about camera, just disconnect it.\nUse HWMonitor and check temps and I\/V sensors in real time.\nAlso try clean ME BIOS, even full new BIOS (clean too)."
    },
    {
        "post_id":55200,
        "thread_id":55177,
        "title":"820-3115B running slow ASD error NDC001 but camera seems to be ok",
        "user_id":12,
        "username":"Ictc",
        "post_date":"2019-12-11 08:44:57",
        "message":"Swapped EFI ROM with a clean one and losted video. Repalced with the original ROM and video still not showing up anymore. Now I get video only after smc bypass, what a hack !???\nCouldn't test any sensor with HWMonitor because of the SMC bypass..."
    },
    {
        "post_id":55220,
        "thread_id":55177,
        "title":"820-3115B running slow ASD error NDC001 but camera seems to be ok",
        "user_id":12,
        "username":"Ictc",
        "post_date":"2019-12-12 02:08:20",
        "message":"Could the ROM change be the cause of the SMC failure at this stage? What could have cause the video to fail even with the original ROM chip? Should I consider an SMC replacement or is there something else am I missing?"
    },
    {
        "post_id":55221,
        "thread_id":55177,
        "title":"820-3115B running slow ASD error NDC001 but camera seems to be ok",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-12-12 02:45:25",
        "message":"Try first reballing SMC.\nAlso test the board disconnecting TP\/KB and BIL connectors.\nMonitor SMC_LID signal."
    },
    {
        "post_id":55223,
        "thread_id":55177,
        "title":"820-3115B running slow ASD error NDC001 but camera seems to be ok",
        "user_id":12,
        "username":"Ictc",
        "post_date":"2019-12-12 03:54:17",
        "message":"SMC_LID was low, I had this problem before and I fix it with a jumper between pin 2 of R5071, pin1 of C4906 and PP3V3_S5_SMC. Now the backlight is back but still have problem with slow \"beachballed\" performance... Takes forever to boot as well. I'll try to test sensor one more time."
    },
    {
        "post_id":55224,
        "thread_id":55177,
        "title":"820-3115B running slow ASD error NDC001 but camera seems to be ok",
        "user_id":12,
        "username":"Ictc",
        "post_date":"2019-12-12 04:14:22",
        "message":"Last time the problem with Low SMC_LID didn't involve C4906 where on pin 1 I found PP3V3, today that voltage was missing on that cap. Isn't strange? Something related with the inner traces on the pcb failing or something else like smc putting to ground that signal making the traces soffering somehow? That's also strange because there's 100k resistor between PP3V3 and SMC_LID..."
    },
    {
        "post_id":55226,
        "thread_id":55177,
        "title":"820-3115B running slow ASD error NDC001 but camera seems to be ok",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-12-12 05:19:42",
        "message":"Did you disconnect BIL connector???\nIt can kill SMC_LID.\n\nDon't force that signal to 3V3_S5; it has corresponding pull-up resistor.\nRun ASD and HWMonitor."
    },
    {
        "post_id":55228,
        "thread_id":55177,
        "title":"820-3115B running slow ASD error NDC001 but camera seems to be ok",
        "user_id":12,
        "username":"Ictc",
        "post_date":"2019-12-12 06:21:51",
        "message":"Of course I did, I also measured before and after BIL connection. I suppose the SMC on pin 1 of the pullup resistor is not pulling down the SMC_LID itself. I also removed the pullup resistor and measured for PP3V3 but I got 0 volt that's why I decided to reroute a jumper to it from PP3V42_G3H as it should be as showed in the schematic."
    },
    {
        "post_id":55230,
        "thread_id":55177,
        "title":"820-3115B running slow ASD error NDC001 but camera seems to be ok",
        "user_id":12,
        "username":"Ictc",
        "post_date":"2019-12-12 06:32:38",
        "message":"What is also strange is that on the BV the voltage on pin 2 of the pullup resistor is showed as PP3V42_G3H but on the schematic is PP3V3 coming from L7220.... May be I should re-route the jumper to the appropriate voltage rail... What's your suggestions?"
    },
    {
        "post_id":55231,
        "thread_id":55177,
        "title":"820-3115B running slow ASD error NDC001 but camera seems to be ok",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-12-12 07:11:06",
        "message":"3V3_S5_SMC comes from 3V42_G3H, is correct.\nSo is OK to run the wire from pin 2 of R5071 to 3V42.\nYou should always have 3V at SMC_LID; it comes through R5071.\nIf R5071 is OK and voltage low, remove R6961 and check again.\nLess probable to be bad Q5701.\nLast to check is changing SMC..."
    },
    {
        "post_id":55331,
        "thread_id":55177,
        "title":"820-3115B running slow ASD error NDC001 but camera seems to be ok",
        "user_id":12,
        "username":"Ictc",
        "post_date":"2019-12-15 02:36:28",
        "message":"Yesterday I took another board previously repaired from a liquid spill damage, put it in the same chassis and guess what? Same identical issue of the other board. Never tested that board before but that sounds really weird. Same ASD error with the camera and slow performance on boot and runtime with many beach balls. Should I better start believing in ghosts or am I missing something environmental that is causing these issues? Sound also like a sata cable issue that?s why I also exchanged some flat with no luck. May those batch of cable be bad? I don?t have any other fully working a1278 in stock to tests the sata cable right now."
    },
    {
        "post_id":55332,
        "thread_id":55177,
        "title":"820-3115B running slow ASD error NDC001 but camera seems to be ok",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-12-15 02:54:21",
        "message":"Why don't disconnect internal HDD and test with USB OSX?\nAlso, did you try disconnecting camera cable?"
    },
    {
        "post_id":55343,
        "thread_id":55177,
        "title":"820-3115B running slow ASD error NDC001 but camera seems to be ok",
        "user_id":12,
        "username":"Ictc",
        "post_date":"2019-12-15 23:50:40",
        "message":"Yes with camera cable disconnected nothing change... I decided to reball the smc on the new board but I had a problem with two pads on the chip itself that decided to stick  on the PCB ... both pads were g3h, don?t know if that smc once rebelled will work again... this morning I?ll solder it back and will see. I need to find a good working smc which I do not have in stock anymore."
    },
    {
        "post_id":55627,
        "thread_id":55177,
        "title":"820-3115B running slow ASD error NDC001 but camera seems to be ok",
        "user_id":12,
        "username":"Ictc",
        "post_date":"2020-01-06 09:16:43",
        "message":"SMC reballed and resoldered but now I get 3 beeps when ram inserted. only one beep with ram slot empty. Can this be the SMC as is the only thing I've messed up with...I'm triyng to find a reason why those 3 beeps, I also checked SMC_MEM_ISENSE wich is between 0,12 with only one module and 0,3 with both modules insertend in ram slots.looks fine, don't know what else to check for."
    },
    {
        "post_id":55628,
        "thread_id":55177,
        "title":"820-3115B running slow ASD error NDC001 but camera seems to be ok",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-01-06 10:02:14",
        "message":"Heat applied to desolder\/resolder SMC affected other board areas.\nYou could now have problems with RAM slots, or CPU..."
    },
    {
        "post_id":55682,
        "thread_id":55177,
        "title":"820-3115B running slow ASD error NDC001 but camera seems to be ok",
        "user_id":12,
        "username":"Ictc",
        "post_date":"2020-01-08 08:24:42",
        "message":"never happened before but I know this board is proneto fail due ram slots issue... I ordered the ddr3 test board andI'll wait for it before consider the board gone... I'll pm you by the way.."
    }
]