[
    {
        "post_id":22978,
        "thread_id":22978,
        "title":"820-00045 keyboard and trackpad not working",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2017-07-13 15:12:34",
        "message":"I have this 12 inch 2015 Macbook that had liquid spilled on it and the keyboard flex cable was damaged. The trackpad had lots of corrosion on it but not much on the logic board even though I haven't been able to completely remove the logic board since I'm missing the Y00 driver bit.\nI replaced the keyboard cable, trackpad cable and trackpad but still the keyboard and trackpad are not working. The only thing that changed is that now the power button is working to turn it on and off.\n\nI took a closer look at the trackpad connector on the logic board(J4801) and I noticed there was burned powder next to the connector and after putting some alcohol and cleaning the area I noticed that F4800 was gone and the pads were empty so I assume F4800 was burned off. L4800 and the connector look fine visually.\nI am getting 5v on Pin 24.\n\nI don't have a replacement fuse for it but I ran a jumper so the pads were connected but still the issue remains.\n\nDo you know what else could be causing this?\n\nAlso, I can't find a fuse with the specs of F4800. Does anyone know where I could get this part or can someone in the US sell me a donor board for this model?"
    },
    {
        "post_id":22979,
        "thread_id":22978,
        "title":"820-00045 keyboard and trackpad not working",
        "user_id":316,
        "username":"G.Beard",
        "post_date":"2017-07-13 15:46:35",
        "message":"Keyboard has some electronics on on the back of it. Change the keyboard. Done a few of these and most of them neded a new keyboard.\nCan't you ust jumper the fuse with some fuse wire?"
    },
    {
        "post_id":22981,
        "thread_id":22978,
        "title":"820-00045 keyboard and trackpad not working",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2017-07-13 16:06:14",
        "message":"There was nothing left of the fuse except for pads which I jumpered together. I disconnected the keyboard cable from the trackpad but I'm still not able to move the trackpad. I can tell the trackpad is somewhat working because when the machine is on I can feel the trackpad is clicking which it doesn't when the machine is off.\nWill the trackpad not work without a working keyboard plugged in like the 2015 rMBP's?\n\nCan you replace these keyboards without replacing the entire topcase because all the prices were about $300+ for the topcase?"
    },
    {
        "post_id":22982,
        "thread_id":22978,
        "title":"820-00045 keyboard and trackpad not working",
        "user_id":316,
        "username":"G.Beard",
        "post_date":"2017-07-13 16:15:11",
        "message":"Yes they are on ali.\n\n[url]https:\/\/www.aliexpress.com\/wholesale?catId=100005067&initiative_id=AS_20170713151038&SearchText=a1534+keyboard[\/url]\n\nReplacing the KB is a pain in the ass but it's really not that much more difficult than the Airs or Pros.\n\nI've had a trackpad working with a bad KB plugged in before."
    },
    {
        "post_id":22983,
        "thread_id":22978,
        "title":"820-00045 keyboard and trackpad not working",
        "user_id":316,
        "username":"G.Beard",
        "post_date":"2017-07-13 16:16:42",
        "message":"I can't remember what the electronics are on the back of the KB. Duke knows.\nYou'll notice when you take the old KB off that you can break them into bits. If you bend them they just snap."
    },
    {
        "post_id":22984,
        "thread_id":22978,
        "title":"820-00045 keyboard and trackpad not working",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2017-07-13 16:28:22",
        "message":"So the keyboard is like the airs where its riveted to the case and you just need to rip it off?\n\nI don't want to order a keyboard only to find out that the trackpad or keyboard still isn't working. I'm curious why my trackpad isn't working even with the keyboard not plugged in.\nAlso, is there a better alternative for the fuse that was missing because I thought that just using solder to jump the pads together will cause issues down the line?\n\nI also read another post from a few months ago and duke said its a pain to fit the new keyboard. Have you had that issue as well?"
    },
    {
        "post_id":22985,
        "thread_id":22978,
        "title":"820-00045 keyboard and trackpad not working",
        "user_id":316,
        "username":"G.Beard",
        "post_date":"2017-07-13 16:46:12",
        "message":"No the KB is screwed on. It's not that bad to fit the KB really. Trackpads are like £15 on eBay."
    },
    {
        "post_id":22987,
        "thread_id":22978,
        "title":"820-00045 keyboard and trackpad not working",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2017-07-13 16:52:16",
        "message":"Okay.\nI already put in a new trackpad & cable from ebay which is why I don't understand how the trackpad is still not working for me."
    },
    {
        "post_id":22988,
        "thread_id":22978,
        "title":"820-00045 keyboard and trackpad not working",
        "user_id":316,
        "username":"G.Beard",
        "post_date":"2017-07-13 17:00:32",
        "message":"Hmm. I don't know about that.\nI do know I bought a cable from eBay and bent it once which fucked it up.\n\nYou might want to investigate the board further first."
    },
    {
        "post_id":22989,
        "thread_id":22978,
        "title":"820-00045 keyboard and trackpad not working",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-07-13 17:22:47",
        "message":"Trackpad should work with a disconnected keyboard. Look up J4801 in the diagram and check all voltages. Check connector for corrosion.\nIf you have a adapter from USBC to USB see if the trackpad works in the boot menu."
    },
    {
        "post_id":22992,
        "thread_id":22978,
        "title":"820-00045 keyboard and trackpad not working",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2017-07-13 17:59:07",
        "message":"Okay I believe I read the schematic right on J4801 that the side where Pins 1\/41 are on can be measured from the connector on the trackpad board.\nIf so all the pins gave me correct readings except for Pins 7,9,35,37,39,41 which all gave me 0v.\n\nI measured from left to right and the first two pins on the left gave me 8v each and the third pin(I assume is Pin 5) gave me 0v."
    },
    {
        "post_id":23011,
        "thread_id":22978,
        "title":"820-00045 keyboard and trackpad not working",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-07-14 03:22:20",
        "message":"I have no idea what you measured. Use the board view and compare the pin numbers. \nYou can say left to right but how do I know which way you are looking at the machine......"
    },
    {
        "post_id":23026,
        "thread_id":22978,
        "title":"820-00045 keyboard and trackpad not working",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2017-07-14 12:33:29",
        "message":"The reason I'm saying that is because I have to measure on connector that is on the trackpad since I can't measure the logic board connector and have the cable plugged in at the same time.\n\nI got these measurements from the connector that is on the trackpad. (J4801)\nPins 1\/3 - 8v\nPin 5 - 0v\nPins 7\/9\/35\/37\/39\/41 - 0v\nPin 11 - 3.26v\nPin 13 - 5v\nPin 15 - 3.3v\nPin 21 - 3.3v\nPin 23 - 5v\nI'm not sure why pins 7,35,37,39 & 41 show 0v because when I measure on the other side with the cable disconnected from the trackpad\nPins 10,36,38,&40 all give me the proper voltages."
    },
    {
        "post_id":23041,
        "thread_id":22978,
        "title":"820-00045 keyboard and trackpad not working",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-07-15 02:27:25",
        "message":"And how would I know what is pin 1 on the trackpad connector and what that pin even is. This is all useless information.....\nMeasure on the board without trackpad connected. Or don't be lazy and take a separate trackpad and connect that."
    },
    {
        "post_id":23058,
        "thread_id":22978,
        "title":"820-00045 keyboard and trackpad not working",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2017-07-15 11:12:18",
        "message":"Okay I separated the trackpad and took these measurements with both the trackpad flex and keyboard flex plugged in.\n\nJ4801\nPin 40\/38\/36 - 7.64v\nPins 34\/32\/30\/28 - 0v\nPin 26 - 3.27v\nPin 24 - 5v\nPin 22 - 3.3v\nPins 20\/18 - 0v\nPin 16 - 3.3v\nPin 14 - 4.98v\nPin 12 - 0v\nPin 10 - 3.28v\nPin 8 - Pulses from around 2v down to as low as 1.8v\nPin 6 - goes from 0.18v to 0.27v\nPin 4 - 0v\nPin 2 - 0v"
    },
    {
        "post_id":23068,
        "thread_id":22978,
        "title":"820-00045 keyboard and trackpad not working",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-07-15 20:15:00",
        "message":"Come on man, missing half the pins......."
    },
    {
        "post_id":23072,
        "thread_id":22978,
        "title":"820-00045 keyboard and trackpad not working",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2017-07-15 20:35:14",
        "message":"[QUOTE=\"dukefawks, post: 23068\"]Come on man, missing half the pins.......[\/QUOTE]\n\nI don't understand. I gave the measurements for even pins from 2-40 and I thought the odd numbers from 1-41 where the previous measurements I gave from the connector that is on the trackpad.\nWhere are the other half of the pins so I can measure them and do I need to keep the trackpad flex cable plugged in?"
    },
    {
        "post_id":23114,
        "thread_id":22978,
        "title":"820-00045 keyboard and trackpad not working",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-07-17 12:58:56",
        "message":"So 1 and 3 have 8V, did you even compare this to the schematic and how this is impossible."
    },
    {
        "post_id":23128,
        "thread_id":22978,
        "title":"820-00045 keyboard and trackpad not working",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2017-07-17 22:06:46",
        "message":"I assumed pins 1 and 3 were on the connector that was on the trackpad but from reading the schematic it says its on the bottom side of the logic board which means I would need to disconnect the battery and measure under the board."
    },
    {
        "post_id":23130,
        "thread_id":22978,
        "title":"820-00045 keyboard and trackpad not working",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2017-07-17 23:17:19",
        "message":"Okay could you just help me to get it back working as it was before so I can send it back to the customer working as it was before.\nNow when I plug in the charger the machine doesn't turn on. Before the customer would keep it in sleep mode and I have a usb keyboard that would wake it up from sleep but its not turning on anymore.\nI disconnected the keyboard and trackpad cables and plugged in the charger to see if the screen would turn on but it doesn't.\nI get 3.3v on PP3V3_S0SW_LCD of j8300.\nI also still got 8.2v on F4800 as well as 3.3v on SMC_ONOFF_L on J4801.\n\nI tried shorting Pin 22(SMC_ONOFF_L) of J4801 to ground but that didn't work either."
    },
    {
        "post_id":23163,
        "thread_id":22978,
        "title":"820-00045 keyboard and trackpad not working",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2017-07-18 14:35:05",
        "message":"I haven't done anything to this machine except for try different flex cables. The last time I touched it was about 2days ago and it was turning on. The only thing I've messed with since then was the trackpad cable\/connector while leaving the battery connected.\n\nAlso, I measured the trackpad connector with no cables plugged in and I didnt get any voltages except for on SMC_LID, SMC_ONOFF_L and PPBUS_G3H_TPAD_FLT.\n\nShouldn't the machine turn on as soon as the charger is plugged in?"
    },
    {
        "post_id":23190,
        "thread_id":22978,
        "title":"820-00045 keyboard and trackpad not working",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2017-07-18 22:56:37",
        "message":"I went to the power aliases page and took measurements on the G3Hot, 5v, and 3v3 rails with the charger plugged in.\n\nAll of the \"G3Hot\" (Always-Present) Rails were present and measured fine except for PPVBUS_E85 which measured 14.9v instead of the 20v the schematic says.\nThere was 5v on PP5V_G3H_LDO but no voltage on all the other 5v rails and nothing on any 3v3 rails.\nPP5V1_S4SW was also 0v as well."
    },
    {
        "post_id":23237,
        "thread_id":22978,
        "title":"820-00045 keyboard and trackpad not working",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-07-19 15:34:41",
        "message":"I have no idea man, you could have poked\/shorted anything at this point. You fucked it up.....\n15V on E85 is the normal voltage and would indicate SMC and everything is running."
    },
    {
        "post_id":23241,
        "thread_id":22978,
        "title":"820-00045 keyboard and trackpad not working",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2017-07-19 15:39:48",
        "message":"Okay could you help me with which component creates the 5v_s4 rails and the 3v3_s5 rails. I'm looking at the schematic but I can't seem to find where they are created.\n\nI checked all the main power rails and none of them are shorted to ground in diode mode with battery disconnected.\nI checked L7520 where PP5V_S4 should be and it never has any voltage on it even when I initially plug the charger in.\n\n[USER=\"1\"]larossmann[\/USER] If I sent this to you how much would you charge to fix this if I send you the trackpad and cable also?"
    }
]