{"post_id":41878,"thread_id":41878,"title":"820-3330 Top Ram Slot Only Bad","user_id":515,"username":"SMMRepair","post_date":"2018-11-07 17:33:13","message":"Working on a liquid-damaged 820-3330 board, but that worked OK for a bit then began having issues. The board works perfectly except the top RAM slot (J2900) is not working at all--board beeps if RAM is installed in top slot at all. Works fine with only bottom slot occupied. Of course, I would recommend not fussing with it and just maxing out the working slot, but this is a board sent in for repair and customer would like it repaired.\n\nI have repaired dozens of bad RAM slots (top and bottom), and have never had an issue like this one. This board is a confusing one, and I fear it may end up being a PCH issue or something. Here's some information:\n\n1. No loose pins or corroded\/damaged pins visible. Diode mode readings all match a working board. No damage to any of the caps or anything relating to J2900. I've confirmed that there is continuity from the board\/joint to the inside slot for each pin. I've cleaned inside the slot and inside the pins as best as I can, but I don't think the issue is related to debris or gunk. If that were the case, I'd half expect the slot to \"sort of work\", but it doesn't work at all, ever. Tried heating it a bit with some flux just to try to clear out any debris inside, but it looks really good and clean.\n\n2. Bottom slot works perfectly and without issues.\n\n3. Tried replacing all the relevant 1.5_s3 DDR-related components (not many of them to try, so went ahead and did so--U7300\/fets\/etc). No change.\n\n4. Confirmed the smbus resistors (r5200\/01) for the RAM slots are reading proper (they are).\n\nAnything else I should check on this board? Can anything else on smbus affect only the top slot? I'd think if it were a sense issue, it would affect both slots, but not sure. Any suggestions before giving up? Usually bad top slot will be bad pins, not making contact, etc., but this one is none of those. I even measured the exposed pins on the RAM stick while it was installed and with power, and it has appropriate voltage across all I could measure, so contact is good. Is this possibly a PCH or CPU issue by chance? All help appreciated."}
{"post_id":41885,"thread_id":41878,"title":"820-3330 Top Ram Slot Only Bad","user_id":682,"username":"2informaticos","post_date":"2018-11-08 03:53:52","message":"RAM lines go to CPU.\nYou can have a broken solder under CPU, or RAM slot; one corroded\/broken trace also possible.\nCan you try a DDR3 test card (with LEDs)?\nUsually broken solders near the corners of the RAM slot..."}
{"post_id":41911,"thread_id":41878,"title":"820-3330 Top Ram Slot Only Bad","user_id":515,"username":"SMMRepair","post_date":"2018-11-08 16:06:32","message":"Unfortunately I don't have a RAM slot tester, but have ordered one today as I've needed one several times before.\n\nHowever, I decided to reflow the CPU and the RAM slot is now working properly. We'll see how long it lasts, but I believe there must have either been crap under the CPU, or maybe even a cracked solder ball\/trace there. After reflowing it a bit, the top slot is working well again."}
{"post_id":41916,"thread_id":41878,"title":"820-3330 Top Ram Slot Only Bad","user_id":1748,"username":"patrickribbsaeter","post_date":"2018-11-08 19:27:04","message":"[QUOTE=\"SMMRepair, post: 41911\"]Unfortunately I don't have a RAM slot tester, but have ordered one today as I've needed one several times before.\n\nWhere did u order the ram slow tester? im interested to buy one as well.. thank you"}
