{"post_id":24913,"thread_id":24913,"title":"[SOLVED] 820-3115 Liquid damage","user_id":651,"username":"RyanLEN","post_date":"2017-08-31 18:22:48","message":"Hey. Have this board with liquid damge missing PP3V42. Obvious damage was under the heatsink bar leading to the fins which I replaced as well as U5010. I now have PP3V42 with a green light but only for a minute with 1 fan spin. In diode mode I get 0.088 but this seems to be getting pulled to ground at pin 2 of L4901. Seeing that there isn't must between this point and the SMC is it safe to assume its time to replace the SMC? Or am I off the trail all together. LOL. I have already tried reflow with no success. I have never had to replace an SMC before so I have to buy the materials. Can someone suggest balls or paste? If so which ones exactly. Also which stencil do I use for this board? Along with anything else. Does it matter which stencil holder i get? Much appreciated. Have a good one.\n\nModerator edit: recommended solder paste and recommended SMC stencil."}
{"post_id":24926,"thread_id":24913,"title":"[SOLVED] 820-3115 Liquid damage","user_id":289,"username":"smiba","post_date":"2017-09-01 06:39:06","message":"When the charging light goes out again, does PP3V42 stay?"}
{"post_id":24928,"thread_id":24913,"title":"[SOLVED] 820-3115 Liquid damage","user_id":651,"username":"RyanLEN","post_date":"2017-09-01 08:17:35","message":"Hi. Thanks for your response. PP3V42 is now holding steady. Still 1 fan spin. 0.128V on pin 1 C4920. 3.47V on pin 2 of L4901 and pn1 of C4901. PP3V42 in diode 0.088 with L4901 in place. if I remove L4901 I get 0.338. Thanks"}
{"post_id":24952,"thread_id":24913,"title":"[SOLVED] 820-3115 Liquid damage","user_id":2,"username":"dukefawks","post_date":"2017-09-01 18:18:59","message":"Either your SMC is dead or it has crap on it. Normal diode mode for 3V42 is .320ish. I assume you ruled out C4901."}
{"post_id":25469,"thread_id":24913,"title":"[SOLVED] 820-3115 Liquid damage","user_id":651,"username":"RyanLEN","post_date":"2017-09-17 13:19:21","message":"Yes. Replaced SMC today. All is good. Thanks, have a good one."}
