[
    {
        "post_id":89449,
        "thread_id":62709,
        "title":"820-01949 freeze when HDMI connected",
        "user_id":145,
        "username":"Sykulski",
        "post_date":"2022-05-19 22:20:05",
        "message":"Here is another one with weird behavior.\n\nThere is no liquid and no dust or debris. Board looks very nice. Machine runs fine.\n\nBut when an external HDMI display is connected to USB-C (through adapter, dock or whatever I try) the machine starts to lag extremely much. It lags so much so it seems like it freezes totally. It is absolutely useless. When moving the mouse pointer it is like it just “jumps” to a new position every 5 seconds. Also the external display stays black and in the display settings no external display gets registered\/recognized.\n\nAll 4 ports same issue. I also tested with an external hard drive. This one works so it seems to be Thunderbolt related but not USB related.\n\nWhen I unplug HDMI the machine goes back to normal again.\n\nAny hints to where to begin?"
    },
    {
        "post_id":89450,
        "thread_id":62709,
        "title":"820-01949 freeze when HDMI connected",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-05-20 02:14:06",
        "message":"Check if HWMonitor reports some strange I\/V sensors value; when HDMI is connected."
    },
    {
        "post_id":89467,
        "thread_id":62709,
        "title":"820-01949 freeze when HDMI connected",
        "user_id":145,
        "username":"Sykulski",
        "post_date":"2022-05-21 02:13:55",
        "message":"Hi, thanks for replying.\n\nHWMonitor is not working correctly in Monterey but I checked with iStat Menus which is not showing any big differences"
    },
    {
        "post_id":89468,
        "thread_id":62709,
        "title":"820-01949 freeze when HDMI connected",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-05-21 02:51:24",
        "message":"Did PRAM reset?\nJust in case, try DFU revive.\n\nHow the problem appeared?"
    },
    {
        "post_id":89475,
        "thread_id":62709,
        "title":"820-01949 freeze when HDMI connected",
        "user_id":145,
        "username":"Sykulski",
        "post_date":"2022-05-21 11:04:22",
        "message":"Yes PRAM did no difference \n\nCustomer just discovered the issue one day he needed to connect external display. Problem may have existed for longer time as machine seems to be working fine unless you plug in HDMI (or other Thunderbolt accessories according to my testing described below)\n\nI did some extra testing and it appears to be problem with Thunderbolt because I tested an external harddrive in af Thunderbolt to SATA caddy and then the harddrive is not turning on. But in this case there is no freeze\/lag like the HDMI problem - just no connectivity with the harddrive. Then I also tried to connect LAN adapter via Thunderbolt and this also not working. But LAN through a USB-C dock works probably because it runs on USB bus (identifies in network settings as \"USB 10\/100\/1000 LAN\")\n\nI will try revive (and\/or restore) next week when back to work\n\nThanks again. If you have any other suggestions in the meantime please let me know."
    }
]