[
    {
        "post_id":91472,
        "thread_id":62944,
        "title":"SOLVED - 820-00165 - Not Charging Battery, although shows charging sign and runs off a battery",
        "user_id":25485,
        "username":"it-solve",
        "post_date":"2022-07-27 19:13:12",
        "message":"Got this A1466 with shorted PPBUS_S5_HS_COMPUTING_ISNS C7313 Tantalum Cap and  F7140 Fuse. Now turns on and works on Battery. It Shows Battery Charging but pulls under 0.6A and does not charge the battery. After draining the battery, is now not charging it anymore. Tested another charged battery, and shows the same symptoms.\n\nHad slight corrosion on SMC_REST_L line, replaced R5100 and resoldered C5495.\n\nU7100 Voltages (on a Batt and Charger) seem fine. Placed them on an image hopefully for easy reading.\n\n[ATTACH type=\"full\" alt=\"1658974348520.png\"]60713[\/ATTACH]\n[URL='https:\/\/ibb.co\/XbhDdNk'][IMG]https:\/\/i.ibb.co\/KXMDQRz\/A1466-820-00165-U7100-Charging-Voltages.png[\/IMG][\/URL]\n\nAny Suggestions?"
    },
    {
        "post_id":91481,
        "thread_id":62944,
        "title":"SOLVED - 820-00165 - Not Charging Battery, although shows charging sign and runs off a battery",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-07-28 01:22:51",
        "message":"You should test battery SMBUS on the MLB and Harald has a very good tool for this.\n[URL unfurl=\"true\"]http:\/\/www.cmizapper.com\/products\/battery-port-tester.html[\/URL]\nI got it, but didn't play with it yet.\n\nNLBA can also test the battery itself.\n[URL unfurl=\"true\"]https:\/\/www.laptopu.ro\/[\/URL]\nI'm pending to get one and I'll post detailed information about how it help with MacBooks.\nNicusor (project owner) said it can reset\/repair any battery.\n\nWe need to discard between battery and MLB problem somehow in the Apple world.\nTwo many machines get weird issues with \"seems good\" battery, or chinese new.\n\nLook at battery information reported by macOS in System Information.\nCheck SMC_DCIN\/BMON_ISENSE levels.\nAlso check diode mode to ground at SCL\/SDA lines of battery bus.\nJust in case, change Q7155."
    },
    {
        "post_id":91499,
        "thread_id":62944,
        "title":"SOLVED - 820-00165 - Not Charging Battery, although shows charging sign and runs off a battery",
        "user_id":25485,
        "username":"it-solve",
        "post_date":"2022-07-28 17:24:11",
        "message":"Thanks, suspecting the SMC reset after fixing that traces didn't go well. Tested with third battery and start charging. When I placed the original battery now, it is pulling >1A current, but seems like internally is not functioning well as it shuts down the minute I pull the plug. \n\nWorks with another battery and charges well, though.\n\nRegarding these, I have seen them but am not sure how usable will be in my workshop. With NLBA, unless I plan to repack\/recycle and sell used batteries, which will be hard to convince a customer. I cannot see commercial use of it. Considering new doggy replicas go for under 100$. It will probably be better with a recycled battery with this tool than a doggy amazon\/eBay battery, but it's still hard to convince to be paid for it.\n\nPort tester makes sense."
    }
]