{"post_id":41075,"thread_id":41075,"title":"Macbook air 820-3437-b u3900 HoT","user_id":1840,"username":"Biggtechman","post_date":"2018-10-22 23:20:15","message":"Hello all.\nI have finally found what I believe to be the problem with this macbook.\n\nthis is not my first post regarding this repair.\n\nThe macbook does not boot. \nmain power rails are present.\n\nu3900 gets hot fast after it has mag plugged in. But no boot and no power.\n\nhas anyone got any recommendation as to what I can do about this.\nThe board originally had water damage around r1661 the test point for r1661, r1663, r1669 were completely corroded.\n\n R1663, r1662, r1664 have been removed.\nbut I dont see how they could cause u3900 to heat up so much.\n\nany suggestions or advice is appreciated \nthanks"}
{"post_id":41079,"thread_id":41075,"title":"Macbook air 820-3437-b u3900 HoT","user_id":682,"username":"2informaticos","post_date":"2018-10-23 03:38:57","message":"\"no boot and no power\"\nYou mean the board doesn't even try to start?\n\n\"main power rails are present\"\nWhich ones, if you told no power???\n\nCamera (U3900) is only powered up in S0 state. via R5421.\nWill stay U3900 cold if that resistor is removed?\nIt gets other voltages, but all in S0 state.\nPlease be clear in which sleep state stays your board.\n\nHowever, U3900 is probably bad, it shouldn't go very hot nor even when is working.\nYou can rip it off and check if board starts."}
{"post_id":41091,"thread_id":41075,"title":"Macbook air 820-3437-b u3900 HoT","user_id":1840,"username":"Biggtechman","post_date":"2018-10-23 07:54:23","message":"Ok thanks.\nthe board shows no sign of life asides from having the power rails in state s5 \n\nI have put posts up about this board and gone through what rails are present.\n\nI will remove that chip since it is not needed to run the machine. Thanks"}
{"post_id":41095,"thread_id":41075,"title":"Macbook air 820-3437-b u3900 HoT","user_id":682,"username":"2informaticos","post_date":"2018-10-23 09:27:46","message":"U3900 is not needed to start the board.\nBut you need to replace it, once the board will start working properly; unless you don't need the camera...\n\nBTW, we will not search other thread about the same board, to see which voltages are present, or not.\nKeep one thread open only, so we have all the info \"at hand\"..."}
{"post_id":41121,"thread_id":41075,"title":"Macbook air 820-3437-b u3900 HoT","user_id":1840,"username":"Biggtechman","post_date":"2018-10-23 16:48:53","message":"Ok cool thanks.\nand yes, sorry about that.\nI'll test rails and report back asap.\nthanks again"}
