{"post_id":75996,"thread_id":61257,"title":"820-00840 - Missing PPVCCGT_S0 - No display on internal nor external","user_id":427,"username":"overshoot","post_date":"2021-05-31 06:42:31","message":"Hello,\n\nI have that board that had a prior repair attempt.\nI don't have any history from the customer on it.\nThe only thing that I saw was the board have been reflowed in the USB-C area. There was also 2 missing diodes of the keyboard I2C lines but I have put these back already.\nOther than that, I can't find anything that looks funny or reworked.\n\nI am getting 20V and the board seems to turn on.\nI am getting all the expected voltages on the coils near the CPU but I am missing PVCCGT_S0 which is for the graphic cores if I am not mistaken.\nI don't get a display on the internal display nor if an external display is connected.\n\nBoard turns on, gets 20V, seats around 0.5A and then goes back to 0A (which my known good board does not) then back to 0.5A and drops to 0.45A\nI've measured the resistance to ground on PPVCCGT_S0 and I'm getting 2ohms, same with my known good board.\n\nHow to find out if I am getting the enable signal for that rail (PPVCCGT_S0)?\nIt's coming from the PMIC, correct?\n\nThat looks to me like a faulty CPU but I am wondering if I should give the PMIC a swap for the sake of trying (or a reflow first)?\nSounds like a good idea?"}
{"post_id":75997,"thread_id":61257,"title":"820-00840 - Missing PPVCCGT_S0 - No display on internal nor external","user_id":427,"username":"overshoot","post_date":"2021-05-31 06:57:04","message":"CPU_VCCST_PWRGD is at 0.9V\nALL_SYS_PWRGD is at 3.3V\nPM_PCH_SYS_PWROK is at 3.V \nPM_RSMRST_L is at 3.3V\nPM_PCH_PWROK is at 3.3V"}
{"post_id":75998,"thread_id":61257,"title":"820-00840 - Missing PPVCCGT_S0 - No display on internal nor external","user_id":682,"username":"2informaticos","post_date":"2021-05-31 08:16:56","message":"As you have an working board, you should know iGPU voltage is not present when the board boots.\nThat voltage is not required, until high graphics load is detected; and we've already talked about that on the forum.\n\nPost CPU core voltage after 10s; you should note a drop to 0.6V (if really boots).\nDid you check for USB activity?\nYou can try known good BIOS dump.\n\nBTW, some people reported intentionally damage done on boards by previous tehcnicians, when they cannot fixed them.\nI recommend to inspect for ripped off components."}
{"post_id":76019,"thread_id":61257,"title":"820-00840 - Missing PPVCCGT_S0 - No display on internal nor external","user_id":427,"username":"overshoot","post_date":"2021-05-31 22:00:55","message":"I swear I've made a search first on that rail name to see if anything would show up so I could read that first but nothing.\nI understand that you must be answering a lot of same things over and over again so I'm sorry about it.\n\nI'll answer you shortly about that CPU vcore voltage, USB activity and once I've tried a known good Bios.\n\nFor the ripped off parts, like I said, I already did find those 2 diodes and when I saw that, I've spent almost 15mins looking around for other messed up parts but couldn't find anything else."}
{"post_id":76022,"thread_id":61257,"title":"820-00840 - Missing PPVCCGT_S0 - No display on internal nor external","user_id":427,"username":"overshoot","post_date":"2021-06-01 03:19:46","message":"So there is no USB activity, only power.\nPPVCCCPU_S0G stays at 0.95V and never drops even after 30s.\n\nI've tried a different Bios and same thing.\n\nOne thing to note is that the board goes to 19.5V and draws 0.5A for a few seconds and then amperage drops to 0 as if there was some kind of reset going on.\nThen it goes back to 0.5A and will drop to 0.45A and 0.37A and stays there.\n\nKnown good board does not reset like that."}
{"post_id":76023,"thread_id":61257,"title":"820-00840 - Missing PPVCCGT_S0 - No display on internal nor external","user_id":682,"username":"2informaticos","post_date":"2021-06-01 03:56:16","message":"Pretty lost case.\nMaybe faulty CPU, or damage induced by other service."}
