[
    {
        "post_id":81696,
        "thread_id":61873,
        "title":"820-00165 pulsing twice",
        "user_id":1427,
        "username":"Narek",
        "post_date":"2021-10-22 04:15:13",
        "message":"I'm working on 820-00165 board, which came to me completely dead. After inspection  I found out:\n\n\n- small corrosion between C7400 \/C7425 and C2951\/C2952\n- PP3V3_S4 was completely shorted to ground, but it was caused by damaged U8000 (no corrosion around). \n\nI've replaced caps and U8000. Now board is pulsing twice without fan spin and nothing other happens. All S0 rails are pulsing, including CPU and PCH VCORE.\n\nWhat I have done so far: \n\n- checked U6100\/J6100 and all termination resistors \n- tried new SPI chip and known good BIOS with clean ME region\n- replaced U6101 and U1900, area of U1950 looks perfect\n- there are no broken\/corroded traces or test points\n- checked current sensing resistors, even replaced U7100\n- reballed and then repalced SMC (just in case)\n- SMC bypass gives me two short fan spins, then nothing. After pressing power button i get only one fan spin.\n\nIs it worth spending time and digging into this board or it's obvious behaviour for damaged of CPU\/PCH?"
    },
    {
        "post_id":81699,
        "thread_id":61873,
        "title":"820-00165 pulsing twice",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-10-22 07:26:33",
        "message":"There could be accumulated crap underneath CPU; especially PCH area.\nYou can try to heat it, just in case.\n\nPLT_RESET_L pulsing too?"
    },
    {
        "post_id":81702,
        "thread_id":61873,
        "title":"820-00165 pulsing twice",
        "user_id":1427,
        "username":"Narek",
        "post_date":"2021-10-22 08:01:22",
        "message":"Yes, PLT_RESET_L pulses twice to 3,3v then drops to 0v and stays like that."
    },
    {
        "post_id":81782,
        "thread_id":61873,
        "title":"820-00165 pulsing twice",
        "user_id":1427,
        "username":"Narek",
        "post_date":"2021-10-25 08:30:45",
        "message":"[USER=682]@2informaticos[\/USER], I have heated CPU with flux and later put board in USC, sadly it hasn't changed anything..."
    },
    {
        "post_id":81784,
        "thread_id":61873,
        "title":"820-00165 pulsing twice",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-10-25 09:13:21",
        "message":"If cannot find any damaged resistor\/trace, then should be bad CPU..."
    }
]