[
    {
        "post_id":10286,
        "thread_id":10286,
        "title":"820-3437 Does not power on",
        "user_id":67,
        "username":"bighead",
        "post_date":"2016-11-27 18:24:28",
        "message":"Hi,\n\nI've this liquid damaged board here.\n\nThere is green and orange light on the charger.\nIt does charge the battery.\n\nPPBUS_G3H - 8.57V\nSMC powers on.\n\nPP3V3_S5 presents.\n\nBefore the repair the board was in S3 state.\n\nALL_SYS_PWRGD was missing and it was 125 Ohm.\nI found PP1V05_S0 shorted. I changed U7600.\nPIN 11 on the board was totally corroded so I fixed that with a jumper cable.\n\nAlso U1950 looked pretty pad so I replaced that one too.\nHere PIN 8 was missing. I fixed that also with a jumper cable.\n\nAfter this, the board went into the ultrasonic cleaner.\n\nNow, looks like all the power rails come up for a second, but the fan does not spin.\n\nThe liquid damage was around the BIOS chip.\nU7600 and U1950. Some was around the SMC.\nI pulled the WLED driver because it looked really bad.\n\nIf I'm not mistaken Y1905 was oscillating prior the repair. Now there is 0.9V but it does not oscillate.\n\nI also pulled the BIOS chip because PIN 8 was totally corroded.\nEven without the BIOS chip fan doesn't move.\n\nAfter this I reballed the SMC. Didn't help anything.\n\nIf I leave the board on the charger U7100 gets warm. I changed it just for the hell of it.\n\nAny idea?\n\nThank you."
    },
    {
        "post_id":10289,
        "thread_id":10286,
        "title":"820-3437 Does not power on",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-11-27 19:21:51",
        "message":"It will power cycle without ROM chip. Check the resistors in series with the ROM data lines. CPU Vcore should be pulsing too"
    },
    {
        "post_id":10314,
        "thread_id":10286,
        "title":"820-3437 Does not power on",
        "user_id":67,
        "username":"bighead",
        "post_date":"2016-11-28 04:27:09",
        "message":"I checked the resistors I changed those which looked bad, but still nothing.\nI can see that CPU VCORE comes up for a sec. Again, fan didn't spin. Not even just for a millisecond."
    },
    {
        "post_id":10315,
        "thread_id":10286,
        "title":"820-3437 Does not power on",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-11-28 04:30:46",
        "message":"It is power cycling. Could be anything, the usual is U1950, U6100 and resistors around it and the clock chip. Was pin 8 on the ROM fixed? ROM must be present for the board to power up."
    }
]