{"post_id":54283,"thread_id":54283,"title":"820-00281-A \"The big Dog!\"  ( no image.  Boot looping )","user_id":5210,"username":"KC Micro Tronix","post_date":"2019-11-07 12:46:35","message":"I am a virgin with this board. This is my first one!\nIt switches to 20v Pulls what appears to be booting current but it's not normal and a little high at the end before it drops to zero and loops. The loop takes 15-20 seconds to complete.\n\nI am looking for schematics now. I will be updating this thread in real time as I try to figure out this monster of a board! I have two of these boards in the Drawer that I have scrounged off ebay the past few months. One appears to boot but I have never had a screen or a machine to test them until today!\n\nWish me luck!\n\n\n* update\nJust got the schematics and Board View from Bad Caps. I'm going in!"}
{"post_id":54284,"thread_id":54283,"title":"820-00281-A \"The big Dog!\"  ( no image.  Boot looping )","user_id":5210,"username":"KC Micro Tronix","post_date":"2019-11-07 12:51:03","message":"[HR][\/HR]"}
{"post_id":54286,"thread_id":54283,"title":"820-00281-A \"The big Dog!\"  ( no image.  Boot looping )","user_id":5210,"username":"KC Micro Tronix","post_date":"2019-11-07 13:37:24","message":"My reference board I purchased on eBay which I thought was a booting board because I could see current draw and activity at 20v turns out suffered the exact same fate as this board. Same symptoms and same problem. No display. I also compared thermal signatures and they were exactly the same. No screaming at you hot spots. I have one more board to try then I have to switch to \"Brain mode\" and drop to schematics. I have never seen one of these working so I really don't know what thermal signatures and values should be.\n\neBay board #2......\nThis board gets the 20V but does not boot. After some quick checking I discovered a short on L8000 and after looking at the PCH I see a little brown tear drop. So this one is headed to the rework machine. I just checked and I do have a nozzle that fits this chip!  I was able to source these chips and the 90x90 stencil on Aliexpress.  They are on the way.  They are a little complex to do by hand so I am going to reach out to one of my vendors for a junk board to get the machine profile tested.   For all I know these other tow boards could be those junk boards.\n\nSo at this point I do not have a working reference board to figure this out.\nGuidance Anyone?"}
{"post_id":54287,"thread_id":54283,"title":"820-00281-A \"The big Dog!\"  ( no image.  Boot looping )","user_id":5210,"username":"KC Micro Tronix","post_date":"2019-11-07 13:56:49","message":"[No message]"}
{"post_id":54293,"thread_id":54283,"title":"820-00281-A \"The big Dog!\"  ( no image.  Boot looping )","user_id":682,"username":"2informaticos","post_date":"2019-11-07 18:08:40","message":"Did you check USB activity, apart of searching for video?"}
{"post_id":54307,"thread_id":54283,"title":"820-00281-A \"The big Dog!\"  ( no image.  Boot looping )","user_id":5210,"username":"KC Micro Tronix","post_date":"2019-11-07 23:15:50","message":"Yes, Fan spin, usb activity, power button functions to turn off and on.\nI am digging in deeper now.  \n\nI believe the board is functioning.  I am getting both the PP3V3_SOSW_LCD and the PP5V_SOSW_LCD signals after a brief wait period of booting.  I do not have a test LCD and believe this one could bad.  This is not a back light issue as the LCD even with a flash light displays nothing but those signals would not be present unless the CPU was ready for them.  Could this be the MUX?"}
