[
    {
        "post_id":47620,
        "thread_id":47620,
        "title":"820-3115-B, dim green light on magsafe + short on PPBUS_G3H?",
        "user_id":2088,
        "username":"Hardwood T\/S",
        "post_date":"2019-03-19 12:59:35",
        "message":"Liquid damage wasn't too extensive, but particularly bad regarding the pads of F9700--the corrosion essentially ate it's way thru some of the board, and there's a shallow divot where the pads should be. Otherwise, some slight corrosion and a totally burnt out L9004, same issue with F9700 where it's eaten slightly thru the board. The area directly to the bottom of F9700 was somewhat liquid damaged, no heavy corrosion but the components don't look stellar.\n\nPP3v42 is fine, PPBUS_G3H is sitting slightly under 1v, at around .990v. Pretty sure the short is on PPBUS_G3H side, as w\/F7040 removed the short to ground disappears on PPVBAT_G3H_CGHR_REG, but BUS_G3H remains at 0.00v in diode mode, some other lines are shorted to ground, PP3V3_S0 is also 0.00v in diode mode--haven't gone thru the whole G3H and S0 rails yet tho.\nWhen plugged into magsafe, you get a dim green light and some immense heat coming from U9701's right side of resistors. I tried removing U9701 and those resistors to see if any of the shorts on the main lines would go away, but they didn't, and that's the only place on the board I'm getting heat.\n\nGuessing you guys will tell me to check the rest of the main rails to see what else is missing, so I'll do that while I wait for a response, but what do you think it could be? I did reflow the SMC as there was some slight corrosion on the top end of the board but like I said, very light stuff and it changed nothing."
    },
    {
        "post_id":47623,
        "thread_id":47620,
        "title":"820-3115-B, dim green light on magsafe + short on PPBUS_G3H?",
        "user_id":2088,
        "username":"Hardwood T\/S",
        "post_date":"2019-03-19 13:38:05",
        "message":"PPBUSG3H - .920v, shorted to ground (0.00v\/ohms in diode + resistance)\nPPVIN_SW_T29BST - .003v, no shorts PPBUS_S5_HS_COMPUTING_ISNS - .870v, shorted to ground (0.00v\/ohms in diode + resistance)\n PPBUS_S5_HS_OTHER_ISNS - .873v, shorted to ground (0.00v\/ohms in diode + resistance)\nPPDCIN_G3H - Cycles every couple seconds, maxes at 1v, no shorts\nPP3V42_G3H - 3.47v\nPPVRTC_G3H - 3.47v"
    },
    {
        "post_id":47625,
        "thread_id":47620,
        "title":"820-3115-B, dim green light on magsafe + short on PPBUS_G3H?",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-03-19 13:44:55",
        "message":"If you remove F9700 is there still a short? If so, you have a short in the board where the fuse use to be. If no, then this will be a situation where you need to soldered the fuse directly to Q9706 and jump the PPBUS pad to somewhere like R4260 to prevent the shorted area of the board from being used."
    },
    {
        "post_id":47626,
        "thread_id":47620,
        "title":"820-3115-B, dim green light on magsafe + short on PPBUS_G3H?",
        "user_id":2088,
        "username":"Hardwood T\/S",
        "post_date":"2019-03-19 13:49:38",
        "message":"Wow--was assuming F9700 was a developer component and not used on the actual board, since my reference 3115 was also missing the fuse. Checked another board I had after you mentioned that, and there she was. I'll be doing your second option to try and remedy this!"
    },
    {
        "post_id":47627,
        "thread_id":47620,
        "title":"820-3115-B, dim green light on magsafe + short on PPBUS_G3H?",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-03-19 13:56:27",
        "message":"Yeah no F9700 is THE backlight fuse for this model. I have seen a few times where the pads blow very badly on these and can cause an internal short. Sometimes this is resolveable. Hopefully, yours is"
    },
    {
        "post_id":47629,
        "thread_id":47620,
        "title":"820-3115-B, dim green light on magsafe + short on PPBUS_G3H?",
        "user_id":2088,
        "username":"Hardwood T\/S",
        "post_date":"2019-03-19 14:41:15",
        "message":"No luck unfortunately, soldered a fuse between Q9706 and R4260 and their respective pads, still a short on PPBUS_G3H. Guessing this guy is as good as done. I'll add a pic of the corroded pads to give some context as to the severity--I have a feeling it's probably an internal short.\n\n[ATTACH type=\"full\"]47631._xfImport[\/ATTACH]"
    },
    {
        "post_id":47633,
        "thread_id":47620,
        "title":"820-3115-B, dim green light on magsafe + short on PPBUS_G3H?",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-03-19 16:55:54",
        "message":"You can try to dig the short out\/dremmel it out but it?s a 50\/50. I had one that the short was still present even with a hole in the board where the fuse use to be."
    },
    {
        "post_id":47634,
        "thread_id":47620,
        "title":"820-3115-B, dim green light on magsafe + short on PPBUS_G3H?",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-03-19 18:39:49",
        "message":"Do you still have short on PPBUS_G3H when remove F9700?\nIf not, you still have a chance..."
    },
    {
        "post_id":47654,
        "thread_id":47620,
        "title":"820-3115-B, dim green light on magsafe + short on PPBUS_G3H?",
        "user_id":2088,
        "username":"Hardwood T\/S",
        "post_date":"2019-03-20 13:41:44",
        "message":"No, the fuse was totally blown off the board when I had gotten it and I just didn't realize until later what was supposed to be there. Board has been shorting since the beginning, without F9700 attached--there aren't any pads to solder a new fuse on in it's original place. With it reattached to the respective pins of Q9706 and R4260, short is still present. Unless you mean removing the newly soldered F9700 on the flipside to see if there's still a short, I'm pretty sure this guy is dead and has been since the beginning.\nAs a sidenote, I did dremel slightly into the board and I still have a short. One more board for parts."
    },
    {
        "post_id":47663,
        "thread_id":47620,
        "title":"820-3115-B, dim green light on magsafe + short on PPBUS_G3H?",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-03-20 18:42:16",
        "message":"Yeah your short is in the board oh well it happens"
    }
]