{"post_id":100702,"thread_id":64067,"title":"820-4924 charging problem","user_id":53445,"username":"Mike H","post_date":"2023-07-18 22:43:50","message":"I have an 820-4924 that came in with no power, not charging. R7020 was visibly burned so I replaced it along with C7091 which was dead short and appears to have been at least one of the problems. Now when I plug in the charger I get 16.5 volts on the PPDCIN_G3H_ISOL side of R7020, but only about 2.5 volts on the PP18V5_DCIN_CONN_R side. I have replaced U7100 but no change. PPBUS_G3H goes to about .7 volts when plugged in and then starts to drop while the probes are connected.\n\nR7005 was blemished and measuring 15 ohms. I also replaced that and measured all other resistors in the area which tested good.\n\nPPBUS_G3H .700V and dropping when probes are attached diode mode shows .124V\n\nPPDCIN_G3H 16.5V\n\nPP3V42_G3H 1.41V\n\nPPVIN_G3H_P3V42G3H 2.14V\n\nDCIN_ISOL_GATE 6.8V\n\nPPDCIN_G3H_ISOL 16.5V\n\n\nLogic board is very clean and shows no signs of moisture\/corrosion. Any suggestions are appreciated."}
{"post_id":100705,"thread_id":64067,"title":"820-4924 charging problem","user_id":682,"username":"2informaticos","post_date":"2023-07-19 03:18:40","message":"First of all, welcome to the forum!\n\nYou must get correct 3V3_G3H first.\nCheck if R7020 is still good (47 ohm) and check diode mode to ground at C7090.\nIf low, remove C7090\/2 (one by one) and check again; U7090 is the last suspect.\nDon't fotget to check D7005."}
{"post_id":100717,"thread_id":64067,"title":"820-4924 charging problem","user_id":53445,"username":"Mike H","post_date":"2023-07-21 15:45:09","message":"Thanks for the welcome and for assisting me with this issue. R7020 was in fact the problem and now I have a functional charging system! For some reason though, the fan does not work. I tested it using a power supply and it is definitely capable of spinning. PP5V_S0 is present at the connector as well as 3.3V on pin 4, FAN_RT_TECH. That lead me to believe that there was something possibly wrong with FAN_RT_PWM. Diode mode there shows .510V. Following that to Q6060 it seems that R6060 was a bit low. About 23k instead of 47k so I replaced it and when that did not change anything, I replaced Q6060. Still no fan. Since Q6060 gets data from the SMC is that the next place to look?"}
{"post_id":100718,"thread_id":64067,"title":"820-4924 charging problem","user_id":682,"username":"2informaticos","post_date":"2023-07-21 16:14:55","message":"Do NOT touch fan circuitry.\nIt doesn't spin until CPU gets really hot on this model!"}
