[
    {
        "post_id":45761,
        "thread_id":45761,
        "title":"820-00165 not recognising the ssd, fan spins and chimes.",
        "user_id":2306,
        "username":"PCTRONICS",
        "post_date":"2019-02-05 23:41:01",
        "message":"820-00165 no ssd detected. wifi works, it chimes, usb mouse powers up, fan does not cycle. im getting voltage to the ssd coil. main rails appear to be ok.\n\nHistory, Liquid damaged but was ultrasonicly cleaned by previous tech. C1053  Pin2 GND was corroded so i ran jumper to C1043 Pin2 GND. \nU5800 has been messed with but dont think this has any affect, i could be wrong. U6100 looks like its been reflowed as it has hallmarks of a tech who uses no flux, it seems okay. ISL6259 has had its R7121\/2 resistors replaced. and Fuckme the smc silicone is gone! LP8550 has obviously been changed too. all in all this system looks pretty healthy. no burnt points. Oh JTAG is missing.\n\nany assistance on where to start would be great. ill start measuring the rails again."
    },
    {
        "post_id":45763,
        "thread_id":45761,
        "title":"820-00165 not recognising the ssd, fan spins and chimes.",
        "user_id":2306,
        "username":"PCTRONICS",
        "post_date":"2019-02-06 01:41:32",
        "message":"Ive tried to factory reset it but it hangs and does not go any further than connect to wifi and apple logo loading.\n\nafter double checking some rails it appeared that i was not getting pp3v42_g3h it was reading 2.19v and flucuating. u7090 voltages were screwed so i replaced it and now pp3v42 is present but still no SSD showing up. ive tried with a good known ssd with os already loaded but still no detection."
    },
    {
        "post_id":45769,
        "thread_id":45761,
        "title":"820-00165 not recognising the ssd, fan spins and chimes.",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-02-06 01:56:02",
        "message":"Post voltages for U3740."
    },
    {
        "post_id":45792,
        "thread_id":45761,
        "title":"820-00165 not recognising the ssd, fan spins and chimes.",
        "user_id":2306,
        "username":"PCTRONICS",
        "post_date":"2019-02-06 13:32:33",
        "message":"U3740 P1 3.46v P2 1v P3 3.3v P4 3.45v P5 0v P6 3.254v P7 0.001v P8 0v"
    },
    {
        "post_id":45794,
        "thread_id":45761,
        "title":"820-00165 not recognising the ssd, fan spins and chimes.",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-02-06 14:01:49",
        "message":"All good there.\nDid you try other SSD, or this one in other machine?\n\nCheck if PP3V3_S0SW_SSD_FLT arrives to J3700.\nAlso check SSD_SR_EN_L and all capacitors from data lines.\nPay atention to U3710\/11 too."
    }
]