{"post_id":57840,"thread_id":57840,"title":"820-00138 FAn Spins for 5 Sec and stop then fans spins continuously  No chime.","user_id":1061,"username":"Don Anton","post_date":"2020-03-29 05:23:34","message":"Hi,\n\nThere is no any damaged on this board.\nI get all the power rails accurately. Initial issue was quater fan spin. How ever I replace the bios with same model board bios to check then it chimes and could get display.\nThen I tried to clear me Reagan on that bios using medusa. And back to old problem fan spins and stop. I tried original bios with clean me , complete new bios, bios from same type of board.replaced \nsmc. with all this same issue now fan spins for 5 sec, then fan spins for ever no chime. Checked bios traces and resisters and they are fine.  All the tests with no USB light,\n\nPLT_RESET_L and PLT_RST_BUF_L is 3.3v and stable.\n\nTried with out bios no fan spins, USB light blinks."}
{"post_id":57843,"thread_id":57840,"title":"820-00138 FAn Spins for 5 Sec and stop then fans spins continuously  No chime.","user_id":682,"username":"2informaticos","post_date":"2020-03-29 06:45:54","message":"So  board doesn't boot now, even testing with BIOS file which worked before?\n\nYou could have CPU issue, as these boards suffer because of CPU power supply problems; read about FDMF6808 chips."}
{"post_id":57854,"thread_id":57840,"title":"820-00138 FAn Spins for 5 Sec and stop then fans spins continuously  No chime.","user_id":1061,"username":"Don Anton","post_date":"2020-03-29 16:34:49","message":"Hi , Thank you for your reply. yes it doesnt boot now. fan spins then stop and fanspins again for ever. No usb mouse light. regards FDMF6808 chips, If i have replace these do i have to replace all 3 of them?"}
{"post_id":57861,"thread_id":57840,"title":"820-00138 FAn Spins for 5 Sec and stop then fans spins continuously  No chime.","user_id":682,"username":"2informaticos","post_date":"2020-03-29 18:41:54","message":"Should be all replaced, but damaged CPU will not come back to life; if that is the case.\nInspect first for knocked off components around SPI chip; if you removed it from the board.\nAlso check integrity of all SPI Bus Serie Termination resistors and traces."}
