[
    {
        "post_id":24707,
        "thread_id":24707,
        "title":"820-4924 no boot, was working sporadically before",
        "user_id":86,
        "username":"samiam",
        "post_date":"2017-08-27 16:18:19",
        "message":"customer brought in and said it needed a new keyboard, because it wouldn't turn on reliably which I did and tested it on and off fine 3 times before closing up.  this was definitely in the top 3 of must disgusting keyboards, with all types of crap in there.\n\nafter he took it back it didn't turn on again, and he complained it was hot, even though it was off. i took a look and board was getting hot under ssd.   I noticed a tiny bit of crap on edge of smc, also smc was warm so I tried cleaning a little with alcohol and blowing hot air and flux under\n\nkeyboard smc reset does change light color from orange to green\nbut still no boot or chime\n\nafter cleaning, spot under ssd is still warm but now farther to left, versus before opposite smc\nnow U8070 is actually hot to touch\n\ndoes that make sense that it's holding up booting (even though there is no ssd actually present)\nor is the smc fried\n\nany easy way to tell?"
    },
    {
        "post_id":24722,
        "thread_id":24707,
        "title":"820-4924 no boot, was working sporadically before",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-08-28 02:10:17",
        "message":"U8070 is on a 3V_S0 rail so something must be powering up for that to get hot. Check for short to GND on pins 3,5."
    },
    {
        "post_id":24734,
        "thread_id":24707,
        "title":"820-4924 no boot, was working sporadically before",
        "user_id":86,
        "username":"samiam",
        "post_date":"2017-08-28 06:27:33",
        "message":"i put on another chip and now all the lines are reading proper at 3.3V, not getting hot anymore.  but still no boot.  any ideas? maybe i should ultrasonic the whole thing? board didn't really get wet as far as I can tell, but there was just so much crap and debris in there who knows"
    },
    {
        "post_id":24756,
        "thread_id":24707,
        "title":"820-4924 no boot, was working sporadically before",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-08-28 19:07:00",
        "message":"Again, if 3V_S0 is present the board is doing something. Check some voltages!"
    },
    {
        "post_id":24775,
        "thread_id":24707,
        "title":"820-4924 no boot, was working sporadically before",
        "user_id":86,
        "username":"samiam",
        "post_date":"2017-08-29 05:03:32",
        "message":"ok will start going thru rails today"
    }
]