{"post_id":93690,"thread_id":63246,"title":"Razer Blade RZ09-01953 Switches off under Nvidia GPU load","user_id":25485,"username":"it-solve","post_date":"2022-11-04 19:58:44","message":"Working on this Razor Blade RZ09-01953, which seems to work fine on light tasks or when the GPU stress test is running under Intel, but the minute it runs under Nvidia, it cuts power.\n\nCould it be GPU failure? I ran some GUI mem tests and came up fine. MATS GPU RAM test doesn't seem to boot\n\nHas anybody experienced it or have advice on where to look to? Slight corrosion sign around the KBD controller, cleaned but doesn't look serious"}
{"post_id":93721,"thread_id":63246,"title":"Razer Blade RZ09-01953 Switches off under Nvidia GPU load","user_id":682,"username":"2informaticos","post_date":"2022-11-07 04:01:04","message":"The Mats has an option to run in stealth mode.\nCheck its manual and set the proper option.\nYou should find the result in the log."}
{"post_id":93807,"thread_id":63246,"title":"Razer Blade RZ09-01953 Switches off under Nvidia GPU load","user_id":25485,"username":"it-solve","post_date":"2022-11-08 21:14:15","message":"So far I have reflowed the GPU just in case if it is a cold joint. Same behaviour, loads Windows every time but shuts when test engages the GPU. Stable when test is run on the Intel GPU.\n\nUCd the board as GPU Core MOSFETs were soaked in a thermal paste.\n[ATTACH type=\"full\"]60854[\/ATTACH]\n\n\nI went ahead and reflowed and resoldered all three GPU Core MOSFETs, as they seemed to have some flux burn marks between the legs. \nThat area is pretty close to the RAMs. Now it will shut down 2-3 out of 5 times when it starts even before loads Windows.\n\nSeems like I have forgotten to switch to CSM mode rather than UEFI.\nI could not find stealth mode in the documentation, but I removed all arguments and left only  gputest.js  -mfg\nAttempted a couple of times. Now boots from it, stay on a black screen for awhile and switch off every time when MATS is booted.\n\nShall I reflow the RAMs? Not sure what else to try"}
{"post_id":93820,"thread_id":63246,"title":"Razer Blade RZ09-01953 Switches off under Nvidia GPU load","user_id":682,"username":"2informaticos","post_date":"2022-11-09 05:17:38","message":"Very likely bad GPU.\nReflow helps for test sometime, but is not a definitive solution."}
