{"post_id":2714,"thread_id":2714,"title":"Dead SSD from MBP Retina 2015","user_id":145,"username":"Sykulski","post_date":"2016-05-17 07:07:50","message":"Hi Guys\n\nI've got in a Retina MacBook Pro 13 year 2015 which was liquid damaged by a beer.\n\nIt was completely dead and after ultrasonic cleaning it starts up but the SSD does not show up. I then switch to another SSD and it is working. \n\nMy question is, do you have any ideas to revive the SSD because customer has no backup and data is important? There was som beer-crap leftovers in some parts of the SSD that doesn't have underfill. I tried to clean SSD in ultrasonic, so now it's clean but still dead. \n\nThanks"}
{"post_id":2738,"thread_id":2714,"title":"Dead SSD from MBP Retina 2015","user_id":2,"username":"dukefawks","post_date":"2016-05-17 14:42:31","message":"Look for corroded parts first. Compare the resistors to a known good SSD. Also many times the NAND chips will be fried. Feel if they get hot when power is applied. There are no diagrams for these so you need an exact same model."}
{"post_id":2746,"thread_id":2714,"title":"Dead SSD from MBP Retina 2015","user_id":145,"username":"Sykulski","post_date":"2016-05-17 16:12:20","message":"Thanks for replying. No visible corrosion and SSD  looking brand new after cleaning. I already checked resistors and all of them seem fine when comparing to a working board of same type. NANDs are cool but the flash controller chip is rapidly getting over 60°C (140°F) as soon as I power up the machine. I think this is a little too hot so I assume the controller is maybe toasted (I'm not going to switch it to find out for sure though). \n\nCustomer agreed to just install a new SSD so he probably learned the importance of a backup routine the hard way. \n\nThanks again"}
{"post_id":2749,"thread_id":2714,"title":"Dead SSD from MBP Retina 2015","user_id":2,"username":"dukefawks","post_date":"2016-05-17 16:33:16","message":"Yeah 60C is pretty sure a dead chip. THE END."}
