{"post_id":30183,"thread_id":30183,"title":"820-3299 - Thunderbolt not working","user_id":145,"username":"Sykulski","post_date":"2018-01-07 12:50:50","message":"This iMac came in with everything working except thunderbolt. It belongs to a professional content creator and the thunderbolt is essential part of the customers workflow as he uses it for external displays and daisy chaining external storage media.\n\nThe symptoms:\n\nBoth thunderbolt ports are seen in system profiler but nothing happens when connecting devices. When connecting a display device the internal screen blinks one time as it “sees” the display being connecting and trying to switch to dual displays but the external display never gets image and also don’t show up either in system profiler or display settings. When connecting storage devices or thunderbolt adapters nothing at all happens. System profiler just keep saying nothing connected.\n\nASD EFI and OS both passes with no errors.\n\nThe history:\n\nThunderbolt ports just stopped working one day. Worked fine the day before next day upon boot not working. \n\nI dont know know where to start. Please help.\n\nThanks in advance"}
{"post_id":30190,"thread_id":30183,"title":"820-3299 - Thunderbolt not working","user_id":2,"username":"dukefawks","post_date":"2018-01-07 15:19:19","message":"U3310 or U2800 are suspect. But honestly this will be a total time waster as this circuit is so complex and without any sort of high speed logic analyzers it is pretty much impossible to find out what is going on.\nMy advice here is to not touch the machine and even risk opening it up."}
{"post_id":30316,"thread_id":30183,"title":"820-3299 - Thunderbolt not working","user_id":145,"username":"Sykulski","post_date":"2018-01-11 14:58:04","message":"Thanks. You are right.\n\nAll power rails in TB circuit measured fine and no shorts anywhere.\n\nI replaced Cactus Ridge - Same shit. Then I replaced the ports - Same shit.\n\nThen I replaced MLB. No more time wasting on this... :mad:"}
{"post_id":30325,"thread_id":30183,"title":"820-3299 - Thunderbolt not working","user_id":2,"username":"dukefawks","post_date":"2018-01-11 17:42:27","message":"Some people like torture I guess."}
