[
    {
        "post_id":88157,
        "thread_id":62549,
        "title":"820-00045 USB-C not working",
        "user_id":29424,
        "username":"donnos",
        "post_date":"2022-03-31 07:45:36",
        "message":"Hello, i have a 820-00045 with initial had charging issues, found short c7131, replaced and device turns on now.\nCharging still have some issues where only 1 side is able to charge. i replaced u4520 and now it works both side (actually i tested with chip removed and that works so no idea how u4520 prevented charging on 1 side)\n\nnow i have new issues, my USB-C is not getting power from the board so accessories don't work. i replaced u4400 and now it works on 1 side, still doesn't work on the other side. the thing is i don't know which usb pair is working, E85 N\/P pair or USB Extra N\/P pair. if replacing u4400 works my guess is USB extra pair works, which IC controls the other pair?"
    },
    {
        "post_id":88160,
        "thread_id":62549,
        "title":"820-00045 USB-C not working",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-03-31 09:23:52",
        "message":"CC1\/2 lines detect and configure the charger.\n\nDid you try another USB-C flex\/connector?\nRemove and inspect connector pins."
    },
    {
        "post_id":88246,
        "thread_id":62549,
        "title":"820-00045 USB-C not working",
        "user_id":29424,
        "username":"donnos",
        "post_date":"2022-04-02 10:01:41",
        "message":"replaced the pin and still the same. measured using a usb C breakout board and diode readings are good."
    },
    {
        "post_id":88387,
        "thread_id":62549,
        "title":"820-00045 USB-C not working",
        "user_id":29424,
        "username":"donnos",
        "post_date":"2022-04-06 07:51:30",
        "message":"so where should i check next?"
    },
    {
        "post_id":89412,
        "thread_id":62549,
        "title":"820-00045 USB-C not working",
        "user_id":29424,
        "username":"donnos",
        "post_date":"2022-05-18 10:35:41",
        "message":"update. i manage to fix this. So keypoint is that it USB C works 1 side and not the other. U7860 was the culprit. for the others if USB not detected, check u4520 and u4400. u7860 and u7865 for the flip side."
    }
]