[
    {
        "post_id":2243,
        "thread_id":2243,
        "title":"[SOLVED]820-3023 Backlight",
        "user_id":110,
        "username":"MOberdick",
        "post_date":"2016-05-02 12:45:42",
        "message":"So this project has been a little disasterous for me so far.. Was a routine Macbook Air LCD-only replacement (done plenty before) but after installation of a new LCD the backlight appeared to be out (could see apple logo on the LCD). I replaced the backlight strip because i had some scratches on the cable thinking that may be the issue but still same problem. I then decided to order a new lcd panel only to find that to not work either. At this point I knew it was probably board-level. After testing around I found 8.1v on pin 3 (gate) of the transistor and 8.4v on pin 4 (source) of the transistor (Q9706), but nothing going through. nothing on the board looks damaged and it had backlight before with the customer's bad LCD. Is the voltage on the gate low enough?"
    },
    {
        "post_id":2249,
        "thread_id":2243,
        "title":"[SOLVED]820-3023 Backlight",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2016-05-02 15:02:38",
        "message":"Q9706 is not opening. It is a P channel that will open when the voltage on the gate is significantly lower than the voltage on the source. This most commonly occurs when the machine does not recognize an LCD. Do you see a picture at all?"
    },
    {
        "post_id":2276,
        "thread_id":2243,
        "title":"[SOLVED]820-3023 Backlight",
        "user_id":110,
        "username":"MOberdick",
        "post_date":"2016-05-03 06:08:51",
        "message":"I have an image just no backlight\nUpdate: Well I feel really dumb now. Wasn't aware that the LCD had to be plugged in for it to pull power through. My main question was more specifically how much lower it had to be in order to open. Wasn't sure if it was as low as 1v or as high as 6v"
    },
    {
        "post_id":2279,
        "thread_id":2243,
        "title":"[SOLVED]820-3023 Backlight",
        "user_id":110,
        "username":"MOberdick",
        "post_date":"2016-05-03 07:28:04",
        "message":"So I've tried a whole new known-good top panel and still has no backlight, I guess this confirms a board issue. D9701 has 8.2v on it so i know power is getting through now but isnt this supposed to be a higher reading? Diode mode reading is 0.551.... from my experience this could be SW_0 and SW_1 ??"
    },
    {
        "post_id":2280,
        "thread_id":2243,
        "title":"[SOLVED]820-3023 Backlight",
        "user_id":36,
        "username":"aprendiz",
        "post_date":"2016-05-03 08:06:34",
        "message":"It is no boosting...... Check feedback trace........... or read here...........[url]https:\/\/www.rossmanngroup.com\/boards\/forum\/board-repair-troubleshooting\/1145-macbook-air-no-backlight-troubleshooting-guide[\/url]"
    },
    {
        "post_id":2284,
        "thread_id":2243,
        "title":"[SOLVED]820-3023 Backlight",
        "user_id":110,
        "username":"MOberdick",
        "post_date":"2016-05-03 09:36:28",
        "message":"Turned out to be LP8550... Was trying to not have to replace the chip cause I don't have anymore in stock except doner boards which I don't necessarily trust.. but I grabbed one from another board and sure enough backlight is back."
    }
]