{"post_id":20232,"thread_id":20232,"title":"[SOLVED]820-3437 sometimes not turning on","user_id":149,"username":"Fizzl92","post_date":"2017-05-15 05:58:07","message":"Hello,\nthis 820-3437 was waterdamaged. I cleaned it and fixed Backlight (and LVDS). Now it works normally. But it gives only with some chargers a green light and sometimes it won´t start at all until i remove the Battery. But if i plug the battery back in it works normally for some time until after a few hours or sometimes days it is dead again until i remove the Battery again. This even happens if i have the Keyboard unplugged. Any ideas what could cause this?\nThanks for any help"}
{"post_id":20234,"thread_id":20232,"title":"[SOLVED]820-3437 sometimes not turning on","user_id":2,"username":"dukefawks","post_date":"2017-05-15 06:14:26","message":"Yeah, corrosion somewhere.....The usual areas under SMC\/U1900\/U1950. Inspect closely."}
{"post_id":20238,"thread_id":20232,"title":"[SOLVED]820-3437 sometimes not turning on","user_id":149,"username":"Fizzl92","post_date":"2017-05-15 11:25:58","message":"i searched for corrosion but couldn´t find any. The only place where i could find any proof of water was the Backlight area. After i cleaned it it seems to charge with every Charger but still won´t start if a battery is plugged in (green light stays on \/ just not booting). Even if i send it to sleep with a battery plugged in it won´t wake up. But without battery everything works fine. If it would be a battery current sensing issue would the green light in the charger be on?"}
{"post_id":20243,"thread_id":20232,"title":"[SOLVED]820-3437 sometimes not turning on","user_id":2,"username":"dukefawks","post_date":"2017-05-15 13:42:47","message":"This board the magsafe should always turn orange even without a battery"}
{"post_id":20249,"thread_id":20232,"title":"[SOLVED]820-3437 sometimes not turning on","user_id":149,"username":"Fizzl92","post_date":"2017-05-15 14:29:54","message":"Sorry, my mistake. I used \"green light\" to say that there is \"a light\" in the charger (to say that the charger stays on). If i plug it in the light comes up green for a few seconds and than turns orange until i press the power button. If i press the power button it turns from orange to green for a second and than back to orange (but it still won´t boot until i unplug thr battery)."}
{"post_id":20252,"thread_id":20232,"title":"[SOLVED]820-3437 sometimes not turning on","user_id":2,"username":"dukefawks","post_date":"2017-05-15 14:37:46","message":"So it does an SMC reset when you press the power button! Inspect corrosion on trackpad connectors\/cable."}
{"post_id":20287,"thread_id":20232,"title":"[SOLVED]820-3437 sometimes not turning on","user_id":149,"username":"Fizzl92","post_date":"2017-05-16 03:17:34","message":"The Connectors look not so bad but also not perfect (some pins are a little black and brown but still conductive). I ordered a new trackpad and keyboard for testing (i have no known good lying around) and test it with the new parts as soon as they arrive. If it has still this problem with the new parts i´ll let you know. Thanks for the great support!"}
{"post_id":20304,"thread_id":20232,"title":"[SOLVED]820-3437 sometimes not turning on","user_id":637,"username":"TCRScircuit","post_date":"2017-05-16 12:25:36","message":"Black\/Brown = Bad!! Make sure to check the connector on the board as well."}
{"post_id":20318,"thread_id":20232,"title":"[SOLVED]820-3437 sometimes not turning on","user_id":2,"username":"dukefawks","post_date":"2017-05-16 13:17:16","message":"Keyboard won't be the issue. Either trackpad and\/or cable\/connector."}
{"post_id":20321,"thread_id":20232,"title":"[SOLVED]820-3437 sometimes not turning on","user_id":149,"username":"Fizzl92","post_date":"2017-05-16 13:30:52","message":"Ok, thanks. I ordered a Trackpad, Keyboard and cable. If i don´t need them now i need them later. If i disconnect the Keyboard\/Trackpad cable from the board it runs better i think. I can wake it up from standby and it also starts often with battery attached. But if i shut it down and try to turn it back on (without Trachpad cable but with akku attached i plug in the charger ) it sometimes again won´t start until i unplug the battery. Once unplugged it can be started just with the charger or i can plug the battery instantly back in and it also can be startet with battery attached. Can this be a battery issue?"}
{"post_id":20352,"thread_id":20232,"title":"[SOLVED]820-3437 sometimes not turning on","user_id":2,"username":"dukefawks","post_date":"2017-05-17 06:20:54","message":"How can you start it again when you disconnected the keyboard? I doubt the power button is a wireless one....."}
{"post_id":20395,"thread_id":20232,"title":"[SOLVED]820-3437 sometimes not turning on","user_id":149,"username":"Fizzl92","post_date":"2017-05-17 11:31:48","message":"I thought that it should start if i plug the charger in (if i take the board out it will start only from charger so i assume it should do the same inside the housing). But anyways it looks like the trackpad (and cable) exchange did the trick. It started normally every time i pressed the power button today (i don´t know it it resets the smc as the battery is 100% full now and the light stays green all the time but i think it dosn´t). \nAgain thank you very much. You guys and this whole Forum are awsome!:)"}
