[
    {
        "post_id":43368,
        "thread_id":43368,
        "title":"820-00045 PPDCIN_E85 Cycling",
        "user_id":135,
        "username":"bjf",
        "post_date":"2018-12-14 16:25:58",
        "message":"This board had a short on PP3V33R3V0_AON. I replaced U4700 and it worked fine for a couple days. The battery was on the low end - around 78% capacity and it was changing a fair amount going anywhere from 73% up to 81% as it charged and drained. I drained it all the way down and then after plugging in the power adapter it would just chime every few second randomly as if it was losing and then regaining connection to the adapter. After pulling the board I measured that PPDCIN_E85 is cycling up and down. I can't find any shorts , PP3V33R3V0_AON is not shorted and am not finding any components heating up. Any idea what might have failed here?"
    },
    {
        "post_id":43369,
        "thread_id":43368,
        "title":"820-00045 PPDCIN_E85 Cycling",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-12-14 16:35:11",
        "message":"The board doesn't work without battery now, like before?\nWhich are the limit flcutations for F7140 and L7095 now?"
    },
    {
        "post_id":43370,
        "thread_id":43368,
        "title":"820-00045 PPDCIN_E85 Cycling",
        "user_id":135,
        "username":"bjf",
        "post_date":"2018-12-14 16:40:47",
        "message":"The battery was drained completely and my other one is also drained. It might actually work on battery though.\n\nAbout .010V is the highest L7095 gets. F7140 stays steady at .010V."
    },
    {
        "post_id":43384,
        "thread_id":43368,
        "title":"820-00045 PPDCIN_E85 Cycling",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-12-15 01:42:50",
        "message":"So it doesn't work on charger only now.\nCheck resistance to ground on the ponits above mentioned; also check on R7120.\nWhat is the voltage on F7140 if connected only battery?\n\nCheck if Q7110\/20 are both OK."
    }
]