{"post_id":101830,"thread_id":64238,"title":"A1990 820-01814 stuck at 5v no current draw","user_id":1547,"username":"CRC2018","post_date":"2023-10-03 12:36:35","message":"Got an A1990 820-01814 which is stuck at 5V with no current draw. Occasionally it does switch to 20v and also with no current draw and no power but i havent seen it do that very often!\n\nIt was slightly liquid damaged around JB200 and C9080 - i've cleaned up both areas and no issues there, have also run it through the ultrasonic just to catch anything I didn't see. \n\nPPBUS is not shorted to ground and is reading 0.8v when it's stuck at 5v. \nPP3V3_G3H is missing and also not shorted to ground.\n\nFollowing the CD3215 bootup sequence at u3200 I have:\nPP20V_USBC_XB_VBUS  5v\nPP3V3_UPC_XB_LDO 3.3v\nPP1V8_UPC_XB_LDOA 1.8v\nPP1V8_UPC_XB_LDOD 1.8v\nPP1V1_UPC_XB_LDO_BMC 0.1v\n\nSo it seems to be getting stuck at reading the thunderbolt rom. All four ports on the macbook behave the same!\n\nWhat would the next step at this point be?"}
{"post_id":101833,"thread_id":64238,"title":"A1990 820-01814 stuck at 5v no current draw","user_id":682,"username":"2informaticos","post_date":"2023-10-03 13:56:47","message":"Did you check diode mode to ground at PPBUS_G3H?\nCompare with the readings on all big coils; don't forget L9080\/580.\n\nRemove F7000\/1 and check C7050 voltage."}
{"post_id":101837,"thread_id":64238,"title":"A1990 820-01814 stuck at 5v no current draw","user_id":1547,"username":"CRC2018","post_date":"2023-10-04 04:22:42","message":"Diode Mode to ground on \nPPBUS_G3H - 0.398\nL9080 - 0.371\nL9580 - not present on this board\nNone of the other coils read anywhere near the same reading and I did already check if any of them were shorted to PPBUS_G3H previously (Forgot to mention)\n\nAfter removing F7000 and F7001 and i'm getting C7050 voltage at 12.3V"}
{"post_id":101838,"thread_id":64238,"title":"A1990 820-01814 stuck at 5v no current draw","user_id":682,"username":"2informaticos","post_date":"2023-10-04 05:58:12","message":"So you have problems with a secondary power supply.\n\nCorrosion near C9080 may be sign of damaged SSD.\nWhat is resistance (ohm scale) between PPBUS_G3H and L9080?"}
{"post_id":101839,"thread_id":64238,"title":"A1990 820-01814 stuck at 5v no current draw","user_id":1547,"username":"CRC2018","post_date":"2023-10-04 05:59:34","message":"Well we can put this one as solved - U9080 had a tiny bit of corrosion underneath which after removing, cleaning and fitting a new IC has resolved the issue.\n\nThank you for the pointers in the right direction! Luckily the SSD has survived this stupid design by apple to put this controller so close to the edge of the board!"}
