[
    {
        "post_id":24214,
        "thread_id":24214,
        "title":"[SOLVED]820-3437 3 fan spins then shuts off after 1 second",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2017-08-12 13:06:02",
        "message":"This board initially was just a no backlight issue and there was liquid damage around the entire lcd connector area as well as the lp8550. I replaced all the components in those areas and after all this now the fan does the usual on and off fan spin 3 times but after about 1 second the fan stops spinning. PPBUS_G3H is 8.6v and once the fan stops spinning o 5v_S5 and 3v3_S5 rails are present.\n\nThere was also liquid damage to the JTAG connector which I removed. I thought the issue for this fan spin may have been because I found that Pins 30&34 of J6100 were bridged together but even after fixing that the issue remains.\nC5120 did not look good so I replaced it along with U5110. All the proper voltages are present on U5110\nI replaced C5003\/09 because they didn't look to well.\nThere was a little corrosion around U6100 and U1900 so I put some flux and heated that area.\nU1950 and its area looks fine and I get 3v42 on C1950 even when the fan stops spinning.\n\nIt is doing all of this with no external components plugged in."
    },
    {
        "post_id":24216,
        "thread_id":24214,
        "title":"[SOLVED]820-3437 3 fan spins then shuts off after 1 second",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2017-08-12 17:42:30",
        "message":"I was looking around and I noticed L8304 was accidentally bridged to the ground pin of C8315. I don't know how L8304 being connected to ground could cause the s0 rails to shut off.\n\nThis thread can be closed."
    },
    {
        "post_id":24217,
        "thread_id":24214,
        "title":"[SOLVED]820-3437 3 fan spins then shuts off after 1 second",
        "user_id":296,
        "username":"jadao",
        "post_date":"2017-08-12 19:12:04",
        "message":"I believe there is a current sensor that monitors  PP3V3_S0SW_LCD between its origin (U8300´s output) and the LCD.\nIt occurs right after the 3 rtc cycling because it's at this stage that Apple logo appears witch means when image and backlight are told to start.\n\nSo at the moment where lcd image is enabled EDP_PANEL_PWR is high and tells U8300 to release 3.3v at the output.\nAs soon as U8300 outputs 3.3v the overcurrent caused by the short is detected and reported to the smc witch with some magic  stops S0 rails."
    },
    {
        "post_id":24218,
        "thread_id":24214,
        "title":"[SOLVED]820-3437 3 fan spins then shuts off after 1 second",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2017-08-12 19:36:49",
        "message":"Okay thanks for the explanation."
    }
]