{"post_id":24551,"thread_id":24551,"title":"820-3115 - Short on DCIN","user_id":289,"username":"smiba","post_date":"2017-08-23 14:16:17","message":"Hi,\n\nJust a quick post\n\nThis macbook has a short on DCIN and for some reason a burned capacitor on PP5V_S3, the ground side is burned away. (Like the half of the capacitor is just burned crap and dust). Removed this from the board but it obviously doesn't solve a DCIN short (PP5V_S3 wasn't shorted by it either)\n\nRemoving the Fuse (Which by the way is not broken) tells me the short is on the system side (Pin 2 of F6905). I can not find any ugly parts and the motherboard looks overall decent for a 5 year old motherboard. Short is 0.4Ohm which is the lowest amount of resistance my cheap ass multimeter can measure (Holding the probes together gives 0.4Ohm as well), usually if there is a short from a capacitor the resistance would measure as somewhere between 0.6 and 1Ohm or somewhere between 1 and 25 ohms for a semi-short.\n\nI don't have a bench supply and neither do I have a shitty chinese charger that has no short protection.\nIs there a quick way to still make sure the motherboard is dead? I'm pretty sure its a internal short to ground due the low resistance.\nAny parts that might be worth just quickly pulling from the motherboard to see if the short gets removed?\n\nOh, also PPDCIN_G3H has a short, but PPDCIN_G3H_CHGR does not. Even though the schematic tells me these are connected\nMotherboard is probably trashed\n\nCheers"}
{"post_id":24565,"thread_id":24551,"title":"820-3115 - Short on DCIN","user_id":2,"username":"dukefawks","post_date":"2017-08-23 18:38:35","message":"Get a PSU to inject voltage to see what heats up."}
{"post_id":24767,"thread_id":24551,"title":"820-3115 - Short on DCIN","user_id":289,"username":"smiba","post_date":"2017-08-29 02:55:49","message":"What is the recommended voltage to test it with?\n\nSince it's the amps causing the heat up, would supplying just 1V be good enough? Or is it recommended to still use 16V?"}
{"post_id":24768,"thread_id":24551,"title":"820-3115 - Short on DCIN","user_id":45,"username":"Repairable","post_date":"2017-08-29 05:02:17","message":"max voltage is wat is the max on that line, so pp3v3 has a max of 3,3volt etc  volt is also your max on psu.\n\ni would recommend start on 1 volt and go up in small steps\nkick current up is what i do"}
{"post_id":24811,"thread_id":24551,"title":"820-3115 - Short on DCIN","user_id":2,"username":"dukefawks","post_date":"2017-08-29 19:55:24","message":"You start low and monitor the current. At 1 Amp something should start to heat up"}
{"post_id":25586,"thread_id":24551,"title":"820-3115 - Short on DCIN","user_id":289,"username":"smiba","post_date":"2017-09-19 13:33:37","message":"Started at 1 amp but the board was totally cold\n\nMoved up with 1 amp every minute. Its been running at 5amp for 10 minutes now and the only thing heating up is the wire going towards the board\n\nInternal short?"}
{"post_id":25614,"thread_id":24551,"title":"820-3115 - Short on DCIN","user_id":2,"username":"dukefawks","post_date":"2017-09-19 21:51:27","message":"Yup, short in the board. You can try to isolate it. But this board should run from battery if the only thing wrong is the short on DCIN."}
{"post_id":25706,"thread_id":24551,"title":"820-3115 - Short on DCIN","user_id":289,"username":"smiba","post_date":"2017-09-20 12:19:18","message":"Tried to run it off battery but it was missing most (if not all) S0 lines. SMC_G2_EN was low but 3.42V is there\n\nNot worth my time honestly, thanks anyways!"}
