[
    {
        "post_id":23150,
        "thread_id":23150,
        "title":"820-00165 Not booting fully",
        "user_id":135,
        "username":"bjf",
        "post_date":"2017-07-18 12:38:18",
        "message":"Any idea why this board might be failing about halfway through booting? It had some components that needed to be replaced around the CPU, wires run etc. CPU comes on now. It has actually booted fully once and then usually fails during the boot progress bar. It turns off and does not auto-restart. I removed J6100. Using known-good testing setup. I uploaded pre-ultrasonic pics. Not sure where to go next."
    },
    {
        "post_id":23213,
        "thread_id":23150,
        "title":"820-00165 Not booting fully",
        "user_id":36,
        "username":"aprendiz",
        "post_date":"2017-07-19 10:20:58",
        "message":"Did you do any measurement?? Did you test another SSD??"
    },
    {
        "post_id":23216,
        "thread_id":23150,
        "title":"820-00165 Not booting fully",
        "user_id":135,
        "username":"bjf",
        "post_date":"2017-07-19 11:13:05",
        "message":"What kind of measurements are you thinking? And yes, it's a known-good testing setup. I tried multiple systems - USB boot, SSD. No change."
    },
    {
        "post_id":23218,
        "thread_id":23150,
        "title":"820-00165 Not booting fully",
        "user_id":624,
        "username":"Alan.L",
        "post_date":"2017-07-19 11:41:23",
        "message":"maybe these corroded components are preventing from booting, why don't you start by replacing these first. have you try running apple diagnostics, (power button then immediately press and hold the D key)"
    },
    {
        "post_id":23223,
        "thread_id":23150,
        "title":"820-00165 Not booting fully",
        "user_id":135,
        "username":"bjf",
        "post_date":"2017-07-19 13:50:47",
        "message":"Thanks for the tip. I don't want to replace them all (especially since, outside of J6100, I'm not seeing how the corroded areas would cause booting issues) but I did overhaul the CPU circuit by necessity. It had no CPU previously. The online diagnostic test comes back with no errors."
    },
    {
        "post_id":23245,
        "thread_id":23150,
        "title":"820-00165 Not booting fully",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-07-19 15:46:05",
        "message":"Could be corrosion anywhere. Probably under something related to CPU power. This will suck....."
    }
]