{"post_id":28288,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":289,"username":"smiba","post_date":"2017-11-20 15:29:15","message":"Hey everyone,\n\nA Macbook 15\" Late 2013 model here with no visible signs of water damage. The device suddenly powers off after using it for somewhere between 10 to 40 minutes.\nHaving a high load running on it won't charge the issues (Furmark + Prime95 for 20 minutes would not cause the device to shutdown) but just idle running a youtube video made it crash at one point.\nThe power off is not registered by the system as a kernel panic and does not show signs of the keyboard incorrectly pressing the power button. (The Shutdown window does not appear, as it would when the power button is being held down). The system does not reboot after the power off has occurred but would stay in S5\n\nIs this model also affected by bad soldering? If so what chip would be the cause of this?\nAny idea where to look?\n\nCheers!"}
{"post_id":28300,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":1153,"username":"JohnB8812","post_date":"2017-11-20 20:20:38","message":"Duke helped me with one of these a while back. It seems the 3662 and 3787's have unexpected shutdown issues, and that there isn't a solution yet."}
{"post_id":28307,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":2,"username":"dukefawks","post_date":"2017-11-20 21:43:48","message":"The usual 3662 issue. I have one here to right now. I really have no time to dig into this problem at the moment."}
{"post_id":28317,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":289,"username":"smiba","post_date":"2017-11-21 04:39:22","message":"Hey duke,\n\nIs there any information or speculation about this issue so far? I have some free time on my hands this week so I woudn't mind experimenting around, who knows what I might find.\n(I tried to DM you about this but it seems your \"Quota\" has been reached and it won't let me send)\n\nThanks in advance!"}
{"post_id":28323,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":2,"username":"dukefawks","post_date":"2017-11-21 05:55:45","message":"It must be something is the power rails to the CPU. I have 0 time to deal with this at the moment as repairs are stacked up here.\n\nFirst to see which rail causes this hook up your 2 channel scope to both CPUVR_PGOOD and ALL_SYS and trigger on the falling edge to see which one drops off first."}
{"post_id":28326,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":289,"username":"smiba","post_date":"2017-11-21 07:34:15","message":"No Title\n\nALL_SYS_PWRGD drops before CPUVR_PGOOD drops.\n\nI guess at this point its just a matter of going through a whole bunch of power signals to hopefully see which one goes first? CPUVR_PGOOD would be much easier :("}
{"post_id":28330,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":110,"username":"MOberdick","post_date":"2017-11-21 12:07:53","message":"Try retinning all the pads on U7200. I am currently experimenting with a board like this and after checking the chip at all 4 angels and making sure each joint was solid it seems to have stopped happening.. I am still testing however just figured it was worth putting out there for someone else to try as well... If It continues to work for over 24 hours I will report back."}
{"post_id":28334,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":2,"username":"dukefawks","post_date":"2017-11-21 12:33:11","message":"Don't heat anything up on the board as this may mask the problem again for weeks.\n\nNow comes the shitty part in separating the ALL_SYS signals and see which one falls first. It seems like ALL_SYS is not a \"hard\" drop and it gradually drops to zero. What is your time base in that picture?"}
{"post_id":28335,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":289,"username":"smiba","post_date":"2017-11-21 12:33:36","message":"Let me know if it works for you. I'm currently keeping track of any power lines dropping just before ALL_SYS_PWRGD does before I solder anything\n\nI'm sceptical about it being a contact issue as the problem gets more frequent once it keeps crashing and you keep rebooting it. But I'm hoping :)\n820-3662 board as well?"}
{"post_id":28336,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":110,"username":"MOberdick","post_date":"2017-11-21 12:37:21","message":"Yep same board 820-3662. Also I didn't use hot air duke, just my micropencil to connect the joints with fresh solder.. shouldn't have a large impact. So far I've been able to run migration assistant, complete an external drive restore, and an internal in-place software upgrade without problem. I have this thread bookmarked however and if for some reason it does come back in the future for anything I will be sure to keep everyone in the loop."}
{"post_id":28337,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":289,"username":"smiba","post_date":"2017-11-21 12:37:41","message":"[QUOTE=\"dukefawks, post: 28334\"]What is your time base in that picture?\n[\/QUOTE]\n\n4[B]μs[\/B]\/div by the way\n\nThe wait is the worst, at this rate its going to take a couple of days...I already confirmed PP1V35_S3RS0_CPUDRR not being at fault and I'm currently testing PP3V3_S0.\n\nAre there any power lines you recommend taking a look at first?\n\n(On the picture the voltages you see on the side are for Probe A and I didn't align B. Sorry for the unclarity. Probe B is seeing normal 1.35V)"}
{"post_id":28338,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":2,"username":"dukefawks","post_date":"2017-11-21 12:42:14","message":"U7200 is on my suspect list but I would have expected CPUVR_PGOOD to drop before ALL_SYS. Resoldering it with an iron can not hurt, just don't use hot air or it may disturb the actual problem.\n\nDo remember that this issue only happens when the machine is \"idle\" or light load. As soon as you hammer the CPU it keeps running fine. So no use is stress testing with this problem."}
{"post_id":28340,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":110,"username":"MOberdick","post_date":"2017-11-21 12:45:13","message":"In the situation with the machine I have, it seems to happen when firefox is opened (usually playing a youtube video) and then there is graphical activity on the dock from the magnification feature.. a few swipes back and fourth with the cursor and it'd crash out. Tried that for about an hour on a cold boot. doing the more extensive stuff now.. I'll probably let it idle overnight tonight on a video or something and retest everything out in the AM tomorrow."}
{"post_id":28341,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":289,"username":"smiba","post_date":"2017-11-21 12:55:39","message":"Can confirm that low load is more likely to let it crash. In my case I often make it stream some music from my local library and thats been pretty effective at making it crash. Stuff like YT also works alright\nStress testing the device will not make it crash at all.\n\nTrick seems to be not to blast the CPU but just keep it at a couple of cpu%. But this is purely speculation based on just a couple of samples so far though\n\nEDIT: Its also not PP3V3_S0. Testing it with PP3V3_S5 now"}
{"post_id":28342,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":110,"username":"MOberdick","post_date":"2017-11-21 13:01:08","message":"Got it. I have it off and will let it cool off for the next 2 hours and retest cold before i leave the office. \n\\"}
{"post_id":28345,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":289,"username":"smiba","post_date":"2017-11-21 13:32:56","message":"PP3V3_S5 is looking alright as well.\nI think I saw the scope catch multiple falling edge triggers though. So I'm running it again at 20ms\/div to see if I can catch those fluctuations. But I might have been wrong\n\nEDIT: The system seems to be very sensitive to my desk light? If I have it close to the keyboard and I disable the light the system will crash and freeze (But not like the random crashes would cause). I think this is what I saw with the multiple falling edge triggers as it happened while I stopped the lamp. I've never noticed this before but its probably unrelated as its just a shitty light. I'll keep on searching\nEDIT2: Its probably noise its picking up on the wires that are sticking out off the motherboard.... Move along. Running the PP3V3_S5 test again as its been skewed by me turning off the light and thus causing a pulse on its power"}
{"post_id":28347,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":2,"username":"dukefawks","post_date":"2017-11-21 15:12:24","message":"When separating the PGOOD signals make sure there still is a pull up resistor. All the signals on the board only have one pull up resistor for all."}
{"post_id":28352,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":289,"username":"smiba","post_date":"2017-11-21 17:46:27","message":"[QUOTE=\"dukefawks, post: 28347\"]When separating the PGOOD signals make sure there still is a pull up resistor. All the signals on the board only have one pull up resistor for all.[\/QUOTE]\n\nWill do, I think the leakage of the transistor inside of most ICs will make a PGOOD signal float around ground level without pull-up as well.\n\nAfter crashing the system because of a voltage spike on PP3V3_S5 caused by a pulse from my desk light I have not been able to get it to crash again....... Been running without crash for 2 hours so far, I've tried YT, Music and just idleing on the desktop.\nI'll try again tomorrow"}
{"post_id":28356,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":2,"username":"dukefawks","post_date":"2017-11-21 19:29:07","message":"That internal pull up is very weak and may affect measurements as you saw with your light."}
{"post_id":28374,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":110,"username":"MOberdick","post_date":"2017-11-22 08:08:57","message":"Update: Macbook ran overnight playing from iTunes library without issues. Came in and it was still powered on. Currently back to my youtube and dock magnification testing around.. probably gonna call it good and send it out though. If it comes back I will let yall know."}
{"post_id":28382,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":289,"username":"smiba","post_date":"2017-11-22 11:20:29","message":"I've not been able to make it crash anymore, its been running a 480p video with 3% cpu load avg. for hours.\n\nBut I've noticed that plugging in the charger to the AC while the magsafe is already in the laptop will make it crash though, but only if the probe is connected...\n\nI've moved the probes into 10x mode to hopefully separate them even more, however this is bringing in a lot of inconsistencies which are making it hard to see between actual crashes and crashes introduced by the exposed wires or scope\n\nEDIT: It seems I didn't had J9510 plugged in all the way! Figured this out because the USB power\/data and SD slot woudn't work.\nWould this be the reason it was not longer crashing? Lets find out!\n\nEDIT2: I've been able to make it crash again! But with more then one hour between plugging J9510 back in makes me unsure if that could've been it. More likely is the fact that I just drained the battery to 70% while all the other tests were with the battery above 95% or connected to AC. Due a bad trigger configuration the data was unusable so I'm hoping I can catch it again but this time right :)\n\n[USER=\"110\"]MOberdick[\/USER] Still working :)? Also if possible can you test it when its around 70% battery capacity? (PPBUS around 10.7V) - Crashing it on >90% is way harder for me then it was on 60-70%"}
{"post_id":28394,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":289,"username":"smiba","post_date":"2017-11-22 18:07:07","message":"The crashes have actually changed in behaviour...\n\nBefore:\n8\/10 of the time it would directly fully power off\n2\/10 of the time the screen video would disappear (blank\/black screen), audio stopping but the backlight and fans still rolling for ~5 seconds before it fully powers off\n\nNow:\nI've been able to make it crash about 4 times... But they all show the last issue where it turns into a blank screen and after a few seconds powers off.\n\nAre we still looking at the same issue? Any tips on what to diagnose next?\nIt definitely happens more often with a lower PPBUS. PPBUS at 11.0V and its running alright, I stress test it on battery to drain the battery to ~10.4V and it will crash within minutes. (But only after stopping the test of course..)"}
{"post_id":28408,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":2,"username":"dukefawks","post_date":"2017-11-22 20:38:38","message":"Resolder U7200 with the iron as to not introduce heat to the board too much."}
{"post_id":28452,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":289,"username":"smiba","post_date":"2017-11-23 15:05:55","message":"No Title\n\nCheck this latest capture from the osiloscope! This time I'm not checking the PGOOD signal but the actual VCore voltage\nI'm really starting to think U7200 is at fault as well, going to resolder it in a moment :)\n\n\nEDIT: Resoldered it with just the iron but no luck, its not posting anymore even though VCore is at ~1.68V. Maybe it has unstable fluctuations that my multimeter isn't catching.\nTried to be bad and do a full reflow of the chip with hot air in case I just sucked at solder but still no luck.\n\nOrdered a new IC and hopefully I have some luck with that... Annoying and definitely a bummer. Even if this will solve the issue I probably won't stop wondering if it was fixed by the heat or U7200"}
{"post_id":28598,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":289,"username":"smiba","post_date":"2017-11-28 13:04:53","message":"Soldered on a new U7200 and its posting again.\n\nHopefully this will be the end of it :)"}
{"post_id":28609,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":289,"username":"smiba","post_date":"2017-11-28 16:42:59","message":"The device is still crashing sadly.\n\nNo idea what it could be since PPVCC_S0_CPU is obviously being unstable as the last screenshot I posted shows.\n\nCPUVR_PGOOD stays high so I doubt PP5V_S0_CPUVR_VDD or PPVIN_S0_CPUVR_VIN are being unstable as the chip resetting would definitely trigger CPUVR_PGOOD.\n\nCould it possibly be one of the switching ICs? (U7310\/20\/30)"}
{"post_id":28613,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":2,"username":"dukefawks","post_date":"2017-11-28 18:34:06","message":"Can you catch some more of those Vcore glitches and set that against CPUVR_PGOOD. Once we have a more clear picture of what is happening to Vcore then needs to be examined if it is caused by the regulator or that communication from the CPU is lost to set the actual Vcore."}
{"post_id":28618,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":2,"username":"dukefawks","post_date":"2017-11-28 21:42:59","message":"Also resolder U7330, it is close to the mounting hole so it may have cracked traces. Only the side with the control pins is important and that is the side closest to the screw hole too."}
{"post_id":28642,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":289,"username":"smiba","post_date":"2017-11-29 14:50:55","message":"No Title\n\nI've not yet resoldered U7330, I want to do that after catching two crashes.\n\nI've only been able to crash it once today and I've attached the osciloscope output. I have one zoomed in output which clearly shows PGOOD going down before the VCore does this time and one big overview\nDue me being a dumbass I do not know the time between divisions, but it should be 40ms or less on the zoomed out view\n\nU7330 looks acceptable, still want me to resolder it even after this graph?"}
{"post_id":28649,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":2,"username":"dukefawks","post_date":"2017-11-29 15:42:58","message":"So lets assume the PGOOD signal drops before Vcore drops below the threshold that would trigger PGOOD to go low. This would could mean 2 things, either it detects an over-current or the communication with the CPU is lost that sets the output voltage. Over current would be a good suspect if any of the output FETs would go rogue by bad connections and causing current spikes.\nYou could monitor the current feedback line and set that against the PGOOD signal. Maybe you can use the IMON signal, but that has already passed through the regulator so there may be some delay in there, but I suspect it will just simply be the output of a differential amplifier so pretty direct. You should see a current spike before shutdown in this setup."}
{"post_id":28653,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":289,"username":"smiba","post_date":"2017-11-29 16:29:20","message":"By looking at the block diagram I think using the IMON signal is a good call. I'll try to see if there is a peak on there while also keeping an eye on CPUVR_PGOOD.\nI have a small backlog so I'll probably have the results in a couple of days after I've finished some of the other repairs waiting :)"}
{"post_id":28748,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":110,"username":"MOberdick","post_date":"2017-12-01 10:07:11","message":"Checking back in, I have not yet heard anything back from my customer about any issues. So I'd assume working fine still? It's for a doctors office so I know they are using it daily."}
{"post_id":30282,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":145,"username":"Sykulski","post_date":"2018-01-10 13:13:55","message":"Is there any further investigation on this issue?"}
{"post_id":30283,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":289,"username":"smiba","post_date":"2018-01-10 14:34:24","message":"I'm almost done with my current queue and hope to investigate the IMON signal a bit more to see if at some point a big amount of current goes to ground. (Indicating a possible failure with one of the mosfets)\n\nNo other updates so far though"}
{"post_id":30299,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":2,"username":"dukefawks","post_date":"2018-01-10 19:44:57","message":"I have a decent logic analyzer on the way too. Now if I can buy some extra hours in a day I can also dig into these."}
{"post_id":30480,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":289,"username":"smiba","post_date":"2018-01-16 17:11:06","message":"So far I've been able to detect two types of crashes:\n\n1. The system fully goes from S0 into S5 within <10ms because CPUVR_PGOOD goes down.\n2. The system shows a blank screen but ALL_SYS_PWRGD and CPUVR_PGOOD stays high, fans will start spinning up and after 10 seconds the system powers off into S5\n\nFrom what I can see based on this is that the system does not have obvious issues with CPU VCore, the core voltage is stable.\nHowever the system DOES show signs of CPU issues, especially the black screen without power off concerns me as it sounds like the CPU feezes and eventually it just shuts down the system because it detects something's up. Its fairly similar to when a device freezes when you're undervolting the CPU too much.\n\nRunning a mkv file in VLC is my #1 way for making it crash, nothing will crash it any faster. Usually before even 10 minutes of the file is played the system will crash.\n\nThe image I've attached is of a type #2 crash with the centre aligned with the point where the screen turned black.\nI've tried to get a type #1 crash but after 10 hours of collecting samples I've only been able to make it crash running a mkv file, resulting in a type #2 crash.\n\nEDIT: Actually if the CPU freezes the screen should not turn black but stay in position. Let me see if this board has a separate power supply for the internal GPU\n\nEDIT2: AFAIK there is no separate GPU power supply so the signs still point to the CPU itself being damaged.\n\nAny other ideas?"}
{"post_id":30485,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":2,"username":"dukefawks","post_date":"2018-01-16 19:41:47","message":"I really have no idea either. I do know that even Apple's so called \"new\" boards still present this issue as well. I doubt this will be figured out without a massive effort and I'm not even sure if Apple will even bother with it. \nIt is a large CPU with a large die, so there will be lots of thermal stress going on in that package, but who knows......"}
{"post_id":30515,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":831,"username":"Revive","post_date":"2018-01-17 11:19:53","message":"Not sure if this is helpful but has anyone noticed that the lower right heatsink binding post on this model logic board are frequently broken ie popped-off. I have a few that exhibit the random shutdown and broken post, wonder if its an indication of something not being right in that area during manufacturing."}
{"post_id":30531,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":2,"username":"dukefawks","post_date":"2018-01-17 12:13:33","message":"Yeah the screw holes popping off is also common but not related to this problem I think."}
{"post_id":40789,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":1495,"username":"PPVCC_S0_CPU","post_date":"2018-10-17 06:17:00","message":"Have someone found any solutions yet?"}
{"post_id":40966,"thread_id":28288,"title":"820-3662 - Sudden power off","user_id":289,"username":"smiba","post_date":"2018-10-20 04:02:37","message":"Never have managed to, I think its an issue in the CPU itself because it seems to be the one that initiates the power down by pulling the signals.\n\nIf you have any additional information I'm still interested though!"}
