{"post_id":70172,"thread_id":60607,"title":"820-3662 PPBUS Pulsing","user_id":26418,"username":"Dusten04","post_date":"2021-01-13 09:00:57","message":"[B]Device History: [\/B]\n[LIST=1]\n[*] Im not entirely sure about the full history. I assume liquid damage. The original shop stated that he sent it out because it had fan spin, but no image or wasn't posting. Original shop wasn't sure which one. He sent it to another board level tech. Other board level tech could not fix it, so he sent it to me.\n[*]When I got the board, it had no signs of life. It was bathed in what I can only assume is gas, based off the smell. So every capacitor and resistor look....well... not good.\n[\/LIST]\n\n[B]Symtoms: [\/B]\n[LIST]\n[*]Plug in the MagSafe, green light for half a second, goes away for like 15-20 seconds, then comes back for half a second. Does this about 3 or 4 times, until it kind of sits at the \"Off\" Position. (no light on MagSafe) \n[*]PPBUS = 12.58 for half a second, then slowly drops down, and loops\n[*]PP3v42 does the same\n[*]All of my power rails going up to S4 are pulsing. Meaning pulsing starts at F7005, and stops at S4 (not getting any voltages at S4)\n[\/LIST]\n\n[B]What I did:[\/B] (I did a lot more than this, but this is the info I believe is relevant to the problem) \n[LIST=1]\n[*]My first step was to take a look at the ISL and the FETs, to confirm they were not the reason for the pulsing. I started here, because the prior tech had replaced this already, and it didn't look So what I did, was I removed ISL, retested, and pulsing stopped. I installed a new ISL, with new FETs, at the same time. Pulsing came back. \n[*]I removed the fuses(F7140 and F7141) that lead to PPBUS from the ISL circuit to try and rule out something attached to PPBUS, or something related to the charging circuit. \n[LIST]\n[*]When I did this, the pulsing stopped. I had steady, proper voltages all the way up to PPBUS. \n[\/LIST]\n[*] I put the fuses back, and started attacking things attached to PPBUS. Isolating PPBUS.\n[LIST]\n[*]I started with Thunderbolt, as one of the ports has a slight burn on the inside of it. So I removed Q3080 and R3081: Pulsing continued. These two items are still off the board. \n[*]Removed R5420: Pulsing continued (placed back on board) \n[*]Removed Q5400: Pulsing continued (placed back on board)\n[*]Removed R5430: Pulsing continued (placed back on the board)\n[*]Removed F7700: Pulsing continued (placed back on the board)\n[*]Removed R5400: Pulsing stopped (Placed back on the board) \n[\/LIST]\n[\/LIST]\n\n[B]Okay, now following this rabbit hole: [\/B]\n[LIST=1]\n[*]Removed U5400: Pulsing continued (placed back on the board) \n[*]Removed Q7630: Pulsing continued (Left off the board) \n[*]Removed R7202: Pulsing continued (placed back on the board) \n[*]Removed U7310: Pulsing continued (placed back on the board)\n[*]Removed U7320: Pulsing continued (Left off the board) \n[\/LIST]\n\nOkay, so this is where I stopped to ask for advice. Im not sure If heading the wrong direction here or not. \n\n[B]Also some other details: [\/B]\n[LIST]\n[*]When the device walked through the door, I had different symptoms, I had the pulsing, but SMC_PM_G2_EN was not present. So I had no light. I saw the prior tech had done something with the SMC, considering the overfill like material was gone, and there was flux all in the area. I simply reflowed this to correct the issue. (Possibly have bad SMC, but didn't account this to be my pulsing issue. \n[*]When replacing the ISL and FETs, I noticed that the computer would turn on when it was hot in that area. (and have external image, haven't tried internal) \n[\/LIST]\n\n Im sure I am forgetting very important details here, but Im sure we will go over them. Thanks for the assistance."}
{"post_id":70173,"thread_id":60607,"title":"820-3662 PPBUS Pulsing","user_id":682,"username":"2informaticos","post_date":"2021-01-13 09:14:53","message":"Try to see what happens starting in SMC bypass mode.\nReball SMC, to discard bad solders."}
{"post_id":70178,"thread_id":60607,"title":"820-3662 PPBUS Pulsing","user_id":26418,"username":"Dusten04","post_date":"2021-01-13 09:27:17","message":"[QUOTE=\"2informaticos, post: 70173, member: 682\"]\nTru to see what happens starting in SMC bypass mode.\nReball SMC, to discard bad solders.\n[\/QUOTE]\nI will try in Bypass mode, did Reball the SMC, that is what brought the light back and PPBUS back to 12.58. Prior to this, it was at 12.26"}
{"post_id":70184,"thread_id":60607,"title":"820-3662 PPBUS Pulsing","user_id":26418,"username":"Dusten04","post_date":"2021-01-13 10:02:35","message":"I put Phase 2 back on, as well as Q7630, then attempted SMC bypass mode, no difference. \n*Assuming I did SMC bypass mode correctly, as I've never done it before, what I did: \nHeld down power button for 10 seconds, then connected MagSafe 2, then released power button two seconds later"}
{"post_id":70192,"thread_id":60607,"title":"820-3662 PPBUS Pulsing","user_id":682,"username":"2informaticos","post_date":"2021-01-13 11:52:27","message":"Maintain power button pressed 5-10s after charger is connected.\nIf succeed, fan must start to max speed."}
{"post_id":70193,"thread_id":60607,"title":"820-3662 PPBUS Pulsing","user_id":26418,"username":"Dusten04","post_date":"2021-01-13 11:58:36","message":"Thank you for the reply,\nI have orange light, until I depress the power button, then get, not even a quarter of a fan spin, then light shuts off, and pulsing begins"}
{"post_id":70199,"thread_id":60607,"title":"820-3662 PPBUS Pulsing","user_id":682,"username":"2informaticos","post_date":"2021-01-13 12:44:24","message":"\" When replacing the ISL and FETs, I noticed that the computer would turn on when it was hot in that area. (and have external iage, haven't tried internal)\"\nWhich area?\n\nTry heating up PCH (U1100) to 180-200 degrees for 15-20s; use good flux, not \"chinese honey\".\nDo the same with CPU, if no reaction in PCH case."}
{"post_id":70201,"thread_id":60607,"title":"820-3662 PPBUS Pulsing","user_id":26418,"username":"Dusten04","post_date":"2021-01-13 12:50:58","message":"Wait.... your advice is rehot CPU? haha\n\nIt turned on when I would heat directly over mosfets (Q7130 and Q7135)  Also I could apply heat on ISL. Pretty much heat anywhere in that area, would get fan spin. But when I have heated near CPU or PCH, there was no difference\n(when I put back U7310 and U7320 I was heating near CPU, no change) \n(when I put back Q7630 I was heating near PCH, no change)"}
{"post_id":70206,"thread_id":60607,"title":"820-3662 PPBUS Pulsing","user_id":682,"username":"2informaticos","post_date":"2021-01-13 13:20:03","message":"My advice was to heat PCH and CPU, trying to burn eventually accumulated crap; not to melt the balls!\n\nSomething is affected by corrosion, if the board reacts to heat."}
