{"post_id":83143,"thread_id":62019,"title":"capacitor on 820-00012","user_id":28356,"username":"RioRio","post_date":"2021-11-28 20:14:22","message":"I have a MacBook Pro 13\" 2015 with a minimal liquid damage on the i\/o board (820-00012). One capacitor was very corroded, after removing it the short circuit was gone. I would like to replace that capacitor, but I don't know its parameters. Are schematics for i\/o boards available anywhere?"}
{"post_id":83144,"thread_id":62019,"title":"capacitor on 820-00012","user_id":682,"username":"2informaticos","post_date":"2021-11-29 03:06:32","message":"I only saw boardview available for 820-3539 RIO board, which corresponds to A1502 from 2014.\nIt will serve you, I hope.\n\n[URL unfurl=\"true\"]https:\/\/drive.google.com\/file\/d\/1VEpF8usKzaNV-wK_GG6kaxG0cH8J-73f\/view?usp=sharing[\/URL]"}
{"post_id":83149,"thread_id":62019,"title":"capacitor on 820-00012","user_id":28356,"username":"RioRio","post_date":"2021-11-29 06:59:35","message":"Thank you! Unfortunately it looks pretty different from 820-00012. Though, there is a group of components that looks identical, even though it is placed on the other side of the board . The capacitor that is missing on my board would correspond to C9800. But I guess there is no guarantee that it has the same parameters as the cap on the 2015 board, right?\nAs these i\/o boards are very cheap, I guess it makes more sense to buy one and keep this one as a donor."}
{"post_id":83152,"thread_id":62019,"title":"capacitor on 820-00012","user_id":682,"username":"2informaticos","post_date":"2021-11-29 07:57:20","message":"You can follow the trace until RIO connector and find what power rail corresponds.\nThen you know the nominal voltage required and make a guess about its capacitance, if is a filter cap.\nIf it is directly connected to some particular chip on the RIO board, you can use its datasheet, or check similar schematic.\n\nIn the above boardview, C9800 is doubled by C4690.\nIf is similar in your board, remove and measure capacitance of second cap.\nOr just use 10-22uF\/6.3-10-16V capacitor..."}
