{"post_id":2479,"thread_id":2479,"title":"820-3115-B Green Light No Power","user_id":139,"username":"jb23","post_date":"2016-05-10 11:59:56","message":"Hello,\n\nI have an issue with an 820-3115-B board. Board was liquid damaged - put it through the ultrasonic cleaner and powered it up - green light and fan spinning. Great! Disconnected magsafe and went to have something to eat. Came back 10 minutes later will not power on: gets green light but will not power on at all. I have the following readings:\n\nPPBUS_G3H: 12.62V\nPP3V42_G3H: 3.497\nPPVRTC_G3H: 3.337\nPP5V_S5: 5.01V\nPP3V3_S5: 3.3V\nPP5V_S3: 0V\nPP3V3_S3: 0V\nPM_SLP_S4_L: 0V\n\n\nGot a weird issue where I get a short to ground on PP5V_S3 when the machine is plugged in but the short goes away after you leave the magsafe unplugged for a while?\n\nAny help would be appreciated with where to check next. Thanks"}
{"post_id":2482,"thread_id":2479,"title":"820-3115-B Green Light No Power","user_id":36,"username":"aprendiz","post_date":"2016-05-10 13:15:50","message":"Where was wather damage?? Check RTC resistors (R1800 to R1803) should have around 3.3V on both sides....."}
{"post_id":2483,"thread_id":2479,"title":"820-3115-B Green Light No Power","user_id":139,"username":"jb23","post_date":"2016-05-10 14:09:55","message":"Water Damage on top of board around EFI chip, SMC and thunderbolt chip and similar area on the other side of the board.\n\nRTC resistor values:\n\nR1800: 3.332V pin 1 3.236V pin 2\nR1801: 3.332V pin 1 3.057 pin 2\nR1802: 3.332V pin 1 3.327 pin 2\nR1803: 3.332V pin 1 3.327 pin 2\n\nR1800: 325K\nR1801: 1M\nR1802: 20K\nR1803: 20K\n\n\nChecked some other voltages:\n\nPP5V_SUS: 0V\nPM_SLP_SUS_L: 0V\nPP3V3_SUS: 0V\n\nSignal for these comes ultimately from U1800 so guessing a dead MCP?\n\nReverse diode reading on PP1V05_S0: 0.006 so guessing I have a short there also?\n\nTime to give up on this rabbit hole to hell?"}
{"post_id":2485,"thread_id":2479,"title":"820-3115-B Green Light No Power","user_id":36,"username":"aprendiz","post_date":"2016-05-10 14:27:31","message":"No MCP on this board, i guess you mean PCH....... Check for any missing or corroded component around SMC and bios chip, replace all bad parts, also you can try apply flux and heat SMC to remove the crap under the chip....."}
{"post_id":2486,"thread_id":2479,"title":"820-3115-B Green Light No Power","user_id":139,"username":"jb23","post_date":"2016-05-10 14:44:34","message":"Sorry PCH! I'm new this this when it comes to the advanced hit your head against a wall stuff. Tried reflowing the SMC with flux to get rid of any crap under the chip but didn't change anything nothing really corroded around the area. As far as I can diagnose it will not go into an S3 state because it's not getting the correct enable signals which seem to come from U1800.\n\nGuessing this is most likely an SMC or PCH issue? Yay!"}
{"post_id":2488,"thread_id":2479,"title":"820-3115-B Green Light No Power","user_id":36,"username":"aprendiz","post_date":"2016-05-10 15:51:47","message":"PP5V_S3_REG comes high for a second or nothing at all??? If you have a slow multimiter, may not be readed, so use osciloscope if you have....\n\nCould be bios problem, double check SPI lines and resistors, do continuity test............"}
{"post_id":2499,"thread_id":2479,"title":"820-3115-B Green Light No Power","user_id":139,"username":"jb23","post_date":"2016-05-11 07:19:24","message":"Nothing at all on PP5V_S3_REG. Replaced BIOS - no change. Have given up on this one for now thanks for the help anyway."}
{"post_id":2504,"thread_id":2479,"title":"820-3115-B Green Light No Power","user_id":139,"username":"jb23","post_date":"2016-05-11 12:38:11","message":"Replaced RTC Chip U2600 and I get an S0 state and the fan is spinning! No video output or chime though - will keep investigating but at least that's one problem solved! Thanks"}
{"post_id":2505,"thread_id":2479,"title":"820-3115-B Green Light No Power","user_id":36,"username":"aprendiz","post_date":"2016-05-11 13:08:27","message":"Put back original bios....."}
{"post_id":2507,"thread_id":2479,"title":"820-3115-B Green Light No Power","user_id":139,"username":"jb23","post_date":"2016-05-11 13:49:01","message":"Have done I think I have a U7400 problem as a few burnt probe points around those. Will check further and get back to you"}
{"post_id":2509,"thread_id":2479,"title":"820-3115-B Green Light No Power","user_id":139,"username":"jb23","post_date":"2016-05-11 15:59:05","message":"OK new issue: machine turns on but I get no video output. I have no voltage on PVCORE_S0_CPU and PVCORE_S0_AXG. All other main voltage rails appear to be present.\n\nI get a reverse diode reading on both of these CPU rails of 0.002V with U7400 removed.\n\nIs this a normal diode reading or does it seem like I have a short to ground on the CPU side?\n\nIf so how do I go around figuring out what's causing it - if I inject voltage here from a bench power supply the CPU gets hot but this would make sense as the CPU is turning on. It's hard to work out if anything else is getting hot and shorting though?\n\nApologies if I'm missing\/doing something stupid I've never had any U7400 or CPU Voltage problems before."}
{"post_id":2527,"thread_id":2479,"title":"820-3115-B Green Light No Power","user_id":139,"username":"jb23","post_date":"2016-05-12 07:58:10","message":"Quick update. I replaced U7400, R7402, R7403, Q7510, Q7520 and Q7550 and I now get 1.118V on PPVCORE_S0_CPU but get 0V on PPVCORE_S0_AXG.\n\nAny ideas of what to check next? I read in another forum that BIOS can cause this so I replaced the BIOS chip again but still no luck. Thanks so much!! Hopefully I'm near the end of fixing this absolute nightmare board"}
{"post_id":2528,"thread_id":2479,"title":"820-3115-B Green Light No Power","user_id":36,"username":"aprendiz","post_date":"2016-05-12 08:17:49","message":"Display is plugged in??? this voltage comes up when display is detected..."}
{"post_id":2529,"thread_id":2479,"title":"820-3115-B Green Light No Power","user_id":139,"username":"jb23","post_date":"2016-05-12 08:33:21","message":"Yes - plugged everything back in and I get a solid sleep light on the front, DVD drive does it's auto eject thing like it's about to POST and then nothing. No video ouput on display and 0.001V on PPVCORE_S0_AXG"}
{"post_id":2530,"thread_id":2479,"title":"820-3115-B Green Light No Power","user_id":139,"username":"jb23","post_date":"2016-05-12 08:35:49","message":"When the DVD drive does it's auto eject thing PPVCORE_S0_CPU goes down from 1.118V to 0.919V"}
{"post_id":2531,"thread_id":2479,"title":"820-3115-B Green Light No Power","user_id":139,"username":"jb23","post_date":"2016-05-12 09:14:18","message":"I get a beep when no RAM installed. I'll go back to U7400 and check all the resistors. I swear this board is a rite of passage from the repair gods to test my patience"}
{"post_id":2548,"thread_id":2479,"title":"820-3115-B Green Light No Power","user_id":139,"username":"jb23","post_date":"2016-05-13 09:49:57","message":"Had a look around U7400 and cant find anything else that looks bad. \n\nI removed R7550 and get voltage to pin 1 (think it was around 1V) as soon as I replace R7550 I get 0V on Pins 3, 4, and 5 on Q7550 and 0V on PPVCORE_S0_AXG.\n\nDead CPU?"}
{"post_id":2569,"thread_id":2479,"title":"820-3115-B Green Light No Power","user_id":1,"username":"larossmann","post_date":"2016-05-13 20:11:32","message":"picture on external monitor if you use thunderbolt to vga adapter?"}
{"post_id":2574,"thread_id":2479,"title":"820-3115-B Green Light No Power","user_id":139,"username":"jb23","post_date":"2016-05-14 05:19:47","message":"[QUOTE=\"larossmann, post: 2569\"]picture on external monitor if you use thunderbolt to vga adapter?[\/QUOTE]\n\nNothing. I put back the BIOS chip from my donor board to see what happens and I got no drop in voltage on cpu vcore or signs of trying to POST. it could be a BIOS issue after all as original spill was around that area. Will order in another and pray"}
{"post_id":2576,"thread_id":2479,"title":"820-3115-B Green Light No Power","user_id":2,"username":"dukefawks","post_date":"2016-05-14 06:58:24","message":"If it beeps all power is ok and POST runs. It can still hang during POST for 1000 reasons. Probably corroded resistor or crap under PCH\/SMC."}
{"post_id":2895,"thread_id":2479,"title":"820-3115-B Green Light No Power","user_id":139,"username":"jb23","post_date":"2016-05-21 15:05:27","message":"Cheers have given up on this rabbit hole to hell especially as I don't have decent enough tools at the moment to do any large scale BGA rework but was a good learning experience nonetheless getting the clock signal and CPU voltage back. Thanks again for all your help."}
