{"post_id":42646,"thread_id":42646,"title":"820-00165 recieves power, but fan spins very high, magsafe always amber?","user_id":2088,"username":"Hardwood T\/S","post_date":"2018-11-30 00:11:52","message":"Hey! First post here, hope to be an active member of the community once I become a bit more experienced. :)\n\n2015 13\" MBAir board, had some liquid damage on the I\/O board and no light on magsafe even w\/new I\/O cable so I bought a new I\/O board. No viewable liquid damage at all on main logic board.\nMagsafe came on amber at first with battery plugged in, turned her around to power on--nothing. Unplugged battery, magsafe still amber. Tried removing components to see if they were causing a short, nope.\nEventually the magsafe light went out, so I decided to pull out the multimeter\/schematic and start testing around normal power rails to see if something had shorted. While doing this I heard a pop on the backside of the board, flipped it around and saw small bit of smoke arise from center of the board. Couldn't tell at first what it was coming from, but eventually saw U7600 had a nice lil hole burnt on top of it near pin 12. Now magsafe light is back on, still amber, and the fan spins very intensely a few moments after being plugged in.\n\nAfter double-checking and measuring all the other rails seeing if they were present, started checking the s0 rails. PP5V_s0 is there, PP3V3_s0 is not--showing 2.0mV consistently. So, this is where I'm at.\nHonestly I wanted a bit of guidance and clearing up before continuing as well. Should I be measuring s0 rails right now, can I be sure the board is in an s0 state? Obviously U7600 is a problem, but would it have any affect on PP3V3_s0 (from the looks of the rails, no)? Where is PP3V3_s0 even created? and why did U7600 short so badly in the first place, how would I go about solving that?\n\nSorry for what may seem like many simple questions, but I would learn a lot from this experience! Thanks for reading.\n\nedit - I forgot to mention, my PPDCIN_G3HOT and related 18.5v rails are all 15v flat. Same result with old I\/O board, same result with multiple chargers. Not sure if this is a problem given all other always-present power rails are being created seemingly without problem?"}
{"post_id":42660,"thread_id":42646,"title":"820-00165 recieves power, but fan spins very high, magsafe always amber?","user_id":682,"username":"2informaticos","post_date":"2018-11-30 14:22:27","message":"Amber LED is normal from 2013 boards, even without battery.\nLED turns green after battery gets full 100%.\n\nU7600 should be changed.\nRemove it and check first resistance to ground on L7630.\nIf short\/low value, remove Q7630 and check again.\nIf still the same, board is trash...\nIf correct value, solder ne chip.\nDo NOT power up the board without U7600!!!\n\nCheck resistance to ground on all missing voltages."}
{"post_id":42665,"thread_id":42646,"title":"820-00165 recieves power, but fan spins very high, magsafe always amber?","user_id":2088,"username":"Hardwood T\/S","post_date":"2018-11-30 15:39:57","message":"Removed U7600, checked resistance on L7630--got .6ohms consistently. Schematic says .011?\nTested other inductors to make sure my multimeter wasn't wonky, was getting .459 on both L1290 and L1295 where schematic says .221. Looks like they're all related to that powerline, tho, and I've never had probs with that multimeter before."}
{"post_id":42668,"thread_id":42646,"title":"820-00165 recieves power, but fan spins very high, magsafe always amber?","user_id":682,"username":"2informaticos","post_date":"2018-11-30 16:32:06","message":"What you see on schematic is internal resistance for the coil.\n0.011 means 11 microhm!\nIf you have 0.6 ohm to ground, that is short.\nYou can never find resistance to ground marked on schematics..."}
{"post_id":42679,"thread_id":42646,"title":"820-00165 recieves power, but fan spins very high, magsafe always amber?","user_id":2088,"username":"Hardwood T\/S","post_date":"2018-11-30 17:35:57","message":"Oh! Good to know! What number should I be expecting normally then for L7630? I'll see about removing Q7630.\n\nedit - removed Q7630, still getting around ~.6ohms on the board. Dead? and if so why is that your conclusion?"}
{"post_id":42681,"thread_id":42646,"title":"820-00165 recieves power, but fan spins very high, magsafe always amber?","user_id":682,"username":"2informaticos","post_date":"2018-11-30 17:41:10","message":"Aprox .130 on diode mode with red probe to ground.\nYou will not get the exact same value of course; but similar one, 100-150 maybe..."}
{"post_id":42688,"thread_id":42646,"title":"820-00165 recieves power, but fan spins very high, magsafe always amber?","user_id":2088,"username":"Hardwood T\/S","post_date":"2018-11-30 19:22:55","message":"Nothing when on diode mode with both chips removed. So you think dead? Why do you think that?"}
{"post_id":42694,"thread_id":42646,"title":"820-00165 recieves power, but fan spins very high, magsafe always amber?","user_id":682,"username":"2informaticos","post_date":"2018-12-01 03:46:53","message":"Nothing means what???\nStill the same value, or open line?\nDo you get 0.600 on diode mode, or ohm scale?\nThere is a big difference!"}
{"post_id":42721,"thread_id":42646,"title":"820-00165 recieves power, but fan spins very high, magsafe always amber?","user_id":2088,"username":"Hardwood T\/S","post_date":"2018-12-01 11:46:03","message":"Nothing as in 0.00 in diode mode, still 0.6 in resistance. I get readings in diode mode for other inductors, so I'm guessing the 0.00 is no good!"}
{"post_id":42722,"thread_id":42646,"title":"820-00165 recieves power, but fan spins very high, magsafe always amber?","user_id":682,"username":"2informaticos","post_date":"2018-12-01 12:32:33","message":"That is real short.\nPCH\/CPU dead, board is trash; good as donor..."}
{"post_id":42728,"thread_id":42646,"title":"820-00165 recieves power, but fan spins very high, magsafe always amber?","user_id":2088,"username":"Hardwood T\/S","post_date":"2018-12-01 14:25:53","message":":( So I'm guessing since the board was getting power when U7600 was burnt out, it fried the CPU? Dern. Would still have liked to know what caused that chip to pop in the first place! Didn't see any signs of water damage on the main board at all."}
{"post_id":42729,"thread_id":42646,"title":"820-00165 recieves power, but fan spins very high, magsafe always amber?","user_id":682,"username":"2informaticos","post_date":"2018-12-01 15:08:36","message":"U7600 and probably Q7630 shorted, PPBUS_G3H went directly to PCH\/CPU..."}
