{"post_id":86173,"thread_id":62324,"title":"820-2914 (17\") Fans on full speed.","user_id":2333,"username":"realmacmods","post_date":"2022-02-11 10:12:21","message":"I have a 17\" 2011 that is blasting the fans all the time.  ASD shows all the temp sensors in working order.  No obvious signs of liquid damage, but prior shop did ultrasonic it before i got to see it.   I assumed this was going to be a bad temp sensor\/trace\/etc but it seems like that is not the case. \n\nI am well aware of the GPU issue and have already disabled it via firmware and hardware so it should be unrelated to that.  \n\nIt is both fans, immediately at power on, but they do turn off completely if put into sleep mode.  The cpu is not exceptionally hot so i dont think it is an actual temperature problem.  ASD fails the fan tests basically saying that it cannot control the fans.  \n\nAny thoughts of where else to look?"}
{"post_id":86175,"thread_id":62324,"title":"820-2914 (17\") Fans on full speed.","user_id":682,"username":"2informaticos","post_date":"2022-02-11 10:17:17","message":"Just in case, test disconnecting the webcam.\n\nASD fans error shoud points to fan controllers problem.\nCheck Q5660 and their adjacent resistors and traces."}
{"post_id":86176,"thread_id":62324,"title":"820-2914 (17\") Fans on full speed.","user_id":2333,"username":"realmacmods","post_date":"2022-02-11 10:25:56","message":"[QUOTE=\"2informaticos, post: 86175, member: 682\"]\nJust in case, test disconnecting the webcam.\n\nASD fans error shoud points to fan controllers problem.\nCheck Q5660 and their adjacent resistors and traces.\n[\/QUOTE]\nI think it was q5660, i just pulled one from a donor board it seems promising so far.  running ASD again to see what happens.\n\n\n:Edit: Yep, all good.  passes ASD now.   thanks."}
{"post_id":86181,"thread_id":62324,"title":"820-2914 (17\") Fans on full speed.","user_id":682,"username":"2informaticos","post_date":"2022-02-11 10:56:56","message":"Glad to hear is solved.\n\nFor the future, write directly on the reply box, instead of clicking Reply button.\nI don't see a real reason to quote an entire post, visible few centimeters above."}
