{"post_id":45313,"thread_id":45313,"title":"820-00239 liquid damage not turn onwith battery connected","user_id":338,"username":"arnonabuurs","post_date":"2019-01-28 07:51:47","message":"Hello, i have a touchbar 13 inch that had liquid damage in following area: U3200, QB701 and C6554 & C6553 (these last 2 not shorted). The machine was previously running from battery (when customer arrived), but display sometimes flickering, it had some waterspil. Since I assumed all was OK we ultra soniced it (did make pictures of the liquid damage prior to ultrasonic) and now the board starts up fine, but only without battery connected. The original battery was blown up, so we replaced it with a known working battery. When connecting a charger it show 20v but 0amp and not booting. When we remove the battery it starts up fine. Checked already the resister around U7000 they measure OK, U7000 area looks very clean. Images attached for reference. What should I check first? Will checkout lewis videos as well but have a big pile to fix so not much time to watch all hope you can point me in the right direction."}
{"post_id":45318,"thread_id":45313,"title":"820-00239 liquid damage not turn onwith battery connected","user_id":682,"username":"2informaticos","post_date":"2019-01-28 09:05:35","message":"Post exact voltage for CHGR_A\/BMON signals.\nTry to start in SMC bypass mode, with both charger and battery connected."}
{"post_id":45357,"thread_id":45313,"title":"820-00239 liquid damage not turn onwith battery connected","user_id":338,"username":"arnonabuurs","post_date":"2019-01-28 23:45:22","message":"With only the AC Charger connected i get 0.068v. Resistors measure OK though"}
{"post_id":45360,"thread_id":45313,"title":"820-00239 liquid damage not turn onwith battery connected","user_id":682,"username":"2informaticos","post_date":"2019-01-29 03:35:15","message":"Both signals same voltage?\nCheck them with charger and battery connected at same time."}
{"post_id":45369,"thread_id":45313,"title":"820-00239 liquid damage not turn onwith battery connected","user_id":338,"username":"arnonabuurs","post_date":"2019-01-29 06:23:14","message":"PRAM reset without battery, then connect the battery did the trick. Charging now, thanks!"}
