{"post_id":30967,"thread_id":30967,"title":"820-00164-A Not powering on\/wierd behavior","user_id":1242,"username":"ddahlstrom","post_date":"2018-02-01 16:07:20","message":"I have an 820-00164-A MacBook air that is not powering on and is exhibiting weird behavior on the PPBUS_G3H rail. With charger plugged in and motherboard out of computer I get fluctuating voltages on both pins of F7140. The fan initially begins spinning but dies again after a few seconds. Shortly after it will do this again in the same order, however it does not always begin this loop immediately, sometimes it takes several moments. On F7140, I get 8.87V max for PPBUS_G3H which drops down to 5.32V, then up to 7.46V and back to 8.87V every times the fan starts spinning but the fan always stops spinning once PPBUS gets back to 8.87V. I also took some other measurements around the ISL6259 region.\nI am getting the 5.1V on pin19 and 20 of U7100, and 4.32V on CHGR_ACIN pin of U7100. I am showing 16.09V on pin 2 of Q7130 and there is no continuity to ground through that MOSFET so I do not think it is shorted to ground. I am also getting 8.87V on CHGR_UGATE and 0.54V on CHGR_LGATE of Q7130, which I thought was strange.\n\nThoughts?"}
{"post_id":30976,"thread_id":30967,"title":"820-00164-A Not powering on\/wierd behavior","user_id":2,"username":"dukefawks","post_date":"2018-02-01 17:04:15","message":"I suspect a rail is shorted and is pulling down PPBUS when the board tries to power on. Check all rails for shorts. Also check resistance between pin 17\/18 27\/28 of U7100."}
{"post_id":30998,"thread_id":30967,"title":"820-00164-A Not powering on\/wierd behavior","user_id":1242,"username":"ddahlstrom","post_date":"2018-02-01 20:45:52","message":"I get 2.9 ohms between pins 17\/18 and 20.5 ohms of resistance between pins 27\/28 of U7100. Will test for short on other rails when I get the chance."}
{"post_id":31001,"thread_id":30967,"title":"820-00164-A Not powering on\/wierd behavior","user_id":2,"username":"dukefawks","post_date":"2018-02-01 20:56:04","message":"Also try a charged battery and see if it powers from that. Green\/orange light present?"}
{"post_id":31026,"thread_id":30967,"title":"820-00164-A Not powering on\/wierd behavior","user_id":1242,"username":"ddahlstrom","post_date":"2018-02-02 17:21:10","message":"With only battery and motherboard, I get 6.83V on PPBYS_G3H that jumps to 7.25V when charger is added. With both battery and charger PPBUS slowly rises from 7.25V to 7.63V and stabilizes.\n\nStarted going down the power rails, and am posting the measurements I have taken so far:\n\nG3Hot is 3.39V\nPPBUS_S5_HS_COMPUTING_ISNS is 8.56V that does not fluctuate with or without fan spin\n PPVCC_S0_CPU is 0V and then jumps to 0.38V when fan starts to spin\nPPVRTC_G3H is 3.31 V\nPP5V_S5 is 4.98V at pin 1 of L4820\n0V at Pin 1 of R1920\n0V at pin 2 of R8081\nP5VS0_EN 0V\nPP3V3_S5 is 3.3V on pin 5 of U8180\n3.3V is present on pin 2 of R8187 when fan is spinning\n\nWill go back through and measure rails again tonight when I have much more time to work on this, but was wondering if anything from what I have posted so far looks abnormal?"}
{"post_id":31035,"thread_id":30967,"title":"820-00164-A Not powering on\/wierd behavior","user_id":2,"username":"dukefawks","post_date":"2018-02-02 18:01:55","message":"PPBUS_S5_HS_COMPUTING_ISNS is 8.56V is directly connected to PPBUS_G3H so check your measurements. If PPVCC_S0_CPU is coming up then it means it is power cycling. Check PPBUS again if it stays at 8.6V"}
{"post_id":31354,"thread_id":30967,"title":"820-00164-A Not powering on\/wierd behavior","user_id":1242,"username":"ddahlstrom","post_date":"2018-02-10 21:54:24","message":"I rechecked my measurements and realized that I was missing PP5V_S4RS3 and it was at 0V. Since this rail comes from the dc-in board, I went ahead and replaced that as well but I seem to be having the same issue with this missing power rail as before. After replacing with new DC-in board I took some more measurements and they are as follows:\n\nPPBUS_G3H is 8.56V but drops to 7.4V when the fan intermittently begins spinning, and then back up to 8.56V when the fan stops\nPP5V_S4RS3 is 0V, but jumps to 5.09V when the fan begins to spin, and then back to 0V when the fan stops. This was measured at pin 1 of L7520. The resistance to ground on this line is 55.6k ohms\nPP3V42_G3H is 3.39V at pin 2 of L7095 and stays present with or without fan spin\nPP5V_S5 is 4.98V normally, and drops to 0V when the fan begins to spin (measured on pin 1 of L4820)\nPP5V_S0 is 0V normally, but jumps to 5V when the fan begins to spin.\n\nI also noticed that sometimes when the magsafe is plugged in I do not get any green or orange light, but PP3V42_G3H and PPBUS_G3H and other power rails measured above always hold the same values regardless of light being present or not.\n\nSo it is apparent that the board is trying to power on, but it can't and I think it has something to do with the PP5V_S4RS3 power rail but I am stumped as to where to go next. With new DC-in board, my results are pretty much the same as before. Do you think this problem could be because of the 821-1721-A cable being bad that connects the I\/O board to motherboard? I unfortunately do not have another for reference and would have to order one, but would like a second opinion before doing so. Cable looks fine physically.\n\nThanks"}
{"post_id":31357,"thread_id":30967,"title":"820-00164-A Not powering on\/wierd behavior","user_id":2,"username":"dukefawks","post_date":"2018-02-10 22:09:30","message":"PP5V_S5 should never drop to 0V. SMC_PM_G2_EN staying high?\nI still need to know if any power rails are shorted to GND, check all coils for shorts to GND.\nHistory of the board?"}
{"post_id":31457,"thread_id":30967,"title":"820-00164-A Not powering on\/wierd behavior","user_id":1242,"username":"ddahlstrom","post_date":"2018-02-12 16:41:05","message":"SMC_PM_G2_En tests at a solid 0.98V with or without the fan spin at pin 1 of RR8140\nI rechecked PP5V_S5 and it stays at 4.98V with or without fan spin at pin 1 of C7400\n\nAccording to customer, the device died one day and she has no longer been able to power it all of the way on, even though she is getting green\/orange light on charger. She took it to apple and they told her it was either a bad battery or bad motherboard. We already confirmed that it is not a battery with a known-good battery. No signs of liquid damage or corrosion, board looks very clean. \n\nI will be testing each rail for a short to ground this evening and will post those results when I have them."}
{"post_id":31472,"thread_id":30967,"title":"820-00164-A Not powering on\/wierd behavior","user_id":1242,"username":"ddahlstrom","post_date":"2018-02-12 23:51:33","message":"Found that there is 0V measured in Diode mode on both pins of L7310 and L7320, however all other inductors seem to measure a normal value."}
{"post_id":31474,"thread_id":30967,"title":"820-00164-A Not powering on\/wierd behavior","user_id":1242,"username":"ddahlstrom","post_date":"2018-02-13 00:25:00","message":"Took a look at U7200 and there is 0V on PP5V_S0_CPUVR_VDD pin 16 that jumps to 5.12V when the fan begins spinning. Also noticed that CPU is warm with no fan spin, but when the fan starts spinning the VPU becomes so hot I can barely hold my finger on it.\nCPU_VR_EN is 0.8V on U7200 that falls to 0V without fan spin"}
{"post_id":31479,"thread_id":30967,"title":"820-00164-A Not powering on\/wierd behavior","user_id":2,"username":"dukefawks","post_date":"2018-02-13 03:56:04","message":"These CPUs should not get that hot. It should take a while before your finger burns. Measure resistance to GND on L7310, not diode mode."}
{"post_id":31493,"thread_id":30967,"title":"820-00164-A Not powering on\/wierd behavior","user_id":1242,"username":"ddahlstrom","post_date":"2018-02-13 10:22:46","message":"It kind of does take a while. So as mentioned, when the magsage is first connected, there is green\/orange light and then after a few moments fan starts spinning for a few seconds then stops. And it will keep going with this loop. CPU initially gets warm, and as the fan goes into this loop is when the CPU starts getting very hot.\n\nresistance to GND on both sides of L3170 is 0ohms. Same on L7320."}
{"post_id":31505,"thread_id":30967,"title":"820-00164-A Not powering on\/wierd behavior","user_id":2,"username":"dukefawks","post_date":"2018-02-13 21:21:13","message":"You sure about 0 Ohm on L7310? This would indicate a shorted CPU....."}
{"post_id":31514,"thread_id":30967,"title":"820-00164-A Not powering on\/wierd behavior","user_id":1242,"username":"ddahlstrom","post_date":"2018-02-13 22:08:43","message":"Yes. 0.3 ohms on L7310. That is unfortunate if that is the case. Does that explain why PP5V_S4RS3 is missing as well(not shorted to GND, just 0V)?"}
{"post_id":31517,"thread_id":30967,"title":"820-00164-A Not powering on\/wierd behavior","user_id":2,"username":"dukefawks","post_date":"2018-02-13 23:34:33","message":"PP5V_S4RS3 will be present and it will be pulsing. Must have been liquid in the CPU regulator area."}
{"post_id":31524,"thread_id":30967,"title":"820-00164-A Not powering on\/wierd behavior","user_id":1242,"username":"ddahlstrom","post_date":"2018-02-14 02:59:19","message":"It is showing a steady 0V on every test point I could find for PP5V_S4RS3. And U7200 area looks flawless of that is what you are referring to. Does not show any signs of liquid damage. PP5v_s0 and enable are missing as well. Anything else I can do to find what the problem is being caused by?"}
{"post_id":31543,"thread_id":30967,"title":"820-00164-A Not powering on\/wierd behavior","user_id":2,"username":"dukefawks","post_date":"2018-02-14 13:48:47","message":"You said \"Took a look at [URL=\"https:\/\/store.rossmanngroup.com\/d2-tps51125.html\"]U7200[\/URL] and there is 0V on PP5V_S0_CPUVR_VDD pin 16 that jumps to 5.12V when the fan begins spinning.\"\nThat 5V comes from 5V_S0 which comes from 5V_S4. But this is all time wasting as the CPU is shorted and this board is trash, RIP."}
{"post_id":31550,"thread_id":30967,"title":"820-00164-A Not powering on\/wierd behavior","user_id":1242,"username":"ddahlstrom","post_date":"2018-02-14 15:06:57","message":"Got it. The board operation seemed to be digressing as time went on, which is why some of my measurements changed. Now the CPU does not get warm and there is never any fan spin. But thank you for the help, it is a good donor board if nothing else...."}
