[
    {
        "post_id":8732,
        "thread_id":8732,
        "title":"820-3115-B not turning on",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2016-10-27 08:01:20",
        "message":"Hello,\nsorry for my bad english. I have a Problem with a 320-3115-B. It has a green light on the charger but wont turn on. I measured the powerrails and noticed, that PP3V42_G3H is 3,62V. I thought that my multimeter could be a little of but PPBUS_G3H is exakt 12,60V. This board had waterdamage but looks very clean overall. I also noticed, that PP3V3_S0 is there but most other S0 rails like PP1V5_S0, PP1V8_S0 or PP1V05_S0 are missing. These are all shorted to groung and i can not find where the short is. Another thing that i noticed is that U1800 is getting a little warm. Means this, that U1800 is shorting the S0 rails to ground or is it only still reciving power anr trying to work? The last and strangest thing i noticed is, that it makes a silent beeping sound in the U1800 areea if its getting power. It sonds like a damaged HDD with a litle click every second. I tryed to attach the sound file to this post (.m4a\/.mp3) but it says invalid file. I´m not sure if this file is needed but if i can provide it.\nIs there any hope to save this board or is it already dead?\nThank you for your help.\nBest regards,\nFelix"
    },
    {
        "post_id":8742,
        "thread_id":8732,
        "title":"820-3115-B not turning on",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-10-27 09:03:03",
        "message":"If PP1V5_S0 is not there, check if PP1V5S0_EN is high. Is CPU getting warm?"
    },
    {
        "post_id":8896,
        "thread_id":8732,
        "title":"820-3115-B not turning on",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2016-10-31 02:50:45",
        "message":"Hello,\ni checked P1V5S0_EN (it is there) and exchanged U7770. Now PP1V5_S0 is there. But PP1V8_S0 is 0,341V and PP1V05_S0 is 0,0V. I check these for faults too. The CPU is not getting warm at all. I also noticed that the \"height\" of the sound changes if i measure on L6995 (PP3V42_G3H which is 3,6V) and also changes and even stops (and than green light turns off) if i randomly press somewhere on the board."
    },
    {
        "post_id":8903,
        "thread_id":8732,
        "title":"820-3115-B not turning on",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2016-10-31 03:42:46",
        "message":"Update:\nI already got, that PP1V8_S0 is shortet and thats why PP1V05_S0 is not there. The short is in pin 2 of L7760 and the diode mode reading is 0,069V, but FB, C7762, C7763 and C7772 are ok. R7760 and R7761 are 6,7Kohm. I assume thats fine. If i put 1V up to 1,8V on L7760 its using max. 0,08A and nothing gets warm."
    },
    {
        "post_id":8923,
        "thread_id":8732,
        "title":"820-3115-B not turning on",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-10-31 14:14:46",
        "message":"I am traveling this week so I have no board at hand to compare, 0.07 seems way too low though. Do you have a board to compare?"
    },
    {
        "post_id":8932,
        "thread_id":8732,
        "title":"820-3115-B not turning on",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2016-10-31 15:08:21",
        "message":"No problem, it´s amazing and incredible helpful that a place like this exists so a few days dont matter for me. I´m sure on both of my two boards is at least one component of almost every circuit missing but i see if i can rebuild it on one of them for a measurement. If i can get a comparisson i´ll let you know. I think that it is to low too because pin 1 of L7760 measures ~0,41V which is in the dimension of many working circuits in my experience... Come back to this if you have time and a board for it :). Thank you!"
    },
    {
        "post_id":8945,
        "thread_id":8732,
        "title":"820-3115-B not turning on",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-10-31 18:21:05",
        "message":"I asked Louis to check, give it a few."
    },
    {
        "post_id":8953,
        "thread_id":8732,
        "title":"820-3115-B not turning on",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2016-10-31 19:07:56",
        "message":"I get 0.125. 0.069 is too low."
    },
    {
        "post_id":8958,
        "thread_id":8732,
        "title":"820-3115-B not turning on",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-10-31 21:04:06",
        "message":"1V8 all goes to CPU, so resistance to GND will depend on your CPU model so 0.07 is possible maybe. Check if P1V8S0_EN is there, if yes replace U7760."
    },
    {
        "post_id":8970,
        "thread_id":8732,
        "title":"820-3115-B not turning on",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2016-11-01 05:47:25",
        "message":"P1V8S0_EN is 3,232V. I replaced U7760 two times and nothing happens. P1V8S0_EN stays 3,232V both times and the beeping sound is also still there. Can i send power to the board with L7760 removed or will it kill the board. If possible i could measure if PP1V8_S0 is created at pin 1 of L7760, right? Because as i removed L7760 the short only seems to be only on Pin 2. Pin 1 of L7760 was ~0,41V. Or are i searching in the wrong section?"
    },
    {
        "post_id":8980,
        "thread_id":8732,
        "title":"820-3115-B not turning on",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-11-01 10:54:31",
        "message":"Well this would point to an overload in 1V8 and it only goes to the CPU. So bad CPU is likely, unless you want to swap a CPU this board is toast."
    },
    {
        "post_id":8985,
        "thread_id":8732,
        "title":"820-3115-B not turning on",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2016-11-01 13:18:53",
        "message":"Ok, thank you very much for your help and fast replys. This is maybe not the best result but it is a solution and a ensurance for me that i don´t throw something reparable away.\nAll the best,\nFelix"
    }
]