{"post_id":50290,"thread_id":50290,"title":"820-4924 will not charge battery","user_id":5210,"username":"KC Micro Tronix","post_date":"2019-06-27 11:19:44","message":"No signs of water damage.  After I could not figure this out I spent some time double checking for any signs of water.  Even looked at MacBook where board came out!\nUnit powers on boots and operates normally.\ngreen light goes orange.  Machine indicates that the battery is charging and properly recolonizes that the battery is present. \nUnit will operate from battery.  Battery currently shows 87% and seems to stay there.  (I am currently draining it to test)\ncurrent draw does not indicate charging. (300 ish mA)  when running. \n\nI checked the current sensing resistors on U7100 \"good\" (R7120 and R7121-R7122) & (R7150 and R7151 & R7152)\nI know Q7155 is working as the machine will operate from battery.\nOut of desperation I changed U7100.\n\nThis is the first \"not charging\" 820-4924 unit I have come across.  I am sure I am missing something stupid here but a nudge in the right direction would be most helpful.   \n\nThanks, Randall"}
{"post_id":50294,"thread_id":50290,"title":"820-4924 will not charge battery","user_id":1153,"username":"JohnB8812","post_date":"2019-06-27 12:25:00","message":"Voltage on PPBUS charger only no battery? Tried known good battery?"}
{"post_id":50305,"thread_id":50290,"title":"820-4924 will not charge battery","user_id":682,"username":"2informaticos","post_date":"2019-06-27 16:50:45","message":"\"I know Q7155 is working as the machine will operate from battery.\"\nThat is not a reason to assume such thing; did you look at internal diode???\n\nPost F7140 voltage on battery alone and also charger alone.\nPost Q7155 voltages with both charger and battery connected.\nDid you test a known good battery?"}
{"post_id":50309,"thread_id":50290,"title":"820-4924 will not charge battery","user_id":5210,"username":"KC Micro Tronix","post_date":"2019-06-27 17:30:52","message":"I actually passed on this board. I work for a vendor that has to turn them in 7 days so I returned the MacBook so they could ship to their other board guy. I won't be able to do additional troubleshooting on this board but moving forward when I see this again I need to know where to look.\n\nquestions \"Theoretical at this point.\"\n[LIST]\n[*]Q7155 \"if the internal diode was shorted\" the unit would be in charge mode all the time correct? The FET would be in continuous bypass \"on\" mode. So that is most likely not the problem? If it were opened it would still work as a FET and charge but would not run off of battery? Perhaps the FET was damaged \"Q7155\" or the signal was missing on Pin 4 I guess I should of looked at that but didn't. I could of bypassed Q7155 and see if it charged.\n[*]The battery was changed out with a new one with the same result. So it's not the battery.\n[*]PPBUS G3H I assumed was good as the machine was running. I guess it could of been low but that would not of been caused by a short. That was ruled out by normal current draw.\n[*]I also gave this board a quick look over with the FLIR and did not see anything glaring back at me.\n[\/LIST]\nThere was no evidence of water damage on this unit. Came in for battery charging problems.\n\nI will find out the results from the secondary board level repair shop in a few days and will post their results here. Just seems like I have to be over looking something real stupid as there is not much to this circuit.\n\nHas anyone seen this before or a failure in Q7155 like this?"}
{"post_id":50314,"thread_id":50290,"title":"820-4924 will not charge battery","user_id":682,"username":"2informaticos","post_date":"2019-06-27 19:01:06","message":"New battery doesn't mean known good working battery; saw too many crappy battery.\n\nSTOP to assume the things so easy.\n12.2V or 12.6V is not the same thing for PPBUS_G3H; even the board can work in both cases.\nInternal diode from Q7155 will always pass battery voltage to PPBUS_G3H; no need the MOSFET itself gets open.\n\nWe try to help you interpreting your answers to our questions.\nIf no answers, sorry but..."}
