{"post_id":103175,"thread_id":64399,"title":"820-00923-A Not Powering Up After BIOS Flash","user_id":57277,"username":"imperialboard89","post_date":"2023-12-18 12:38:17","message":"Hello everyone,\n\nI have a 820-00923-A board that used to boot without any issues before I flashed the BIOS. After programming the BIOS chip with the CH341A programmer, the board did not power up anymore.\n\nSo, I took the schematics of the board and started checking the power aliases. I verified all the voltages, and they are all correct. The only skewed voltage is on PPVCC_S0_CPU, where the measured value is 0.785V instead of 1.5V. I thought the CPU might be dead, but I'm not certain.\n\nWhen I try to power on the board, I notice that it correctly receives 20V input, but only draws 0.461A. Using the thermal camera, I observe that the CPU heats up, and just above the CPU, there are the U7210, U7220, U7410, U7420, U7430 chips, all heating up beyond 45 degrees.\n\nI have tested L7210 and L7220, and on both, I read a voltage of 0.785V."}
{"post_id":103176,"thread_id":64399,"title":"820-00923-A Not Powering Up After BIOS Flash","user_id":682,"username":"2informaticos","post_date":"2023-12-18 13:15:10","message":"First of all, welcome to the forum!\n\nYou get even S0 voltages, so board powers up; not booting is another problem.\nCPU core should drop near the 0.65V when board really boots.\nMonitor its voltage from start and see when stops to 0.785V.\nJust in case, check USB activity and Caps Lock LED reaction.\n\nI recommend to check for knocked off components near the BIOS chip; be sure U6100 has good solders.\nWhere did you get the BIOS file?\n\n\"board that used to boot without any issues before I flashed the BIOS\"\nWhy did it???\n\n[URL unfurl=\"true\"]https:\/\/drive.google.com\/file\/d\/1zqEhJcX9Ol9v7HMLIyFWm-Gpt-lQ0_dP\/view?usp=sharing[\/URL]"}
{"post_id":103180,"thread_id":64399,"title":"820-00923-A Not Powering Up After BIOS Flash","user_id":57277,"username":"imperialboard89","post_date":"2023-12-18 14:05:06","message":"[QUOTE=\"2informaticos, post: 103176, member: 682\"]\nFirst of all, welcome to the forum!\n\nYou get even S0 voltages, so board powers up; not booting is another problem.\nCPU core should drop near the 0.65V when board really boots.\nMonitor its voltage from start and see when stops to 0.785V.\nJust in case, check USB activity and Caps Lock LED reaction.\n\nI recommend to check for knocked off components near the BIOS chip; be sure U6100 has good solders.\nWhere did you get the BIOS file?\n\n\"board that used to boot without any issues before I flashed the BIOS\"\nWhy did it???\n\n[URL unfurl=\"true\"]https:\/\/drive.google.com\/file\/d\/1zqEhJcX9Ol9v7HMLIyFWm-Gpt-lQ0_dP\/view?usp=sharing[\/URL]\n[\/QUOTE]\nThanks for the help,\n\nI don't have the green LED on the Caps Lock, but the fans spin at maximum speed. After about a minute, they restart and continue this cycle indefinitely.\n\nHere are the voltages on the following lines:\n\nCPUCORE_PWM1: 0.369V\nCPUCORE1_GL0: 4.686V\nCPUCORE2_GL0: 4.694V\n\nMeasuring the voltage of PPVCC_S0_CPU on C10G1, I get exactly 0.784V after 10 seconds, and after about 12 seconds, the voltage drops back to 0. It repeats this cycle continuously.\n\nI got the bin file on alisaler.com. I had to flash the bios cause I could not install anyone MacOS outside of Sonoma with OpenCore, but the TouchBar was not working with that OS, so I had to solve the corrupted bios issue..."}
{"post_id":103187,"thread_id":64399,"title":"820-00923-A Not Powering Up After BIOS Flash","user_id":682,"username":"2informaticos","post_date":"2023-12-18 15:44:01","message":"\"I get exactly 0.784V after 10 seconds\"\nI said to [B]monitor[\/B] the voltage.\nConnect multimeter before applying power; see the voltage changes in time!\n\nDid you make BIOS backup?\nIf not, try the uploaded file.\n\nWhat didn't work under Ventura, to need Sonoma???\n\nBTW, do not quote an entire post visible few centimeters above.\nWrite directly on the bottom reply box, instead of clicking reply button.\nPlease, maintain forum aesthetic..."}
{"post_id":103189,"thread_id":64399,"title":"820-00923-A Not Powering Up After BIOS Flash","user_id":57277,"username":"imperialboard89","post_date":"2023-12-18 16:22:50","message":"No, unfortunately, I forgot to back up the BIOS.\n\nI've tested Ventura, High Sierra, Monterey, Big Sur, Catalina, but despite everything, I received the message that it's not possible to update after installing the operating system. So, the system never started.\n\nI ask for your forgiveness, but I'm still a beginner, trying to do my best.\nI monitored the voltage on PPVCC_S0_CPU, and it starts rising from 0 to 0.785V instantly as soon as the board reaches a current draw of 0.488A. After about ten seconds, the board stops drawing amperes, then starts rising again to 0.488A, and the voltage on PPVCC_S0_CPU remains fixed at 0.785V for the time that I monitored it for about ten minutes, then I powered off the board. \n\nDo you think that if I replace U7210 and U7220 could I solve the problem? I thought at this because the input Voltage on the chips is right, but when I test the voltage on the inductors L7210 and L7220 it is not 1.5V but 0.785V.\n\nI want to clarify that I am conducting the test only on the board, without connecting fans or a keyboard."}
