[
    {
        "post_id":33143,
        "thread_id":33143,
        "title":"820-3115 with no backlight",
        "user_id":1423,
        "username":"captainmac",
        "post_date":"2018-03-31 16:18:31",
        "message":"Hi there, new to the whole board repair stuff, so please bear with me\n\nGot a 3115 with a huge hole by the LCD conn. pins 21 and 22\ncaps c9796 and c9020 were blown off.\n\nwith U9701 removed (looked messed up) and both aforementioned caps removed, I have full continuity to ground from pin 5 of U9701.\nalso full continuity to ground from the pads under pin 1 of both the C9796 and c9020.\n\nany pointers of where to start?\nagain, sorry if I am clueless..\n\nEDIT: History is liquid damage around the LCD and U9701 area. not previously worked on."
    },
    {
        "post_id":33187,
        "thread_id":33143,
        "title":"820-3115 with no backlight",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-04-03 12:19:32",
        "message":"Looks like you have a short in the board from PPVOUT_SW_LCDBKLT to GND. Sometimes you can dig it out at the LCD connector but many times you will have to lift every component on that line and run a wire to make your own rail. \nDon't dig too much around the LCD connector or risk messing up other traces. Do you at least have an image without backlight?"
    },
    {
        "post_id":33236,
        "thread_id":33143,
        "title":"820-3115 with no backlight",
        "user_id":1423,
        "username":"captainmac",
        "post_date":"2018-04-04 03:10:49",
        "message":"Thanks duke. Yeah i do get image, just no backlight.\n\nShit, this is going to be a pain in the bumhole..\nI did indeed do some digging at the C9020\/C9796 area, but I can't seem to remove the short; it's only becoming more gross-looking. (L9080 is standing on the edge of a giant crater the size of fucking grandcanyon)\n\nSo i would have to run wires from and to every component on the PPVOUT_SW_LCDBKLT line, without them touching any parts of that original trace, right? Doesn't that mean i have to start at pin 5 from U9701? I can't use the probe point there, so i was thinking to attach a wire to the IC itself and have that run to the caps at the LCD Connector (which, in turn need to be off the board) ?\nI guess i could mount the caps standing up?"
    },
    {
        "post_id":33270,
        "thread_id":33143,
        "title":"820-3115 with no backlight",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-04-05 11:17:24",
        "message":"Yup everything needs disconnected. You can forget about the small caps like C9020. I don't know how much time you have to waste, but I don't think I would bother with something like this."
    }
]