[
    {
        "post_id":103080,
        "thread_id":64381,
        "title":"Macbook Air M1 820- 02016 DFU error",
        "user_id":27167,
        "username":"drmacbookth",
        "post_date":"2023-12-11 22:26:14",
        "message":"I got a Macbook 2020 that came in not booting. Chimes, shows Apple logo then crashes. Also the utility menu crashes, so tried a DFU restore which generates an error. Got 20V, all seems OK, chimes, Apple logo, then black. Time to try another T2 chip or what you guys suggest? SSD seems OK, no shorts and all power is there."
    },
    {
        "post_id":103083,
        "thread_id":64381,
        "title":"Macbook Air M1 820- 02016 DFU error",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-12-12 01:07:48",
        "message":"Any history available?\nWhat error did you get on DFU?\nTried with both charger and battery connected?\nConnect charger cable first, before connecting DFU cable."
    },
    {
        "post_id":103088,
        "thread_id":64381,
        "title":"Macbook Air M1 820- 02016 DFU error",
        "user_id":27167,
        "username":"drmacbookth",
        "post_date":"2023-12-12 01:44:35",
        "message":"I notices it had a defect pin on one of the charge ports due to corrosion, also tiny little splash visible on the battery so I guess it had some liquid. Board is totall ]y clean. I retried DFU again with a proper Type-C connector and yes both battery and charger connected. the sequence i didnt pay attention to and didnt note the error down, let me do it once more in the way you described and report back."
    },
    {
        "post_id":103108,
        "thread_id":64381,
        "title":"Macbook Air M1 820- 02016 DFU error",
        "user_id":27167,
        "username":"drmacbookth",
        "post_date":"2023-12-12 19:46:15",
        "message":"So after doing the process again its installing, then ir reboots, chimes, Apple logo, black, apple logo again and in the Configurator shows a lock, I noticed caps lock was on, so i connected it to an external display, and what do you know, it is in recovery menu. So it seems the display has some issue, turns of when booting. Tried with another known good display and it works. One question, where is the LID sensor on these machines? I read in the speakers but dont see it, trackpad maybe? Thanks for the help!"
    },
    {
        "post_id":103117,
        "thread_id":64381,
        "title":"Macbook Air M1 820- 02016 DFU error",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-12-12 23:21:23",
        "message":"Left sensor is placed on the microphone flex.\nThe right sensor is on the right speaker flex."
    },
    {
        "post_id":103119,
        "thread_id":64381,
        "title":"Macbook Air M1 820- 02016 DFU error",
        "user_id":27167,
        "username":"drmacbookth",
        "post_date":"2023-12-13 00:05:51",
        "message":"OK thanks for that will check."
    }
]