{"post_id":52655,"thread_id":52655,"title":"3 - 820-4924 boards- Green to Orange - No Fan Spin 19.9V 0.03A","user_id":9462,"username":"Phiberop840","post_date":"2019-09-26 22:25:16","message":"So I am fairly new to Apple Logic board repair but not Electroniscs or Soldering.  Hoping that you can help me here and tel me the points to check first and what the values should be for each,  If this is something already out and solved please link me,  \n\nI use an Apple USB C Cable to an Apple Charger 87W USB-C and a USB C Black Test Meter bought from you guys.  I have 3 of each board and toasted one of the power boards smoked, turned bright orange then black and never worked since.   Not sure what happened,  So 3 boards that are like new and same with the rest of the machine. As stated, I have 3 boards and 2 good Power boards, and I get the same on all 3 boards when I check for fan spin using 2 power boards on the 3,  The one is dead now.  What other rails should I tackle as well is there a quick list to start off with?  I will post as soon asa I ksff\n\n\nThank you, \nM"}
{"post_id":52659,"thread_id":52655,"title":"3 - 820-4924 boards- Green to Orange - No Fan Spin 19.9V 0.03A","user_id":682,"username":"2informaticos","post_date":"2019-09-27 01:57:09","message":"\"I use an Apple USB C Cable to an Apple Charger 87W USB-C and a USB C Black Test Meter\"\nWhy???\nThis board requires 60\/85W Magsafe 2 charger.\nUse correct charger and come back with exact voltage for PPBUS_G3H, 3V42 and 3V3_S5\/SUS lines.\nAlso try to start in SMC bypass."}
{"post_id":52664,"thread_id":52655,"title":"3 - 820-4924 boards- Green to Orange - No Fan Spin 19.9V 0.03A","user_id":9462,"username":"Phiberop840","post_date":"2019-09-27 06:05:30","message":"Thank you for not chewing his head off,  l tell them if they get stuck to ask so I give him credit for that.  He was using this cable which is convenient but you end up using the wrong power brick, as you noted.  This will fry the little power boards.  I will come back (or he will) with the appropriate numbers and more, if I don't figure it out.  Sometimes I Get lucky.  lol.  Thank you f0r your time and help.  Its really appreciated.  The internet can be very mean to new people making dumb mistakes.  Thanks for holding back.  :-)"}
{"post_id":52665,"thread_id":52655,"title":"3 - 820-4924 boards- Green to Orange - No Fan Spin 19.9V 0.03A","user_id":9462,"username":"Phiberop840","post_date":"2019-09-27 06:06:00","message":"[url]https:\/\/www.amazon.com\/gp\/product\/B07RHM5RWW\/ref=ppx_yo_dt_b_asin_title_o02_s02?ie=UTF8&psc=1[\/url]\n\nSorry forgot to post link."}
{"post_id":52672,"thread_id":52655,"title":"3 - 820-4924 boards- Green to Orange - No Fan Spin 19.9V 0.03A","user_id":1153,"username":"JohnB8812","post_date":"2019-09-27 16:21:30","message":"Never ever ever ever EVER use anything but an OEM 60\/85 watt Magsafe 2 charger on the newer Retinas aka 2015. You probably have no amp pull because of a bad charger..."}
