[
    {
        "post_id":2506,
        "thread_id":2506,
        "title":"Repairing \"Not Recognized\" Batteries",
        "user_id":135,
        "username":"bjf",
        "post_date":"2016-05-11 11:25:02",
        "message":"Like anyone else that works on these things, I'm building up a massive collection of batteries that are not recognized and have no stats showing up. I'm thinking specifically of Retina and Air batteries. It seems to be very common with them. Has anyone had any luck trying to repair the boards on these to restore functionality?"
    },
    {
        "post_id":2514,
        "thread_id":2506,
        "title":"Repairing \"Not Recognized\" Batteries",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-05-11 16:54:35",
        "message":"They are fixable if they are recognized but the status is \"replace now\".  Look at Be2Works or UBRT, I found it not worth the money and effort."
    },
    {
        "post_id":2534,
        "thread_id":2506,
        "title":"Repairing \"Not Recognized\" Batteries",
        "user_id":135,
        "username":"bjf",
        "post_date":"2016-05-12 09:14:06",
        "message":"Yeah, \"Replace Now\" gives some hope, and yes, that's a lot of work, but the \"Not Recognized\" ones are really plaguing me right now, and they could probably be fixed if a schematic was available. It's a tough one to experiment with too, I'm not fond of fireworks going off in my face."
    },
    {
        "post_id":2537,
        "thread_id":2506,
        "title":"Repairing \"Not Recognized\" Batteries",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2016-05-12 11:25:02",
        "message":"[url]https:\/\/www.youtube.com\/watch?v=P2QJHWHZAxg[\/url]"
    },
    {
        "post_id":2552,
        "thread_id":2506,
        "title":"Repairing \"Not Recognized\" Batteries",
        "user_id":135,
        "username":"bjf",
        "post_date":"2016-05-13 11:36:36",
        "message":"Terrifying. Spewing gases and flames. I'm way too wary of batteries to go near them with metal tools.\n\nI had a fully repaired board give me a very intimate 4th of July celebration after connecting a battery that apparently gave the board a dead short. Fortunately I had it facing away from me. Either way, I now wear safety glasses and check for shorts on the main voltage line every time I plug in any unknown batteries.\n\nIn other news, really nice quality on the security video."
    }
]