{"post_id":18160,"thread_id":18160,"title":"820-00164-A (issues with BIOS chip)","user_id":468,"username":"ALB-Repairs","post_date":"2017-04-11 06:11:48","message":"Hi\nIve been having an issue with 820-00164 bios chips, It seems every time i resolder one it gives me no power. I these smaller bios chips seem to be a pain in the ass, Ive been soldering on macbook boards every day for 3-4 years now so its odd that im d=finding these a challenge!\n\nBefore this the machine was booting most of the way but hanging on boot, really odd issue that ive only seen on 2015 11\" airs."}
{"post_id":18167,"thread_id":18160,"title":"820-00164-A (issues with BIOS chip)","user_id":2,"username":"dukefawks","post_date":"2017-04-11 10:01:46","message":"No idea, these are certainly not hard to solder. Inspect for proper seating of the chip and knocked off components. Also if you flash these you need to enable the \"quad\" bit. If you reuse an existing chip this bit will still be set, but a new chip you will need to set this bit in the programmer software."}
{"post_id":18225,"thread_id":18160,"title":"820-00164-A (issues with BIOS chip)","user_id":468,"username":"ALB-Repairs","post_date":"2017-04-12 04:33:38","message":"Ah Okay, interesting stuff.\n\nSome resistors had blown out causing it to not recognise a bios chip atall\nIntersetingly enough When no bios chip is installed it mimics what ive often thought is dead CPU symtoms on this model.\n\nBy this i mean the fan doesnt spin and the current jumps up but shuts off instantly. When PP5V_S0_EN is removed it will stay with all voltages but V-Core\n\nSeems both 'no bios' and 'shorted cpu' on these machines manifests in exactly the same way. (unless ive been completely overlooking bad bios on all the boards that ive come across with shorted CPU's)"}
{"post_id":18227,"thread_id":18160,"title":"820-00164-A (issues with BIOS chip)","user_id":468,"username":"ALB-Repairs","post_date":"2017-04-12 05:39:23","message":"Still cant get the machine booting past anything EFI based. OSX installs but it just sits on a completed loading bar.\nAny ideas?"}
{"post_id":18229,"thread_id":18160,"title":"820-00164-A (issues with BIOS chip)","user_id":468,"username":"ALB-Repairs","post_date":"2017-04-12 06:23:38","message":"It only completes boot after a PRAM reset.. And only once! otherwise it sits on the apple logo and you can here OSX voiceover. Its like bad GPU symptoms which is odd!\n\nSystem was originally liquid damaged and all that was done was an ultrasonic!"}
{"post_id":18233,"thread_id":18160,"title":"820-00164-A (issues with BIOS chip)","user_id":2,"username":"dukefawks","post_date":"2017-04-12 07:26:00","message":"Without ROM it will just power cycle.\nI doubt the ROM is the issue if it was liquid damage and no one had messed with it. Did you use a file with a clean ME?"}
{"post_id":18236,"thread_id":18160,"title":"820-00164-A (issues with BIOS chip)","user_id":468,"username":"ALB-Repairs","post_date":"2017-04-12 07:48:44","message":"Its currently running its original rom file. (i think, unless i got the rom chips confused at some point)\n\nIt only power cycles once on the 2015 models unlike older machines, Without a ROM chip it doesnt quater fanspin it just jumps the once, and as stated before if you shut off the v-core rail the fan remains spinning.\n\nAlthough if there is one damaged SPI line like MISO then it will power cycle like normal older machines. \nso basically on 2015+ missing SPI = stuck in s5 (but v-core jump once very quickly) and if its just damaged or messed up programming it will power cycle like normal.\nanyhow ill get back too it. Maybe if i use the ME region disable strap it will boot."}
{"post_id":18239,"thread_id":18160,"title":"820-00164-A (issues with BIOS chip)","user_id":468,"username":"ALB-Repairs","post_date":"2017-04-12 08:18:44","message":"disabled the ME region by removing r1920.\n\nSame symtoms, only boots to the apple logo.\nUnless of course i do a pram reset before the initial boot.\n\nDo these 2015 model airs even have an accesible ASD?\n\nThe machines passes inbuilt diagnosis with flying colours!\n\nEDIT: removing r1920 doesnt disable the ME strap."}
{"post_id":18245,"thread_id":18160,"title":"820-00164-A (issues with BIOS chip)","user_id":515,"username":"SMMRepair","post_date":"2017-04-12 10:24:19","message":"2015 models are a nightmare when you start messing with the BIOS and ME regions. I hope you saved the original file?"}
