{"post_id":99766,"thread_id":63952,"title":"820-02020 Stuck at 5V 0.46A draw","user_id":1547,"username":"CRC2018","post_date":"2023-06-07 10:20:39","message":"So a little bit of backstory on this one I received an A2338 820-02020 in for repair again. \n\nThis is a device we previously repaired around 9 months ago for no power - in that instance we replaced one of the CD3217's (UF400) as it was burned out which fixed the problem.\n\nSame device has come back in for repair again - we have opened it up and found that UF400 has exploded completely - also there is evidence that the client has taken the device elsewhere as I couldn't find the missing pieces of UF400, heatsink was bent and multiple screws were missing all over the place. \n\nAnyhow back to the diagnosis and repair: \nReplaced UF400 with a CD3217 from a donor board - board still stuck on 5V\nReplaced UF400 with a brand new CD3217 - board still stuck on 5V\n\nProceeded to check voltages: \nPPBUS_AON - 12V - seems too low to me but it's there\nPP3V8_AON - 3.8V\nPP3V3_S2 - 3.2v\nPP5v_S2 - 5v\nPP3v3_S2_UPC - 3.3v\nPP1v25_S2 - 1.25v\nPP3v3_UPC0_LDO - 3.3v \nPP3v3_UPC1_LDO - 3.3v\nPP1v5_UPC0_LDO_CORE - 1.5v \nPP1v5_UPC1_LDO_CORE - 1.5v\nThese voltages were all tested with the board out of the case with just the charger connected to the topmost type c port (Closest to display)\n\nPlugged the macbook into another and opened apple configurator - it isn't coming up at all so doesn't seem to be in DFU mode. \n\nIn terms of behaviour on the USB C Ammeter:\nWith Board out of case on its own:\nType C Port nearest display - 5V 0.26a then drops to 5V 0.05a\nOther port - ammeter loops\n\nWith board installed in case and all parts connected:\nBoth Type C Ports - 5V 0.46A stable no looping."}
{"post_id":99770,"thread_id":63952,"title":"820-02020 Stuck at 5V 0.46A draw","user_id":682,"username":"2informaticos","post_date":"2023-06-07 11:40:17","message":"If UF400 melt, very likely overvoltage from 20V to M1 occured.\nM1 is connected directly to CD3217 chips..."}
