{"post_id":26789,"thread_id":26789,"title":"820-2530 no Boot","user_id":149,"username":"Fizzl92","post_date":"2017-10-14 10:24:09","message":"This 820-2530 had an short in the PP3V42 circuit and no green light. No waterdamage\/visible damage. I fixed that and had to replace the SMC. Now it has a green \/orange light again, battery indicator works, it turns on, has backlight and even chimes, but thats it. I cant enter boot menu (tried external keyboard too) and it also won´t boot from a known good installation drive. Now i am stuck. \nThanks for any help."}
{"post_id":26791,"thread_id":26789,"title":"820-2530 no Boot","user_id":2,"username":"dukefawks","post_date":"2017-10-14 11:39:40","message":"Correct SMC from donor? Any indication how the SMC died, it does not \"just\" happen."}
{"post_id":26795,"thread_id":26789,"title":"820-2530 no Boot","user_id":149,"username":"Fizzl92","post_date":"2017-10-14 12:37:18","message":"I guess it died from a surge on PP3V42. R6905 had a hole in it and C6990 was split in half. I replaced U6990 too to be sure... How can i know if the SMC is correct? i thought there are only the \"980\" and the \"F211\" SMCs...  Or has it to be from a board with the exact same 820-XXXX number?"}
{"post_id":26797,"thread_id":26789,"title":"820-2530 no Boot","user_id":2,"username":"dukefawks","post_date":"2017-10-14 13:24:23","message":"SMC has to be from the EXACT same board, so there is your issue I bet."}
{"post_id":26820,"thread_id":26789,"title":"820-2530 no Boot","user_id":149,"username":"Fizzl92","post_date":"2017-10-15 10:59:45","message":"Ok, thank you. I did not know this... Im not sure but this can be the first time i had not the same donor to take the smc from. I try to take all parts from the exact same board if possible. I ordered two 820-2530 and let you know if the problem is still not solved..."}
{"post_id":27125,"thread_id":26789,"title":"820-2530 no Boot","user_id":149,"username":"Fizzl92","post_date":"2017-10-22 11:53:22","message":"Yes. That was the issue... right SMC, SMC reset and new D6905 (won´t run from battery) ant this one is fixed finally. i think that was the sixth SMC i put on this board... The first times i thought it was bad soldering... Incredible how lucky i was until now. I replaced quiet a lot SMCs and they worked - without me knowing this..."}
{"post_id":27126,"thread_id":26789,"title":"820-2530 no Boot","user_id":2,"username":"dukefawks","post_date":"2017-10-22 12:35:56","message":"Then there are probably a lot of boards with weird unexpected issues out there now. It will mess with thermal control, current\/voltage sensing and even OSX detecting which kind of drivers to load."}
{"post_id":27132,"thread_id":26789,"title":"820-2530 no Boot","user_id":149,"username":"Fizzl92","post_date":"2017-10-22 16:37:24","message":"Ok... Thank you or the lesson. 99% i replaced SMCs on 3115 and 2936. They have different SMCs fortunately. Some 3437 too, but I took the SMCs (as all parts) from the exact same donor if possible and ordered new donor boards early to avoid any problems. This board was one of my first ones - or even the first one - i soldered on a SMC from a different donor and instantly experienced some issues. I had not the exact same donor lying around and could not find them easy to buy.\nSo some boards could be working with wrong SMCs while having some problems? And is it ok to reball the F211 SMCs (0.45mm balls) with the 980 (0.38mm balls) stancils?"}
{"post_id":27138,"thread_id":26789,"title":"820-2530 no Boot","user_id":149,"username":"Fizzl92","post_date":"2017-10-22 16:51:15","message":"So if I got that right (I never bought them) all the SMCs on Ebay, Ali, etc can not be used on MacBooks, right? Any idea if they can be used on other machines or are they just useless like the iPhone 7 Homebutton replacements?"}
{"post_id":27143,"thread_id":26789,"title":"820-2530 no Boot","user_id":289,"username":"smiba","post_date":"2017-10-22 17:49:32","message":"Depends, just random SMCs can not be bought and are most likely even just the unprogrammed chip.\n\nIf you find a pre-balled SMC which specifically mentions the board number you can buy those though. But they're a rare find.\n\nJust get the right stencils, its a few bucks on ebay or ali"}
{"post_id":27170,"thread_id":26789,"title":"820-2530 no Boot","user_id":149,"username":"Fizzl92","post_date":"2017-10-23 10:35:53","message":"Ok, thank you. I stay with the reballing i think"}
