[
    {
        "post_id":77125,
        "thread_id":61373,
        "title":"820-3437 power on sequence 3 starts",
        "user_id":31181,
        "username":"Yalnif",
        "post_date":"2021-06-29 04:00:32",
        "message":"I am curious and cannot find this anywhere I have looked. Does anyone know exactly what the macbook is doing when it starts 3 times on an 820-3437.\n\nBy this I mean fan spin, shut down, fan spin, shut down fan spin and run.\n\nI am asking because I have two boards doing exactly the same thing: Turn on, fan spin for lonhger than usual, shut down, fan spins and then that is it. Sits like that with fan spinning and ALL rails present including Vcore, CPU gets hot (normal temp).\n\nIs this a Bios thing? PCH thing? Rubbish design thing?\n\nAND it would be nice if anyone else can answer as it seems to be a one man show at the moment with answers - to which I am more than grateful, but nobody else offering help on these boards?"
    },
    {
        "post_id":77130,
        "thread_id":61373,
        "title":"820-3437 power on sequence 3 starts",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-06-29 05:35:18",
        "message":"That is normal behaviour for 3435\/37 boards.\nHowever, I saw few of them botting directly; when charger is connected first time.\n\nOnce the board is turned off and power is not removed (charger, or battery still present), board must start directly; when pressing power button. \n\nIn your case, is PLT_RESET_L high?\nIf yes, check external video and USB activity."
    },
    {
        "post_id":77131,
        "thread_id":61373,
        "title":"820-3437 power on sequence 3 starts",
        "user_id":31181,
        "username":"Yalnif",
        "post_date":"2021-06-29 05:41:16",
        "message":"Thanks for your reply. Apperciated as always.\n\nI think you misunderstand sllightly.\n\nBoard on work bench, no battery with ONLY a dc in power supply:\n\n1. [B]Normal[\/B] board - fan spin 1, shut down, fan spin 2, shut down, fam spin 3, chime and run.\n\n2. [B]THIS [\/B]board: fan spin 1 for much longer than normal (20 seconds or so), shut down, 2nd fan spin and stay on with no USB\/Screen activity. No 2nd shut down and thus no 3rd start. All rails on not screen rail obviously as on bench.\n\nPLT_RESET_L  is 3.316v"
    },
    {
        "post_id":77135,
        "thread_id":61373,
        "title":"820-3437 power on sequence 3 starts",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-06-29 07:03:15",
        "message":"Then try known good BIOS as first step."
    },
    {
        "post_id":77136,
        "thread_id":61373,
        "title":"820-3437 power on sequence 3 starts",
        "user_id":31181,
        "username":"Yalnif",
        "post_date":"2021-06-29 07:18:05",
        "message":"Yes, Ia gree. But I already reporgrammed it (having saved original of coyurse), then replaced it with known good. Same result. I am thinking CPU. What do you think? I hope I am wrong, but I don't really follow the whole 3 starts process on these. If you know or if anyone knows EXACTLY what is supposed to hapepn each step and why it resets 3twice, I might try to figure something.\n\nThanks again for your input. You are a very nice and helpful member here."
    },
    {
        "post_id":77139,
        "thread_id":61373,
        "title":"820-3437 power on sequence 3 starts",
        "user_id":1057,
        "username":"piernov",
        "post_date":"2021-06-29 09:17:14",
        "message":"Spin-stop-spin and no POST behaviour can also happen on other boards like 00165 (which doesn't do spin-stop-spin-stop-spin normally).\nThere can be a lot of cause for this, and in fact there can be several different situation with missing CPU VCore or missing PLT_RESET_L, or both present.\nUsually it's a dead-end, but sometimes you are lucky and you find a random knocked-off resistor so first thing is a thorough visual inspection of the board.\nAmong other things it can be caused by:\n- BIOS issue\n- Something wrong in the power sequence (in case of no VCore or PLT_RESET_L)\n- Missing auxiliary power rail for PCH (the PLL rails for example, with series resistors or inductors right next to the CPU)\n- Communication issue on the LPC bus (broken resistor, bad SMC)\n- A random chip causing trouble on an SMBUS (backlight driver for example) or PCIe\n- Dead PCH\n- Dead CPU\n- Something else random somewhere, who knows"
    },
    {
        "post_id":77143,
        "thread_id":61373,
        "title":"820-3437 power on sequence 3 starts",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-06-29 09:50:19",
        "message":"Any history fault available, liquid sign?"
    },
    {
        "post_id":77147,
        "thread_id":61373,
        "title":"820-3437 power on sequence 3 starts",
        "user_id":31181,
        "username":"Yalnif",
        "post_date":"2021-06-29 11:04:44",
        "message":"This is one of the most knowledgable and helpful answers I have seen on any forum. Both of you are light years ahead of me in my understanding of these boards. I don't know how you understand so much of the way they work. But I am more than grateful for both of your amazing help and guidance. I will check and get back with the results.\n\nVERY grateful. Thank you both."
    },
    {
        "post_id":77148,
        "thread_id":61373,
        "title":"820-3437 power on sequence 3 starts",
        "user_id":31181,
        "username":"Yalnif",
        "post_date":"2021-06-29 11:06:19",
        "message":"[B][USER=682]2informaticos[\/USER][\/B]\n \nThe board has more red probe points than any board I have ever seen. Nothing corroded through, just read tarnish so I have to guess it was liquid damaged and\/or untra sonic cleaned before I got it."
    },
    {
        "post_id":77149,
        "thread_id":61373,
        "title":"820-3437 power on sequence 3 starts",
        "user_id":31181,
        "username":"Yalnif",
        "post_date":"2021-06-29 11:24:03",
        "message":"On a very quick look just now I can see what MAY be a tiny crack end to end in L1270.  So I will check that whole area VERY carefully tomorrow and replace where needed. It may be a rabbit hoile, but worth a look. The worst is I end up with another donor board."
    },
    {
        "post_id":77179,
        "thread_id":61373,
        "title":"820-3437 power on sequence 3 starts",
        "user_id":31181,
        "username":"Yalnif",
        "post_date":"2021-06-30 03:46:10",
        "message":"No, it was a false alarm. Just a fine scratch. Replaced it anyway just to be certain. Checked just about everything on this board now and I think time to make it a donor."
    }
]