[
    {
        "post_id":11609,
        "thread_id":11609,
        "title":"820-3115 Short on 3v42, Can't locate.",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2016-12-19 17:57:50",
        "message":"Working on an 820-3115 board that has a dead-short on the system side of pp3v42_g3h (pin 2 of L6995) that I'm having trouble locating, because it's tricking me. I removed all normal suspects, and the short remained. Nothing gets warm at all when I inject voltage, and I also have no green light, so I decided to pull the SMC (I originally re-balled it because it had liquid underneath). I removed the original\/re-balled SMC, and the short is gone. Cool. So I replace the SMC, and the short returns (with an entirely different SMC). Hmm. I guess it's possible this second SMC is bad (from a parts board), so I replace it a third time with another clean-pull SMC from a board that had a bad CPU. Same thing--short returns when SMC is in place. \n\nAt this point I'm confident (fairly) that the SMC itself is not the issue. I checked each pin of the SMC with the SMC removed, but none of them show a short. I'm out of ideas, and have no idea where to go from here. \n\nThanks."
    },
    {
        "post_id":11616,
        "thread_id":11609,
        "title":"820-3115 Short on 3v42, Can't locate.",
        "user_id":36,
        "username":"aprendiz",
        "post_date":"2016-12-19 19:49:44",
        "message":"Correctly placed???, correct orientation??"
    },
    {
        "post_id":11632,
        "thread_id":11609,
        "title":"820-3115 Short on 3v42, Can't locate.",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2016-12-20 06:09:40",
        "message":"Hey Aprendiz, yeah it's placed properly. I have no issues with replacing SMCs (have done it probably 100 times at this point, etc), and did it 3 times on this board. I'd imagine that even if by some chance it was misaligned, it certainly wasn't misaligned 3 times in a row. :)"
    },
    {
        "post_id":11653,
        "thread_id":11609,
        "title":"820-3115 Short on 3v42, Can't locate.",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2016-12-20 10:36:10",
        "message":"Hey Duke, any ideas on this one? I'm 100% positive the SMC is properly placed. Short goes away when SMC is removed, but is present (complete dead-to-ground short, .000) when SMC is in place. I've tried 3 SMCs, including one that I am 100% positive is good. I've never seen an issue like this."
    },
    {
        "post_id":11658,
        "thread_id":11609,
        "title":"820-3115 Short on 3v42, Can't locate.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-12-20 11:15:57",
        "message":"No real explanation for this besides maybe a bubble in the board causing the balls to bridge. Inspect the board for damage and popcorning. Also triple check orientation. Only thing you can remove for testing is L4901."
    },
    {
        "post_id":11669,
        "thread_id":11609,
        "title":"820-3115 Short on 3v42, Can't locate.",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2016-12-20 12:21:17",
        "message":"Thanks, duke. Yeah, I've oriented the SMC correctly (I check the layout of the balls themselves--align the direction of the empty \"arrow\" in the center of the balls, and just make sure my pin-1 dot is where pin-1 is on boardview, etc), and I'm positive the issue isn't with the replacement of the SMC itself.\n\nI removed L4901, and the short is present on pin 1 (3v42), but no short on pin 2. Not surprising. I do want to mention that the board received liquid on the reverse side directly \"behind\" where the SMC sits on the obverse side. Nothing looked terrible, but there were some slightly ugly caps. I touched them all up with clean solder, but now I'm thinking maybe one of those guys was shorted out maybe (but wouldn't that keep the short present even when the SMC is removed?). This is a goofy situation for sure. I'll pull the SMC and see what the actual surface of the board looks like. I know I've said it a dozen times already (sorry), but I really am confident with how I've replaced the SMC 3 times. :)\n\nThanks!"
    }
]