[
    {
        "post_id":31091,
        "thread_id":31091,
        "title":"820-2850 GPU issue?",
        "user_id":1190,
        "username":"Gmorb",
        "post_date":"2018-02-04 14:19:03",
        "message":"After reviving the board i get pinkish flickering on screen and wont boot to recovery or os. Once it gets to the final stage of boot it will shut off then display an unexpected shutdown error and repeat. When connected to external display it will only show a white screen towards the end of the boot cycle before shutdown but doesnt flicker."
    },
    {
        "post_id":31095,
        "thread_id":31091,
        "title":"820-2850 GPU issue?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-02-04 15:02:30",
        "message":"Reviving? What is the history?\nVisible GFX problems that crash the machine are bad news on a 2850. You could replace C9560 to see if it helps. Do not use hot air, it can affect other components and mask the real problem."
    },
    {
        "post_id":31098,
        "thread_id":31091,
        "title":"820-2850 GPU issue?",
        "user_id":1190,
        "username":"Gmorb",
        "post_date":"2018-02-04 19:59:18",
        "message":"Water damage and mistreatment it had a couple knocked off components some of which were for cpu vcore."
    },
    {
        "post_id":31100,
        "thread_id":31091,
        "title":"820-2850 GPU issue?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-02-04 21:30:53",
        "message":"Check for damaged components around the GPU\/VRAM then."
    },
    {
        "post_id":31104,
        "thread_id":31091,
        "title":"820-2850 GPU issue?",
        "user_id":1190,
        "username":"Gmorb",
        "post_date":"2018-02-04 22:38:26",
        "message":"there are no knocked off components in that area. replaced c9560 problem persists. cleaned up some components as well as reflow L8920,Q8959,Q8951 and it actually made it past the apple logo but hangs on a black screen with the rotating rainbow but flickering is no longer present after the startup logo the rotating rainbow shows no signs of artifacting. I was now able to enter recovery menu althoough i still get artifacting its a pinkish pixelated mess on certain parts of the gui but its letting me go through install process. would a gpu reflow help? maybe theres corrosion under the chip?\n\nok after installing the mac os i get no weird pink or artifacting on external display. Maybe its a video cable issue?"
    },
    {
        "post_id":31111,
        "thread_id":31091,
        "title":"820-2850 GPU issue?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-02-05 04:30:26",
        "message":"Now you used heat around the GPU so problem is masked by that. Could be a dead GPU or PCB problem that is now temporarily fixed by heat. \nThe artifacting on  the LCD is usually the MUX, push on it to see if artifacts change. Reflow U9600, make sure to remove the glue fully or you will be reballing it."
    },
    {
        "post_id":31124,
        "thread_id":31091,
        "title":"820-2850 GPU issue?",
        "user_id":1190,
        "username":"Gmorb",
        "post_date":"2018-02-05 10:35:08",
        "message":"Well i didnt use my hot air station i just added new solder to components using my soldering iron. Have not used heat on anything yet. Ill check the mux out.\n\nthere are no changes when touching the mux, continue with reflow of the mux?\n\nafter reflowing gmux the screen is a constant pinkish pixelated color, i still see an image but before it was only certain areas that were artifacted n pink. now its a constant pink color. bad gmux? seems like replacing it may help."
    }
]