[
    {
        "post_id":89471,
        "thread_id":62712,
        "title":"A1708 - SSD?",
        "user_id":35752,
        "username":"Anterweb",
        "post_date":"2022-05-21 07:24:47",
        "message":"So I had an a1708 you helped me work on a while back that was suffering from the flashing folder missing ssd problem, \n\nI now have 2 a1708 macs here that have been repaired and are working fine except for the SSD drives, I have 2 original apple SSD drives \n[ATTACH]60637[\/ATTACH]\nOne is a 2016 and the other is a 2017 ssd, and they are both behaving the same, as in if I have the charge cable connected to the macbook it will boot install os and work perfectly, if I remove the charger again they work perfectly until the battery goes below 30%. If I leave the mac on it will work until the battery runs out but if you try to restart the mac you get a flashing folder icon and the drive can't be seen at all until you charge the battery above 30%. As soon as the mac is above the 30% battery level or charger is reconnected it works perfectly, \n\nThis behaviour is the same with these ssd drives in 2 different macbooks so it's deffinatly the ssd at fault, question is have you seen anything like this before? Are these drives salvageable or do I bin them and find replacements? \n\nAlso thorght this info was useful to anyone trying to diagnose an a1708 whe flashing folder problem,"
    },
    {
        "post_id":89476,
        "thread_id":62712,
        "title":"A1708 - SSD?",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-05-21 11:14:26",
        "message":"This kind of SSD module has an internal SMPS (switched mode power supply), connected to PPBUS_G3H.\nWhen battery drops under 30%, PPBUS_G3H is also low and mentioned SMPS stops to work correctly.\nIt shouldn't happen, seems Apple didn't properly test their devices."
    },
    {
        "post_id":89477,
        "thread_id":62712,
        "title":"A1708 - SSD?",
        "user_id":35752,
        "username":"Anterweb",
        "post_date":"2022-05-21 11:26:04",
        "message":"Ah! Makes perfect sense.. \nThanks dude, I'll swap it out for an m2 adaptor and drive"
    },
    {
        "post_id":98420,
        "thread_id":62712,
        "title":"A1708 - SSD?",
        "user_id":32898,
        "username":"javier_herart",
        "post_date":"2023-04-15 13:16:15",
        "message":"Hello guys, \n\nI am having that exact same issue, what is the recommended solution? I saw that the 512gb version doesnt have this issue."
    }
]