{"post_id":100812,"thread_id":64092,"title":"820-5029-a 4GHz 27inch iMac with graphics issues","user_id":29109,"username":"Outofwhack","post_date":"2023-08-02 17:40:42","message":"This iMac exhibits strange effects when transitioning from login screen to the desktop.\nIts a bit like a horizontal Venetian blinds being opened to view the fresh desktop.\ni.e. it paints the new screen in horizontal bars from the bottom up.\n\n\nCustomer says it is also tediously slow.\n\nIs this fixable?"}
{"post_id":100816,"thread_id":64092,"title":"820-5029-a 4GHz 27inch iMac with graphics issues","user_id":682,"username":"2informaticos","post_date":"2023-08-03 03:06:37","message":"Looks like GPU issue, if problem appears exactly when the graphics driver is loaded.\nCheck what happens starting in safe mode."}
{"post_id":100826,"thread_id":64092,"title":"820-5029-a 4GHz 27inch iMac with graphics issues","user_id":29109,"username":"Outofwhack","post_date":"2023-08-03 07:53:17","message":"In safe mode:\n[LIST]\n[*]progress increases to 50% point then sits for a minute or two then finally shows the login screen\n[*]when I login I see a 30 seconds of beach ball, black background then says its rebooting because of a fault.\n[*]instead of rebooting shows a black screen with moveable cursor.\n[*]when I hold power switch down it shows a popup asking if am I sure I want to shutdown.\n[\/LIST]"}
{"post_id":100869,"thread_id":64092,"title":"820-5029-a 4GHz 27inch iMac with graphics issues","user_id":29109,"username":"Outofwhack","post_date":"2023-08-05 07:12:29","message":"Is this problem a result of manufacturing like the older iMac graphics daughter boards that could be fixed by baking to remake solder joints?\n\nIs there any way to make a repair. I have already had the experience of purchasing a board that exhibited the exact same problem and had to be sent back.\n\nCan the graphics chip be disabled to leave a workable system using onboard graphics?"}
{"post_id":100870,"thread_id":64092,"title":"820-5029-a 4GHz 27inch iMac with graphics issues","user_id":682,"username":"2informaticos","post_date":"2023-08-05 09:24:53","message":"Reballing is not definitive solution; but can help.\nAlmost all the time, the problem is inside the GPU die, not cracked solder balls (to board), as many peoples claim on Internet.\nDesolder, solder new balls (leaded) and resolder again the chip on the board, suppose various heat\/cold cycles, which can improve the bad contacts developed inside the GPU."}
{"post_id":100873,"thread_id":64092,"title":"820-5029-a 4GHz 27inch iMac with graphics issues","user_id":29109,"username":"Outofwhack","post_date":"2023-08-05 10:30:23","message":"Can the graphics chip be disabled to leave a workable system using onboard graphics?"}
