[
    {
        "post_id":64643,
        "thread_id":59960,
        "title":"820-00840 20V 0.03A",
        "user_id":14193,
        "username":"daniel_andrei1996",
        "post_date":"2020-09-04 08:27:04",
        "message":"got this laptop in from a customer. Small signs of liquid damage near usb ports, especially on C2975 and C2978. I don't usually work on the newer models so just wanted some advice before I dive in.\nI get 20V on both usb ports but 0.01-0.03A so not turning on\nI cleaned the corrosion with alcohol and toothbrush, but I'm measuring a short across C2975 and C2978, so basically between PP3V3_TBT_X_S0 and PP0V9_X_SVR_AGND. I think I can see a heartbeat if I use alcohol on C2975, but I'm afraid to remove it because of U2800 on the other side of the board. Is it safe to use hot air to remove it or should I wedge it off with my soldering iron.\nAlso, I'm worried the short might actually be on U2800, any advice for removing the shield so I can check?\n\nThanks a lot"
    },
    {
        "post_id":64654,
        "thread_id":59960,
        "title":"820-00840 20V 0.03A",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-09-04 13:39:59",
        "message":"Using JBC NASE station makes your life easy.\nYou can easy remove small components (0201, 0402), close to sensitive chips.\n\n[URL unfurl=\"true\"]https:\/\/www.google.com\/search?q=jbc+nase+station&client=firefox-b-d&hl=es&sxsrf=ALeKk00JGifoG2VcezLPxyXm0GLQik21Ng:1599251698868&source=lnms&tbm=isch&sa=X&ved=2ahUKEwjIlavrrNDrAhVhDmMBHWC3BY4Q_AUoAXoECAsQAw&biw=1680&bih=866[\/URL]\n\nIf you remove U2800, charger ports must still work.\nYou should test if macOS can recognize other USB devices; maybe only USB 2.0, like pendrive, mouse..."
    },
    {
        "post_id":64662,
        "thread_id":59960,
        "title":"820-00840 20V 0.03A",
        "user_id":14193,
        "username":"daniel_andrei1996",
        "post_date":"2020-09-04 15:43:27",
        "message":"JBC are very nice, but I can't afford right now. I managed to replace C2975 and C2978 with soldering iron and assistive hot air, now short is gone and machine powers on.\n\nOnly issue left seems to be slight stagelight effect at bottom of screen. Could this be cause by liquid damage or is it the backlight flex cable issue? Customer doesn't know if it was there before"
    },
    {
        "post_id":64663,
        "thread_id":59960,
        "title":"820-00840 20V 0.03A",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-09-04 16:03:02",
        "message":"Flex causes backlight flickering, or image\/backlight come and go when you move the lid.\nDisplay should be affected by liquid this time."
    },
    {
        "post_id":64664,
        "thread_id":59960,
        "title":"820-00840 20V 0.03A",
        "user_id":14193,
        "username":"daniel_andrei1996",
        "post_date":"2020-09-04 16:07:11",
        "message":"the effect is very faint, and consistent at all display angles. I've cleaned the small (i mean tiny) bits of corrosion on the display board and backlight connectors, but it made no change. Looks clean under the shields but I haven't removed them. Anything else I can do without changing screen or just tell the customer to live with it?"
    },
    {
        "post_id":64667,
        "thread_id":59960,
        "title":"820-00840 20V 0.03A",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-09-04 16:13:39",
        "message":"I can only think about liquid inside display assembly.\nLight diffusion has been affected,.."
    },
    {
        "post_id":64668,
        "thread_id":59960,
        "title":"820-00840 20V 0.03A",
        "user_id":14193,
        "username":"daniel_andrei1996",
        "post_date":"2020-09-04 16:23:18",
        "message":"ok, thank you. I will call this done and see what customer thinks, but I don't think it's that bad. Maybe they can get a new display from apple when the backlight flex fails haha"
    }
]