{"post_id":91151,"thread_id":62903,"title":"820-3642 Switching off on battery, while battery shows charging at 100%","user_id":25485,"username":"it-solve","post_date":"2022-07-18 01:05:56","message":"I got this Macbook not turning on with slight oxidation around C3898\/99 on the PP15V_TBT line.\nI cleaned and replaced the caps, and now I am getting 15V on the PP15V_TBT line.\n\nIt worked fine for a week, then shut down and would not turn on anymore. After reconnecting, the battery now turns on and works. \nNow the Macbook turns on and shows its charging at 100%, but the minute I pull the charger, it switches off. Apple diagnostic doesn't detect any battery faults. The customer did not have battery problems.\nVery hard to test the board with the battery attached to the board only.\n\nNo Shorts on the U7000 legs or around,\nQ7055 doesn't seem to open with 12.5V on Gate and Source. Drain on 2.1V with connected battery\n\nAny suggestion on what I can test without replacing the battery? Or how to test U7000 on the opposite side of the board without a battery?\n\n\nProbably not related, but the screen suddenly shows greenish background. At the same time, it was okay when I reconnected the battery."}
{"post_id":91154,"thread_id":62903,"title":"820-3642 Switching off on battery, while battery shows charging at 100%","user_id":682,"username":"2informaticos","post_date":"2022-07-18 03:01:01","message":"Really strange to get 100% battery sign, with just 2.1V on it.\nIn fact, looks like being bad, with such low voltage on it.\n\nClean J6950 pads.\nBe sure SH6950 screw makes good contact on the detection pads.\n\nMeasure voltage and diode mode to ground on SCL\/SDA lines.\nAlso check resistance between pins 17\/18 and 27\/28 of U7000."}
{"post_id":91252,"thread_id":62903,"title":"820-3642 Switching off on battery, while battery shows charging at 100%","user_id":25485,"username":"it-solve","post_date":"2022-07-19 18:48:20","message":"[QUOTE=\"2informaticos, post: 91154, member: 682\"]\nBe sure SH6950 screw makes good contact on the detection apds.\n[\/QUOTE]\n\nAh, this seems to be the problem. Thanks 2informaticos"}
