{"post_id":81469,"thread_id":61851,"title":"820-01521 5V on charger and cycle 0 to 50 mA","user_id":26621,"username":"grmacs","post_date":"2021-10-15 14:36:32","message":"Board on the bench. I found a short on PP3v3_G3H at C7809 and PMIC U7800. Replaced both. then discovered only one of the CD3215's had the 1.1V LDO when charger connected to it's corresponding port. Replaced U3100 and now get all of the LDO's with charger connected to corresponding port. I was thinking that would be it and board would boot but it has the same symptoms it started with of 5V incoming with cycling up to 50mA and back to zero amps. Nothing in DFU mode. PPBUS_G3H is 12.3V. No shorts on big coils. CPU coils have good diode readings so I don't believe I'm wasting my time..."}
{"post_id":81471,"thread_id":61851,"title":"820-01521 5V on charger and cycle 0 to 50 mA","user_id":682,"username":"2informaticos","post_date":"2021-10-15 15:37:35","message":"12.3V is incorrect PPBUS_G3H; T2 doesn't properly communicate with U7000.\nDo you get all AWAKE and SLPS2R voltages?"}
{"post_id":81484,"thread_id":61851,"title":"820-01521 5V on charger and cycle 0 to 50 mA","user_id":26621,"username":"grmacs","post_date":"2021-10-16 12:05:00","message":"I get pulses at the slps2r. Discovered full short on P0v9SLPDDR. zero ohms resistance to ground. Guessing this means I have a dead T2? damnit I've wasted a lot of time on this board."}
{"post_id":81487,"thread_id":61851,"title":"820-01521 5V on charger and cycle 0 to 50 mA","user_id":682,"username":"2informaticos","post_date":"2021-10-16 13:04:13","message":"That is not SLPS2R voltage.\nHowever, short there points to bad T2.\nJust in case, remove L7816\/17 and R7816; see if short is not on U7800 side."}
{"post_id":81488,"thread_id":61851,"title":"820-01521 5V on charger and cycle 0 to 50 mA","user_id":26621,"username":"grmacs","post_date":"2021-10-16 14:35:40","message":"Thanks for help with that. NOt sure if I'd have figured out how to isolate that one. it actually is on the PMIC so looks like one I placed from other board had an issue as it at least doesn't appear that it was due to shorted balls and internal to chip (chcking it pin 10 is 0 ohms to pin 9) oye! this board is killing me. I'm going to diode test around my donor PMIC before pulling it this time haha"}
{"post_id":81489,"thread_id":61851,"title":"820-01521 5V on charger and cycle 0 to 50 mA","user_id":26621,"username":"grmacs","post_date":"2021-10-16 15:15:40","message":"Well making some progress anyway. Now it goes to 19.9V and up to eventually climbs to 1.8A and 36W but no chime no data activity. USB drive has solid light for a while and shuts off. Trackpad activity present. Still not registering DFU but seems like trackpad activity never goes away even after holding down the power button for a while. As soon as I release the power button it tries to start up again I believe. PPBUS_G3H is 12.7V no fan spin. Seems like it bounces to 13.1V briefly I believe that was with battery plugged in but typically with battery plugged in, the PPBUS_G3H is under 12V"}
{"post_id":81496,"thread_id":61851,"title":"820-01521 5V on charger and cycle 0 to 50 mA","user_id":682,"username":"2informaticos","post_date":"2021-10-16 19:23:54","message":"Do you get steady AWAKE and SLPS2R voltages now?"}
{"post_id":81525,"thread_id":61851,"title":"820-01521 5V on charger and cycle 0 to 50 mA","user_id":26621,"username":"grmacs","post_date":"2021-10-18 11:59:43","message":"yes. I have steady AWAKE and SLPS2R's related to 1V1, 1V8 and 3v3, PPVDDCPU"}
{"post_id":81526,"thread_id":61851,"title":"820-01521 5V on charger and cycle 0 to 50 mA","user_id":682,"username":"2informaticos","post_date":"2021-10-18 12:45:43","message":"This machine starts automatically if you press a key or make click on trackpad.\n\nIf all AWAKE and SLPS2R voltages are present, machine should be seen in DFU."}
{"post_id":81623,"thread_id":61851,"title":"820-01521 5V on charger and cycle 0 to 50 mA","user_id":26621,"username":"grmacs","post_date":"2021-10-20 11:56:11","message":"I guess Thunderbolt2 to thunderbolt3 doesn't work (both Apple brand) was trying with my 2015 A1398. No issues seeing its in DFU mode from a1708. NO luck though. Tried Revive first, checked with customer and got the green light on restoring it but I get a: System cannot be restrored on this device: amrestoreerrordomain error 6 failed to handle messag type statusmsg. I tried multiple times with host OS and configurator updated from both Big Sur and Catalina. I tried from Mojave but I didn't already have configurator on that load and apparently Apple requires 10.15 or greater to download. I have to assume host OS isn't that relevant considering if the target has Mojave but yet Configurator2 is no longer available for new download to Mojave to attempt as host for DFU restore."}
{"post_id":81624,"thread_id":61851,"title":"820-01521 5V on charger and cycle 0 to 50 mA","user_id":682,"username":"2informaticos","post_date":"2021-10-20 14:46:29","message":"Check if SSD voltages are present too."}
{"post_id":81629,"thread_id":61851,"title":"820-01521 5V on charger and cycle 0 to 50 mA","user_id":26621,"username":"grmacs","post_date":"2021-10-20 15:11:14","message":"Yes. PP0v9_SSD, PP2V7_NAND and PP1v8_SSD all present"}
{"post_id":81633,"thread_id":61851,"title":"820-01521 5V on charger and cycle 0 to 50 mA","user_id":682,"username":"2informaticos","post_date":"2021-10-20 15:34:42","message":"Remove audio board and inspect for liquid sign, on both sides; also audio flex\/connectors."}
{"post_id":81636,"thread_id":61851,"title":"820-01521 5V on charger and cycle 0 to 50 mA","user_id":26621,"username":"grmacs","post_date":"2021-10-20 16:33:40","message":"Good thoughts. I looked those over and not seeing anything out of the ordinary."}
{"post_id":81640,"thread_id":61851,"title":"820-01521 5V on charger and cycle 0 to 50 mA","user_id":682,"username":"2informaticos","post_date":"2021-10-20 18:19:38","message":"Check diode mode to ground on all T2 lines going to J6100.\nPay atention to pins 32 & 33."}
{"post_id":81726,"thread_id":61851,"title":"820-01521 5V on charger and cycle 0 to 50 mA","user_id":26621,"username":"grmacs","post_date":"2021-10-22 15:27:22","message":"Compared to another board. Not seeing anything unusual from diode check of J6100"}
{"post_id":81727,"thread_id":61851,"title":"820-01521 5V on charger and cycle 0 to 50 mA","user_id":682,"username":"2informaticos","post_date":"2021-10-22 16:28:06","message":"Should be T2 internal problem, if above mentioned voltages are all present."}
