[
    {
        "post_id":13885,
        "thread_id":13885,
        "title":"[SOLVED]Early 2013 13\" MacBook Pro Fans running full speed. 820-3462",
        "user_id":61,
        "username":"wrbailey",
        "post_date":"2017-01-30 05:37:42",
        "message":"Machine turns on and chimes and will boot to desktop. Charges, etc... just fine.\n\nThis machine has the fans running full speed.\n\nI've run ASD and I get these sensor errors:\n\nTA0P -- Ambient Air Sensor (ERROR - SMC IO FAILED)\nTA1P -- DC-IN Proximity for Airflow (ERROR - SMC IO FAILED)\nTC0P -- CPU Proximity (ERROR - SMC IO FAILED)\nTM0P -- DDR3 Proximity (ERROR - SMC IO FAILED)\nTW0P -- AirPort Proximity (ERROR - SMC IO FAILED)\n\nI have not been able to locate liquid damage (and I am the only one to take machine apart.)\n\nEverything seems to run the way it should. It does not have an error on Ts0P for the trackpad, that test actually passes.\n\nIs there a certain area of the board I should be focusing my efforts on?\n\nThank You!"
    },
    {
        "post_id":13902,
        "thread_id":13885,
        "title":"[SOLVED]Early 2013 13\" MacBook Pro Fans running full speed. 820-3462",
        "user_id":36,
        "username":"aprendiz",
        "post_date":"2017-01-30 11:42:12",
        "message":"Check U5570, 3.3V on pin 1, also check I2C_CPUTHMSNS_SDA and I2C_CPUTHMSNS_SCL and report values....."
    },
    {
        "post_id":13905,
        "thread_id":13885,
        "title":"[SOLVED]Early 2013 13\" MacBook Pro Fans running full speed. 820-3462",
        "user_id":61,
        "username":"wrbailey",
        "post_date":"2017-01-30 11:55:17",
        "message":"Thank you for the reply. I will check these values once I am home in a few hours. The machine is in beautiful shape, would love to resurrect."
    },
    {
        "post_id":14297,
        "thread_id":13885,
        "title":"[SOLVED]Early 2013 13\" MacBook Pro Fans running full speed. 820-3462",
        "user_id":61,
        "username":"wrbailey",
        "post_date":"2017-02-04 20:48:07",
        "message":"U5570 was just fine. Found some corrosion around Q7850 and the backlit keyboard connector. Cleaned up the areas and BAM, no more loud fan and passes ASD now. Not sure why it would cause the sensor issues?? Any idea? But this can be marked fixed (not so much solved, but fixed)\n\nThanks!"
    }
]