{"post_id":43333,"thread_id":43333,"title":"820-3476-A No Trackpad","user_id":288,"username":"DannyRinc","post_date":"2018-12-13 17:26:14","message":"Hey all, same nightmare issue a lot of people have had. Troubleshooting I've already done:\n\n- Using known good trackpad\n- Using known good cable\n- Tested continuity from end of Trackpad Cable to U4801\n- R4801 reads .01 ohms\n- Pin 1 - 3.3v\n- Pin 4 - 5v\n- Replaced U4801 after all diode readings and everything else was checked first.\n\nDiode Mode:\n1: 0.3\n2: 0.62v\n3: 0.5v\n4: 0.46v\n5: 0.49v\n6: 0.0v\n7: 0.629v\n8: 0.5v\n9: 0.63v\n10: 0.56v\n11: 0.5v\n12: 0.0v\n13: 0.6v\n14: 0.63v\n15: 0.64v\n16: 0.63v\n17: 0.6v\n18: 0.638v\n\nI'm ruling out U8000 because there wouldn't be any 3v3_s4 if it was bad right? The values stack up against what everyone else has had on diode mode as well. Is there anything I'm desperately missing? Another bad U4801? Keyboard works just fine.\n\nAny help is appreciated."}
{"post_id":43335,"thread_id":43333,"title":"820-3476-A No Trackpad","user_id":288,"username":"DannyRinc","post_date":"2018-12-13 18:00:56","message":"Would there be any voltage on the MISO\/MOSI lines? Or are they just data lines? I AM getting 0v on some of the data lines (not the z2 lines) so that may be a clue? I replaced Q4801 thinking that maybe it was shorting and disabling the trackpad. The click function KINDA works, i have to push it maybe 6-7 times and it will respond."}
{"post_id":43343,"thread_id":43333,"title":"820-3476-A No Trackpad","user_id":682,"username":"2informaticos","post_date":"2018-12-14 03:36:47","message":"Could be J4800 issue.\nCheck continuity directly between U4801 and trackpad board.\nAlso check voltage for Q4801."}
{"post_id":43358,"thread_id":43333,"title":"820-3476-A No Trackpad","user_id":288,"username":"DannyRinc","post_date":"2018-12-14 10:43:40","message":"Sooooo.... turns out that my technicians are idiots. They damaged the new and old trackpad somehow, tested a new one that I overnighted and sure enough it works. Additionally the customer was complaining about GHOSTING, not it not working at all. Replacing U4801 fixed that issue. They previously tested the \"known good trackapd\" and it was ghosting as well, before they damaged them both. Please mark this as resolved."}
