{"post_id":36633,"thread_id":36633,"title":"[SOLVED]820-3332A no chime, no ssd","user_id":1655,"username":"tuner2000i","post_date":"2018-07-04 16:30:29","message":"hello. i just got a 820-3332A board that as far as i can tell did not suffer any water damage and did not have any repair attempts (i did not inspect it very carefully)\nfriday\/saturday i will get to my shop and have a look on it.\nuntil then, i can say that it does not see the SSD at all and has no chime so i assume audio is not working either. i get the question mark folder flashing on the screen.\nany suggestions where to start with this one? thanks"}
{"post_id":36635,"thread_id":36633,"title":"[SOLVED]820-3332A no chime, no ssd","user_id":145,"username":"Sykulski","post_date":"2018-07-04 16:47:42","message":"Start by resetting NVRAM\/PRAM to see if you get the chime and check if it is just a missing\/corrupted OS"}
{"post_id":36647,"thread_id":36633,"title":"[SOLVED]820-3332A no chime, no ssd","user_id":1655,"username":"tuner2000i","post_date":"2018-07-04 17:45:49","message":"ok i will do that. as for the missing\/corrupted os its not the case just that it was installed and running on a different board same model. if i hold the options key nothing showed up. i did not make more testing on it (did not try with usb boot either), will do that in the weekend, but it was sold to me as faulty anyway."}
{"post_id":36648,"thread_id":36633,"title":"[SOLVED]820-3332A no chime, no ssd","user_id":515,"username":"SMMRepair","post_date":"2018-07-04 18:09:15","message":"Could still be APFS issue...which causes it to not show as bootable when holding shift. I'd not assume it can't see SSD yet."}
{"post_id":36650,"thread_id":36633,"title":"[SOLVED]820-3332A no chime, no ssd","user_id":1655,"username":"tuner2000i","post_date":"2018-07-04 20:45:33","message":"Ok so i put the board back in. Indeed a nvram reset brought the chime back. And i think you were right about the APFS issue since it does not see the high sierra usb install disk either\nedit. Internet recovery seems to detect both ssd and usb. I will install high sierra fresh and report back"}
{"post_id":36658,"thread_id":36633,"title":"[SOLVED]820-3332A no chime, no ssd","user_id":1655,"username":"tuner2000i","post_date":"2018-07-04 23:12:18","message":"I managed to install osx lion from internet recovery and then fully downloaded high sierra. As soon as it restarted to start the install i get no image and no backlight after the progress bar gets to 25%. Few times i got the message that the computer restarted because of a problem. It will not even boot unless i let it cool down a little first. Once it boots to os, it shows some gpu panic error\nis this a U8900 issue?"}
{"post_id":36660,"thread_id":36633,"title":"[SOLVED]820-3332A no chime, no ssd","user_id":2,"username":"dukefawks","post_date":"2018-07-04 23:13:50","message":"Yeah, reflow U8900 and this one will be good."}
{"post_id":36669,"thread_id":36633,"title":"[SOLVED]820-3332A no chime, no ssd","user_id":1655,"username":"tuner2000i","post_date":"2018-07-05 11:17:46","message":"i will only get to my shop this weekend. meanwhile i managed to install high sierra after few tries from USB. once it boots up and runs on intel gpu i can use the laptop normally, everything else seems to work. if i reboot it while the motherboard is warm, the screen will go out. if i let it cool down it boots normally, so definately its some crap solder i guess at U8900. i will report after i remake the solders so others can find this post useful as well."}
{"post_id":36727,"thread_id":36633,"title":"[SOLVED]820-3332A no chime, no ssd","user_id":1655,"username":"tuner2000i","post_date":"2018-07-06 15:44:35","message":"i took U8900 down, cleaned all that shit unleaded solder from the board and the IC. put new laeded solder and seems to be working great now. i let it run in Unigine 2 benchmarks and then restarted the system and its all good. one thing that concerns me is that in unigine the GPU temp is about 92 degrees C. is this normal? the cooling system is very bad :("}
{"post_id":36735,"thread_id":36633,"title":"[SOLVED]820-3332A no chime, no ssd","user_id":2,"username":"dukefawks","post_date":"2018-07-06 17:25:47","message":"92C is fine on these. This one is fixed."}
