{"post_id":89548,"thread_id":62722,"title":"820-01521 Weird Video Loss Problem","user_id":4543,"username":"brunomotter","post_date":"2022-05-25 16:50:23","message":"Hello. Got this one here with a strange problem. Internal video is lost a few seconds after the system loads. Just internal video is gone, backlight keeps on. On external monitor it works ok. If I start in safe mode everything works, except of course graphics drivers are not loaded, but internal screen works fine. Also, on system installer and on EFI, environments where only basic drivers are loaded, display works fine. Tried already reinstalling fresh new OS, same symptom. I don't have another screen to test for this model, but I don't believe its it. No corrosion anywhere, just a little but of dust but apart from that, everything loos perfect. Any ideas?"}
{"post_id":89549,"thread_id":62722,"title":"820-01521 Weird Video Loss Problem","user_id":682,"username":"2informaticos","post_date":"2022-05-25 18:56:49","message":"Internal LCD goes white, or black?\nBoth 3V3\/5V_S0SW_LCD are stable?\n\nYou should test with known good screen..."}
{"post_id":89550,"thread_id":62722,"title":"820-01521 Weird Video Loss Problem","user_id":4543,"username":"brunomotter","post_date":"2022-05-25 20:02:10","message":"It goes black with just backlight on, no image. I’ll test that signal tomorrow. I don’t believe it’s a screen problem because the problem only occurs after system completely boots and if video drivers are loaded."}
{"post_id":89556,"thread_id":62722,"title":"820-01521 Weird Video Loss Problem","user_id":682,"username":"2informaticos","post_date":"2022-05-26 03:05:46","message":"GPU is embedded into CPU and iGPU core works good, if you get correct external video.\nThe problem appears only with internal eDP output, shouldn't be driver issue."}
{"post_id":89564,"thread_id":62722,"title":"820-01521 Weird Video Loss Problem","user_id":4543,"username":"brunomotter","post_date":"2022-05-26 08:53:44","message":"Yes, I agree it's not a driver issue because I formatted and installed new fresh OS and problem persists. But, what I meant is that it's only after all drivers load that the problem starts, telling me it's an issue when it requires more from the graphics side... I'll try to get a test display, but this model rarely appears here."}
