{"post_id":75949,"thread_id":61251,"title":"A1990 no backlight no image 55V on backlight","user_id":28712,"username":"adrko","post_date":"2021-05-28 16:49:25","message":"Hey guys\n\nSorry but I have to ask for help, I’m stuck. \n\nA1990 01041 liquid damage\n55V on backlight - PPVOUT_S0_LCDBKLT\n\nI have image and backlight on a screen from A2141. \n\nTwo known working A1990 screens give no backlight and no image with 55V on backlight \n\nTouchbar works, keyboard backlight works, I can regulate lcd and kb backlight using external screen. \n\nReplaced blown mux chip. \nReplaced connector on the screen side tcon board, reconstructed exploded PP5V_S0_ALSCAM_F - L8504, C8504, C8552. \n\nNo visible damage anywhere else, logic board aide connector looks fine. \n\nFrom what I under this might have something to do with led load circuits or backlight sense or even backlight controller U8400. \n\nI’m having trouble understanding how the backlight sense circuit works and how to diagnose it."}
{"post_id":75950,"thread_id":61251,"title":"A1990 no backlight no image 55V on backlight","user_id":28712,"username":"adrko","post_date":"2021-05-28 19:15:15","message":"Solved:\nI used and original cable from A1706, will order proper lvds cables.\n3$ cables from China aren’t very reliable after all, who could have known {facepalm}"}
{"post_id":75953,"thread_id":61251,"title":"A1990 no backlight no image 55V on backlight","user_id":682,"username":"2informaticos","post_date":"2021-05-29 05:31:58","message":"Keep in mind, when you get higher voltage than normal on backlight output, the electronic circuitry is good.\nThere can only be open connection to LEDs strip; like bad LCD connector, flex, or screen itself."}
{"post_id":75985,"thread_id":61251,"title":"A1990 no backlight no image 55V on backlight","user_id":28712,"username":"adrko","post_date":"2021-05-29 17:02:59","message":"Aight, thanks. It was unexpected for me that those trouble could be caused by wrong cable. But of course the pin outs vary from one model to another, what can be data pin on one can be ground or unconnected on another"}
