{"post_id":53546,"thread_id":53546,"title":"820-00165 power pulsing","user_id":14193,"username":"daniel_andrei1996","post_date":"2019-10-16 17:56:40","message":"Hi! Have done quite a few A1466 so far but this one is being a pain\n\nGot an 820-00165 off ebay, board looks good, no repair attempts, minor corrosion around SMC and U1900, which I cleaned up\nDidn't have S4\/S5_SLP_L due to missing S5_PWRGD\/DSW_PWRGD, reballed SMC, now I have PWRGD signals\n\nWhen I connect charger or press the power button, I can see the current draw on my PSU going to around 0.5A and then back to 0.02A (sometimes does this a few times)\nThe fan does not spin when it does this, unless I try booting in SMC bypass, then the fan spins with the pulses but still no boot.\nI can see S4\/S5_SLP_L pulsing to 3.3V when pressing the power button.\n\nAny suggestions?"}
{"post_id":53548,"thread_id":53546,"title":"820-00165 power pulsing","user_id":682,"username":"2informaticos","post_date":"2019-10-16 18:26:29","message":"Welcome to the forum.\n\nIf PM_SLP_S4_L pulses, all S3 voltage should pulse too, check that.\nAlso check for pulse at PM_SLP_S3_L and controlled S0 voltages.\n\nAny pulse at ALL_SYS_PWRGD?\n\nCheck solders and traces around U6100.\nAlo check all SPI Bus Series Termination resistors (more than 20 there).\nClean, or remove J6100.\nTest known good BIOS file."}
{"post_id":53558,"thread_id":53546,"title":"820-00165 power pulsing","user_id":14193,"username":"daniel_andrei1996","post_date":"2019-10-17 04:59:38","message":"Hi! Thanks a lot for the quick reply!\n\nI've got all S3 and S0 rails pulsing to their normal voltage with power button press, for like a second. Even PPVCC_S0_CPU.\nAlso have pulses on PM_SLP_S3_L and ALL_SYS_PWRGD\n\nRemoved J6100 and cleaned the area, just in case\nU6100 looks clean, and all resistors around it measure fine.\nPulled U6100 and read with programmer, image seems fine (opens with UEFITool) with no errors\/warnings\nWhere can I get a new bios file, just in case?\n\nWill measure SPI termination resistors, there's like 22 I can see on page 46 of the schematic (SPI Bus Series Termination)"}
{"post_id":53559,"thread_id":53546,"title":"820-00165 power pulsing","user_id":682,"username":"2informaticos","post_date":"2019-10-17 05:07:30","message":"Several 00165 BIOSes should be already posted on the forum, just search..."}
{"post_id":53560,"thread_id":53546,"title":"820-00165 power pulsing","user_id":14193,"username":"daniel_andrei1996","post_date":"2019-10-17 05:26:47","message":"[QUOTE=\"2informaticos, post: 53559\"]Several 00165 BIOSes should be already posted on the forum, just search...[\/QUOTE]\n\nYes, I saw that you posted a link in a previous post to a clean file from duke's library but someone then said it wasn't working so wanted to ask before I try it.\n\nWill flash that to the chip and try"}
{"post_id":53561,"thread_id":53546,"title":"820-00165 power pulsing","user_id":682,"username":"2informaticos","post_date":"2019-10-17 05:40:52","message":"You'll find more files, not just that..."}
{"post_id":53562,"thread_id":53546,"title":"820-00165 power pulsing","user_id":14193,"username":"daniel_andrei1996","post_date":"2019-10-17 06:28:26","message":"Sorry, didn't mean to be a pls bro.\n\nFound a few files but had no luck(got fan spin but no brain). Then I tried a new bios chip from a donor board without reflashing and I got boot.\nSo I guess the original bios chip was bad (even though it would read\/write\/verify in the programmer)\n\nShould I just flash the new chip with a clean ME bios from the forum and then change serial number, or do I need to do anything else?"}
{"post_id":53563,"thread_id":53546,"title":"820-00165 power pulsing","user_id":682,"username":"2informaticos","post_date":"2019-10-17 07:16:33","message":"If you change SN, need to fix checksum.\nAnd ME region MUST be clean, if you use dump from other board.\nUpload that working BIOS somewhere and I try to fix it later..."}
{"post_id":53564,"thread_id":53546,"title":"820-00165 power pulsing","user_id":14193,"username":"daniel_andrei1996","post_date":"2019-10-17 07:23:21","message":"[QUOTE=\"2informaticos, post: 53563\"]If you change SN, need to fix checksum.\nAnd ME region MUST be clean, if you use dump from other board.\nUpload that working BIOS somewhere and I try to fix it later...[\/QUOTE]\n\nThanks a lot for all your help. I have uploaded the original bios and a dump from the donor chip which makes the machine boot:\n[url]https:\/\/drive.google.com\/open?id=1R_KOfR_cYmQ2YlMHRj-beIGq8Bi4aXcz[\/url]\n\nI'm trying to learn how to do it myself from the forum here but might take a while."}
{"post_id":53565,"thread_id":53546,"title":"820-00165 power pulsing","user_id":682,"username":"2informaticos","post_date":"2019-10-17 07:36:53","message":"Do NOT quote an entire post, visible few centimeters above.\nPlease, maintain forum aesthetic.\nI will post back when dump is ready..."}
{"post_id":53567,"thread_id":53546,"title":"820-00165 power pulsing","user_id":1153,"username":"JohnB8812","post_date":"2019-10-17 08:01:31","message":"Inspect all traces\/probe points near U6100 would not be surprised at all if one is busted left of the BIOS chip."}
{"post_id":53568,"thread_id":53546,"title":"820-00165 power pulsing","user_id":14193,"username":"daniel_andrei1996","post_date":"2019-10-17 08:04:31","message":"Hi, thanks for the suggestion but U6100 area looks good.\nMachine now boots with donor BIOS chip, just need fixed ME region\/SN and should be good to go"}
{"post_id":53570,"thread_id":53546,"title":"820-00165 power pulsing","user_id":682,"username":"2informaticos","post_date":"2019-10-17 08:45:06","message":"Try it and report back\n[url]https:\/\/drive.google.com\/open?id=1TB7LC9vsR0Z_lbaHgk0zK3DmuauifdhE[\/url]\nSN changed, clean ME.\n?Bafta!"}
{"post_id":53571,"thread_id":53546,"title":"820-00165 power pulsing","user_id":14193,"username":"daniel_andrei1996","post_date":"2019-10-17 08:49:00","message":"Thank you so much.\nI requested access to the file.\n\nI tried my hand at copying the FSYS block from my original bios to the donor file but I'd rather just use your file since I'm having to solder the bios chip for every flash.\n\nOut of curiosity, do you usually fix these manually or just use the medusa programmer?"}
{"post_id":53578,"thread_id":53546,"title":"820-00165 power pulsing","user_id":682,"username":"2informaticos","post_date":"2019-10-17 11:49:15","message":"If you swap entire Fsys region, no need to fix checksum.\nYou must do it only when change SN in Fsys.\n\nUntill now nobody asked me for access to Google Drive.\nStill can't get the file?"}
{"post_id":53579,"thread_id":53546,"title":"820-00165 power pulsing","user_id":14193,"username":"daniel_andrei1996","post_date":"2019-10-17 12:21:55","message":"I got the file now that you approved permissions, not sure why gdrive decided to be weird\nBIOS chip is back on the board and booting. Cleared internet diagnostics and shows serial number same as on the casing.\nCurrently installing OS, but it's all looking great.\n\nSo would best practice always be to just replace the entire FSYS block, when you have the original bios file?\nI noticed that you changed some other parts of the donor file, I'm assuming that's to do with cleaning the ME region?\n\nI saw a few posts about the medusa and it seems like an awesome tool, but it's pretty expensive at 300-400 eur and I have other gear I want to buy first (ie ultrasonic).\n\nI'll try to read up some more on bios modifying so I can do it myself, but I really appreciate your help with everything, you're a star!"}
{"post_id":53582,"thread_id":53546,"title":"820-00165 power pulsing","user_id":682,"username":"2informaticos","post_date":"2019-10-17 12:47:51","message":"Medusa programmer is more important than ultrasonic cleaner, if you deal with Apple stuff..."}
{"post_id":53583,"thread_id":53546,"title":"820-00165 power pulsing","user_id":14193,"username":"daniel_andrei1996","post_date":"2019-10-17 13:35:59","message":"Alright, good to know.\n\nI always hear Louis talk about how great his ultrasonic is but haven't seen him use the medusa or other bios programmers I guess.\nIt's a bit of a relief tbh because it's pretty expensive to try and get a P500 ultrasonic here in the UK, much more expensive than the medusa. I'll stick to my alcohol and toothbrush for now.\n\nI'll probably order the medusa once I get my money from this job. OS install finished without issue, and everything seems to work fine, including camera, so can count this one fixed."}
{"post_id":53585,"thread_id":53546,"title":"820-00165 power pulsing","user_id":1547,"username":"CRC2018","post_date":"2019-10-17 14:23:49","message":"thought i'd just hop in here daniel - if your looking for somewhere to purchase a Crest from in the UK then take a look at sonikem - I got mine from them at a very reasonable price compared to everywhere else I checked!"}
{"post_id":53588,"thread_id":53546,"title":"820-00165 power pulsing","user_id":14193,"username":"daniel_andrei1996","post_date":"2019-10-17 15:59:24","message":"Hi, thank you very much for the suggestion. Funny, I actually sent them an email earlier asking for a quote. They seem to be the only UK distributor I could find for crest but they didn't have any prices on the website. How much did you pay for yours?"}
