[
    {
        "post_id":64465,
        "thread_id":59935,
        "title":"820-00928 No GPU",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-08-31 19:59:21",
        "message":"Hello. I have a 820-00928 board that seems to turn on, but no image or backlight on internal display, and no image on external either. I do not know the history on this macbook, but the logic board is completely spotless. Caps lock lights up and the touchbar turns on shortly after connecting a charger to it. When the charger is first connected, it takes around 1 amp without a battery connected, but that slowly drops to about 300ma after only like a minute of being connected. PPVCC_S0_CPU is 1.06v when first connected and then it drops to 0.65v. PPVCCSA_S0_CPU is 1.06v when first connected but also drops to about 0.9v. PPVCCGT_S0_CPU is always 0v and does not seem to be short. I get 5 ohms on PPVCCGT_S0_CPU and 7 on a good board. What should I check next?"
    },
    {
        "post_id":64471,
        "thread_id":59935,
        "title":"820-00928 No GPU",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-09-01 01:07:04",
        "message":"PPVCCGT_S0_CPU  only appears under high graphics load, when Intel Graphics is used.\nThe other CPU rails look to have good reaction, board is really booting.\n\nAs you are missing both internal\/external video, should have a problem with U9800, but U9850 could also be involved."
    },
    {
        "post_id":64479,
        "thread_id":59935,
        "title":"820-00928 No GPU",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-09-01 05:59:14",
        "message":"Yea I am missing both internal and external video. I have another one of these boards that I repaired and is now fully functional and I am using that one to compare values to. Looks like PPVCCGT_S0_CPU is 0v on the good board also, but I do get voltage on the GPU coils when I first connect the charger to the good board. LA640, LA650 and LA350 have 0.9v and LA300 has 1.2v for the first like 30 seconds or so and then they go to 0v. This board never gets any voltage on those coils, so that is why I am thinking its a GPU issue."
    },
    {
        "post_id":64489,
        "thread_id":59935,
        "title":"820-00928 No GPU",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-09-01 13:27:15",
        "message":"Heat GPU for test.\nCompare ohm value (NOT diode) on GPU coils, between both boards."
    },
    {
        "post_id":64496,
        "thread_id":59935,
        "title":"820-00928 No GPU",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-09-01 22:01:06",
        "message":"I did that and compared the ohms values and they are very similar between both boards. I was checking over the board again and actually found that RA900 was missing from the board and pin 1 of CA905 was burnt. I replaced both of them and also replaced UA900 just in case, and now the GPU voltages are present and I got image on the screen. Problem now is the image is distorted on like 1\/5th of the screen on the left side. I originally thought the screen was damaged, but after using it for a few minutes, I noticed the image in that section of the screen is like getting stuck. I can see the old windows and the dock bar still in that section of the screen, so it seems like it might be a GPU issue. I will try another working screen tomorrow to be sure."
    },
    {
        "post_id":64499,
        "thread_id":59935,
        "title":"820-00928 No GPU",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-09-02 00:26:59",
        "message":"That is LCD problem..."
    },
    {
        "post_id":64533,
        "thread_id":59935,
        "title":"820-00928 No GPU",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-09-02 11:47:27",
        "message":"Yea your right. Works fine with another LCD. Thanks for the help."
    }
]