{"post_id":25778,"thread_id":25778,"title":"[SOLVED]A1407 Apple Thunderbolt Display 27-Inch Random black outs","user_id":623,"username":"MaxFix","post_date":"2017-09-22 07:35:57","message":"Hi there,\n\nSorry if this is off topic question but maybe you know this problem and have an easy solution.\nI have Thunderbolt Display 27-Inch here that goes to black screen randomly anytime between 15 minutes to 24 hours. Reconnecting mini display cable solves the problem instantly but still the guy would like to get it back working as it should. I obviously thought it was a worn out display cable but replacing it did not solve the problem.\nCould it be a sneaky tantalum capacitor or something similar? Did you have familiar case?\n\nThank you."}
{"post_id":25795,"thread_id":25778,"title":"[SOLVED]A1407 Apple Thunderbolt Display 27-Inch Random black outs","user_id":2,"username":"dukefawks","post_date":"2017-09-22 14:35:30","message":"Backlight strips in the LCD. Need to completely tear apart the LCD and resolder the connectors on the LCD strips. Also if it has the older rectangular style LEDs you need to reflow them all."}
{"post_id":25819,"thread_id":25778,"title":"[SOLVED]A1407 Apple Thunderbolt Display 27-Inch Random black outs","user_id":623,"username":"MaxFix","post_date":"2017-09-23 09:45:17","message":"Alright, sounds like hell but ill give it a shot!"}
{"post_id":25834,"thread_id":25778,"title":"[SOLVED]A1407 Apple Thunderbolt Display 27-Inch Random black outs","user_id":2,"username":"dukefawks","post_date":"2017-09-23 18:15:13","message":"I do think this newer LCD will have the square LEDs that will not need to be touched. I believe there is a video on youtube showing a guy soldering some wires to the LED strip connector without taking the LCD apart. I have done this before but I found it such a bitch that I just rip the LCD apart now. You may want to opt for the less invasive wire soldering option as destroying the LCD is very easy.\nIt is 90% the left side that has the issue."}
{"post_id":25868,"thread_id":25778,"title":"[SOLVED]A1407 Apple Thunderbolt Display 27-Inch Random black outs","user_id":623,"username":"MaxFix","post_date":"2017-09-25 04:51:14","message":"No Title\n\nOkay I made some progress and ripped the screen apart so far without casualties i think. Before I resolder the backlight connectors and put everything together could you please confirm that these are the ones we are talking about (see picture attached). \nI suppose you were referring to this youtube video where Italian gentleman uses an alternative approach? [url]https:\/\/www.youtube.com\/watch?v=W0WLafU-kJA[\/url]"}
{"post_id":25895,"thread_id":25778,"title":"[SOLVED]A1407 Apple Thunderbolt Display 27-Inch Random black outs","user_id":2,"username":"dukefawks","post_date":"2017-09-25 21:03:30","message":"Yes that is the connector. Make sure not to damage the backlight diffuser if you are not taking out the complete strip. It will also soak up a lot of heat because of the aluminium backing of the strip."}
{"post_id":25918,"thread_id":25778,"title":"[SOLVED]A1407 Apple Thunderbolt Display 27-Inch Random black outs","user_id":623,"username":"MaxFix","post_date":"2017-09-26 07:10:48","message":"Okay... what a ride! The way back is definitely way harder then disassembling that thing! That plastic bezel that covers lcd and other layers is so hard to put back on and that sugar glass lcd is so freaking fragile that of course it cracked. Luckily I had an imac 27-inch from 2009 lying around waiting to be refurbished. I am testing it now and hopefully it will not randomly switch off till the end of the day.\nLesson learned. I will not attempt to do this again because there is too much risk for me doing that. Probably there is a good technic how to fit that bezel back on but I have not discovered it even after breaking the lcd."}
{"post_id":25971,"thread_id":25778,"title":"[SOLVED]A1407 Apple Thunderbolt Display 27-Inch Random black outs","user_id":623,"username":"MaxFix","post_date":"2017-09-27 06:08:45","message":"Fuck. It is still doing the same thing with new LCD...\nCan it be power supply or the logic board?"}
{"post_id":26017,"thread_id":25778,"title":"[SOLVED]A1407 Apple Thunderbolt Display 27-Inch Random black outs","user_id":2,"username":"dukefawks","post_date":"2017-09-27 20:02:10","message":"\"new\" LCD......All these LCDs have the same problem. Sure it could be the board but I have not seen that before."}
{"post_id":26070,"thread_id":25778,"title":"[SOLVED]A1407 Apple Thunderbolt Display 27-Inch Random black outs","user_id":623,"username":"MaxFix","post_date":"2017-09-28 11:00:23","message":"Yes that is true. It is not a new LCD but another LCD. However, I did some testing and thinking.\nWhen the display turns black there is no image at all. Not just backlight. Mac to which display is connected is still in the display resolution but it doesn't detect display in display or audio settings. So it seems that connection is lost. As soon as you reconnect the caBLE everything comes back again.\nIf this would be backlight connector problem, shouldn't the image still be there but just without backlight? shouldn't I be seeing display in mac settings?"}
{"post_id":26094,"thread_id":25778,"title":"[SOLVED]A1407 Apple Thunderbolt Display 27-Inch Random black outs","user_id":2,"username":"dukefawks","post_date":"2017-09-28 18:17:50","message":"Pfff now you tell there is no image at all. This is just a bad cable. You can connect a generic thunderbolt cable to one of the inputs on the back and the LCD should work too."}
{"post_id":26121,"thread_id":25778,"title":"[SOLVED]A1407 Apple Thunderbolt Display 27-Inch Random black outs","user_id":623,"username":"MaxFix","post_date":"2017-09-29 07:29:16","message":"Sorry if it was not clear from the beginning.\nI did replace the main flex cable to a \"new\" one first thing before posting here but the problem was the same with \"new\" cable.\nI ordered mini display to mini display cable and will test to hook it up from secondary port in the back of the display. Will update tomorrow."}
{"post_id":26130,"thread_id":25778,"title":"[SOLVED]A1407 Apple Thunderbolt Display 27-Inch Random black outs","user_id":831,"username":"Revive","post_date":"2017-09-29 12:24:26","message":"Power supply, super common problem with these, usually replace the cable while in there as well."}
{"post_id":26248,"thread_id":25778,"title":"[SOLVED]A1407 Apple Thunderbolt Display 27-Inch Random black outs","user_id":623,"username":"MaxFix","post_date":"2017-10-02 10:54:43","message":"Duke, I guess you are right about GENERIC cable because I have \"high copy\" mini-display cables and they dont work. Or maybe that port is meant for something else.\nI guess I will start with generic cable and then a PSU.\n\nThanks!"}
{"post_id":26266,"thread_id":25778,"title":"[SOLVED]A1407 Apple Thunderbolt Display 27-Inch Random black outs","user_id":2,"username":"dukefawks","post_date":"2017-10-02 22:53:09","message":"You got a mini display cable and you need a thunderbolt....."}
{"post_id":26349,"thread_id":25778,"title":"[SOLVED]A1407 Apple Thunderbolt Display 27-Inch Random black outs","user_id":623,"username":"MaxFix","post_date":"2017-10-04 09:43:50","message":"And the winner is Duke! Thank you.\nBought a new thunderbolt cable and connected it to the port in the back. Been watching movies for over 24 hours now without any black outs. \n\nIn the meantime received a second thunderbolt display for repair. This one has no backlight after half an hour. I guess its the connectors on the backlight strip. Testing it now with working first display LCD."}
{"post_id":26500,"thread_id":25778,"title":"[SOLVED]A1407 Apple Thunderbolt Display 27-Inch Random black outs","user_id":623,"username":"MaxFix","post_date":"2017-10-07 05:38:16","message":"No Title\n\nAnother big thank you to you Duke. I am impressed by our knowledge and experience. Thank you for sharing it with us!\nResoldered left backlight strip connector and its good as new again!"}
