{"post_id":21670,"thread_id":21670,"title":"820-3662 MBP Retina 15 no backlight","user_id":917,"username":"galvestonmac","post_date":"2017-06-13 22:15:15","message":"hi. I have a MBP 15\" 820-3662 Retina with no backlight.  I haven't worked with this model yet so I'm not sure of it's unique characteristics.\n\nI can see an image on the screen if a flashlight is pointed at the back of the screen. Computer starts normally and chimes and external video works via the DisplayPort.\nI checked F7700 and it was blown.  LCI is red under LCD connector and there was some charring evidence on the underside of the logic board below where the LCD connector sits. No other corrosion is visible on either side of the board.\n\nI replaced the fuse and connected the display again. No backlight so I checked the fuse again and it was blown again.  I replaced the fuse again and this time also replaced the LCD connector.  I powered it on again to test without the display connected.  The fuse did not blow this time. I connected the display and powered up again. Still no backlight, but the fuse is not blown. Must have been some corrosion under the LCD connector that was shorting. I made some measurements on these components:\n\nR7700 pins 1 & 2 12.6V\n12.5v on pins 3 & 4\n\nR7701 pin 1 12.5v\npin 2 12.6v\n\nC7700 pin 1 12.6v\npin 2 11.6v\n\nQ7706 pin 1 0v\npin 2 0v\n3 11.6v\n4 12.5v\n5 0v\n6 0v\n\nC7701 pin 1 0v\npin 2 11.6\n\nU7701\n1 0v\n2 0v\n3 0v\n4 0v\n5 4.9v\n6 4.9v\n8 5v\n9 12.7v\n10 12.7v\n11 11.1v\n12 0v\n13 0v\n14 0v\n15 0v\n16 0v\n17 3.2v\n18 4.9v\n19 0v\n20 0v\n21 0v\n\nAny help would be greatly appreciated.  I don't have another exact LCD panel to swap out, but I do have a 2015 Retina display. Would that work with this model?"}
{"post_id":21688,"thread_id":21670,"title":"820-3662 MBP Retina 15 no backlight","user_id":917,"username":"galvestonmac","post_date":"2017-06-14 13:29:35","message":"I should also add that I checked C7710, C7711, C7712, L7710, D7701 for short to ground and proper measurements. All checked out with their correct values.  I have a 2013 LCD panel on the way for testing.  I was thinking of injecting 12.6v at pin 1 of C7701. Not sure if that will blow anything up and want to proceed with caution.  Anyone? anyone?"}
{"post_id":21692,"thread_id":21670,"title":"820-3662 MBP Retina 15 no backlight","user_id":1,"username":"larossmann","post_date":"2017-06-14 19:12:03","message":"Don't do that. There is a reason the transistor is not opening. You have to have a known good LCD for testing, even if cracked, just something you know can produce an image\/backlight on a known good. This machine has current sensing after the fuse, Q7706 won't open if there is large voltage difference between R7700 input\/output so that the circuit doesn't go on fire(about time Apple). My guess is it senses a short to ground on output when the LCD is plugged in most likely something inside the LCD cable. 99% of the backlight problems on this model are LCD or LCD cable or connector, not backlight circuit related itself. It's much less prone to failure due to the fact that it is hidden away from where the water lands."}
{"post_id":21709,"thread_id":21670,"title":"820-3662 MBP Retina 15 no backlight","user_id":2,"username":"dukefawks","post_date":"2017-06-14 20:57:28","message":"This is a simple bad connector and bad cable in my opinion. I bet the still cable has a burned pin, no that 2015 assembly will not work. Inspect cable and replace.\n\nI also suspect you did the measurements on the backlight circuit without an LCD connected, so that is all moot."}
{"post_id":21727,"thread_id":21670,"title":"820-3662 MBP Retina 15 no backlight","user_id":917,"username":"galvestonmac","post_date":"2017-06-15 07:17:33","message":"OK thanks for the input.  I have a test LCD panel on the way. I'll post again with results.\nThanks for having this board also. I've learned a great deal from watching your videos and interacting with others with similar tech issues.  On another note, I used to live in NYC for 12 years. I had an apartment at 12th & Broadway and I worked at TekServe when it was on 23rd street as a MacBook bench tech."}
{"post_id":21999,"thread_id":21670,"title":"820-3662 MBP Retina 15 no backlight","user_id":917,"username":"galvestonmac","post_date":"2017-06-20 20:09:26","message":"OK. an update on my no backlight issue.  I bought a known good testing LCD panel for this model late-2013 Retina that arrived today.  This computer arrived with no backlight but the external display port works normally and there is an image on the screen that can be seen with a  flashlight.  The LCI was red under the LCD connector and there was evidence of a short that happened under the connector. The fuse F7700 was also blown.  I replaced the LCD connector and F7700 and checked for short to ground on the connector pins and components along the backlight circuit.  I tried out the newly acquired test LCD panel and have the same results,  no backlight but an image on the screen.\n\nI measured around U7701 again and I see that I have no EDP_IG_PANEL_PWR or EDP_IG_BKL_ON coming into pin 17 EN.  I chased that path back through R1284 & R1281 and back to U1100.  Nothing is being output from U1100 on that signal.  I also checked U8300 for short to ground and have 0v on pin 1, 5v on pins 2,3 0v on 4, 5\n\nIs this repair hopeless since this chip is not sending the correct signal to enable U7701?"}
{"post_id":22055,"thread_id":21670,"title":"820-3662 MBP Retina 15 no backlight","user_id":2,"username":"dukefawks","post_date":"2017-06-21 16:13:51","message":"If you have no EDP_IG_PANEL_PWR it is impossible to have an image! No idea how you are measuring things, but LCD must be connected for this to make sense."}
{"post_id":22125,"thread_id":21670,"title":"820-3662 MBP Retina 15 no backlight","user_id":917,"username":"galvestonmac","post_date":"2017-06-22 18:48:27","message":"Customer got impatient and came to pick up the laptop so onto the next one! thanks!"}
