[
    {
        "post_id":85480,
        "thread_id":62251,
        "title":"iMac pro 2018 DFU reset help needed",
        "user_id":64,
        "username":"Dozer",
        "post_date":"2022-01-24 01:29:27",
        "message":"hi,\n\ngot the imac pro without any sign of life. client told me machine crashes randomly and install from internet ending with error 1008F, but now dont turn on\nafter replacing the power unit the machine turned on but was not possible to install or restore all ends with 1008F\n\nso tryed the DFU reset. that worked fine. after that i got internet restored but only Mojave\n\nso tryed here an update to Monterey, that failed and machine shows no sign of life\n\nI tryed DFU reset again but that seems not to be possible got all time this error\n\nwhat i do wrong here, what can i do to make the machine running again? thanks for help"
    },
    {
        "post_id":85481,
        "thread_id":62251,
        "title":"iMac pro 2018 DFU reset help needed",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-01-24 02:32:29",
        "message":"Many people complained on Internet about machines crashed on macOS upgrade, especially Big Sur and Monterey.\nBIOS got corrupted and the only way to recover it is DFU.\nTry to do it more times, or send him to Apple.\n\nThis happens because people with perfect working Mojave, or Catalina macOS want to get latest Apple macOS, without real reason."
    },
    {
        "post_id":85482,
        "thread_id":62251,
        "title":"iMac pro 2018 DFU reset help needed",
        "user_id":64,
        "username":"Dozer",
        "post_date":"2022-01-24 02:47:24",
        "message":"i have a second device (macbook pro 2018 13\") with the same problem like in my first post\n\nwhen i plug the cable in the icon changes to \"RECOVERY\" after selceting \"Revive\" it is performing some steps,\nthe \"damaged\" laptop is booting up with apple log, the loading progress bar performs almost until the end, there is missing about 15mm, then\nthe drops the Error message on the \"good\" macbook nothing more happens on the \"bad\" device and the icon on the DFU App is showing like in my first post a broken line square\n\nhere i only need the data but seems for me no way to get it\n\na question is if i select \"restore\" it deletes the ssd, do you think it will be possible after that with a recovery tool to find some files on it?"
    },
    {
        "post_id":85483,
        "thread_id":62251,
        "title":"iMac pro 2018 DFU reset help needed",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-01-24 03:34:44",
        "message":"DFU restore will erase SSD; no way to recover anything.\nFileVault was probably enabled, as people like to encrypt their data against god knows what.\n\nTry to get get access to SSD in Target Disk mode."
    },
    {
        "post_id":85487,
        "thread_id":62251,
        "title":"iMac pro 2018 DFU reset help needed",
        "user_id":64,
        "username":"Dozer",
        "post_date":"2022-01-24 04:27:29",
        "message":"tryed the Target mode but no way.\n\nthe moment i turn the device on there i see in the configurator the same symbol like DFU but it is labeld with RECOVERY\n\nafter selecting \"Revive\" it performs 4 steps, step 4 is almost in the end in this moment turn the screen on with apple logo and loading bar wich is near the end and in the same moment as well pop up the error, tryed already different cables but always the same procedure\n\ni set the device to DFU mode, so the logo is not RECOVERY but DFU\n\nbut still the same procedure like described after selecting \"Revive\"\n\nwhat a mess\n\nthe Error what pops up is the same in DFU or in RECOVER mode"
    },
    {
        "post_id":89184,
        "thread_id":62251,
        "title":"iMac pro 2018 DFU reset help needed",
        "user_id":64,
        "username":"Dozer",
        "post_date":"2022-05-09 12:01:59",
        "message":"i still have that problem.\n\ni have a 2017 a1706 osx 12.0.1 as host\nthe imac pro 2018 is the target\nusing newest apple configurator\n\nthe DFU Mode is starting perfect\n\nusing restore or revive, all time ends up in error 6\n\nwhat can i do iam out of ideas\n\ni found the IPSW Firmware file ([URL]https:\/\/mrmacintosh.com\/apple-silicon-m1-full-macos-restore-ipsw-firmware-files-database\/[\/URL])\n\nis it a good idea to flash the t2 with the medusa\n[URL unfurl=\"true\"]http:\/\/www.cmizapper.com\/products\/t2-chip-stuff.html[\/URL]\n\nor is there any other idea"
    },
    {
        "post_id":89191,
        "thread_id":62251,
        "title":"iMac pro 2018 DFU reset help needed",
        "user_id":64,
        "username":"Dozer",
        "post_date":"2022-05-09 23:24:37",
        "message":"I still have the problem with the imac pro 2018\n\ni can turn in dfu mode without problems but with the configurator happens the error 06\n\nthe last osx i installed was Mojave. is it needfull on the host computer to run mojave as well ?\n\nthe target is imac pro 2018 mojave\ni tryed the host with a a1706 2017 installed monterey 12.0.1\n\nhow is it possible to repair that? need realy help\n\n\ni found here : [URL]https:\/\/mrmacintosh.com\/apple-silicon-m1-full-macos-restore-ipsw-firmware-files-database\/[\/URL]\nthe ISPW files\n\nis it a good idea for example to flash the t2 with the medusa and the ISPW file ?\n[URL unfurl=\"true\"]http:\/\/www.cmizapper.com\/products\/t2-chip-stuff.html[\/URL]"
    },
    {
        "post_id":89197,
        "thread_id":62251,
        "title":"iMac pro 2018 DFU reset help needed",
        "user_id":64,
        "username":"Dozer",
        "post_date":"2022-05-10 04:14:45",
        "message":"I tryed now installing Mojave on Host\n\n\nthe target is imac pro 2018 mojave\ni tryed the host with a a1706 2017 installed mojave 10.14\n\ngot now error 10\n\nthis is discribed in mr.macintosh  as osx not matching\n\n...\"\n\n[B]BridgeOS Restore Error 10[\/B] – The BridgeOS Restore failed! This is most likely because the host Mac was 1 or 2 OS Versions behind the Target Mac. The Host and Target Mac need to be on the same OS Version.\n\n[B]If your Target Mac is on 10.15, then your Host Mac needs to be on 10.15.[\/B]\n\nThe OS Cannot be restored on this device.\n\nThe operation couldn’t be completed. (AMRestoreErrorDomain error 10 – Failed to handle message type StatusMsg) [AMRestoreErrorDomain – 0xA (10)]\n...\"\n\nso what now?"
    },
    {
        "post_id":89206,
        "thread_id":62251,
        "title":"iMac pro 2018 DFU reset help needed",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-05-10 08:28:42",
        "message":"There must be a problem with T2 internal firmware.\nApple will not help for free, of course."
    }
]