{"post_id":27274,"thread_id":27274,"title":"[SOLVED]820-3330 SD Slot Issue","user_id":515,"username":"SMMRepair","post_date":"2017-10-25 09:53:01","message":"Working on an 820-3330 board that works perfectly, but the SD slot does not work. When I insert an SD card and measure pin 14 on J3300, it stays at 3.3v instead of going low (compared to working board as well--voltage drops to .000 once SD card is detected). Diode measurements are identical to a working board. Replaced U3300 & U3311, but no dice. All resistors check out fine, no damage in the area. SD port looks fine, no other issues with board. Something I don't understand is that pin 4 of J3300 (PP3v3_S0_SW_SD_PWR) doesn't have voltage at all (with or without card). It stays at 0v. It seems to be this way on a working board too, though, so I'm not sure what's up with that. Board is clearly in S0, but no voltage there. I would imagine that if the SD card isn't detected, it wouldn't send s0 voltage to the port (and that SD detect works off of 3v3 s4 voltage).\n\nAny help appreciated. Hoping this isn't an SMC or even a CPU\/PCH issue. Thanks in advance!"}
{"post_id":27293,"thread_id":27274,"title":"[SOLVED]820-3330 SD Slot Issue","user_id":2,"username":"dukefawks","post_date":"2017-10-25 16:51:18","message":"It's always the slot. You can poke at the detect switch a bit and most of the time it will work again, there is just crap in there. Look at donor board first how this works before fucking up the slot on your board!"}
{"post_id":27297,"thread_id":27274,"title":"[SOLVED]820-3330 SD Slot Issue","user_id":515,"username":"SMMRepair","post_date":"2017-10-25 17:02:16","message":"Hey Duke, thanks; I'll check that and get back to you. I did clean the slot out pretty well as part of the troubleshooting process, but sticky switches certainly wouldn't give to a bit of air\/brushing, so I'll target the switch specifically. Thanks!"}
{"post_id":27302,"thread_id":27274,"title":"[SOLVED]820-3330 SD Slot Issue","user_id":515,"username":"SMMRepair","post_date":"2017-10-25 17:49:36","message":"Damn, Duke; spot on again. I hope one day I get to buy you a beer in person--you humble me weekly (several cases of Occam's razor).\n\nI had already cleaned the port well (and have cleaned really nasty ones in the past), but sure enough I probed in the SD slot and behind the detect switch, and pulled out a laughably-large ball of dust\/lint that was trapped perfectly inside the slot between the switch and the side-plastic molding of the slot. Got it plucked out, pushed the switch several times for good measure then tested and it works great. Thanks again, Duke! You can mark this one solved."}
