{"post_id":70228,"thread_id":60615,"title":"820-2915 intermittent start\/boot","user_id":26621,"username":"grmacs","post_date":"2021-01-14 06:28:38","message":"Strange issue for me. Board boots and runs well occassionally from charger only. Always runs on battery.\n\nwhen not starting from charger, there is less than .5V coming in. Changed dcin port multiple different ones as that seemed the obvious likely issue. Checked resistance in lines from DCIn. Replaced U7000. Replaced Q7080 same symptoms. Not sure what is causing the intermittent issue. UsuallyIf I leave on the charger long enough the voltage will slowly build and the board wil turn on. Once on it stays on. Something inconsistently allowing charger to send voltage. No intermittent shorts on main rails that I can detect.\nI am testing with known working 85W charger."}
{"post_id":70229,"thread_id":60615,"title":"820-2915 intermittent start\/boot","user_id":682,"username":"2informaticos","post_date":"2021-01-14 06:50:32","message":"\"when not starting from charger, there is less than .5V coming in\"\nDo you mean F6905?\nRemove C7011, just in case.\nTest with fake charger, or lab PSU."}
{"post_id":70253,"thread_id":60615,"title":"820-2915 intermittent start\/boot","user_id":26621,"username":"grmacs","post_date":"2021-01-14 11:36:05","message":"Testing with lab supply I get pp3v42 instantly but no start. I haven't done that before so I'm not sure if board will actually start without adapter sense. \n\nIf when I plug OEM charger in and montor voltage on pp3V42_G3H, if board hasn't started usually I can watch the voltage there actually dropping until it gets to about 230mV and then it will start going back up and jump to 3.48V"}
{"post_id":70254,"thread_id":60615,"title":"820-2915 intermittent start\/boot","user_id":682,"username":"2informaticos","post_date":"2021-01-14 11:43:38","message":"Use Magsafe cable from a dead charger to connect lab PSU!!!\nThis board requires 85W model, to start without battery."}
{"post_id":70264,"thread_id":60615,"title":"820-2915 intermittent start\/boot","user_id":26621,"username":"grmacs","post_date":"2021-01-14 13:11:35","message":"Ok. Yes I was testing with known working 85W charger.\n\nWith MagSafe connected to PSU, board starts immediately every time the PSU is turned on."}
{"post_id":70268,"thread_id":60615,"title":"820-2915 intermittent start\/boot","user_id":682,"username":"2informaticos","post_date":"2021-01-14 15:33:22","message":"Did you use new Q7080?\nPost exact ohm value for R7085\/86, measured onboard."}
{"post_id":70271,"thread_id":60615,"title":"820-2915 intermittent start\/boot","user_id":26621,"username":"grmacs","post_date":"2021-01-14 16:47:47","message":"Turned out to be D6990. Thought I had tried replacing that already so I wasted a bunch of time running jumper wires from teh other sde of the board to ensure it wasn't a bad trace along ppDCIN. Anyway all is well and thanks for the help!"}
