[
    {
        "post_id":23845,
        "thread_id":23845,
        "title":"00165 Shows battery charge symbol when turns on",
        "user_id":371,
        "username":"nate8organic",
        "post_date":"2017-08-04 18:23:44",
        "message":"Got a customers computer in, liquid damage. shows green and orange light but will not power on without the battery and when i have the battery plugged in it show a battery logo on the screen and then powers off.  it had liquid damage on the battery charger plug.  isl is good replaced it with a new one. same issue. check i\/o board,flat cable and battery.  anything specific that might be causing this or should i test around?\nthanks \nnate"
    },
    {
        "post_id":23857,
        "thread_id":23845,
        "title":"00165 Shows battery charge symbol when turns on",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-08-05 11:39:29",
        "message":"PPBUS voltage without battery?"
    },
    {
        "post_id":24275,
        "thread_id":23845,
        "title":"00165 Shows battery charge symbol when turns on",
        "user_id":371,
        "username":"nate8organic",
        "post_date":"2017-08-14 12:19:39",
        "message":"8.56v on ppbus w out battery. I have no Voltage on pin 2 & 3 of the Q3080.  i also have no voltage on DCINVSENS_EN_L"
    },
    {
        "post_id":24290,
        "thread_id":23845,
        "title":"00165 Shows battery charge symbol when turns on",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-08-14 18:48:39",
        "message":"What on earth has Q3080 do to with all of this?\n\nI suspect crap under SMC and possibly a dead battery too."
    },
    {
        "post_id":24652,
        "thread_id":23845,
        "title":"00165 Shows battery charge symbol when turns on",
        "user_id":371,
        "username":"nate8organic",
        "post_date":"2017-08-25 13:43:24",
        "message":"Just got in some donor boards to pull smc from. Replaced the smc powers on with the same issue. No power with out battery, fan turns on with battery connected w\/ & w\/out the charger connected. except that i have no video now, Guessing because the smc i replaced it with has something wrong with the video?\n\nAlso i'm testing with a known working battery.\n\nI only brought up q3080 because it had crap on it so i was testing around there, i realize now its not related."
    },
    {
        "post_id":24672,
        "thread_id":23845,
        "title":"00165 Shows battery charge symbol when turns on",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-08-26 11:42:33",
        "message":"No idea, only thing I know is that you fucked up the SMC replacement now..."
    }
]