[
    {
        "post_id":86763,
        "thread_id":62394,
        "title":"A1708 820-00840-A - graphics drivers not loaded?",
        "user_id":33224,
        "username":"Vogelek23",
        "post_date":"2022-02-28 02:45:04",
        "message":"Hi there, I've got an A1708 2017 on my desk with a bit strange issue. Originally there was the keyboard fault (some keys did not work) so I have replaced the keyboard and it started to work. I did not see it before, but now this computer acts like the graphics drivers are not loaded - there is no transparency and when you open any window and try to drag it left and right quickly it does not move smoothly but is lagging a bit. Mac OS is Monterey but I tried Catalina and Big Sur and it's all the same. All voltages seem to be correct (compared to the other logic board), no visible signs of spillage (checked under microscope). How to proceed with the repair?\n\nEDIT: I just found that the camera does not provide any picture - green LED is on but picture inside Photo Booth is black. Is it because the graphics drivers are not loaded or maybe it's something which causes the main issue? Can faulty camera prevent the OS from loading GPU drivers?\n\nEDIT 2: I've ruled out all the external parts (screen, keyboard, battery etc). This is definitely the logic board problem.\n\nEDIT 3: I found on the fully working logic board that PPVCCGT_S0G is 0V when on idle and turns on when GPU is loaded, and on the faulty logic board this voltage is always on (0.45V)."
    },
    {
        "post_id":86765,
        "thread_id":62394,
        "title":"A1708 820-00840-A - graphics drivers not loaded?",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-02-28 05:06:08",
        "message":"iGPU voltage should only appear when high graphics load is detected.\nDefinetely the graphics is not managed good on the board.\nIs the graphics correctly recognized on system report?\nLook there for camera too.\n\nDid you try another BIOS?\nAny liquid sign?"
    },
    {
        "post_id":87032,
        "thread_id":62394,
        "title":"A1708 820-00840-A - graphics drivers not loaded?",
        "user_id":33224,
        "username":"Vogelek23",
        "post_date":"2022-03-08 03:55:12",
        "message":"Faulty CPU - after replacement everything is fine.\nNOTE: after CPU full reflow it started to work for a while (around 2 hours) then failed to load GPU driver and came back to the original fault. Reflow can only be the way of diagnosis for CPU fault, which must be replaced anyway in order to get the logic board permanently fixed."
    },
    {
        "post_id":87033,
        "thread_id":62394,
        "title":"A1708 820-00840-A - graphics drivers not loaded?",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-03-08 04:32:24",
        "message":"Thanks for feedback.\nCamera works normall too now?"
    },
    {
        "post_id":87072,
        "thread_id":62394,
        "title":"A1708 820-00840-A - graphics drivers not loaded?",
        "user_id":33224,
        "username":"Vogelek23",
        "post_date":"2022-03-08 13:10:01",
        "message":"[QUOTE=\"2informaticos, post: 87033, member: 682\"]\nCamera works normall too now?\n[\/QUOTE]\nYes, camera works perfectly fine."
    }
]