{"post_id":14695,"thread_id":14695,"title":"820-2850-A strange graphics error","user_id":205,"username":"dr. moast","post_date":"2017-02-13 05:37:16","message":"Hi everybody,\n\nYES, I know this board is shit and I know that in 99,9% it's C9560 which causes kernel panics due to GT330M usage.\n\nBut here is the strange thing:\nIn the last year, we have repaired around 500 boards with \"GPU problems\" by simply replacing C9560, only 2 (!) in fact needed a new GPU.\n\nBut last week we got 5 devices on the same day (from different customers) all showing the following problem (see attachment). Last week we got another 3. One of the boards has already been tampered with before but the other ones were never touched. Now we already replaced C9560 (because we always replace that prophylactic no matter what the error is), but naturally the issue persisted.\n\nSince we started repairing these boards we have never seen this issue and now we got 8 of them in 2 weeks. Isn't that weird?\n\nThen we replaced the GPU with known good GPUs (at least the rest of the batch was flawless) on three boards but it is still exactly the same issue. All of the devices show the exact same pattern on the screen.\nDoes anybody have more experience with this type of error and can point us into the right direction? I know you would probably stop the repair at this point but unfortunately for at least two tickets this is not an option.\n\nThanks and best regards!"}
{"post_id":14696,"thread_id":14695,"title":"820-2850-A strange graphics error","user_id":205,"username":"dr. moast","post_date":"2017-02-13 05:38:06","message":"No Title"}
{"post_id":14725,"thread_id":14695,"title":"820-2850-A strange graphics error","user_id":36,"username":"aprendiz","post_date":"2017-02-13 15:38:29","message":"VRAM replaced????"}
{"post_id":14732,"thread_id":14695,"title":"820-2850-A strange graphics error","user_id":2,"username":"dukefawks","post_date":"2017-02-13 15:49:15","message":"Either VRAM or on issue inside the PCB. Also inspect for damaged\/missing components around the GPU."}
{"post_id":14755,"thread_id":14695,"title":"820-2850-A strange graphics error","user_id":205,"username":"dr. moast","post_date":"2017-02-14 02:37:29","message":"VRAM was not replaced. Should we try that?\n\nGPU on 7 of the boards was never touched. Also thermal compound was still original.\n\nHave you seen this exact pattern before and were you able to solve it?"}
{"post_id":14761,"thread_id":14695,"title":"820-2850-A strange graphics error","user_id":2,"username":"dukefawks","post_date":"2017-02-14 05:37:21","message":"It is usually one of 2 things, the GPU or the VRAM. Just replace both while you are at it."}
{"post_id":15009,"thread_id":14695,"title":"820-2850-A strange graphics error","user_id":205,"username":"dr. moast","post_date":"2017-02-18 04:33:51","message":"Thanks duke,\n\nwe have a new batch of GPUs arriving on monday, will try another replacement and swap the VRAMs then."}
{"post_id":15022,"thread_id":14695,"title":"820-2850-A strange graphics error","user_id":2,"username":"dukefawks","post_date":"2017-02-18 06:58:17","message":"I have one here right now with the exact same thing. Will also update with results."}
{"post_id":15236,"thread_id":14695,"title":"820-2850-A strange graphics error","user_id":205,"username":"dr. moast","post_date":"2017-02-21 09:40:03","message":"VRAM Reflow did the trick for mine. Weird this happened in bulk."}
{"post_id":15240,"thread_id":14695,"title":"820-2850-A strange graphics error","user_id":2,"username":"dukefawks","post_date":"2017-02-21 09:50:00","message":"Mine is working after GPU replacement and VRAM reflow too. Not really confident these won't come back, time will tell."}
