[
    {
        "post_id":18002,
        "thread_id":18002,
        "title":"[SOLVED]Macbook Air Mid 2011",
        "user_id":517,
        "username":"vaswaniraj",
        "post_date":"2017-04-08 07:29:03",
        "message":"Hi Guys,\nYesterday I received a 13\" Macbook Air - Mid 2011, where the customer complained for No Sound.  I checked in the System Preferences it says \" No output devices found \" and also \" No input devices found \".  I went ahead and took a backup of the customer and then went ahead and formatted the hard drive thinking it to be a software issue.  After reinstalling the OS (Yosemite ) the problem still continued.  Then opened the laptop to see if there is any physical damages or liquid damages to the board under the microscope, but did not see any indications of any damage.  Read some forums and even tried the solutions provided in the forum, but with no luck.  Someone said it is a hardware issue and needs a change of the logic board.  But we at this forum fix logic boards, so will it be possible to get me some guidance as what to check and if possible to fix the problem for the customer.  Thanks.  Raj."
    },
    {
        "post_id":18003,
        "thread_id":18002,
        "title":"[SOLVED]Macbook Air Mid 2011",
        "user_id":316,
        "username":"G.Beard",
        "post_date":"2017-04-08 07:32:33",
        "message":"Change the IO \/ DC in board for a new one. Try that before you do anything. Audio is dealt with on the IO board."
    },
    {
        "post_id":18004,
        "thread_id":18002,
        "title":"[SOLVED]Macbook Air Mid 2011",
        "user_id":517,
        "username":"vaswaniraj",
        "post_date":"2017-04-08 07:54:07",
        "message":"Thanks G.Beard, let me try that.  I will keep you posted.  Thanks. Raj."
    },
    {
        "post_id":18006,
        "thread_id":18002,
        "title":"[SOLVED]Macbook Air Mid 2011",
        "user_id":517,
        "username":"vaswaniraj",
        "post_date":"2017-04-08 10:25:18",
        "message":"[USER=\"316\"]G.Beard[\/USER] Hi, The solution that you provided worked.  Thanks so much for your help.  Appreciated.  Regards,  Raj."
    }
]