[
    {
        "post_id":66973,
        "thread_id":60221,
        "title":"A1286 2012 820-3330 Graphic issue",
        "user_id":24772,
        "username":"VinceLx",
        "post_date":"2020-10-22 13:54:25",
        "message":"Hello,\nI have this board with a graphic issue, see examples attached. When I play a video it's worse, I see just a blinking white display with some colour spots.\nDo you have by any chance A BIOS which use only the internal graphic? Maybe the internal is still good?"
    },
    {
        "post_id":66981,
        "thread_id":60221,
        "title":"A1286 2012 820-3330 Graphic issue",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-10-22 17:10:55",
        "message":"Hardware mod has already been posted on the forum.\n\n[URL unfurl=\"true\"]https:\/\/drive.google.com\/file\/d\/1jrLkrtVJcb-FgI3FXOqgBZwcABhpMlpb\/view?usp=sharing[\/URL]\nJust in case..."
    },
    {
        "post_id":67039,
        "thread_id":60221,
        "title":"A1286 2012 820-3330 Graphic issue",
        "user_id":24772,
        "username":"VinceLx",
        "post_date":"2020-10-23 12:08:47",
        "message":"Woow... thank you, this sounds interesting to do! I will try.\nI also noticed that on internal display the image is ok, even with video playing; it starts to distort when I force dedicated GPU.\nWhen I look at the block diagram page 2, I understand that mini display port should also use internal and dedicated GPU, through U9390 DP\/T29 MUX. Why I don't have a clear image on external display then? Is it possible that this MUX is blocked to dedicated GPU?"
    },
    {
        "post_id":67048,
        "thread_id":60221,
        "title":"A1286 2012 820-3330 Graphic issue",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-10-23 13:45:33",
        "message":"External monitor is driven by discrete graphics (GPU)."
    },
    {
        "post_id":67096,
        "thread_id":60221,
        "title":"A1286 2012 820-3330 Graphic issue",
        "user_id":24772,
        "username":"VinceLx",
        "post_date":"2020-10-25 13:10:01",
        "message":"Thanks for the information.\nI completed the mod today, it was perfect for a rainy Sunday! I passed my microsolderer exam, it works :D Thanks again for the information.\nJust to clarify about this mod: it was originally for 2011 820-2915 (I see L8920)? Then can I use these pictures to modify a 820-2915 board, or there are some steps differents\/ to add?"
    },
    {
        "post_id":67097,
        "thread_id":60221,
        "title":"A1286 2012 820-3330 Graphic issue",
        "user_id":1427,
        "username":"Narek",
        "post_date":"2020-10-25 13:21:07",
        "message":"For 820-2915 remove u9600 and use solution from this photo + remove R8911 after soldering wires. Some say you can leave u9600 but I always remove it.\n\nFor High Sierra you will also need to make jumper between pin 2 of R9704 and pin 1 of C9711, otherwise after closing and opening the lid there will be no image."
    },
    {
        "post_id":67098,
        "thread_id":60221,
        "title":"A1286 2012 820-3330 Graphic issue",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-10-25 14:38:49",
        "message":"Too much work, disable 2915 in BIOS with Medusa, or flash GMUX.\nBest way, use Tiresias GPUkiller; that preserves real backligh adjust.\n\nBTW, flashing GMUX is the fastest; no need to remove MLB from case."
    },
    {
        "post_id":67141,
        "thread_id":60221,
        "title":"A1286 2012 820-3330 Graphic issue",
        "user_id":24772,
        "username":"VinceLx",
        "post_date":"2020-10-26 13:40:51",
        "message":"Thank you both.\nI never flashed GMUX, I saw another post about that, so I will first get a  Lattice HW-USBN-2A programmer, then I will open another post because for sure I will need you support!"
    }
]