{"post_id":20033,"thread_id":20033,"title":"820-2850, Determining Bad GPU","user_id":515,"username":"SMMRepair","post_date":"2017-05-10 17:06:31","message":"Please forgive the 2-3 posts I've made on this topic the previous few weeks.\n\nI've been going through and repairing some old 2850 boards, as we had a customer request several of them. Doing the usual replacing of C9560 and running FurMark for an hour to make sure there are no underlying issues (or at least trying to). \n\nI've noticed that one of the boards, however, is missing the checkbox option in Energy Saver that allows automatic graphics switching. When I go to \"About this Mac\" and into System Information, it shows the GeForce 512MB card, but not the Intel integrated graphics. Is the system not seeing both graphic chips? Is this an indication of a bad GPU or a bad GMUX?\n\nI want to be overly cautious when selling these 2850 boards, so that's why I have so many questions about them. Thanks!"}
{"post_id":20034,"thread_id":20033,"title":"820-2850, Determining Bad GPU","user_id":2,"username":"dukefawks","post_date":"2017-05-10 17:09:14","message":"PRAM reset first! If the intel still does not show up it is most likely the MUX. Run ASD, I think you need OS version to test MUX switching."}
{"post_id":20035,"thread_id":20033,"title":"820-2850, Determining Bad GPU","user_id":515,"username":"SMMRepair","post_date":"2017-05-10 17:11:47","message":"Ok cool, thank you duke! Yeah, the board runs FurMark fine without crashing, so I was hopeful for it. I'll reset PRAM then get on running ASD. Is this particular MUX issue cracked balls (and remedied with a reflow\/reball), or would the chip need replacing? Thanks!"}
{"post_id":20038,"thread_id":20033,"title":"820-2850, Determining Bad GPU","user_id":2,"username":"dukefawks","post_date":"2017-05-10 17:20:07","message":"Reflow of the MUX should do it. But honestly I would leave it if it runs ok on the Nvidia, only down side would be a bit shorter battery life."}
{"post_id":20039,"thread_id":20033,"title":"820-2850, Determining Bad GPU","user_id":515,"username":"SMMRepair","post_date":"2017-05-10 17:22:35","message":"Ok great, thanks. I'll do that then (and will run ASD for good measure). I had already run ASD on the board 3 times, and nothing came up, but I'm going to let it do 5-10 passes on the video tests. Thanks, Duke! Sorry for the same sort of questions about this board model."}
