{"post_id":35810,"thread_id":35810,"title":"820-3208-a, RTC_RESET and my stupidity","user_id":1309,"username":"Inwerp","post_date":"2018-06-14 13:34:52","message":"Macbook air 2012 A1465, came with sporadical shutdown problem. After 3-5 minutes of high load, the laptop shuts down and then works 20-30 seconds till shutdown unless cooled for a while. Since CPU\/GPU were under 60°C, i checked all voltages and some reset signals, on board and found funny slow linear voltage drop on RTC_RESET, changed batteries in my multimeter and immediately confirmed it with a brilliant solution by Dukefawks from this forum.\nAfter i changed both caps, it started to work and here comes the stupid one.\nTo test the board with the battery i used SMC_ONOFF jumper near the wlan card. I was too stupid to check if there's something dangerous around it and i guess i shorted SMC_ONOFF with damn PPVBAT_G3HOT_CHRG_REG on C7045 which is happened to be just near this jumper. IDK if apple considers electrical safety but although i feel retarded enough for my mistake, i found it rather funny that they put 8V hot power rail just in 2mm from the power jumper, without even putting some sort of compound or glue.\n[ATTACH alt=\"Click image for larger version  Name:\topenboardview_2018-06-14_20-32-14.png Views:\t1 Size:\t384.9 KB ID:\t35811\"]35811._xfImport[\/ATTACH]\nPic 1. Apple trap for big tweezers in shaky hands. \n\nNow i'm having 1.7V on SMC_ONOFF, Keyboard power button drops it to 1.3V, and, of course, shorting it to ground does not turn the laptop on anymore, it starts only if i plug the charger in.\nI am really pissed off with my stupidity but i am asking for some help.\nUnfortunately, it's not C5734 shorting to ground.\nHowever, i found that R5070 is nearly 1kOhm (10kOhm in schematics) in circuit. Is that possible that on higher load SMD resistors melt to lower resistance? Should i start searching for a new SMC and U5010, or it simply shorts my PP3V42 rail instead of turning it on?\n\nAlso, note to self: check SMC_ONOFF area for high power rails before you take your dirty tweezers in hand."}
{"post_id":35845,"thread_id":35810,"title":"820-3208-a, RTC_RESET and my stupidity","user_id":2,"username":"dukefawks","post_date":"2018-06-15 14:04:46","message":"SMC is certainly dead to start with. Seeing that this board already has a shitty shutdown problem that could be many things I would not put any more time into this. RIP."}
{"post_id":35875,"thread_id":35810,"title":"820-3208-a, RTC_RESET and my stupidity","user_id":1309,"username":"Inwerp","post_date":"2018-06-17 06:47:08","message":"Yup, I've decided to order a new one since working board could be found for just ~100$ on ebay. I'm wondering how many times power issues ending up with SMC death. PC laptops are far more repairable in this sense - when IO chip dies, it is almost always available without donor board lottery and can be pre-programmed with Vertyanov jig just like a normal flash chip, so it's almost never a big deal. :)"}
