{"post_id":24588,"thread_id":24588,"title":"[SOLVED]820-3476-a","user_id":517,"username":"vaswaniraj","post_date":"2017-08-24 10:02:10","message":"Hi Team, Need help with this situation.  \nThis is my personal computer.\nComputer was working fine.  Next day morning computer comes on but does not accept password.  Keyboard types but computer does accepts password.  Now here is what I have done so far.\n\n1.  Connected external keyboard and typed the password.  Password accepted.  Computer is on a regular desktop.  Graphics is draggy, but after a while gets to normal.   \n2.  Tried using the keyboard on the Macbook Pro and see that everything is typing in CAPS.  Tried typing numbers and only the special characters on the top of numbers get typed.\n3.  Thought it is the keyboard has a problem.  Replaced the keyboard on the computer, but still it continues to do the same thing.\n4.  Borrowed a friends computer ( Working and known good ) with exactly same year and same 820-3476-A logic board and swapped the logic board into his computer.\n5.  Still this computer continues to type in CAPS, and instead of numbers continues to type special characters. - For eg.  !@#$%\n6.  Also downloaded the ASD 3S162 - EFI and put it on a USB Stick to run a EFI test, but when the Option key is pressed on the keyboard - The option key does not work.  So unable to do a EFI test on the computer.\n7.  All my schematics and board view software is on that computer, cannot access anything.\n\nCan anyone please help me with the above situation.  \n\nThanks Raj"}
{"post_id":24606,"thread_id":24588,"title":"[SOLVED]820-3476-a","user_id":2,"username":"dukefawks","post_date":"2017-08-24 19:14:59","message":"Corrosion in keyboard connector or under U4850."}
{"post_id":24621,"thread_id":24588,"title":"[SOLVED]820-3476-a","user_id":517,"username":"vaswaniraj","post_date":"2017-08-24 22:55:42","message":"Hi Duke,  I was successful in fixing the Macbook Pro.  I was able to run the ASD 3S162 EFI Test and in that test it was discovered a power sensor IPBR Sensor is reading above the high limit.  I checked the schematics and checked the Cap and Resistor for the IPBR sensor, they looked normal, but following the GND line the GND_SMC_AVSS one of the caps was founded corroded.  Replaced the cap with a new one and the problem described was solved.  I would conclude that the ASD 3S162 was really helpful or else troubleshooting would have been difficult or a thorough physical inspection of the logic board would have solved the problem. Thanks once again for all your help.  CASE SOLVED."}
