[
    {
        "post_id":86453,
        "thread_id":62355,
        "title":"A2159 (820-01598) PP5V_G3S understated resistance",
        "user_id":35118,
        "username":"k_konstantin",
        "post_date":"2022-02-18 03:57:37",
        "message":"MacBook Pro 13\" A2159\n820-01598\n\nIt just died quietly, there are no traces of flooding. When charging was connected, it made a sound of connecting the charger. If you press the on\/off button for a long time, and then on, then the cooler started spinning for a second and that's it\nConsumption with a connected battery is slightly more than 2A\nConsumption with disconnected battery is between 150mA and 300mA\n\nEDP_AUXCH_N and EDP_AUX_P resistance kOhms\nThere is no picture on the external display\nLogged into DFU and using Apple Configurator 2 restored T2\nThe result did not work, I disassembled the laptop\n\nThe U8400 was warming up, it was removed, after that an understated resistance was detected by PP5V_G3S, and that's where it started\n\nPP5V_G3S ground resistance at the time of detection is 120 ohms, nevertheless 5v is present and nothing but the PROCESSOR is heated (approximately 40 degrees)\n\nThe next day, the resistance of PP5V_G3S to the ground was 21 ohm\nAll capacitors were removed (according to BoardView), which according to PP5V_G3S were on the ground - the resistance remained 21 ohm\nRemoved all resistors, which goes PP5V_G3S also on BoardView\n\nR7100 removed, PP5V_COREVR_VCC - kilooms, PP5V_G3S_CPUREG_MISC - 21 ohm\nR7215 removed, PP5V_MAIN_VCORE1 - kilooms\n\nPP5V_G3S-ALSCAM - 21 ohm\n\nRemoved U3200, U3100, U7650 - resistance has not increased, still 21 ohm\n\nA voltage of 1 volt was applied to PP5V_G3S, consumption was 100mA, increased to 2.5 volts, consumption began to grow to 400mA, nothing was heated, 3 volts, consumption 700mA, Q7660 began to warm, was removed, nothing changed, L7670 was removed, P5VG3S_VSW - kOhm\nBut after connecting the LBP, the resistance of PP5V_G3S jumps to the ground between 180-230 ohm\n\nSubsequent connection of the LBP to PP5V_G3S does not give results, at 3-4 volts, consumption of 10mA\n\nI don't know which way to dig anymore and what kind of floating resistance is this\nI would be very grateful for any help"
    },
    {
        "post_id":86455,
        "thread_id":62355,
        "title":"A2159 (820-01598) PP5V_G3S understated resistance",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-02-18 04:24:55",
        "message":"First of all, welcome to the forum!\n\nDid you still get the power beep when started to dig on 5V_G3S?\n\nResistance to ground must be checked when board is cooled down.\nWe normally use diode mode; switch to ohm scale only for very low values.\n\nDid you check removing L8504 and U8500?\n\nMissing internal\/external video at same time, points to CPU graphics issue."
    },
    {
        "post_id":86460,
        "thread_id":62355,
        "title":"A2159 (820-01598) PP5V_G3S understated resistance",
        "user_id":35118,
        "username":"k_konstantin",
        "post_date":"2022-02-18 05:28:02",
        "message":"The problem was in U8110\n\nIt's all settled\n\nThank You"
    }
]