[
    {
        "post_id":47320,
        "thread_id":47320,
        "title":"820-2879-B Short on PPBUS_G3H",
        "user_id":2316,
        "username":"Naevius",
        "post_date":"2019-03-12 07:46:03",
        "message":"I have trouble finding the short on a 820-2879-B board. Resistance to ground on PPBUS_G3H is 11 ohm. I removed F7040, short is on the side of pin 2.\n\nA bit of (sugar-ish) liquid damage on U7500, C6960 and around R7400. Cleaned with IPA, but 11 ohm short remains.\nHave put 0.8V directly on PPBUS_G3H, takes about 0.37A. This 0.3W is too little heat to actually warm up the short I guess, since I can't find it with putting some IPA on certain components and actually feeling the heat. Not sure if I want to increase the voltage, since I know you can mess up the CPU while doing that.\n\nBefore randomly removing components directly connected to PPBUS_G3H, and tips on where to look for?"
    },
    {
        "post_id":47331,
        "thread_id":47320,
        "title":"820-2879-B Short on PPBUS_G3H",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-03-12 16:07:08",
        "message":"Check if any big coil gets sinilar value to ground.\nIf yes, remove corresponding high-side MOSFET and test again on PPBUS_G3H."
    },
    {
        "post_id":47436,
        "thread_id":47320,
        "title":"820-2879-B Short on PPBUS_G3H",
        "user_id":2316,
        "username":"Naevius",
        "post_date":"2019-03-14 16:53:06",
        "message":"Both coils measured double the value of the short, so seemed like short on CPU side. Removed L7401 and L7400, and short is on CPU side.\nRemoved several caps like C7420, C7423, C1242, C1243 to be sure it wasn't that, but short remains. The resistance value also get really low (< 2 ohm) when just slightly warming up the CPU. removed the heat pipe, no visible chipping.\n\nSo very likely internal short in the CPU, right?"
    },
    {
        "post_id":47437,
        "thread_id":47320,
        "title":"820-2879-B Short on PPBUS_G3H",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-03-14 17:30:29",
        "message":"So short from PPBUS_G3H is gone when CPU coils removed?\nThat means one (at least) high-side MOSFET is shorted.\nChange it (them) and try the board.\nCPU can be dead, but you don't lose anything trying..."
    },
    {
        "post_id":47529,
        "thread_id":47320,
        "title":"820-2879-B Short on PPBUS_G3H",
        "user_id":2316,
        "username":"Naevius",
        "post_date":"2019-03-16 23:47:53",
        "message":"Checked again, and short on PPBUS was still present. I guess I was too focused on the low resistance on the CPU side.\nI injected voltage on PPBUS again (with CPU coils still removed), now with 1.2V, which takes 2A. The GPU was getting hot. Verified by removing the heat sink, and the GPU its self is clearly warm.\n\nSo still a unrepairable board sadly."
    },
    {
        "post_id":47534,
        "thread_id":47320,
        "title":"820-2879-B Short on PPBUS_G3H",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-03-17 03:41:25",
        "message":"You should have high-side MOSFET burnt from other power supply too.\nCPU has more power rails, apart of VCORE.\nI told you to check ALL big coils..."
    }
]