{"post_id":8345,"thread_id":8345,"title":"[SOLVED]13\" Macbook Pro Retina - Early 2013.","user_id":517,"username":"vaswaniraj","post_date":"2016-10-20 14:59:20","message":"Hello,  I have received a macbook pro retina display - early 2013.  The problem with this macbook pro is that the trackpad is laggy.  The desktop loads very slow.  After a while the screen just moves from the desktop screen to the widget screen.  The computer stays on if on charger, but if unplugged, after a while would just shut down.  I cannot find the board number on the board.  What is that I need to check to fix this computer."}
{"post_id":8346,"thread_id":8345,"title":"[SOLVED]13\" Macbook Pro Retina - Early 2013.","user_id":7,"username":"Therealkilometers","post_date":"2016-10-20 15:04:59","message":"Its Probably a 820-3462 Board but find the board number to make sure. To fix the laggy part Run ASD and fix the failed sensors."}
{"post_id":8347,"thread_id":8345,"title":"[SOLVED]13\" Macbook Pro Retina - Early 2013.","user_id":1,"username":"larossmann","post_date":"2016-10-20 15:05:38","message":"Run ASD EFI version 3S162 and tell me if there are any sensor failures.  Also try with known good battery, it will run funny with a bad battery."}
{"post_id":8353,"thread_id":8345,"title":"[SOLVED]13\" Macbook Pro Retina - Early 2013.","user_id":517,"username":"vaswaniraj","post_date":"2016-10-20 16:21:45","message":"Louis, I shall open the board tonight and get you the feedback by tonight itself."}
{"post_id":8362,"thread_id":8345,"title":"[SOLVED]13\" Macbook Pro Retina - Early 2013.","user_id":1,"username":"larossmann","post_date":"2016-10-20 20:48:13","message":"Also you mentioned IC0R in chat, so check U5400 and tell me what it looks like."}
{"post_id":8494,"thread_id":8345,"title":"[SOLVED]13\" Macbook Pro Retina - Early 2013.","user_id":517,"username":"vaswaniraj","post_date":"2016-10-22 22:14:57","message":"Louis, I am still not able to locate the Board number on the board.  Is there anyway you can help me locate the same.  As I am unable to locate the board number, I am unable to follow your advice to check U5400."}
{"post_id":8496,"thread_id":8345,"title":"[SOLVED]13\" Macbook Pro Retina - Early 2013.","user_id":2,"username":"dukefawks","post_date":"2016-10-23 05:31:51","message":"It's a 820-3462. Use the 820-3536 schematic and board view. But first you need to run ASD 3S162 to check for errors."}
{"post_id":8501,"thread_id":8345,"title":"[SOLVED]13\" Macbook Pro Retina - Early 2013.","user_id":517,"username":"vaswaniraj","post_date":"2016-10-23 12:28:55","message":"Hi Duke,  I have downloaded ASD 3S162 via torrent, but I am unable to mount it on the external hard drive so that I can run it on the effected machine.  Please guide me, if I am doing anything wrong.  As I a aware of the Apple Hardware Test which is done by pressing the D key at startup, which I did and I get the sensor error IC0R: 10.996, but I am unable to run the ASD EFI.  Please guide."}
{"post_id":8502,"thread_id":8345,"title":"[SOLVED]13\" Macbook Pro Retina - Early 2013.","user_id":2,"username":"dukefawks","post_date":"2016-10-23 12:41:50","message":"First fix the IC0R problem, it will be corrosion in U5400 area."}
{"post_id":8503,"thread_id":8345,"title":"[SOLVED]13\" Macbook Pro Retina - Early 2013.","user_id":1,"username":"larossmann","post_date":"2016-10-23 13:10:45","message":"[QUOTE=\"vaswaniraj, post: 8494\"]Louis, I am still not able to locate the Board number on the board. Is there anyway you can help me locate the same. As I am unable to locate the board number, I am unable to follow your advice to check U5400.[\/QUOTE]\n\nI Can't help you find the number without knowing which board it is. Every board has the number on a different spot. If you tell me the board number, I can show you where to find it, but this becomes a chicken\/egg fallacy. Identifying boards is something you'll have to do before we can help you.\n\nEither way, just find U5400 as I said and fix what is wrong in that area."}
{"post_id":8504,"thread_id":8345,"title":"[SOLVED]13\" Macbook Pro Retina - Early 2013.","user_id":517,"username":"vaswaniraj","post_date":"2016-10-23 14:59:59","message":"Hi Louis,  There was a CA3E..... number on the logic board which I googled it and it showed up that it is a 820-3462.  I checked the U5400 area and nothing looks corroded.  Can you please advice further troubleshooting steps.  I know I am not good at this, but learning.  Please advice."}
{"post_id":8506,"thread_id":8345,"title":"[SOLVED]13\" Macbook Pro Retina - Early 2013.","user_id":2,"username":"dukefawks","post_date":"2016-10-23 15:27:43","message":"Run ASD! It comes with instructions on how to put it on a USB stick. Need to use a Mac of course."}
{"post_id":8508,"thread_id":8345,"title":"[SOLVED]13\" Macbook Pro Retina - Early 2013.","user_id":517,"username":"vaswaniraj","post_date":"2016-10-23 16:14:47","message":"Hi Duke \/ Louis, Can you guys send me some link to download the ASD EFI - 3S155 and 3S162."}
{"post_id":8510,"thread_id":8345,"title":"[SOLVED]13\" Macbook Pro Retina - Early 2013.","user_id":7,"username":"Therealkilometers","post_date":"2016-10-23 16:29:03","message":"[url]http:\/\/lmgtfy.com\/?q=asd+torrent[\/url]"}
{"post_id":8549,"thread_id":8345,"title":"[SOLVED]13\" Macbook Pro Retina - Early 2013.","user_id":517,"username":"vaswaniraj","post_date":"2016-10-24 14:59:45","message":"Hi,  As advised by Duke and Louis that I need to download the ASD and run it on the machine, but the problem is that download it taking for ever.  I was able to download ASD 3S162 but when I run it on the machine of Early 2013, it says it is not supported. I kept 3S155 to  download yesterday morning via torrent, and till this afternoon I only see a progress of unto 17%. Can anyone help me with a link where I can do a faster download and not via torrent.  Thanks in Advance."}
{"post_id":8597,"thread_id":8345,"title":"[SOLVED]13\" Macbook Pro Retina - Early 2013.","user_id":517,"username":"vaswaniraj","post_date":"2016-10-25 13:25:18","message":"Hi Duke and Louis,  As advised I ran the ASD 3S155 and here is the error I get \" Sensor - Current (IC0R) -- Computing (test 1) - Sensor Reads Within Operating Range - Voltage.\n- Check to ensure that sensor reads within operating range\nERROR - Sensor is reading above the high limit\n-T E S T  F A I L E D -"}
{"post_id":8602,"thread_id":8345,"title":"[SOLVED]13\" Macbook Pro Retina - Early 2013.","user_id":517,"username":"vaswaniraj","post_date":"2016-10-25 13:58:36","message":"Hi Guys,  I did the following as well.  As was recommended by Louis that a bad battery would also cause this problem, so I disconnected the battery and just boot the system on AC Adapter power.  Even after turning on the system on AC Adapter I get the same error of IC0R and I also run the ASD OS where I get the same error as \" Señsor reading above alarm point.\" As mentioned earlier that I even check u5400 and it does not show any corrosion.  Further help shall be highly appreciated.  Regards, Raj."}
{"post_id":8603,"thread_id":8345,"title":"[SOLVED]13\" Macbook Pro Retina - Early 2013.","user_id":1,"username":"larossmann","post_date":"2016-10-25 14:01:49","message":"Possibilities:\n\n1) Traces to\/from R5400 are broken\n2) U5400 is bad\n3) U5400 is not receiving 3.3v on pin 3\n4) R5409 is blown. \n5) C5409 is bad\n6) SMC is bad.\n\nI am guessing on 1, 2, 3, maybe 4, rarely 5, and I doubt 6. These are the only possible issues."}
{"post_id":8606,"thread_id":8345,"title":"[SOLVED]13\" Macbook Pro Retina - Early 2013.","user_id":517,"username":"vaswaniraj","post_date":"2016-10-25 14:55:50","message":"Hi Louis,  I did the following :\n\nChecked if U5400 was getting 3.3v on pin 3 and yes it was getting 3.3v - so does that still indicate that U5400 could be bad.\nSecondly I checked the area of R5409 which I see in there, but I observe one weird thing is that the R5369 that resistor is not to be seen on the board.\nAlso the Cap C4921 I see it is heavily corroded and looks like it is blown. \nWould any of the above observations be the cause of IC0R error.\nPlease advice."}
{"post_id":8608,"thread_id":8345,"title":"[SOLVED]13\" Macbook Pro Retina - Early 2013.","user_id":1,"username":"larossmann","post_date":"2016-10-25 15:35:29","message":"If you see a problem fix it. If you see a corroded cap replace it, if a resistor is missing put it on."}
{"post_id":8688,"thread_id":8345,"title":"[SOLVED]13\" Macbook Pro Retina - Early 2013.","user_id":517,"username":"vaswaniraj","post_date":"2016-10-26 18:57:08","message":"Hi Louis,  The computer is working absolutely fine.  I run the ASD Test and the sensor did not show up any error.  There is one situation that the trackpad does not click.  The tap works but the click does not.  Could it be the trackpad itself or something else.  Can you please advice. Thanks."}
{"post_id":8692,"thread_id":8345,"title":"[SOLVED]13\" Macbook Pro Retina - Early 2013.","user_id":517,"username":"vaswaniraj","post_date":"2016-10-26 20:38:06","message":"Hi Louis,  I watched one of your videos in which it is mentioned that the PICKB_L, if it has a low voltage than 3.3 then it is a problem, so I checked the PICKB_L and it is getting 3.3V.  Where are the other areas that I can troubleshoot or should I try changing the trackpad to see if it is the trackpad that is giving issues.  Please advice."}
{"post_id":8695,"thread_id":8345,"title":"[SOLVED]13\" Macbook Pro Retina - Early 2013.","user_id":36,"username":"aprendiz","post_date":"2016-10-26 22:08:17","message":"Just try another trackpad....."}
{"post_id":8709,"thread_id":8345,"title":"[SOLVED]13\" Macbook Pro Retina - Early 2013.","user_id":1,"username":"larossmann","post_date":"2016-10-27 00:17:49","message":"If the trackpad doesn't click, then try a different trackpad.\n\nI want you to do research on the socratic method and study it before coming back to another board!"}
{"post_id":8711,"thread_id":8345,"title":"[SOLVED]13\" Macbook Pro Retina - Early 2013.","user_id":2,"username":"dukefawks","post_date":"2016-10-27 00:59:47","message":"First check if PICKB_L goes low when you click the trackpad. If not then inspect the cable\/connector for corrosion. If that looks ok then replace trackpad."}
{"post_id":8778,"thread_id":8345,"title":"[SOLVED]13\" Macbook Pro Retina - Early 2013.","user_id":517,"username":"vaswaniraj","post_date":"2016-10-28 01:35:16","message":"Hi Louis \/ Duke and everyone in the forum.  The trackpad was changed and the computer worked absolutely fine.  CASE SOLVED.  Thank you everyone once again for all your support."}
