{"post_id":80276,"thread_id":61722,"title":"820-01700 - Charging issue after repair","user_id":427,"username":"overshoot","post_date":"2021-09-17 06:27:19","message":"Hi,\n\nI've got that MacBook Pro 16\" that came dead.\nWouldn't wake up from sleep.\n\nAfter first inspection, board would not start, was getting 20V but stuck at .04A floating.\nTried reviving\/restoring but got Error 6.\n\nAfter further inspection, I did find some signs of liquid on one edge of the board near U9580 and along that edge (this side only, other side was nice and clean)\nDecided to take U9580 out and found some crap under it.\nReplaced it but still wouldn't boot up.\nI did then try to revive the system and it worked, board booted up.\nHowever it's now not charging. It sees the battery but it won't charge it and if I unplug the charger it shuts right off.\n\nI've checked to see if I could have ripped off some parts but none from what I can tell.\nI have tested the board in another enclosure with a used battery and same thing.\nBattery could also be dead because I've left that case unused\/uncharged for 4 months but seems unlikely.\n\nI am wondering if T2 could be involved or if I just have to try diagnose the charging circuitry.\nAny idea?"}
{"post_id":80283,"thread_id":61722,"title":"820-01700 - Charging issue after repair","user_id":682,"username":"2informaticos","post_date":"2021-09-17 07:31:19","message":"macOS reports the battery percentage?\n\nYou should try with known good battery.\nThe other used battery was tested with other board?"}
{"post_id":80335,"thread_id":61722,"title":"820-01700 - Charging issue after repair","user_id":427,"username":"overshoot","post_date":"2021-09-18 03:24:06","message":"yes it was reporting percentage.\n\nI've tried with a new battery and it's working.\nWondering how come those dies like that, in a such period of time?!\n\nMy battery was working 3-4 months ago, board was dead (shorted NAND), customer didn't want to replace the board, sold me the Mac for parts.\n\nIn this case, customer's battery was also working he told me and so 4 days later it's already dead.\n\nThere's no way to try and charge them at 5V somehow to revive them?"}
{"post_id":80336,"thread_id":61722,"title":"820-01700 - Charging issue after repair","user_id":682,"username":"2informaticos","post_date":"2021-09-18 04:36:36","message":"The battery has an internal BMS.\nTo charge it, need to talk with its embedded processor."}
