[
    {
        "post_id":34564,
        "thread_id":34564,
        "title":"820-00165, ppvrtc_g3h 2.76v.",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2018-05-08 12:28:27",
        "message":"Seen this problem a few times, never solved it. Figured it was an issue with the CPU or something, but: working on an 820-00165 board that has vrtc_g3h at 2.7v. Replacing clock did nothing, and board is clean as a whistle. No liquid, no drop, etc. Might try a different BIOS just to see, but wouldn't think the BIOS would affect vrtc. \n\nAny ideas? Board powers on fine, CPU gets appropriately warm, but no chime. VCore is present. PPVRTC_G3H seems to be the only signal that's not present properly. Any tips or help appreciated--thanks!"
    },
    {
        "post_id":34591,
        "thread_id":34564,
        "title":"820-00165, ppvrtc_g3h 2.76v.",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2018-05-09 10:50:56",
        "message":"Well, this is embarrassing. \n\nTurns out my multimeter was fucked. Realized when all my 3.42v rails were reading as 2.7v....but my ppbus was still reading as 8.56v somehow. Checked several boards, and all 3v42 rails showing at 2.7v. Odd. Replaced battery, no change. Found a bracket for one of the fuses had broken and wasn't making good contact...then meter stopped powering on altogether. Picked up a cheap-o until the new fluke arrives, and all seems well.\n\nBoard still not working, so will re-evaluate and post an update later today. Sorry for the confusion."
    },
    {
        "post_id":34614,
        "thread_id":34564,
        "title":"820-00165, ppvrtc_g3h 2.76v.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-05-09 13:28:04",
        "message":"Why would you even suspect PPVRTC if it is powering on? CPU Vcore present? Could be corrupt BIOS."
    },
    {
        "post_id":34624,
        "thread_id":34564,
        "title":"820-00165, ppvrtc_g3h 2.76v.",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2018-05-09 14:49:02",
        "message":"Hey duke. Getting the odd reading (before I realized it was an equipment issue) led me to suspect it. I get your point, but it was an odd circumstance. I've had boards in the past (00165) that did the fan on\/off\/on\/off and it turned out to be the clock, so I guess I was hopeful. \n\nTried a new BIOS and no dice; vcore is present on the board (1.8v), but a mouse does not light up. All_sys_pwrgd present as well. Checked board well for damaged\/missing components or any evidence of liquid, but no luck."
    },
    {
        "post_id":34628,
        "thread_id":34564,
        "title":"820-00165, ppvrtc_g3h 2.76v.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-05-09 16:45:57",
        "message":"Yeah, if this was a random out of the blue failure this is not going to be fixed. Unless there is history this one is RIP."
    },
    {
        "post_id":34629,
        "thread_id":34564,
        "title":"820-00165, ppvrtc_g3h 2.76v.",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2018-05-09 16:46:52",
        "message":"Thanks, Duke. That's what I figured. I've seen DDRMEM issues that had this behavior, but everything checks out fine there. Going to not waste time and swap it out--thanks, Duke!"
    },
    {
        "post_id":34631,
        "thread_id":34564,
        "title":"820-00165, ppvrtc_g3h 2.76v.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-05-09 16:49:51",
        "message":"It could be bad RAM, but to find that out you'd have to put too much time into it. The time to success ratio is just not good for cases like this."
    }
]