{"post_id":76681,"thread_id":61322,"title":"820-00244 no display","user_id":27167,"username":"drmacbookth","post_date":"2021-06-16 06:54:54","message":"Hello, we have an 820-00244 that came in for battery replacement. After the battery was replaced, we have a black display. We have tried a known working display and same situation. Display completely black, so its not no backlight. I checked, we have 5V (C8512)  for a second and then drops to 0v, and 0.144v on Backlight IC (C8500). Pin 23 from LCD connector 0v. Any idea what can cause this. I connect to external display and that works. Also noticed KBD not working (worked before). Could it be related to i.e. a damaged keyboard flex cable? Will try another cable tomorrow as first I am backing up the data from this pile of trash."}
{"post_id":76682,"thread_id":61322,"title":"820-00244 no display","user_id":682,"username":"2informaticos","post_date":"2021-06-16 07:06:07","message":"Check SMC_LID signal.\nIncorrect level will disbale internal image and TP\/KB."}
{"post_id":76684,"thread_id":61322,"title":"820-00244 no display","user_id":27167,"username":"drmacbookth","post_date":"2021-06-16 08:02:00","message":"OK thanks will report back tomorrow."}
{"post_id":76713,"thread_id":61322,"title":"820-00244 no display","user_id":27167,"username":"drmacbookth","post_date":"2021-06-16 23:03:08","message":"SMC_LID = 3.2v\n\nSome more info. I checked with another board and this display and it works. When I connect the non working board I did find EDP_BKLT_EN = 0v on the working board it is present. The issue is not no backlight though, as I have no image at all. Also when I connect to external display, keyboard did not work, but Trackpad I can feel clicking."}
{"post_id":76716,"thread_id":61322,"title":"820-00244 no display","user_id":682,"username":"2informaticos","post_date":"2021-06-17 01:47:25","message":"Same TP\/KB work with the other board?\n\nBacklight is the last to appear; image must come first.\nYou may have no backlight issue at all; find why there is no image.\n\nCheck if both 3V3\/5V_S0SW_LCD appear at J8500 in the first seconds (when chime).\nIf yes, DP_INT_HPD should come high at same time."}
