{"post_id":61900,"thread_id":59607,"title":"820-00840 Missing SSD EN","user_id":1912,"username":"Vertx","post_date":"2020-07-05 12:38:10","message":"Hello!,\nGot this 820-00840 which had damaged SSD connector and few knocked off caps around it. Replaced SSD connector, turned on and off few times to test it and it was booting all fine, so decided to test fully with connected trackpad keyboard and speakers, after putting board back to housing it was coming on with question mark again.. And on top of that when i tried to boot to mac os x pendrive smoked (but not sure if the problem is new USB C to USB Adapter).\nSSD_PWR_EN_L Missing\nR8640 - 68K instead of 100K\nR8645 - 20K instead of 100K\nR8620 - 94K instead of 470K\nAll caps connecting with U8640 looks good.\n\nAny ideas where to have a look? :rolleyes:. As always appreciate any help!"}
{"post_id":61905,"thread_id":59607,"title":"820-00840 Missing SSD EN","user_id":682,"username":"2informaticos","post_date":"2020-07-05 17:05:28","message":"If smoke, should keft some sign; if was on the board.\nDoes the board still work now?\nDid you try again to boot through USB?\n\nHigh value resistors will show lower value measured onboard."}
{"post_id":61907,"thread_id":59607,"title":"820-00840 Missing SSD EN","user_id":1912,"username":"Vertx","post_date":"2020-07-05 17:24:56","message":"Board still works\/boots to usb only not ssd - question mark.  Flash drive burned down. Still on this board I think values of resistors are too low as on working board as checked they go up to 100k and that one R8620 over 400K, any ideas why on this one  values are so low?, what could I check, please?"}
{"post_id":61911,"thread_id":59607,"title":"820-00840 Missing SSD EN","user_id":682,"username":"2informaticos","post_date":"2020-07-05 17:51:54","message":"R8620 appears to be not mounted in my schematic; your board could be different revision.\nHowever, big differences comparing with good board, can point to damage on SSD area.\nChange U8640.\n\nBTW, did you compare diode mode readings between boards w\/ and w\/o SSD inserted?\nAlso switch the SSDs between boards."}
{"post_id":61938,"thread_id":59607,"title":"820-00840 Missing SSD EN","user_id":1912,"username":"Vertx","post_date":"2020-07-06 13:56:30","message":"Replaced U8640, values on resistors way better now, found out that when usb flash drive burned down, ssd got damaged as well, tried to boot only to usb without ssd and board burned another one usb flash drive. SSD issue looks like resolved, but can't understand why is it burning all usb accesories?, Nothing happens to charging cable though  :rolleyes: ."}
{"post_id":61939,"thread_id":59607,"title":"820-00840 Missing SSD EN","user_id":682,"username":"2informaticos","post_date":"2020-07-06 14:26:15","message":"What kind of USB-C hub used?\nDid you try another?\nUSB flash drive got burnt when charger was connected too?"}
{"post_id":61941,"thread_id":59607,"title":"820-00840 Missing SSD EN","user_id":1912,"username":"Vertx","post_date":"2020-07-06 14:32:43","message":"Used this one [URL]https:\/\/www.amazon.co.uk\/gp\/product\/B015Z7XE0A\/ref=ppx_yo_dt_b_asin_title_o03_s00?ie=UTF8&psc=1[\/URL]. But usb c adapter works still fine, board kills whatever is connected to it and has IC's (maybe instead of 5V it gives all around 20V?). Yes, I tried another one usb c adapter and different flash drive, same results (another one burned flash drive). Looks like It also kills ssd's connected to board. Used only charger to power on machine."}
{"post_id":61944,"thread_id":59607,"title":"820-00840 Missing SSD EN","user_id":682,"username":"2informaticos","post_date":"2020-07-06 15:30:32","message":"Check if your input MOSFETs are not shorted IN-OUT (Q3100\/200)."}
{"post_id":61951,"thread_id":59607,"title":"820-00840 Missing SSD EN","user_id":1912,"username":"Vertx","post_date":"2020-07-06 20:28:08","message":"Thank you!, problem was in mosfets, replaced, stopped killing pen drives finally, boots to external devices, but unfortunately still can't boot to ssd.. Checked Compared U8640 pins to good board so only difference i found is between pin6 ssd_pwr_en_conn_L 108K (bad board) = 2.300K (good board).\nAlso in every board i could find R8645 resistance was 90-100K on mine one only 20.70K. On diode mode U8640  pin6 = 0.475 (bad one)     0.668    (good one). Replaced already R8620, C8671, C8670, C8673, C8674, R8641. Could it be that ssd slot itself damaged again when mofsets were failing as it killed one ssd already?"}
{"post_id":61962,"thread_id":59607,"title":"820-00840 Missing SSD EN","user_id":682,"username":"2informaticos","post_date":"2020-07-07 03:27:45","message":"Input MOSFETs are not related with SSD in anyway.\nThat higher ohm value on SSD_PWR_EN_CONN_L can be sign of bad solder at U8640.\nStrange to get lower value in diode mode.\nChange U8640 again.\nBe sure R8640\/45 have correct values, measured out of board."}
{"post_id":62068,"thread_id":59607,"title":"820-00840 Missing SSD EN","user_id":1912,"username":"Vertx","post_date":"2020-07-08 16:22:28","message":"All problems sorted, just need to fit new keyboard and will be as good as new. Finally found out that some of this model boards does not suppose to have U8640, R8640,  R8645, R8637 mounted, so removed these and finally machine boots to SSD!, Thank you  2informaticos for your guidance and time, really appreciate it!"}
