[
    {
        "post_id":52012,
        "thread_id":52012,
        "title":"iMac video card",
        "user_id":9161,
        "username":"DoctorDesktop",
        "post_date":"2019-09-05 08:14:37",
        "message":"Hello new subscriber here! My name is Mark Rudisill from Martinsburg WV. Owner of Doctor Desktop,LLC.  I've been in the computer repair business for 19 years and have, in the last 5 years or so gotten into board level repair. Also iPhone repair, mostly parts changing so far. I'm new to BGA level board repair. I have acquired a microscope, ZXW, hot air, FM-203 with hot tweezers. I have done some jumper type soldering and other SMD type repairs, I just haven't tried to do a ball type chip yet.  My question is about an iMac A1311 black screen, fans running normal, diagnosis. I have seen Louis's YouTube video about the bad video chips on the Macbook boards. So I used the hot air and heated the video chip on this card to 120-150 c for about 5 minutes to test the chip theory on this video card. And sure enough it worked. So not the solder, but the junk chip. So now my question is the best solution for the customer. are there good replacement chips for these cards, or are there good replacement video cards for this machine, I'm guessing that a used card will do the same thing eventually, or should the customer replace the machine"
    },
    {
        "post_id":52145,
        "thread_id":52012,
        "title":"iMac video card",
        "user_id":9161,
        "username":"DoctorDesktop",
        "post_date":"2019-09-09 18:59:32",
        "message":"After 21 views No one has an opinion yet. I realize that its an iMac, But I figured I would get at least some opinions!!"
    },
    {
        "post_id":52148,
        "thread_id":52012,
        "title":"iMac video card",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-09-10 01:47:33",
        "message":"No idea even what GPU you have there.\nBut as always, be aware if buy \"new\" chips from China.\nIf you get second-hand card with some warranty, should be good option."
    },
    {
        "post_id":52151,
        "thread_id":52012,
        "title":"iMac video card",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-09-10 07:04:27",
        "message":"It's an old iMac that probably is not worth wasting time on...unless you can source a reliable card like 2informaticos suggested, it's going to be a waste of time."
    }
]