{"post_id":88909,"thread_id":62641,"title":"820-01958 Need parts.","user_id":37056,"username":"Zebulon","post_date":"2022-04-27 20:37:52","message":"Hi! I need some parts for a 820-01958 and don't really want to buy a dead boat just to harvest the parts I need. I can't seem to find the parts on Mouser or Digikey, but maybe the replacement just will not look the same. I need these parts ... L7210, L7220, L7230, L7400, U7210, U7220, U7230. I picked up this 2020 MacBook Air and after checking it out it looks like someone was working on it in this area and broke these components. Maybe the MacBook is cooked, but I want to replace the parts and see."}
{"post_id":88910,"thread_id":62641,"title":"820-01958 Need parts.","user_id":682,"username":"2informaticos","post_date":"2022-04-28 02:59:10","message":"Need to have scrap boards in stock.\nI don't see other way to get the coils.\nApple also uses lot of proprietary chips, which are not available new from manufacturer.\nHowever, T2 and M1 scrap boards are not cheap.\n\nMentioned components are parts of CPU power supplies.\nI don't recommend to waste time on this board.\nKeep it as scrap for other repairs."}
{"post_id":88914,"thread_id":62641,"title":"820-01958 Need parts.","user_id":37056,"username":"Zebulon","post_date":"2022-04-28 07:53:23","message":"The reason I am hopeful for this board is that it seems to have activity. Not sure if that activity is coming from the T2 and it's bridge OS or if it is a sign of something more, but it gets trackpad click and I can see the machine in configurator. Was even able to successfully revive it according to the host Mac, but I don't see an image. even on external display. Strange, or perhaps not, when the power cord is plugged in it give me the chime that it's connected. Almost seems like it's booted, but no image. Like I say, maybe that just due to the T2 chip and Bridge OS though?"}
{"post_id":88915,"thread_id":62641,"title":"820-01958 Need parts.","user_id":682,"username":"2informaticos","post_date":"2022-04-28 09:25:08","message":"Machine can be detected in DFU, without working CPU; it only needs SLPS2R and AWAKE voltages.\nAlso, trackpad force feedback is not a sign for working machine; is just a hardware response from actuator coils.\n\nHow can you expect image from a board where CPU coils are not present???\nI bet CPU is fried..."}
{"post_id":88920,"thread_id":62641,"title":"820-01958 Need parts.","user_id":37056,"username":"Zebulon","post_date":"2022-04-28 13:38:50","message":"Ok, that's what I was wondering about with DFU and trackpad. However, because the damage to the components looks to be caused by someone who attempted to repair the board, I'm going to keep trying to get it working. The components are not missing, but a few that I named have chips or cracks in them, so who knows. Maybe I'm wasting my time, but in this case, I'm not in a rush. :)"}
{"post_id":88923,"thread_id":62641,"title":"820-01958 Need parts.","user_id":682,"username":"2informaticos","post_date":"2022-04-28 15:39:41","message":"Do you get voltage at L7210?"}
{"post_id":88924,"thread_id":62641,"title":"820-01958 Need parts.","user_id":37056,"username":"Zebulon","post_date":"2022-04-28 15:49:19","message":"I will do that and get back to you! Thanks!"}
{"post_id":88969,"thread_id":62641,"title":"820-01958 Need parts.","user_id":1057,"username":"piernov","post_date":"2022-05-01 07:17:09","message":"FIrst thing is to check CPU VCore resistance to ground. CPU likely shorted if the previous owner messed with CPU VCore circuit."}
{"post_id":88979,"thread_id":62641,"title":"820-01958 Need parts.","user_id":37056,"username":"Zebulon","post_date":"2022-05-01 21:49:56","message":"I will also do this and get back to you. Hope to get it back on the bench Tuesday."}
