[
    {
        "post_id":73717,
        "thread_id":60990,
        "title":"820-3536 PPBUS_S5_HS_COMPUTING is shorted",
        "user_id":30458,
        "username":"sammobile",
        "post_date":"2021-03-30 14:27:46",
        "message":"Hi guys, I am not expert in Mac repair. Please help me find the solution.\nMacbook came with some corrosion water. No power no fan green then orange cable when the charger is plugged. \nPPBUS-S5-HS-COMPYTING is shorted ground. As I attached under q7630 there is a problem. \nI took these components to see if I could find the shorted part.\nc7622\nc7624\nr7202\nr5400\nq7430\nq7630\nq7310\nc7619\nl7630\nBut no lock still shorted. Except that area that I attached components seems fine without any issue or water damaging under the microscope."
    },
    {
        "post_id":73719,
        "thread_id":60990,
        "title":"820-3536 PPBUS_S5_HS_COMPUTING is shorted",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-03-30 14:30:55",
        "message":"First of all, welcome to the forum!\n\nPost the exact ohm resistance of that short.\nCompare with all big coils to ground."
    },
    {
        "post_id":73720,
        "thread_id":60990,
        "title":"820-3536 PPBUS_S5_HS_COMPUTING is shorted",
        "user_id":30458,
        "username":"sammobile",
        "post_date":"2021-03-30 14:36:53",
        "message":"Thanks.\nI didn't get, sorry. You mean I took off the components again from the board then measure the ohm.\nCould you please explain more?"
    },
    {
        "post_id":73728,
        "thread_id":60990,
        "title":"820-3536 PPBUS_S5_HS_COMPUTING is shorted",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-03-30 15:41:09",
        "message":"You've said to have short to ground.\n0 ohm, 10 ohm, how much???\nCompare that value with resistance to ground on all big coils.\nNo need to remove anything (yet)."
    },
    {
        "post_id":73729,
        "thread_id":60990,
        "title":"820-3536 PPBUS_S5_HS_COMPUTING is shorted",
        "user_id":30458,
        "username":"sammobile",
        "post_date":"2021-03-30 15:50:14",
        "message":"It shows 0.03 ohm compare to other big coils It is same amount.0.02 or 0.03"
    },
    {
        "post_id":73731,
        "thread_id":60990,
        "title":"820-3536 PPBUS_S5_HS_COMPUTING is shorted",
        "user_id":30458,
        "username":"sammobile",
        "post_date":"2021-03-30 16:04:33",
        "message":"Bad news. I found ppbus-g3h and ppvbat g3h chgr reg is also shorted. :cautious:"
    },
    {
        "post_id":73735,
        "thread_id":60990,
        "title":"820-3536 PPBUS_S5_HS_COMPUTING is shorted",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-03-30 17:11:00",
        "message":"I hope you've disconnected power from the board, before measuring in diode mode.\nIn fact allow 10-15s, to discharge any remanent voltage.\n\nI was talking to compare with ohm resistance to ground on big coils.\nYou cannot get 0 ohm on all of them...\n\nI specified OHM value, not diode mode.\nI doubt you can get 0.03 ohm, nor even in ohm scale; multimeter probes give aprox 0.3 ohm already."
    },
    {
        "post_id":73774,
        "thread_id":60990,
        "title":"820-3536 PPBUS_S5_HS_COMPUTING is shorted",
        "user_id":30458,
        "username":"sammobile",
        "post_date":"2021-03-31 11:12:09",
        "message":"No, the power was disconnected. I was just testing board without connecting to power.\nI know I look stupid and very amateur but really want to solve it. Yes I tested on diode mode yesterday.\nCould you please tell me in which range ohm of multimeters should I test?\nAlso, I found out PPBUS-GH3 and PPVBAT-GH3-CHRG-REG were shorted as well. After I took F7140 off of board, the other way which is PPVBAT-GH3-CHRG-REG returned to normal and not shorted. So still PPBUS-GH3 and ppbus_s5_HS_COMPUTING are shorted to ground."
    },
    {
        "post_id":73778,
        "thread_id":60990,
        "title":"820-3536 PPBUS_S5_HS_COMPUTING is shorted",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-03-31 14:10:53",
        "message":"Actual multimeters are all auto-range.\nIf not, choose 200 ohm scale."
    },
    {
        "post_id":73784,
        "thread_id":60990,
        "title":"820-3536 PPBUS_S5_HS_COMPUTING is shorted",
        "user_id":30458,
        "username":"sammobile",
        "post_date":"2021-03-31 15:14:01",
        "message":"Most of the big coils are shorted for example:\nc7543\nc7540\nc7542\nc7580\nc7314\nc7313\nc7324\nI can not compare because all are shorted. I get 1.8 ohm on all of them. Only one c1031 I get 63.1 ohm\nI confused."
    },
    {
        "post_id":73785,
        "thread_id":60990,
        "title":"820-3536 PPBUS_S5_HS_COMPUTING is shorted",
        "user_id":30458,
        "username":"sammobile",
        "post_date":"2021-03-31 15:44:50",
        "message":"Update\nI took off these components to check the board. L7130  I have shorted ground on pin2 of l7130. Also, r7150 only pin2 is shorted. F7700 PIN1 is shorted , pin2 is normal.\nAm I wasting time with this way of testing?"
    },
    {
        "post_id":73793,
        "thread_id":60990,
        "title":"820-3536 PPBUS_S5_HS_COMPUTING is shorted",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-04-01 00:54:36",
        "message":"You waste time if you do not want to post short values, as already asked.\nIf you only mention several components connected to the same rail, what you see intersting?\n\nYou can consider short some low values, as 5-20 ohms, which can be good values, depending where you measured.\nIs IMPOSSIBLE to get short on all big coils to ground!!!\n\nCan you post again accurate ohm value to ground measured at PPBUS_G3H?\nR5400 is an easy to access test point.\n\nThen post EXACT resistance to ground at L7310\/20, L7430, etc ."
    },
    {
        "post_id":73844,
        "thread_id":60990,
        "title":"820-3536 PPBUS_S5_HS_COMPUTING is shorted",
        "user_id":30458,
        "username":"sammobile",
        "post_date":"2021-04-01 14:18:51",
        "message":"R5400 all pins shows 1.9-2.1 ohm.\nL7310: 59.5 OHM\nL7320: 59.5 OHM\nR5510: 270 OHM\nR7310\/R7320: 65 OHM\nC7440\/1\/2   L7430 : 270 OHM\nL7520 :1270 OHM\nL7560: 7.76k on 20K OHM\nC4696\/C3387\/C3287 7.7 K OHM not fixed range.\n\nand ground pin on others like c7740\/1\/2 is 0.08 ohm\nThanks for following"
    },
    {
        "post_id":73845,
        "thread_id":60990,
        "title":"820-3536 PPBUS_S5_HS_COMPUTING is shorted",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-04-01 14:41:24",
        "message":"\"and ground pin on others\"\nDo you mean that you'ne measured ground to ground???\nBe serious man.\nDo not post more than we need here...\n\nIf no big coil has the same resistance to ground like PPBUS_G3H, then you are safe to inject voltage.\nStart injecting with 1V and slowly go uo, if needed (at R5400, for example).\nSet first amp limit to max on your lab PSU.\nThen check with your fingers where the board heats.\nShould be some cpacitor shorted, on PPBUS_G3H power rail."
    },
    {
        "post_id":73847,
        "thread_id":60990,
        "title":"820-3536 PPBUS_S5_HS_COMPUTING is shorted",
        "user_id":30458,
        "username":"sammobile",
        "post_date":"2021-04-01 15:51:07",
        "message":"I connected the power as you told me to the battery connector also r5400 from 1v to 2.5v. The only part got heat q7630 under the IC a layer of the board was pilled off I took it with cutter. See the picture. Also, c7619 I took it off. But the place under Q7630 when I connect to power is burning smoking. Nothing gets hot on PPBUS_G3H power rail."
    },
    {
        "post_id":73848,
        "thread_id":60990,
        "title":"820-3536 PPBUS_S5_HS_COMPUTING is shorted",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-04-01 16:09:01",
        "message":"You've probably fried the board now.\n\nI don't really understand what you did.\nI said to conect lab PSU to R5400; starting with 1V.\nWho said something about battery connector???\n\nDon't tell me thay you powered up the board with battery (or charger) and also inject voltage with lab PSU to R5400.\n\nYou didn't report any short to ground at L7630 before.\nProbably killed the CPU now..."
    },
    {
        "post_id":73849,
        "thread_id":60990,
        "title":"820-3536 PPBUS_S5_HS_COMPUTING is shorted",
        "user_id":30458,
        "username":"sammobile",
        "post_date":"2021-04-01 17:04:34",
        "message":"I understand. Check my first post I reported PPBUS_s5_hs_computing rail is shorted. Also I reported L7630 is shorted. \nAt the first view when I saw the motherboard found out the Q7630 was defective. I posted the picture first post. Under the IC a top layer was ripped and was peeled off half.\nI connected positive hub of power supply to r5400 and negative hub to ground started 1v then went to 2v same area started smoking."
    },
    {
        "post_id":73851,
        "thread_id":60990,
        "title":"820-3536 PPBUS_S5_HS_COMPUTING is shorted",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-04-01 17:46:32",
        "message":"I asked you several times to post exact ohm value of that short.\nIn the first post you mentioned lot of components, but didn't post exact values.\n\nI asked lot of rimes to compare short value on PPBUS_G3H with ALL big coils; never got an exact reply.\nIf Q7630 was the reason for shorting PPBUS_G3H to L7630, then I didn't expect to still have short on PPBUS_G3H, once Q7630 was removed.\nUnless you have a short between copper layers, under Q7630.\nAnd that is a big problem; not sure if you can properly clean that area and resolder the MOSFET correctly.\n\nHowever, if you lift L7630 and get short to ground on its pad 2 (R7640), then CPU is dead; do not waste more time on this board."
    },
    {
        "post_id":73913,
        "thread_id":60990,
        "title":"820-3536 PPBUS_S5_HS_COMPUTING is shorted",
        "user_id":30458,
        "username":"sammobile",
        "post_date":"2021-04-03 13:38:09",
        "message":"Sorry for delay here was holiday.\nYes you are right. I had a shorted ground under Q7630. I shaved the surface then short gone. So I don't have shorted on PPBUS-G3H and PPBUS-S5-HS-COMPUTING anymore but yes I have short under l7630 pin2 and r7640 pin1.\nI am a cellphone technician recently I am trying to learn and fix computers as well, so I am an amateur. Thanks for helping me."
    }
]