{"post_id":11297,"thread_id":11297,"title":"[SOLVED]820-2532 EFI Temp errors above limit","user_id":296,"username":"jadao","post_date":"2016-12-14 13:21:38","message":"This machine had been given to me and sitting there for few months, it had 0.33V on 1.05V MCP S5 rail. I replaced C7771 and all went good. Chimes and boot ok no lag no heat. No water damage, this board is intact.\n\nI decided to run EFI just for the heck of it and found these 3 Temp errors all reading above high limit according to hardware profile:\n\nTemp (TG1H) - Left Heat pipe \/ Fin Stack Proximity Temp (test 1) \/ Range [15-80]°C \/ Reading reported 128.000°C\nTemp (TN0D) - CPU Vcore voltage (test 1) \/ Range [15-100]°C \/ Reading reported 128.000°C\nTemp (TN0P) - MCP Proximity (test 1) \/ Range [15-75]°C \/ Reading reported 128.000°C\n\nThey all report the same 128.000°C value, should I look only to U5550 and U5500?"}
{"post_id":11304,"thread_id":11297,"title":"[SOLVED]820-2532 EFI Temp errors above limit","user_id":2,"username":"dukefawks","post_date":"2016-12-14 15:52:10","message":"I bet J5502 is not connected or damaged."}
{"post_id":11366,"thread_id":11297,"title":"[SOLVED]820-2532 EFI Temp errors above limit","user_id":296,"username":"jadao","post_date":"2016-12-15 15:30:29","message":"I wish it could be only this but unfortunately connector is intact (checked continuity between connector's pins and board's pads) and cable is  well connected.\n\nI have in diode mode 0.715 for both pins on J5502, no short between pins and same values with or without connector plugged in...\n\nChecked also the thermal sense circuit sticked underneath the heatsync and looks good no corrosion still protected under a sillicon shit.\n\nI don't have another 15 or 17 inches core2duo to try another heatsync :(\nI tried to run EFI without J5502 connected and got same three errors...\nI tried to disconnect ALS and run again EFI just in case because it seems to share the SMBus with MCPTHMSNS...but no difference still same errors.\n\nI am thinking swapping U5550 or U5500 with U5570 to see if any diference...\n\nWhat do you think? any thoughts?\nThanks"}
{"post_id":11373,"thread_id":11297,"title":"[SOLVED]820-2532 EFI Temp errors above limit","user_id":2,"username":"dukefawks","post_date":"2016-12-15 16:02:00","message":"First see if it is receiving 3V on pin 1. Then pull it and see if ASD now reports an IO error on those sensors and no over temp. Then it is possible the chip is just bad."}
{"post_id":11463,"thread_id":11297,"title":"[SOLVED]820-2532 EFI Temp errors above limit","user_id":296,"username":"jadao","post_date":"2016-12-16 14:26:12","message":"3V was present on pin 1 of u5550 and u5500.\nI removed suspected U5500 and noticed no change, still 3 same errors TG1H TN0D TN0P. So I made assumption the chip is bad or the heatsync sensor bad or both.\nI decide to removed U5550 and noticed 3 new errors TG0H TG0P TG0T So I made assumption this chip is good.\nLet's swap those chips and see what happen: No more errors!\n\nHappy it's fixed but this makes no sense to me :) maybe something to do with the heatsync when I removed it to check the little sensing circuit underneath...\n\nThanks Duke you can please mark this one solved!"}
