[
    {
        "post_id":55794,
        "thread_id":55794,
        "title":"820-3332 - GPU Buck converter fix gone bad :(",
        "user_id":21537,
        "username":"goldcoastmick",
        "post_date":"2020-01-15 03:16:03",
        "message":"Hi guys!\n\nStill new to this but please bare with me. As per the forum rules I am thick skinned and here to learn and i'll be on the forum a lot I expect so please feel free to tell me if i've been a dick and done something stupid (preferably followed by some helpful guidance on how to fix said stupid act...). I will respond in kind by the way so be prepared!\n\nAlrighty, so today we have... A MacBook!\n\n15? MacBook Pro Retina 2012 exhibiting intermittent no video issues.\n\nNot my first rodeo so thought i'll just do quick U8900 touch up with the assistance of some nice Amtec flux (oh thanks Louis by the way, I DIDN'T WAIT and I BOUGHT NOW! the crap I was using previously from Jaycar in Australia was terrible! Vaseline would have been more effective...) and be on on my way....\n\nAnyway, following my very gentle touch up and reflow of the surrounding area, a quick dip in the ultrasonic spa and an hour in the tanning bed, my board returned with a suprise gift....\n\nNo Fan Spin! ?\n\nThe only \"mistake\" I made (that i'm aware of) was an accidental bumped resistor, R8940 (which launched itself across the room somewhere where it will remain for eternity...). I didnt have a 147K in my component book (thanks Louis again, the component folders are awesome... usually) so I used a 150K. Eventually swapped it back for a 147K from a donor board with no improvement in my situation. That had sounded stupid to me (the apparent minor difference in resistance couldnt possible be my issue?!) but it is a 1% tolerance resistor which would be 147+-1,470ohms... So my 150K would be well outside, particularly if it was at the higher end of its tolerence by pure luck (guaranteed right, murphys law)... but it seemed so small! 147 vs 150, cmon?! I may have forgotton the K.... Anyways... this Resistor is the RBIAS line of the U8900... What is RBIAS? I'm guessing maybe I need it... Sigh.\n\nSoooo in summary here's where i'm at...\n\n\nIntermittent no video output issues. Suspected U8900 dry joints\n[LIST]\n[*]Fluxed & Resoldered U8900 and surrounding components.\n[*]Accidentally bumped off R8940 (147K). Replaced with 150K from component book. Ultrasonic cleaned. No fan spin :(\n[*]Replaced R8940 with 147K from donor board (why not). No fan spin?\n[*]Missing S4 power rails (stuck in S5 state).\n[*]Missing Enable1 (P5VS4_EN) on U7201. Traced it backwards to U7970 logic gate (74LVC1G32). No P5V3V3_S4_EN on pin 4 of gate.\n[*]PP3v3_S5 on pin 6 of U7201 is happy so I have VCC (according to spec sheet)\n[*]I have no PM_SLEEP_S5_L on pin 2 OR SMC_WAKESRC_EN on pin 1... So as per highschool math 0 OR 0 = 0 :(\n[LIST]\n[*]PM_SLEEP_S5_L comes from what i'm guessing used to be the Psomething (PMIC?) or M something that louis always talks about that now appears to be part of the U8100 which I hope to god doesn't need reballing\/replacing\n[*]SMC_WAKESRC_EN appears to come from U4900 which looks suspiciously like an SMC chip which I also don't fancy replacing...\n[\/LIST]\n[*]So basically I'm hoping that i went off track somewhere up there around U7201 and that my fault lies BEFORE that and that i'm totally on the wrong track... Because otherwise it would appear I may have to reball some nasty looking shit?\n[\/LIST] Oh wow, long post, sorry, got over excited.\n\n:)"
    },
    {
        "post_id":55800,
        "thread_id":55794,
        "title":"820-3332 - GPU Buck converter fix gone bad :(",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-01-15 07:05:03",
        "message":"Welcome to the forum.\n\nI didn't see any mention about liquid signs.\nWhy did you put in ultrasonic bath then?\nBe aware, incorrect use of ultrasound can generate more damage than initial fault; especially if no sweep function used.\n\nYou can have now more knocked off components, or broken traces; because of hot spots if no sweep US available.\nPost first resistance to ground (ohm scale) on all big coils.\nTrigger SMC_ONOFF_L and check for voltage pulse at all them."
    },
    {
        "post_id":55811,
        "thread_id":55794,
        "title":"820-3332 - GPU Buck converter fix gone bad :(",
        "user_id":21537,
        "username":"goldcoastmick",
        "post_date":"2020-01-15 12:56:39",
        "message":"Hi 2informaticos, thanks for helping me out.\n\nI always clean off my flux in a quick ultrasonic before reassembly. You?re right though, I have a good quality Australian made ultrasonic cleaner but it does not have a sweep function.\n\nOkay will get back to you with coil resistances tonight (just running out the door to work). I just checked a couple though and found some appear to be unstable, like counting down from 25Mohms quite slowly (took 5 mins to count down to 6Mohms and was still goin)... do I just wait this out till it settles? or will it just keep counting down to 0? Is this significant?"
    },
    {
        "post_id":55812,
        "thread_id":55794,
        "title":"820-3332 - GPU Buck converter fix gone bad :(",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-01-15 13:01:45",
        "message":"Start measuring in diode mode, red probe at ground.\nSwitch to ohm scale when you get less than 005 reading...\nUse alcohol and toothbrush only to clean small areas."
    },
    {
        "post_id":55815,
        "thread_id":55794,
        "title":"820-3332 - GPU Buck converter fix gone bad :(",
        "user_id":21537,
        "username":"goldcoastmick",
        "post_date":"2020-01-15 16:00:38",
        "message":"Sorry, experimenting with the \"Comment\" button... Not sure why you would use this feature vs standard post below? schmeh"
    },
    {
        "post_id":55816,
        "thread_id":55794,
        "title":"820-3332 - GPU Buck converter fix gone bad :(",
        "user_id":21537,
        "username":"goldcoastmick",
        "post_date":"2020-01-15 16:01:50",
        "message":"[QUOTE=\"2informaticos, post: 55812\"]Start measuring in diode mode, red probe at ground.\nSwitch to ohm scale when you get less than 005 reading...\n[\/QUOTE]\nWill do.\n\n[QUOTE=\"2informaticos, post: 55812\"]\nUse alcohol and toothbrush only to clean small areas.\n[\/QUOTE]\nOkay, noted, thank you. Will import a Crest with sweep from the states today as well.\n\nWill get back to you with those measurements tonight."
    },
    {
        "post_id":55827,
        "thread_id":55794,
        "title":"820-3332 - GPU Buck converter fix gone bad :(",
        "user_id":21537,
        "username":"goldcoastmick",
        "post_date":"2020-01-16 04:52:36",
        "message":"Okay coil resistances:\n\nL9830 - 23ohm\nL7330 - 0.517K\nL7030 - 84K\nL7220 - 18.8K\nL3895 - 33.61K\nL7770 - 12.63K\nL8360 - 158.6ohm\nL8310 - 360.7ohm\nL7220 - 300ohm\nL7630 - 11.4ohm\nL7100 - 7.1ohm\n\nVoltage when SMC_ONOFF_L triggered \n\nL9830 - 0\nL7330 - 0\nL7030 - 12.53v\nL7220 - 0\nL3895 - 0\nL7770 - 0\nL8360 - 0\nL8310 - 0\nL7220 - 0\nL7630 - 0\nL7100 - 0\n\nSo I can learn, can you please tell me the purpose of measuring resistance to ground [I]at the coils[\/I] specifically? What are you looking for?"
    }
]