[
    {
        "post_id":28571,
        "thread_id":28571,
        "title":"820-3332 no backlight",
        "user_id":1190,
        "username":"Gmorb",
        "post_date":"2017-11-27 23:17:15",
        "message":"fuse gets 10 volts on ppbus_g3h but blows on ppbus_s0_bklt_fused when i solder fuse only on ppbus_g3h side it gets 10 volts on both ends. fuse will blow only when connected to pad leading to r9788 there are no short to ground  on r9788,r9789, q9706 or q9707. i get a shorth to ground on ppbus_g3h but wouldnt board not be powering on? i do get an image on screen."
    },
    {
        "post_id":28572,
        "thread_id":28571,
        "title":"820-3332 no backlight",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2017-11-28 00:47:05",
        "message":"Check for short Q9701 and C9715-19 caps.\nDoes the fuse blow without LCD panel connected?"
    },
    {
        "post_id":28575,
        "thread_id":28571,
        "title":"820-3332 no backlight",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-11-28 06:03:43",
        "message":"There is a short to GND on PPVOUT_S0_LCDBKLT. Check with and without LCD to see if short is in LCD or not."
    },
    {
        "post_id":28621,
        "thread_id":28571,
        "title":"820-3332 no backlight",
        "user_id":1190,
        "username":"Gmorb",
        "post_date":"2017-11-28 20:12:49",
        "message":"replaced the fuse and disconnected lcd. as soon as i gave it power the trace on pin 1 of j9000 blew and took the pin with it.."
    },
    {
        "post_id":28622,
        "thread_id":28571,
        "title":"820-3332 no backlight",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-11-28 23:37:04",
        "message":"You didnt have to give it power... Just connecting or disconnecting the LCD and checking for a short while the board was powered off would've been enough. \n\nAnyways this means it's not inside of the LCD. Already tried to replace the display connector with a new one? I often find that one to be the culprit if I can't find anything ugly directly on the board itself"
    },
    {
        "post_id":28710,
        "thread_id":28571,
        "title":"820-3332 no backlight",
        "user_id":1190,
        "username":"Gmorb",
        "post_date":"2017-11-30 21:50:40",
        "message":"already ordered some connectors and will be installing tomorrow! it does seem to only be the connector nothing else is shorting guess ill find out tomorrow."
    },
    {
        "post_id":28737,
        "thread_id":28571,
        "title":"820-3332 no backlight",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-12-01 07:41:42",
        "message":"Usually when the connector is fucked the LCD cable will also be damaged. Inspect carefully before fucking up the connector again."
    },
    {
        "post_id":28864,
        "thread_id":28571,
        "title":"820-3332 no backlight",
        "user_id":1190,
        "username":"Gmorb",
        "post_date":"2017-12-04 16:40:53",
        "message":"connector does look damaged! will order some of those as well. i got the connector installed and trace fixed i get 54volts on pin 1 of j9000 is that a normal voltage?"
    },
    {
        "post_id":28868,
        "thread_id":28571,
        "title":"820-3332 no backlight",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-12-04 18:07:02",
        "message":"54V means the backlight line has an open and is not connected to the LCD. So bad connector\/bad cable or bad LCD."
    }
]