[
    {
        "post_id":45925,
        "thread_id":45925,
        "title":"820-00840 not turning on with keyboard plugged in",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2019-02-09 17:56:39",
        "message":"I got this 2017 13\" FN keys macbook with liquid damage around the USB-C ports. I have cleaned and repaired and it boots up fine and everything works except for the keyboard. I don't know if I damaged the keyboard flex cable when I initially took apart the machine because it was kind of difficult to get out. This machine is not turning on whenever the keyboard flex cable is plugged in. When I plug in that cable and measure SMC_ONOFF_L it is at 0.95v and as soon as I unplug it SMC_ONOFF_L goes back to 3.4v and it turns on. \n\nMy question is do you think the flex cable could be causing this issue or could it just be the entire keyboard that needs to be replaced?"
    },
    {
        "post_id":45926,
        "thread_id":45925,
        "title":"820-00840 not turning on with keyboard plugged in",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-02-09 18:45:03",
        "message":"Crap on the power button, inside keyboard most probable.\nYou need to change entire keyboad.\nI don't think to have a real option to clean the button only.\nAnd probably more keys are affected."
    },
    {
        "post_id":45941,
        "thread_id":45925,
        "title":"820-00840 not turning on with keyboard plugged in",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2019-02-10 10:06:32",
        "message":"Okay I looked up some keyboards for this model and it looks like almost all of them come without a backlight sheet.\nDo you know if it will it be easy for me to transfer the backlight sheet on the original keyboard to the new keyboard?"
    },
    {
        "post_id":45968,
        "thread_id":45925,
        "title":"820-00840 not turning on with keyboard plugged in",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-02-10 15:38:09",
        "message":"Sincerely, no idea; I never changed one.\nAs I basically repair for other services, this is a job that they can do..."
    },
    {
        "post_id":46654,
        "thread_id":45925,
        "title":"820-00840 not turning on with keyboard plugged in",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2019-02-23 14:55:21",
        "message":"I tried replacing the keyboard for this machine and it doesn't like it is possible. I removed all the rivets necessary and It still wouldn't fit over the screw holes that are on it. I just have to order a topcase with the keyboard and transfer everything over to it."
    }
]