[
    {
        "post_id":23870,
        "thread_id":23870,
        "title":"[SOLVED]820-3437 No Chime No Display",
        "user_id":288,
        "username":"DannyRinc",
        "post_date":"2017-08-05 16:15:46",
        "message":"Water damaged board, typical suspects were bad.\n\nU6100 termination points weren't continuous, fixed that. Replaced any corroded\/damaged components.\nWasn't getting PM_SLP_S4_L and no PP5vS4Rs3 so had to replace u1900 \n\nNow fans spin up, green light & orange, but no full boot. No USB light up, CPU VCORE is at 1.72v and it doesn't get warm at all.\n\nAll power rails check out. U3900 area is a little warm, but there was no liquid damage around there so I don't think it's necessarily the culprit? I'd like to not have to remove it unless it comes down to it. Any suggestions?"
    },
    {
        "post_id":23874,
        "thread_id":23870,
        "title":"[SOLVED]820-3437 No Chime No Display",
        "user_id":288,
        "username":"DannyRinc",
        "post_date":"2017-08-06 10:55:41",
        "message":"Came back today and it works just fine now. Not sure what was up. You can mark this as solved."
    },
    {
        "post_id":23877,
        "thread_id":23870,
        "title":"[SOLVED]820-3437 No Chime No Display",
        "user_id":461,
        "username":"Gurmon",
        "post_date":"2017-08-06 11:56:20",
        "message":"Probably corrosion under the CPU."
    },
    {
        "post_id":23880,
        "thread_id":23870,
        "title":"[SOLVED]820-3437 No Chime No Display",
        "user_id":468,
        "username":"ALB-Repairs",
        "post_date":"2017-08-06 12:38:17",
        "message":"inspect u1950 before you send this out. If the V-core is present but the CPU doesnt get hot U1950 is the usual cause.\nCheck this before you send it out\/sell it to prevent chance of returns"
    },
    {
        "post_id":23882,
        "thread_id":23870,
        "title":"[SOLVED]820-3437 No Chime No Display",
        "user_id":288,
        "username":"DannyRinc",
        "post_date":"2017-08-06 13:06:07",
        "message":"Forgot to mention that I did replace U1950 prior to v-core being present. I've tested it out thoroughly and all tests check out fine. Been running for 5 hours, boots & shuts down fine, all functions operational. CPU gets nice and toasty."
    }
]