[
    {
        "post_id":25822,
        "thread_id":25822,
        "title":"[SOLVED]820-3332 Safe Mode",
        "user_id":73,
        "username":"ajdoc",
        "post_date":"2017-09-23 10:47:57",
        "message":"Liquid damage - other shop tried to fix it.\n\nIt boots in most cases to Safe Mode.\nI thought keyboard is damaged, but with new keyboard still same issue.\n\nALT key wont works during boot as well so it looks like SHIFT is pressed all the time.\n\nBooted without keyboard and still same issue.\nThe only idea what I got is something wrong with Pin 3 on J5713 with line WS_LEFT_SHIFT_KBD but got no clue how to start.\n\nJ5713\/3\nDiode mode 0.415V\n\nU5701 and U5750 looks clean and got 0.430V in diode mode on U5701\/55 and U5750\/9\n\nWhen it boots then left shift wont works with old and new keyboard (left shift works OK on USB keyboard)\n\nAny ideas?"
    },
    {
        "post_id":25823,
        "thread_id":25822,
        "title":"[SOLVED]820-3332 Safe Mode",
        "user_id":893,
        "username":"2andrewd",
        "post_date":"2017-09-23 11:46:20",
        "message":"Sounds like the USB \"hub\" is functioning since external keyboards work. Inspect the keyboard connector."
    },
    {
        "post_id":25824,
        "thread_id":25822,
        "title":"[SOLVED]820-3332 Safe Mode",
        "user_id":624,
        "username":"Alan.L",
        "post_date":"2017-09-23 12:36:26",
        "message":"unplug trackpad, then try pram reset with new keyboard"
    },
    {
        "post_id":25836,
        "thread_id":25822,
        "title":"[SOLVED]820-3332 Safe Mode",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-09-23 16:22:53",
        "message":"No trackpad has nothing to do with this nor a PRAM reset.\n\nVoltages on pin 1,2,3,4 of keyboard connector? Could be corrosion in the connector between pins 3 and 4 pulling shift key high. Could also be crap under or dead U5750."
    },
    {
        "post_id":25975,
        "thread_id":25822,
        "title":"[SOLVED]820-3332 Safe Mode",
        "user_id":73,
        "username":"ajdoc",
        "post_date":"2017-09-27 06:37:41",
        "message":"SOLVED - resoldered pin 3 on J5713 and works fine. Thank you guys"
    }
]