{"post_id":51165,"thread_id":51165,"title":"Send my board to KTelectronic and now ?broken beyond repair?","user_id":5954,"username":"Middle-ground-is-gone","post_date":"2019-08-04 12:32:58","message":"I don?t know if I can post it here, but I?m still mad about it.\nI sent my working but with issues logic board (A1534, early 2016 1.2GHz\/8GiB\/512GB) to KT electronics, now they said they broke it beyond repair and want me to pay $320 for a replacement that?s half of my storage.\n\nThe customer service don?t understand what I said (or don?t want to) most of the time, slow response, I have no idea what their technicians were doing, I?m generally disappointed.  They didn?t send it back yet so I don?t know what?s going on, of course they will say it?s the same as I sent it in ? total bs because it used to boot!\n\nWhen I sent it in:\n1. Keyboard backlight is not working.\n2. Trackpads from 2016 will get overheat, but 2017 will work.\notherwise functional.\n\nI did some simple tests for some components around keyboard connectors (have 820-00244 schematics), I didn?t find anything wrong with my limited knowledge, other than the R4870, which used to be 100K but only read 91K.\n\nI will keep updating this post, hopefully figuring something out if I can.  From now on, I will either send my boards to trustful names, or not at all."}
{"post_id":51166,"thread_id":51165,"title":"Send my board to KTelectronic and now ?broken beyond repair?","user_id":5954,"username":"Middle-ground-is-gone","post_date":"2019-08-04 12:38:18","message":"I got admit, I like to taking things apart and thinking about modifications, that?s why I?m having these issues the first place.  I broke the keyboard backlight myself, causing issues on the board, I admit.  I tried my best to explain this complicated situation, because I hope they read it and taking care of it.  They don?t.  One time they actually makes the keyboard light up again, i thought it?s finally over and want them to send back, but they want to ?stress test my board for 8 hours?.  I shouldn?t listen to them the first place!"}
{"post_id":51169,"thread_id":51165,"title":"Send my board to KTelectronic and now ?broken beyond repair?","user_id":5954,"username":"Middle-ground-is-gone","post_date":"2019-08-04 18:36:51","message":"I?m little more calm now so I will explain it further.  I was afraid they don?t understand my problems first so I prepared a detailed explanation, showing their symptoms and what my simple diagnosis was.\n\ntwo weeks after I sent the board, I got their reply to access my user password, thankfully I locked it up before shipped out.  I told them that links to my iCloud Keychain, nor you have to access to test it out ? that?s what the misunderstand begins.\n\nThey think when I said ?Overheat?, I?m referring my CPU did, but I already made it clear that is my Trackpad, [B]something on the board is killing my trackpad, the system will run just fine.  [\/B]So I explained to them again (pic 1)\n\nThen what?s their response? (pic 2)\n\nNow I have to wait two more days to get them listen to me.\n\n\nNext week, I asked them did they read my response, of course they didn?t. (Pic 3)\n\nI have to repeat myself again, this time they seems understood (but in reality, they didn?t), so I thought, well, the backlight is working again, there?s no more overheat under it, so it must be good.  I want them to send it back ? but they keep bragging to do a ?stress test? just to see ?it works fine?.  That means, they still want to going into my system, testing things they shouldn?t be doing if they understand the problem.\n\nI hate myself when I agreed on their nonsense."}
{"post_id":51194,"thread_id":51165,"title":"Send my board to KTelectronic and now ?broken beyond repair?","user_id":624,"username":"Alan.L","post_date":"2019-08-05 17:25:51","message":"this thread is more suitable for discord or facebook group. All A1534 boards are sucks. soon or later these boards will die from CPU thermal issue because apple didn't add a cooling fan."}
{"post_id":51197,"thread_id":51165,"title":"Send my board to KTelectronic and now ?broken beyond repair?","user_id":5954,"username":"Middle-ground-is-gone","post_date":"2019-08-05 20:24:22","message":"[QUOTE=\"Alan.L, post: 51194\"]this thread is more suitable for discord or facebook group. All A1534 boards are sucks. soon or later these boards will die from CPU thermal issue because apple didn't add a cooling fan. [\/QUOTE]\n\nYou know the issue I was talking about isn?t because passive cooling, right?\n\nI do want to use this thread later if I could do the repair myself.\n\nAnyway, here?s what happened today, they?re just too lazy to response.\n\nedit: they respond.  Unfortunately they still didn?t tell me what they?re doing, what?s their problem and my board now they turned a working board to ?unrepairable?.\n\nI will wait for my board and see what I can do.  Might just go through all that schematics as well get a hot air station.\n\nOnly making matters worse, great people, I?m impressed."}
