[
    {
        "post_id":23676,
        "thread_id":23676,
        "title":"[SOLVED]820-00138 bad thunderbolts",
        "user_id":831,
        "username":"Revive",
        "post_date":"2017-08-01 09:33:16",
        "message":"no corrosion, I took off the shielding behind the ports and the only clue is the plastic hole-through-post seems to be burnt (see pic) the HV Power MUX's look clean. No board views but Im pretty sure I found PP3V3RHV_S4_TBTAPWR : 3.3V\n\nLooking into the ports with microscope they appear fine but I know that can be deceiving, Is it safe to assume the ports need to be replaced?  Is this even possible on these boards?  Any other usual suspects to test? \n[ATTACH alt=\"IMG_6756.JPG\" type=\"full\" width=\"377px\"]23677._xfImport[\/ATTACH]"
    },
    {
        "post_id":23679,
        "thread_id":23676,
        "title":"[SOLVED]820-00138 bad thunderbolts",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-08-01 10:30:23",
        "message":"What do the ports themselves look like inside? Have seen several boards where the port itself was shorted out and caused a lot of heat. Might explain the melted nub you see."
    },
    {
        "post_id":23680,
        "thread_id":23676,
        "title":"[SOLVED]820-00138 bad thunderbolts",
        "user_id":831,
        "username":"Revive",
        "post_date":"2017-08-01 10:48:00",
        "message":"Has been through the ultrasonic but looked pretty much the same before, still think their suspect though because of the burnt post\n\n[ATTACH type=\"full\" width=\"30%\"]23682._xfImport[\/ATTACH][ATTACH type=\"full\" width=\"30%\"]23684._xfImport[\/ATTACH][ATTACH type=\"full\" width=\"30%\"]23686._xfImport[\/ATTACH][ATTACH type=\"full\" width=\"30%\"]23688._xfImport[\/ATTACH]"
    },
    {
        "post_id":23690,
        "thread_id":23676,
        "title":"[SOLVED]820-00138 bad thunderbolts",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-08-01 13:10:49",
        "message":"Yeah it looks like the metal heatsink prong\/piece has bent inwards on BOTH ports, which is probably shorting or bridging something (or preventing the port from making proper contact with the inserted connector), and probably causing your heat that melted the plastic nub. UNBEND that metal piece from each port so it won't stick down into the ports. That's your issue here. Make sure you install the board with the metal prongs\/tabs \"above\" the port casing, not \"underneath\" the port casing. It clearly wasn't installed properly at some point, so that metal tab was pushed\/bent into each port. No good. Correct and re-test."
    },
    {
        "post_id":23692,
        "thread_id":23676,
        "title":"[SOLVED]820-00138 bad thunderbolts",
        "user_id":831,
        "username":"Revive",
        "post_date":"2017-08-01 13:49:34",
        "message":"wow, I don't know how I missed that, removed the tabs and everything works great.\nMany thanks"
    }
]