[
    {
        "post_id":21729,
        "thread_id":21729,
        "title":"[SOLVED]820-4924 short to ground on SMBUS_BATT_SCL",
        "user_id":623,
        "username":"MaxFix",
        "post_date":"2017-06-15 05:23:47",
        "message":"The board has waterdamage in the battery connector area. It still boots to OS, but it's not detecting the battery. SMBUS_BATT_SCL measures 0.4 ohms to ground. R5381 measures 2000 Ohms from the PP3v42 side. I already replaced D7050, but the short is still there. the only other termination points i can find in the schematic are on U5000 and U7100. Is there a way to tell if its U7100 other than replacing it? or could the short be somewhere else still?"
    },
    {
        "post_id":21730,
        "thread_id":21729,
        "title":"[SOLVED]820-4924 short to ground on SMBUS_BATT_SCL",
        "user_id":741,
        "username":"PhilipC",
        "post_date":"2017-06-15 06:01:37",
        "message":"Replace ISL if short is still there can only be the SMC, I injected 3v into one of these once and the smc got a tiny bit warm just enough to evaporate a thin layer of alcohol slightly faster. I guess you could try that if you wanted to be 100%"
    },
    {
        "post_id":21731,
        "thread_id":21729,
        "title":"[SOLVED]820-4924 short to ground on SMBUS_BATT_SCL",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2017-06-15 06:11:20",
        "message":"This is really only the ISL6259 or the SMC. One way to find out; remove! Obviously begin with the ISL6259."
    },
    {
        "post_id":22406,
        "thread_id":21729,
        "title":"[SOLVED]820-4924 short to ground on SMBUS_BATT_SCL",
        "user_id":623,
        "username":"MaxFix",
        "post_date":"2017-07-01 05:57:05",
        "message":"Well, sometimes lucky rubber ducky, the machine recognises the battery again after replacing the ISL."
    },
    {
        "post_id":22621,
        "thread_id":21729,
        "title":"[SOLVED]820-4924 short to ground on SMBUS_BATT_SCL",
        "user_id":623,
        "username":"MaxFix",
        "post_date":"2017-07-06 02:49:11",
        "message":"I am returning to this one for a less clear issue. After re-assembling the machine and final testing it turns out the machine is running throttled. Self-diagnostics of the machine give error PPF004, issues with the fan.\nturning it to maximum using macs fan control shows that it is only running at 5700 rpm maximum. after replacing resistors R6060 i am getting 6100 rpm max with a known good fan, only 100 rpm off what it is supposed to be. The machine is still running throttled.\n\nWhen the fan is off Q6060 measures\npin 1: 3.3 V\npin 2: 0v\npin 3: 0v\n\nwhen hte fan is on full\npin 1: 3.3v\npin 2: 3,4v\npin 3: 5.05v\n\nResistance to ground on SMC_FAN_0_TACH is 103.4 Ohms\n\nis there any way to check is this is the actual cause of the problem? and also any way to maybe artificially squeeze out a little more rpm is this if the problem? I suspect the problem is not with the actual rpm of the fan, but the measured rpm value, so maybe changing the reistance on one of the voltage divider resistors a little might fix this?"
    },
    {
        "post_id":22644,
        "thread_id":21729,
        "title":"[SOLVED]820-4924 short to ground on SMBUS_BATT_SCL",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-07-06 19:01:34",
        "message":"Either bad SMC or crap under SMC."
    }
]