{"post_id":6758,"thread_id":6758,"title":"[SOLVED]820-2915 Weird backlight issue","user_id":145,"username":"Sykulski","post_date":"2016-09-15 04:10:53","message":"This one came in with severe water damage. After ultrasonic cleaning and fixing CPU VCORE power issue it started up with no backlight. I knew it would because it had a lot of corrosion around backlight circuitry. I changed all corroded resistors and caps around LP8550 and also the LP8850 itself. Some traces needed wire. Also the pulldown resistor on BKLT_PWM was corroded so I have changed it and put a wire on the broken trace.\n\nNow the backlight is working partially. When I start the computer backlight turns on. The brightness is 100% even if I turn it down. BKLT_PWM is pulsing - long pulses on high brightness and short pulses on low brightness - but still full brightness around 40V on LCD connector. But when computer goes to sleep backlight does not come back on every time. Sometimes it comes right away - sometimes after 30 seconds - and sometimes not at all before I shut down and turn the machine back on. When backlight is not working after sleep then I get 19-20V on LCD connector.\n\nI tried giving BKLT_PVM 3V from PP3V3_S0 but still only 19V on backlight after sleep.\n\nWhat am I missing ?"}
{"post_id":6760,"thread_id":6758,"title":"[SOLVED]820-2915 Weird backlight issue","user_id":2,"username":"dukefawks","post_date":"2016-09-15 05:29:40","message":"Seems like an issue on PWM pin. Remove R9704 and measure on diode mode on C9704. Could also be a bad C9704. Also measure diode mode on pin 1 of R9714\/16 and pin 2 of R9741. Also check value of these resistors.\nOh and the LP8550 you used, have you used these of the same batch before? They do have an EEPROM with settings in them..."}
{"post_id":6787,"thread_id":6758,"title":"[SOLVED]820-2915 Weird backlight issue","user_id":145,"username":"Sykulski","post_date":"2016-09-15 18:38:23","message":"Thanks Duke for pointing me in the direction of measuring diode mode on C9704 with R9704 removed. It showed up that I had a microscopic OL around the probe point for C9704. I couldn't even see it in the microscope on highest zoom setting. But the multimeter saw it :) Made a trace and brightness now is adjustable and backlight wakes from sleep.\n\nThanks again you can mark this one solved. Thumbs up!"}
