[
    {
        "post_id":25597,
        "thread_id":25597,
        "title":"[SOLVED]Macbook Pro 13\" Mid-2009 - Systeem feezes after post.. But only specefic hard drive",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-09-19 15:02:22",
        "message":"[PLAIN][SOLVED]Macbook Pro 13\" Mid-2009 - Systeem feezes after post.. But only specefic hard drive[\/PLAIN]\n\nNot sure what the board number on this one is, not very related but I can look it up if required\n\nJust wondering whats causing this, the system boots fine from my test hard drive but when I place its original drive back the screen either stays gray after the chime or if you get to the drive selection (pressing the Option key), it shows the available partitions of my usb flash drive and then feezes. (If I smash the arrow key I can move around with the speed of 1 partition per 2 minutes)\n\nASD both OS and EFI pass. Motherboard was not touched or reworked on and only inspected by me. No water damage\/corrosion and no bad looking parts\n\nThis drive reads fine on my windows machine with no S.M.A.R.T. errors and a surface test gives me no errors. I can write to it without issues.\nI've even removed all partitions from the drive and wiped the first 16k sectors to make sure it didn't had some messed up MBR. But the same issues stay\n\nJust ignore the issue and get a new drive? Or could this mean something more serious that will turn into a issue after I give it back to the customer with a new drive?"
    },
    {
        "post_id":25619,
        "thread_id":25597,
        "title":"[SOLVED]Macbook Pro 13\" Mid-2009 - Systeem feezes after post.. But only specefic hard drive",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-09-19 20:01:16",
        "message":"Meh, just trash the drive, it could have some weird issue."
    },
    {
        "post_id":25745,
        "thread_id":25597,
        "title":"[SOLVED]Macbook Pro 13\" Mid-2009 - Systeem feezes after post.. But only specefic hard drive",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-09-21 13:15:50",
        "message":"Drive was actually alright, it was the hard drive cable.\n\nNot sure why one drive ended up working though, maybe it had better error correction functionality or something."
    }
]