[
    {
        "post_id":19062,
        "thread_id":19062,
        "title":"Upgrade memory on macbook pro retina or macbook air",
        "user_id":621,
        "username":"raainxx",
        "post_date":"2017-04-24 23:06:26",
        "message":"Hi,\ni find this video for upgrade memory on macbook air\ndo you have already make this upgrade?\nI don't find the reference of memory chip, where can i find it? on schematic i don't see it.\nthanks"
    },
    {
        "post_id":19072,
        "thread_id":19062,
        "title":"Upgrade memory on macbook pro retina or macbook air",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-04-25 06:18:09",
        "message":"No no no no. Very stupid idea to take the risk and possibly fuck up a perfectly working macbook. Customer ok with a dead macbook after a failed attempt? I don't think so, stay away from these practices."
    },
    {
        "post_id":19132,
        "thread_id":19062,
        "title":"Upgrade memory on macbook pro retina or macbook air",
        "user_id":732,
        "username":"peterfixit",
        "post_date":"2017-04-25 20:21:37",
        "message":"i agree, my personal laptop is a 2013 air 4gb, its fine, I never run out of memory with chrome mail calander and final cut pro running, macos has really good memory optimization, not worth the risk. If you watch till the end you also have to mess with the EFI, which is a bad idea at the best of times"
    },
    {
        "post_id":19143,
        "thread_id":19062,
        "title":"Upgrade memory on macbook pro retina or macbook air",
        "user_id":621,
        "username":"raainxx",
        "post_date":"2017-04-26 04:31:30",
        "message":"i have a board with beep memory at start, when i have time to check the problem, i try it, i have nothing to loss (except my time) :D."
    },
    {
        "post_id":19145,
        "thread_id":19062,
        "title":"Upgrade memory on macbook pro retina or macbook air",
        "user_id":732,
        "username":"peterfixit",
        "post_date":"2017-04-26 04:33:35",
        "message":"if the board has dead ram, then hell yeah you should try it, but make sure you get matched ram, in the same order and the other chip it needs"
    },
    {
        "post_id":19151,
        "thread_id":19062,
        "title":"Upgrade memory on macbook pro retina or macbook air",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-04-26 04:44:49",
        "message":"If you have a beeping board it is even worse. You can swap the RAM and it may still not work cause something else is wrong. In this case you should first swap the RAM with the original chips, if it works again only then you should upgrade. If you don't do this you will never know if your upgrade worked or not. All a huge time waster project in my eyes."
    },
    {
        "post_id":19153,
        "thread_id":19062,
        "title":"Upgrade memory on macbook pro retina or macbook air",
        "user_id":732,
        "username":"peterfixit",
        "post_date":"2017-04-26 04:49:55",
        "message":"you make a good point duke, as usual"
    },
    {
        "post_id":19177,
        "thread_id":19062,
        "title":"Upgrade memory on macbook pro retina or macbook air",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2017-04-26 08:00:42",
        "message":"I'm surprised duke & I are in full agreement here. I have more of a high volume setup so I shy away from things that are either very risky or going to take a lot of time, whereas duke usually dives right in. Uunless it's the end of the day and I have time for the camera.\n\nBut yeah, here's what you must consider.\n\na) They have a working board that you can kill. If you kill it, does what you charged for other RAM replacements allow you to pay the cost of replacing their board? Are people going to be willing to *PAY* what that costs? \n\nb) If it is beeping and you spend $50 or $70 or $120 on the RAM, and it is beeping because of cracked internal vias\/bad CPU\/bad PCH, what do you do with the $120 and the hour you put into that board?"
    },
    {
        "post_id":19600,
        "thread_id":19062,
        "title":"Upgrade memory on macbook pro retina or macbook air",
        "user_id":621,
        "username":"raainxx",
        "post_date":"2017-05-03 07:03:20",
        "message":"You are right, and i don't know the reference of the memory chip, when you have memory problem is impossible to solve the problem?"
    }
]