{"post_id":66511,"thread_id":60167,"title":"820-00165 never fully boots SSD\/USB","user_id":2873,"username":"Alex97Lewis","post_date":"2020-10-13 06:14:08","message":"So got a 820-00165 here which had a power issue. Liquid found around U7600 replaced that and fixed a trace that lead from pin 15 all the way to D8185. Now it actually powers on, chimes and shows the apple logo.\n\nNow I seem to be facing an issue of when I've successfully booted into the OS and the login screen appears. I attempt to login and the progress bar gets to around 70% full and then just hangs indefinitely. Obvious signs is SSD failing or software related issues, so tried a blank SSD and reinstall MacOS with my recovery USB which does work as I just used it on a different machine. This has the same problem as it gets to around 70% and just hangs. \n\nWhen I boot to the original SSD it almost immediately boots, Apple logo is there for around 2 seconds, no loading bar - and then immediately goes to the login screen. Upon logging in, just stays there forever - Original\/Test SSD same outcome, and recovery USB won't even get past 70%.\n\nJust quickly tried diagnostics just to see if that pops up with anything but it's returned with No issues found."}
{"post_id":66513,"thread_id":60167,"title":"820-00165 never fully boots SSD\/USB","user_id":682,"username":"2informaticos","post_date":"2020-10-13 06:16:05","message":"First step, clean ME region."}
{"post_id":66514,"thread_id":60167,"title":"820-00165 never fully boots SSD\/USB","user_id":2873,"username":"Alex97Lewis","post_date":"2020-10-13 06:29:41","message":"More than likely a stupid question - but will give that a go.\n\nI'm not sure if I have any spare boards with usable bios chips to use. Is it best to try a clean me on the original chip before trying on a new\/known working spare chip?"}
{"post_id":66518,"thread_id":60167,"title":"820-00165 never fully boots SSD\/USB","user_id":682,"username":"2informaticos","post_date":"2020-10-13 09:50:36","message":"You should clean ME from your BIOS; as it is working."}
{"post_id":66557,"thread_id":60167,"title":"820-00165 never fully boots SSD\/USB","user_id":2873,"username":"Alex97Lewis","post_date":"2020-10-14 03:52:09","message":"Just attempted a clean ME with the original bios chip, now it seems to hang on the Apple logo with around 50% of it loaded, whereas it did originally boot into the OS just never log in, nor boot from a recovery USB.\n\nI just a second clean ME and it still does the same thing now - Attempted an SMC reset, PRAM reset as well as an SMC bypass but to no avail."}
{"post_id":66558,"thread_id":60167,"title":"820-00165 never fully boots SSD\/USB","user_id":682,"username":"2informaticos","post_date":"2020-10-14 04:18:50","message":"How did you clean ME region?\nUpload somewhere your backup BIOS; I hope you did it."}
{"post_id":66563,"thread_id":60167,"title":"820-00165 never fully boots SSD\/USB","user_id":2873,"username":"Alex97Lewis","post_date":"2020-10-14 04:31:01","message":"I haven't got medusa yet, have ordered one but delivery timescales are unknown - Currently using a clip method with an eeprom programmer.\n\n[URL='http:\/\/awbsolutions.com\/OriginalBIOS.bin']Original BIOS[\/URL]\n\nI'm about to attempt another clean ME soon but I've not really had much issues just yet with cleaning ME region this method, maybe this is my first time having this issue."}
{"post_id":66568,"thread_id":60167,"title":"820-00165 never fully boots SSD\/USB","user_id":2873,"username":"Alex97Lewis","post_date":"2020-10-14 07:51:52","message":"I've just attempted a clean ME file I found on the forum, and it seems the device boots up to the login screen then once logging in - it hangs on the loading bar again at around 70%. When I restart the machine it then fails to go past the Apple logo again."}
{"post_id":66569,"thread_id":60167,"title":"820-00165 never fully boots SSD\/USB","user_id":682,"username":"2informaticos","post_date":"2020-10-14 08:05:13","message":"Can you boot Linux, or Windows?"}
{"post_id":66575,"thread_id":60167,"title":"820-00165 never fully boots SSD\/USB","user_id":2873,"username":"Alex97Lewis","post_date":"2020-10-14 10:42:29","message":"I can boot into a Windows Installer USB. Is that any help at all? I've not been able to boot into a MacOS USB at all, but can boot into the original SSD just can't get past the login as it stops on the end of the progress bar. \n\nI might install Windows to a test SSD and see how that works out"}
{"post_id":66604,"thread_id":60167,"title":"820-00165 never fully boots SSD\/USB","user_id":2873,"username":"Alex97Lewis","post_date":"2020-10-15 03:37:12","message":"So this is becoming an odd one - I've installed Windows to a test SSD, it's installed and booted fine - Was able to boot into my Windows Installer USB fine, but using a MacOS USB which works on other devices doesn't seem to work neither does actually logging into a MacOS SSD - I've tried this SSD in another machine, and on both it boots into the OS, on my test machine the SSD can log in fine - but on this board this post is about, it just won't go past the login screen just hangs... very strange, practically out of options and doubt the customer would be happy with running Windows on it"}
{"post_id":66605,"thread_id":60167,"title":"820-00165 never fully boots SSD\/USB","user_id":2873,"username":"Alex97Lewis","post_date":"2020-10-15 04:01:08","message":"Booted into verbose mode (never knew how to do it, what an amazing thing to have for diagnostics). Shows iGPU timeout, so assumed gpu issues when loading drivers, so booted into the Windows SSD and went to install the Intel graphics drivers, it immediately locked up and Windows died. \n\nGonna say GPU issues, so will be replacing the board then - unless you have any ideas? Will use this board for parts if I replace this board"}
{"post_id":66606,"thread_id":60167,"title":"820-00165 never fully boots SSD\/USB","user_id":682,"username":"2informaticos","post_date":"2020-10-15 04:29:37","message":"Looks like case closed; iGPU is bad.\nAnd remember Windows help for the future."}
{"post_id":66609,"thread_id":60167,"title":"820-00165 never fully boots SSD\/USB","user_id":2873,"username":"Alex97Lewis","post_date":"2020-10-15 04:32:36","message":"Definitely will do, verbose mode and Windows will be my new best friend for diagnostics. Thank you for assisting me through this, became such a stressful machine to work on. Time for the next board repair"}
