{"post_id":42096,"thread_id":42096,"title":"2915 b, Turn OFF","user_id":423,"username":"Noguinfor","post_date":"2018-11-13 04:41:10","message":"Hey, \n\nworking on this board and C7536 ,Q7510,Q7515  are damage!! i replace this 3 components same time and the board work's fine... but lasted 2 hours. i already replace again this 3 components more u7400. Now, When i plug the charger, the machine turn on goes off then on and when goes to show image turn's off cycling!! this was what happened to me yesterday because in this morning i turn on the machine and it shows image but when appear the Apple logo then turn OFF!  After trying 3 - 4 times to boot normally then goes to 1st problem... \n\nany advice for this machine ??? \n\nthank you"}
{"post_id":42097,"thread_id":42096,"title":"2915 b, Turn OFF","user_id":682,"username":"2informaticos","post_date":"2018-11-13 06:14:32","message":"Probably GPU issue; heat for test.\nOr try disabling GPU directly..."}
{"post_id":42098,"thread_id":42096,"title":"2915 b, Turn OFF","user_id":1153,"username":"JohnB8812","post_date":"2018-11-13 09:25:04","message":"Dead GPU. RIP. Best to replace 2915 boards with 3330 boards for customers who absolutely want to keep using their Mac"}
{"post_id":42121,"thread_id":42096,"title":"2915 b, Turn OFF","user_id":423,"username":"Noguinfor","post_date":"2018-11-14 03:49:47","message":"Yes, you are right!!! DEAD GPU!\n\nOne question, i have a 2849 A and this board came with a GPU problem, and while i was waiting for the chip i took Q7490 to repalce for Q7510 on 2915 board! When the GPU arrive i replace the chip and when i go to test if everything it's ok i forgot the Q7490. My question is, can i fuck anithink on this board because i turn on this machine without Q7490!! I say that because i put a new Q7490 and a new GPU but the machine don't show image!! before that the machine showed the image."}
{"post_id":42124,"thread_id":42096,"title":"2915 b, Turn OFF","user_id":682,"username":"2informaticos","post_date":"2018-11-14 04:25:24","message":"Open new thread for the other board.\nHowever, missing Q7490 cannot damage anything."}
