[
    {
        "post_id":68215,
        "thread_id":60368,
        "title":"820-00840-A 20V 44mA",
        "user_id":21359,
        "username":"Fanfwe",
        "post_date":"2020-11-22 11:17:48",
        "message":"Hi,\nI have this board that have signs of liquid spill. It won't turn on.\nCD3215 stuff works fine, I get 20V on the charger, so I have good PP3V3_G3H and PPBUS_G3H is present also.\n\nBut then I get no other rails, no S5, S4 and probably nothing else either. The enable signal for those rails all come from U7800, and it's not active.\nSo I've looked at U7800. It has good power input from PPBUS_G3H. The 3V LDO gives me 3.2V.\n\nPP3V1_RTC however gives me 6mV. Measuring resistance to ground on it gives me 20 Ohms.\nI don't know if this is normal or not, don't have a good working board to compare it to.\nIf this is a short to ground, then I guess this is almost hopeless. Few caps to check for short, and if not, then bad PCH ?"
    },
    {
        "post_id":68216,
        "thread_id":60368,
        "title":"820-00840-A 20V 44mA",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-11-22 15:33:19",
        "message":"Very likely PCH issue.\nYou can heat first with quality flux.\nJust to burn eventually accumulated crap between its balls.\nIf still low, you can remove U7800 and check resistance again."
    },
    {
        "post_id":68218,
        "thread_id":60368,
        "title":"820-00840-A 20V 44mA",
        "user_id":21359,
        "username":"Fanfwe",
        "post_date":"2020-11-23 00:44:44",
        "message":"OK thanks.\nThe liquid marks are not on U7800, just to make it clear. That area looks pristine.\nBut yeah, my action plan right now will be to remove the few caps on the PP3V1_RTC line and check if the short goes away.\nIf not, then I will reheat U7800, and if this still doesn't help, I will remove it and hope for the short to be gone, otherwise this will turn into a donor board."
    },
    {
        "post_id":68222,
        "thread_id":60368,
        "title":"820-00840-A 20V 44mA",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-11-23 04:16:12",
        "message":"\"Very likely PCH issue. \nYou can heat first with quality flux.\"\nI was talking about PCH area..."
    }
]