[
    {
        "post_id":77890,
        "thread_id":61454,
        "title":"HP AIO - 24-b223w - Won't power on, can't track issue.",
        "user_id":31464,
        "username":"Jameswis",
        "post_date":"2021-07-18 17:30:22",
        "message":"I'[m working on an HP AIO.\nboard number  DAON83MB6G0   rev3. I have the baordview and schematics.\nThe board won't turn on. At the power button, i don't have 5v.\nThe schematics shows bot S0-S5 states and A G3 State.. The only power rails i have with the power adapter hooked up, are those listed under G3... So I'm no sure where to look next.  Can someone please point me in the right direction?"
    },
    {
        "post_id":77900,
        "thread_id":61454,
        "title":"HP AIO - 24-b223w - Won't power on, can't track issue.",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-07-19 00:47:26",
        "message":"Do you get +3\/5V_ALW?\nBe sure to use correct charger; AD_ID is very important signal for HP!"
    },
    {
        "post_id":77911,
        "thread_id":61454,
        "title":"HP AIO - 24-b223w - Won't power on, can't track issue.",
        "user_id":31464,
        "username":"Jameswis",
        "post_date":"2021-07-19 05:57:37",
        "message":"I get 3\/5 ALW..."
    },
    {
        "post_id":77914,
        "thread_id":61454,
        "title":"HP AIO - 24-b223w - Won't power on, can't track issue.",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-07-19 07:48:19",
        "message":"Do you get 3V at PWRBTN#?\nIf not, disconnect CN19 and check again; you can use SW1 pads instead.\nIf sltill low, be sure R570 is good."
    },
    {
        "post_id":77932,
        "thread_id":61454,
        "title":"HP AIO - 24-b223w - Won't power on, can't track issue.",
        "user_id":31464,
        "username":"Jameswis",
        "post_date":"2021-07-19 11:24:54",
        "message":"I will check if I have 3v at power button, but Please answer me this?\nWhen i look at the schematic \/ boardview at the power button connector, they only show 5v_S5 PWR.. I don't see any of the 4 pins labeled as 3v.. So should i be looking for 5v or 3v? (Im not trying to be a wiseass, I'm just trying to understand in a way that I can learn it.)\nThanks.\nI'll check on this when i get home.."
    },
    {
        "post_id":77938,
        "thread_id":61454,
        "title":"HP AIO - 24-b223w - Won't power on, can't track issue.",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-07-19 14:17:13",
        "message":"Power button is something like SW1; do you see any 5V going to SW1 pads?\nThe pull-up resistor for PWRBTN# is R570, to +3V_ALW..."
    },
    {
        "post_id":77940,
        "thread_id":61454,
        "title":"HP AIO - 24-b223w - Won't power on, can't track issue.",
        "user_id":31464,
        "username":"Jameswis",
        "post_date":"2021-07-19 15:49:45",
        "message":"Well I just did it.  In poking around i slipped and shorted 2pins on an 8pin chip (PU11), Which I think is a voltage converter, and let the smoke out of it.  I just ordered another, so hopefully i can get it swapped and keep testing.  I guess I'll be back in a few days... lol"
    },
    {
        "post_id":78014,
        "thread_id":61454,
        "title":"HP AIO - 24-b223w - Won't power on, can't track issue.",
        "user_id":31464,
        "username":"Jameswis",
        "post_date":"2021-07-21 16:12:29",
        "message":"I've got the new chip soldered in, and I'm back to testing.  \nOn the board view, Looking at SW1 It has 4 pads. 2 are ground and 2 are PWRBTN#...\nBoth PWRBTN# pads have 3.29v on them..\nThe actual connector with the ribbon cable for the power button is CN19 and has 4pins.. \nPin1 = Ground,\nPin2= Pwr on LED#  (This measures 3.29v but bounces to 0v and back to 3.29v over and over about every second)\nPin3= PWRBTN#  - 0.0v\nPin4= +5v S5 PWR  0.0v\nSo i have No 5v at the power button connector. \nR570 has 3.3v"
    },
    {
        "post_id":78016,
        "thread_id":61454,
        "title":"HP AIO - 24-b223w - Won't power on, can't track issue.",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-07-21 16:18:37",
        "message":"I don't really understand why do you still expect 5V at PWRBTN#; it is pulled up to +3V_ALW!!!\nFind the broken point for PWRBTN# line.\nYou can run a wire from SW1 to CN19..."
    },
    {
        "post_id":78029,
        "thread_id":61454,
        "title":"HP AIO - 24-b223w - Won't power on, can't track issue.",
        "user_id":31464,
        "username":"Jameswis",
        "post_date":"2021-07-22 06:53:36",
        "message":"I don't expect to find 5v at PWRBTN#   However I would think I would find 5v on +5v_S5PWR correct? (IDK.. If I knew i wouldn't have paid for the help on this forum.. lol)\n \nI don't think running a wire will help because the path from SW1 to CN19 is fine.  \n\nCorrect me if i'm wrong, but on SW1 i should be able to use a momentary switch from the 3.3 to Grn and have the system turn on\/off?   I've tried with a jumper wire there to a ground pad and it won't try to turn on at all."
    },
    {
        "post_id":78033,
        "thread_id":61454,
        "title":"HP AIO - 24-b223w - Won't power on, can't track issue.",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-07-22 08:52:38",
        "message":"You've said to have 3.3V at SW1 (PWRBTN# pads), but not on pin 3 of CB19 (0V on same PWRBTN# line).\nCan you then explain how the PWRBTN# line is not broken???\n\n+5V_S5 power rail requires S5_ON, which appears AFTER power button is pressed.\n\n\"I've tried with a jumper wire there to a ground pad and it won't try to turn on at all.\"\nDid you disconnect CN19?\nBe sure to have 3V at SW1, when run that wire.\nKBC's pin 107, must detect 3-0-3V signal drop when PWRBTN# is triggered."
    },
    {
        "post_id":78073,
        "thread_id":61454,
        "title":"HP AIO - 24-b223w - Won't power on, can't track issue.",
        "user_id":31464,
        "username":"Jameswis",
        "post_date":"2021-07-23 17:05:54",
        "message":"I follow what you're saying now, and I understand the confusion.  I got a little ahead of myself when I was writing out the numbers on CN19.  Let me do this again..\nPin\n1 - Ground - 0.0v\n2 -  Pwr ON LED - Bounching 0-3.29v\n3 - PWRBTN# - 3.29v\n4- +5V_S5 - 0.0v\n\nSo i have 3.3 on PWRBTN# at both SW1 and CN19."
    },
    {
        "post_id":78074,
        "thread_id":61454,
        "title":"HP AIO - 24-b223w - Won't power on, can't track issue.",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-07-23 17:11:26",
        "message":"Check for pulse at +3.3\/5V_S5, when trigger PWRBTN#; use SW1 pads, instead of power button."
    },
    {
        "post_id":78162,
        "thread_id":61454,
        "title":"HP AIO - 24-b223w - Won't power on, can't track issue.",
        "user_id":31464,
        "username":"Jameswis",
        "post_date":"2021-07-28 16:47:32",
        "message":"ok... I'm sorry for this, but we need to start over.  I broke something else when troubleshooting and fixed that issue, and then created another.  I replaced the part i thought was heating up, but apparently the part heating was on the opposite side of the board and i didn't think to flip it once i found something heating that much... \nSo heres the situation now..\nNo more power LED at power port.  No more 3v at SW1.\non the bottom of the board i have a chip I can't find on digikey or even google (with whats actually written on the chip) and it is written as 3G=4H M3X....\nIn the schematic it shows this chip as PU21 RT6575AGQW... Even with this RT number I can't find a data sheet to figure out what it does to know how to test it. This chip gets sooooo hot it will burn my fingers when plugged in for only a few seconds. This didn't happen before i shorted whatever I shorted in tested before..\nSo i need some direction on where to test now before just replacing a chip i can't find...\nAnd I'm also confused about something, so I'm going to ask (Please don't bite my head off for it)...  Something I'm not understanding is the different Voltage lines on the schematic..  Around this chip I'm seeing stuff like i've written below and I'd like to know what it means:\n3v_Phase\n3v_Boot (I can kinda guess this one)\n3v_UG \n3v_FB\nAnd finally the one thats made me give up is VIN_3V... On which i have 19v... IDK if this should be 3v or 19v.... Or does this mean its the +VIN feed for the +3v circuit?\nSorry.. I know this was long, and there's a lot here, but I'm having a bad week and this didn't help things today...\nThanks"
    },
    {
        "post_id":78172,
        "thread_id":61454,
        "title":"HP AIO - 24-b223w - Won't power on, can't track issue.",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-07-29 02:17:06",
        "message":"If you still get correct +VIN (19V), you are lucky; maybe no problems on +3V_AUX and +5V_S5.\nKBC is probably fried and you have a short on +3V_ALW rail.\nRemove PR324, to confirm that; may need to cut off the trace, if no physical resistor soldered on the board.\n\n\"3V\" in that signal names denotes their relation with 3V power supply; nothing more about their voltage level.\nIC datasheet clarify what means each signal.\n\nA small bonus:\n3F=    RT6575BGQW\n3G=    RT6575AGQW\n\n3J=    RT6585AGQW\n3H=    RT6585BGQW\n\n5Y=    RT6575CGQW\n5X=    RT6575DGQW"
    },
    {
        "post_id":78186,
        "thread_id":61454,
        "title":"HP AIO - 24-b223w - Won't power on, can't track issue.",
        "user_id":31464,
        "username":"Jameswis",
        "post_date":"2021-07-29 07:57:39",
        "message":"WOW!!! Thanks for all the extra info there.  That really helped a lot.  No resistor on PR324 so cutting the trace look like my option...\nBefore I do that I just want to be very clear on evertything so i don't screw more up.. lol\nSo I'm looking for a short to ground on +3v_ALW once PR324 is removed correct? (well Trace cut)\nAnd is there any specific location i should probe +3_ALW after the cut?\n\nI feel dumb for asking this but What does KBC stand for?  Is it Keyboard Controller?   Or is it another way of saying SUPER IO Chip?\n\nThanks,\nAnd I'm sorry for being such a PITA... I'm taking a logic board repair class in about 3 weeks and I'm trying to pickup as much as I can now.. Hopefully asking you a lot now, will help make it easier for me in the class, and if goes well, I won't need so much hand holding after... lol"
    },
    {
        "post_id":78188,
        "thread_id":61454,
        "title":"HP AIO - 24-b223w - Won't power on, can't track issue.",
        "user_id":31464,
        "username":"Jameswis",
        "post_date":"2021-07-29 08:30:18",
        "message":"I went ahead and cut the trace.  I verified to continuity through the cut.  On the trace side, its a dead short to ground.  On the side of PU21 pin3 I don't get short to ground."
    },
    {
        "post_id":78189,
        "thread_id":61454,
        "title":"HP AIO - 24-b223w - Won't power on, can't track issue.",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-07-29 09:07:51",
        "message":"\"is it another way of saying SUPER IO Chip?\"\nKBC, Super I\/O, EC...\nEC (Embedded Controller) is more correct than KBC (KeyBoard Controller), but we still use a lot that old name.\nIt has many more functions implemented, than a simple keyboard controller.\n\nResolder the trace now.\nIf you inject voltage there, I bet U34 will get hot.\n1V should be probably sufficient, do not inject more than 4V."
    },
    {
        "post_id":78190,
        "thread_id":61454,
        "title":"HP AIO - 24-b223w - Won't power on, can't track issue.",
        "user_id":31464,
        "username":"Jameswis",
        "post_date":"2021-07-29 09:26:38",
        "message":"Dead on the money.  U34 gets warm \/ hot when I inject 1.1v @ 0.75 amps.  Any less and the CC protection would kick on and drop the voltage causing the chip not to heat up.\n\nThis would point to the SuperIO, but I wonder if that chip was bad all along, or I blew it when shorting the other connector in testing?  I've been looking for a reason to buy a Super IP Programmer.. Maybe now is the time. :)"
    },
    {
        "post_id":78193,
        "thread_id":61454,
        "title":"HP AIO - 24-b223w - Won't power on, can't track issue.",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-07-29 09:40:24",
        "message":"You cannot set V and A at same time, when inject voltage.\nLearning more about Ohm Law can help you.\nIf you set amp limit of lab power supply at max, I'm sure you can inject 2V and get KBC hotter.\nHowever, no need to inject more, if already detected it as the culprit.\n\nNeed to change KBC first, not always need to flash it.\nSchematic says something about auto load code in this case.\n\nThe KBC got fried because of some short you've done on the board..."
    },
    {
        "post_id":78198,
        "thread_id":61454,
        "title":"HP AIO - 24-b223w - Won't power on, can't track issue.",
        "user_id":31464,
        "username":"Jameswis",
        "post_date":"2021-07-29 11:45:53",
        "message":"One thing i know pretty well is Ohms law.  And what I was explaining is that by setting my CV at 1.1v,  the system wanted more current than I had my bench supply set to.  So in order to get the voltage to stay at 1.1 i had to up the current.\nBasically, on this power supply, if i set the current max at 100milliamps, and the CV at 1.1v then if the chip or circuit wants more than 0.1amps, my PSU will drop the voltage to near 0v, until I give it more current.  so at 100milliamps, it wasn't enough to get the chip warm and thus i had to up the current until it no longer trigger the CC cutoff.  At which the 1.1v CV was the next stopping point.  That's when the chip got warm....\n\nNow I'm interested in the Auto load info.  I've heard of this but never experienced it personally I'm going to dig into that a bit and see what's up..\nThanks."
    },
    {
        "post_id":78201,
        "thread_id":61454,
        "title":"HP AIO - 24-b223w - Won't power on, can't track issue.",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-07-29 12:49:11",
        "message":"ALWAYS set amp limit to max when inject voltage.\nSo lab PSU doesn't enter in protection mode.\nYou don't have to re-adjust amp limit each time you detect the PSU stoped to inject.\nA 20A PSU is recommended for this purpose..."
    }
]