{"post_id":56368,"thread_id":56368,"title":"820-00239 - Not Booting","user_id":1358,"username":"mccafe","post_date":"2020-01-31 22:31:01","message":"Hello guys,\n\nI have a laptop that does not boot and it only tries to turn on when the battery is disconnected.\n\nCorrosion on PP5V_S0_KBD on the keyboard\/fan connector. Cleaned up and fixed some of the pins. One of the redundant PP5V_S0_KBD pins are burned and not connected, will fix later.\n\nLittle corrosion around Q6000\/Q6050 - insignificant amount. Cleaned up with alcohol, reflowed quickly.\nCorrosion around U5256.\nLots of corrosion around U8192, U8190, U1910 - I understand there is a lot going around this area. Cleaned reflowed, replaced R1343, R8190.\n\nFans spin\nPPBUS_G3H = 13.1v\nCPU Vcore is present\nGPU Vcore is present\nNo display internal or external\nUSB mouse I believe shows activity, however we need to confirm this\n\nHow do I begin troubleshooting? I don't have any donor boards for newer models yet, but they are on the way.\n\nPicture attached."}
{"post_id":56376,"thread_id":56368,"title":"820-00239 - Not Booting","user_id":682,"username":"2informaticos","post_date":"2020-02-01 04:15:03","message":"Very uggly that photo; a PlayBoy poster looks better...\n\nCorrosion on CPU area makes worry about its integrity.\nBut if you can confirm USB activity for sure, at least CPU core should be good; not so sure about iGPU.\nUse an USB OSX pendrive with Link LED to confirm activity.\n\nHow looks LCD connector?\nAny sign of liquid there?\nExternal image present?"}
{"post_id":56408,"thread_id":56368,"title":"820-00239 - Not Booting","user_id":1358,"username":"mccafe","post_date":"2020-02-03 10:37:08","message":"Very ugly.\n\nI used an external hard drive with link LED (macOS Installer) and it shows no USB activity. Normally the light will stay on and fade in and out as it reads\/writes data, but this one will flick on and then forever off quickly.\n\nLCD connector looks clean - no corrosion or signs of liquid.\n\nExternal image is not present. I get 0.4 - 0.5 amps on the amp meter, no power cycling. CPU temperature feels normally warm."}
{"post_id":56409,"thread_id":56368,"title":"820-00239 - Not Booting","user_id":682,"username":"2informaticos","post_date":"2020-02-03 10:45:59","message":"You could have bad CPU, or just a simple corroded resistor.\nIs your choice to start check them, one by one.\nHigh ohm resistor need to be measured out of board.\nAlso possible to have accumulated crap under CPU; try to heat it with good flux."}
{"post_id":56410,"thread_id":56368,"title":"820-00239 - Not Booting","user_id":1358,"username":"mccafe","post_date":"2020-02-03 11:50:52","message":"I was able to fix the issue by replacing R6110 (SPI ROM data line) 22 ohm and R1452 (PCIE_WAKE_L) 10K ohm\n\nThank you for your help!"}
{"post_id":56411,"thread_id":56368,"title":"820-00239 - Not Booting","user_id":682,"username":"2informaticos","post_date":"2020-02-03 12:22:04","message":"Really happy end of this story :D."}
