{"post_id":78328,"thread_id":61510,"title":"802-00165 PFM001 (SMC), NCD001 (camera), PPN001 (power management system), fan @ 100%, after liquid ingress","user_id":22870,"username":"joshAU","post_date":"2021-08-01 19:12:12","message":"Hi all.\n820-00165-A (Macbook air A1466) with liquid ingress.\n\nErrors:\nPFM001 (SMC)\nNCD001 (camera)\nPPN001 (power management system)\nwhile running Apple diagnostics\n\nFan @ 100% when operational.\n\nAfter liquid ingress around keyboard connector area and near WLAN card. (see photo)\nA tiny amount was near U5000 as well, none under, but two tiny spots, near L5001 and R5100. (see photo)\n\nI removed the logic board and cleaned.\nNo signs of damage, some corrosion that was cleaned off.\nReset SMC\/PRAM a few times.\nCustomer doesn't use camera (taped over), and system seems to be running OK, i.e. not slow, and I could put on SSD Fan Control to control fan, but would prefer a proper fix, if you have any suggestions?\n\nReflow SMC?\n\nThanks for any help you can provide."}
{"post_id":78337,"thread_id":61510,"title":"802-00165 PFM001 (SMC), NCD001 (camera), PPN001 (power management system), fan @ 100%, after liquid ingress","user_id":682,"username":"2informaticos","post_date":"2021-08-02 04:04:21","message":"SMC must be reballed when detect corrosion on its area.\n\nFirst try disconnecting webcam; if works good, there is a problem with ALS.\nSecond step, test with known good trackpad flex\/board.\nAlso LIO board has a thermal sensor; so, if needed, try another LIO flex\/board."}
{"post_id":78638,"thread_id":61510,"title":"802-00165 PFM001 (SMC), NCD001 (camera), PPN001 (power management system), fan @ 100%, after liquid ingress","user_id":22870,"username":"joshAU","post_date":"2021-08-10 01:30:13","message":"Thanks for your advice 2informaticos.\nSorry for the delay.\nThe customer never used the webcam, and was happy enough to take it as it was, as they are planning on replacing it soon anyway, so I put on SSDFanControl and let it go at that."}
