{"post_id":89842,"thread_id":62762,"title":"820-00840-a Works well but not recognizing USB devices","user_id":39005,"username":"DoubleGrinder","post_date":"2022-06-03 14:20:31","message":"Hello,\n\nI have another macbook that had liquid damage that I repaired, it had a short to ground under U2800, as well as a damaged J3300 which I replaced both of making it boot and operate as normal.\n\nThe only item that does not work properly is that the device will not recognize or show a USB flash drive that I plugged in, it will provide some power to the USB flash drive as indicated by a faint glow on the LED inside the flash drive, but otherwise there is no response to the drive. I tested several other drives to make sure it wasn't the USB drive that was unresponsive.\n\nI have replaced PI3USB32224BXEAE twice from two donor boards, but still have the same effect of no response from the computer when a USB is plugged in.\n\nAre there other chips that manage USB connectivity other than PI3USB32224BXEAE and U2800?"}
{"post_id":89843,"thread_id":62762,"title":"820-00840-a Works well but not recognizing USB devices","user_id":682,"username":"2informaticos","post_date":"2022-06-03 16:13:32","message":"Check if you get 5V on the USB device.\nDid you try another USB-C hub?"}
{"post_id":89846,"thread_id":62762,"title":"820-00840-a Works well but not recognizing USB devices","user_id":39005,"username":"DoubleGrinder","post_date":"2022-06-03 16:40:01","message":"I only have access to the one USB-C Hub, but it works on my primary macbook.\n\nWhen working on my primary MacBook, the Flash drive pulls 5.04v, 0.09a\n\nWhen plugged into the non-working USB MacBook the drive pulls, 5.08v, 0.0007a or 0.7ma"}
{"post_id":89849,"thread_id":62762,"title":"820-00840-a Works well but not recognizing USB devices","user_id":682,"username":"2informaticos","post_date":"2022-06-03 18:48:34","message":"Check if problem persists in USB 2.0 and 3.0 modes.\nUse a mouse for USB 2.0 test."}
{"post_id":89852,"thread_id":62762,"title":"820-00840-a Works well but not recognizing USB devices","user_id":39005,"username":"DoubleGrinder","post_date":"2022-06-03 19:37:53","message":"So I tested using USB 2.0 and 3.0 using both a mouse and a flash drive and it seems like initially they are fully powered for 0.1 second (lights are at full brightness for both the mouse and the flash drive) but then nearly immediately dim (the flash drive) or the light goes out completely and is unresponsive (the mouse)\n\nSo it seems like they can be fully powered, its just power is being cut to them almost immediately after being plugged in"}
{"post_id":89853,"thread_id":62762,"title":"820-00840-a Works well but not recognizing USB devices","user_id":682,"username":"2informaticos","post_date":"2022-06-03 19:42:52","message":"Confirm if USB device loss power.\n5V output is going through CD3215; both ports have same behavior?"}
{"post_id":89860,"thread_id":62762,"title":"820-00840-a Works well but not recognizing USB devices","user_id":39005,"username":"DoubleGrinder","post_date":"2022-06-04 00:02:13","message":"Immediately after plugging in the USB flash drive the ammeter jumps to 5.01v 0.0554amp for about 0.5 seconds then goes back down to 5.01v 0.0007 amps, \n\nSame behavior on both ports"}
{"post_id":89863,"thread_id":62762,"title":"820-00840-a Works well but not recognizing USB devices","user_id":682,"username":"2informaticos","post_date":"2022-06-04 04:06:38","message":"So USB power is maintained.\nIn this case you have problems with data lines.\nCheck diode mode and voltage; compare with good board.\n\nAlso check continuity from USB terminals to corresponding points on the MLB.\nMaybe some resistors got broken, or knocked off in J3300 area.\nThere are also many protection diodes."}
