{"post_id":90326,"thread_id":62814,"title":"power supply ribbon cable connector pulled off board :*(","user_id":39610,"username":"jack2423","post_date":"2022-06-20 19:36:14","message":"Hey Everyone,\n\nI need some help y'all. I messed up my wifes computer so im in the dog house.  I accidentally ripped off of the board the batter power supply connector for the ribbon. Does anyone have any clue where i can get a replacement connector? I can solder fine i have access to reflow station at work so i can get it fixed i just need the part...\n\n2020 MacBook Pro Retina"}
{"post_id":90330,"thread_id":62814,"title":"power supply ribbon cable connector pulled off board :*(","user_id":682,"username":"2informaticos","post_date":"2022-06-21 02:03:09","message":"First of all, welcome to the forum!\n\nThe easiest way should be to get a dead battery and remove the connector.\nMake a visit to local laptop repair shops.\n\nPossibly some connectors from scrap logic boards may have same configuration.\nCompare with microphone connector, for example.\n\nTo remove the old connector, use 138 degrees solder paste; will make the job easy."}
{"post_id":90417,"thread_id":62814,"title":"power supply ribbon cable connector pulled off board :*(","user_id":39610,"username":"jack2423","post_date":"2022-06-23 16:08:27","message":"so the connector on the motherboard side is bad, the ribbon cable already got a new one from ifixit so that was easy. \nDo you guys in your shop have any scrap boards for sale? maybe from a completed data recovery? Doesnt seem much available on ebay for this model and the local shop i looked into was no help :\/"}
{"post_id":90418,"thread_id":62814,"title":"power supply ribbon cable connector pulled off board :*(","user_id":39610,"username":"jack2423","post_date":"2022-06-23 16:09:12","message":"oh yea its model a2289"}
{"post_id":90419,"thread_id":62814,"title":"power supply ribbon cable connector pulled off board :*(","user_id":682,"username":"2informaticos","post_date":"2022-06-23 17:35:17","message":"Your board should be 820-01987, but any 2016-2020 board should have the same battery connector.\nThis connector has 10 pins, but only 3 active lines, plus ground.\nSo, you could solve the problem soldering 4 wires.\nIn such case, be aware to disconnect first the wire from pin 7, if you want to work on the board.\nAlso, solder this wire as last one; when you only need to put the back cover.\n\nLook at similar connectors from other boards.\nMaybe microphone connector can help."}
