{"post_id":72956,"thread_id":60913,"title":"[Solved]: A1466 (820-00165-A) sensor issue","user_id":29628,"username":"Askaleto","post_date":"2021-03-11 14:01:58","message":"Hello to all,\n\nI have an old problem, but starting a new thread in order to present all relevant information for this particular macbook in one place.\n\nI have repaired the board 820-00165-A, by replacing U8030. The laptop worked normally for a few hours and then fan just ramp to full speed.\nAt first I didn't notice any performance issue (YouTube, Netflix etc worked without glitches). Later I have found out that CPU speed is limited to max 1.0 GHz, but according to the specifications it is 1.6 GHz I5-5250U with Turbo boost up to 2.7 GHz, 4 GB RAM , 128 GB SSD.\n\nHWMonitor shows that 4 sensors are failed (actually 5, but \"meomory proximity doesn't exist in reality). Below keyboard cable is liquid presence indicator and it is white, meaning water wasn't there.\n\nWhat I have tried so far:\n1. disconnected web cam connector and issue is still there\n2. I have obtained new trackpad with new flex cable (actually used, but disassembled from working computer). I have connected the new trackpad, and issue still exists. This comes as a big surprise, because I expected problem would be solved with a new trackpad.\n\nSo, I need further advices. I believe that issue may be with U5810, if all those 4 sensors are connected to the same chip. According to the schematics (page nr. 44, this chip is for TBT, MLBBOT and TBD Temp Sensor)\n\nSo, I kindly somebody here, who have the same MBA with the same motherboard, is it possible to disconenct the trackpad. then starts laptop and post HWMonitor readings?\n\nHow to proceed further? Should I check if supply voltage is present on U5810? This chip is on the other side of the board and is not easy accessible.\n\nAny help is welcome, this problem is really a puzzle for me."}
{"post_id":72959,"thread_id":60913,"title":"[Solved]: A1466 (820-00165-A) sensor issue","user_id":682,"username":"2informaticos","post_date":"2021-03-11 16:46:55","message":"If only one sensor is triggered, HWMonitor should not show more sensors failing.\nThere should be a problem with an interface, which prvent correct communication on that bus.\nIf already discarded webcam and trackpad, then try known good LIO board\/flex.\nAlso inspect U5800 area."}
{"post_id":72965,"thread_id":60913,"title":"[Solved]: A1466 (820-00165-A) sensor issue","user_id":29628,"username":"Askaleto","post_date":"2021-03-11 23:45:54","message":"Is LIO board\/flex from any A1466 compatible with A1466 (early 2015 - 820-00165)?"}
{"post_id":72971,"thread_id":60913,"title":"[Solved]: A1466 (820-00165-A) sensor issue","user_id":682,"username":"2informaticos","post_date":"2021-03-12 05:13:53","message":"2014\/17 Air LIO boards and flex compatible."}
{"post_id":72987,"thread_id":60913,"title":"[Solved]: A1466 (820-00165-A) sensor issue","user_id":29628,"username":"Askaleto","post_date":"2021-03-12 10:21:56","message":"Thank you. I have made a test, disconnected flex I\/O cable and start with battery. The MBA booted as usually and HWMonitor showed exact same valies as already posted here. It was very unexected for me. Except for lack of audio, there were no other signs of additional slowdown. I expected very slow laptop. Since everything was the same (except audio and of course USB) this is indication to me that problem is more likely with flex and\/or LIO board.\n\nAfter close examination of flex cable, I have found something, shown in the attachment. So my next suspect is flex cable. I have used alcohol and a toothbrush to clean connecter, but problem still exists. I have ordered and waiting for a new flex cable to check.\n\nSo it is possible that Palmrest sensor (and others) share the same interface as LIO board. I would never expected this based on the values from HWMonitor. But it is obvious there is some dirt on the flex cable. I never examine this before, since audio, USB and power was working fine. This cable is connected to J9500 connector on the mainboard."}
{"post_id":72996,"thread_id":60913,"title":"[Solved]: A1466 (820-00165-A) sensor issue","user_id":682,"username":"2informaticos","post_date":"2021-03-12 10:54:53","message":"Sometime is possible to recover it using fiber glass pen and resoldering bad pins, if needed.\nHowever, having 5-10 flex cables in stock is the best option."}
{"post_id":73087,"thread_id":60913,"title":"[Solved]: A1466 (820-00165-A) sensor issue","user_id":29628,"username":"Askaleto","post_date":"2021-03-15 02:04:21","message":"Ok, here is an update. Checked with another flex I\/O cable and the issue is still the same. Now, I examined the area around U5810 more closely and found nothing suspicious, but when I measured the resistor R5811, which is 22 K according to the schematics the multimeter showed 4.5 kOhm in one direction and 3.5 kOhm in another (reverse MM plugs). I measured while component is still on the board, so it is not a 100% reliable measurement. Anyway, when connected to the charger, pin 1 of R5811 (PP3V3_S0_TBTMLB_ISNS_R) was 3.28V, but pin 2 (TBT_INLET_THM_L) was 0.12V.\nNow, I know that _L means that signal is present when voltage is low, so I ask for your opinion whether this is OK. But on the other hand, maybe because this signal is low, this means that chip will consider this as a thermal issue present. Not sure how to interpret this. I would expect after 22 kOhm resistor to have voltage but don't know how big load U5810 chip is."}
{"post_id":73088,"thread_id":60913,"title":"[Solved]: A1466 (820-00165-A) sensor issue","user_id":682,"username":"2informaticos","post_date":"2021-03-15 05:27:50","message":"You should check if there is good continuity between MLB and LIO boards; may have bad contacts on J9500.\nAlso try changing U5810."}
{"post_id":73091,"thread_id":60913,"title":"[Solved]: A1466 (820-00165-A) sensor issue","user_id":29628,"username":"Askaleto","post_date":"2021-03-15 05:49:12","message":"I doubt that LIO could be in any connection with this problem. According to the schematics, Trackpad shares SMBUS_SMC_3 and it has connection to the lines that go to U5810. HWMonitor shows Palmrest (trackpad) and 3 other sensors to be 128 °C. \nPull up resistor R5811 is critical for addressing. If this resistor is out of specs, the address will be faulty and there will be no communication.\n\nI would like to ask anybody who has 820-01165 board, to measure resistance of R5811 (while on board) and confirm if the reading is about 22 kOhm."}
{"post_id":73249,"thread_id":60913,"title":"[Solved]: A1466 (820-00165-A) sensor issue","user_id":29628,"username":"Askaleto","post_date":"2021-03-18 11:16:35","message":"After double check, the R5811 is 22k. My multimeter was not good. So I‘m back at the beginning. Is there  any way I can check on SDA and SCL SMbus 3 in diode mode to ground to try to find out what is the problem? I don‘t have new LIO board, but don‘t understand how this could influence Palmrest reading. According to the schematics, LIO sensor doesn‘t not share same bus line. Also battery charging works Ok, audio as well as USB. It is very unlikely that LIO has a fault that only influence temperature readings.\nMaybe to try to change U5810? This is last thing before declaring this as SMC issue."}
{"post_id":73254,"thread_id":60913,"title":"[Solved]: A1466 (820-00165-A) sensor issue","user_id":682,"username":"2informaticos","post_date":"2021-03-18 12:01:33","message":"Finstack temp sensor is placed on LIO board.\nIt has separate bus, but is better to discard an issue with known good LIO flex\/board.\n\n\"Also inspect U5800 area.\"\nU5800 is also placed on separate bus.\nBut is also temp related, so may be involved."}
{"post_id":73283,"thread_id":60913,"title":"[Solved]: A1466 (820-00165-A) sensor issue","user_id":29628,"username":"Askaleto","post_date":"2021-03-19 00:59:30","message":"Thank you for your reply 2informaticos. Different name used for sensors is also a big problem in troubleshooting. For example, I have installed TG Pro and there all temperatures were OK except Palm rest wasn't displayed. It is possible that TG Pro doesn't display sensor data at all if they're not in a range.\nDown in the diagnostics, there was a yellow flag with message that there might be a problem with HDD and PS sensor, which is additionally confusing. I have inspect U5800 visually and measured resistors around it. Found nothing out of order. I have ordered now a new DC I\/O board even though I'm convinced that it is not a source of a problem."}
{"post_id":73286,"thread_id":60913,"title":"[Solved]: A1466 (820-00165-A) sensor issue","user_id":682,"username":"2informaticos","post_date":"2021-03-19 06:35:00","message":"Somewhere on Internet exists an ASD mod for 2015 Air boards\nI did all the steps mentioned there and got the ASD, but I don't find it now."}
{"post_id":73288,"thread_id":60913,"title":"[Solved]: A1466 (820-00165-A) sensor issue","user_id":1057,"username":"piernov","post_date":"2021-03-19 07:28:03","message":"[URL unfurl=\"true\"]http:\/\/web.archive.org\/web\/20200202143909\/http:\/\/honestgeek.ca\/2018\/10\/19\/asd-for-2015-systems\/[\/URL]"}
{"post_id":73363,"thread_id":60913,"title":"[Solved]: A1466 (820-00165-A) sensor issue","user_id":29628,"username":"Askaleto","post_date":"2021-03-22 07:19:01","message":"I'm continuing chasing the problem of multiple 128 deg C reporting. LIO board s not the soruce of the problem. I have found some discrepancies between resistor values on the schematics and actual values on the board.\nPull up resistors R5390 and R5391 are 2 kOhm according to the schematics, but in reality I measure with a good multimeter 0.99 kOhm and 0.97 kOhm. These are conencted between SMBUS_SMC_3_SCL\/SDA and 3.3V S0 line.\nAlso, resistance between legs 9 and 10 of U5810 (SMC_3 SDA and SCL) is 300 ohms. In diode mode (red probe on ground) I have the follwoing readings: SMC_3 SCL: 0.685, SMC_3 SDA:0.591 SO here there is a slight discrepancy.\n\nSince I dn't have a good known 00165-A board, I cannot say if these values are correct. I would expect a complete symmetry (in diode mode) of SDA and SCl to ground. My biggest concern is the values of pull up resistors R5390 and 5391. Similar resistors on MBUS_SMC_1_S0_SCL\/SDA lines R5360 and R5361 have indeed 1.98 kOhm just like on the schematics (2kOhm)."}
{"post_id":73364,"thread_id":60913,"title":"[Solved]: A1466 (820-00165-A) sensor issue","user_id":682,"username":"2informaticos","post_date":"2021-03-22 08:06:43","message":"You cannot expect to get nominal reading for a resistor measured onboard.\nIn fact, depends of configuration.\n\nYou can check diode mode on SCL\/SDA lines disconnecting trackpad flex.\nSMC is involved in the readings too..."}
{"post_id":73368,"thread_id":60913,"title":"[Solved]: A1466 (820-00165-A) sensor issue","user_id":29628,"username":"Askaleto","post_date":"2021-03-22 08:59:55","message":"Well, after more than a month struggling with this unfortunate repair, I can say that I have fixed the problem. After all, the job is to make the customer happy. The palm rest temperature (which was the main reason for throttling and fan full speed) is measured as normal again. The problem was U5810 which caused disturbance on SMBUS_SMC_3_SCL\/SDA. \nThe problem is eliminated by removing the U5810 chip completely from the board. I have tried once before to replace it but that didn't solve the problem.\nIt's like pulling out a rotten tooth. Now I have the HWmonitor readings like attached. Also during stress test CPU enters turbo boost and is no longer limited to 800\/900MHz. The laptop is made great again and this reminded me why I used to avoid MacBooks.\nThank you all for your help and patience.\n\nBest regards."}
