{"post_id":49344,"thread_id":49344,"title":"820-00923: Won't bootup, high fan for 5secs, shuts off, then steady high spin","user_id":1984,"username":"macRepairAmb","post_date":"2019-05-20 17:23:47","message":"Hello, have a A1706 (820-00923 or 00239), doesn't bootup (no usbC connector pong sound or image on display), but right fan starts out spin high for like 5 or so second, shutoff then comes back on high again and remains on. Left fan only comes on when i leave the trackpad unplugged, so suspect there may also be issues with the trackpad.\n\nNo liquid damage, but the laptop was dropped, which is when the issue started. Not sure where to start here as the usual power rails are all present. \n\nThe A1706 laptops should bootup even when the keyboard is discounted, right?"}
{"post_id":49354,"thread_id":49344,"title":"820-00923: Won't bootup, high fan for 5secs, shuts off, then steady high spin","user_id":682,"username":"2informaticos","post_date":"2019-05-21 06:07:20","message":"All iCore must start automatically, when charger is connected.\nDropped machine is usually a nightmare to repair.\nYou could have some broken traces, or balls, under some BGA chip.\nDisconnect all from the MLB, let only USB-C connected and test USB activity when charger is connected."}
{"post_id":49362,"thread_id":49344,"title":"820-00923: Won't bootup, high fan for 5secs, shuts off, then steady high spin","user_id":1984,"username":"macRepairAmb","post_date":"2019-05-21 12:20:24","message":"The is power coming from the usbc port just no activity. I can power up a usb device, but when I plug in a thumb drive or external drive, I don?t get any activity."}
{"post_id":49366,"thread_id":49344,"title":"820-00923: Won't bootup, high fan for 5secs, shuts off, then steady high spin","user_id":682,"username":"2informaticos","post_date":"2019-05-21 12:56:43","message":"If machine is confirmed as dropped, I wouldn't waste time on it..."}
{"post_id":49521,"thread_id":49344,"title":"820-00923: Won't bootup, high fan for 5secs, shuts off, then steady high spin","user_id":1984,"username":"macRepairAmb","post_date":"2019-05-27 19:10:41","message":"Yep, it was dropped. Was hoping there some key signals that one could check for after the fan turns on. But you are probably right as there most like is a broken trace, either one of the components or between the layers of the board, Thanks for the assist."}
