{"post_id":23647,"thread_id":23647,"title":"[SOLVED]820-3536 Backlight","user_id":170,"username":"rob777","post_date":"2017-07-31 01:54:23","message":"Need some help please sorry.. ok so pin 1 at LCD connector I have 0v\nU7700 has pp5v__s0 going in. \nPpvin_s0sw_lcdbklt_r is present going into u7700 and q7700.\n\nlcdbklt_sw is missing along with ppvin_s0sw_lcdbklt\n\ni have replace q7700 and reballed a used u7700 from donor board. \n\nCould the u7700 be the problem here?"}
{"post_id":23652,"thread_id":23647,"title":"[SOLVED]820-3536 Backlight","user_id":36,"username":"aprendiz","post_date":"2017-07-31 11:15:03","message":"Do you have imagen? Only no backlight?"}
{"post_id":23662,"thread_id":23647,"title":"[SOLVED]820-3536 Backlight","user_id":170,"username":"rob777","post_date":"2017-07-31 19:59:52","message":"Was only no backlight but problem solved. I came in with a fresh mind and fresh eyes this morning. Spent 2 mins looking, changed the LCD cable and problem solved 15min total. Spent a good two hours last night testing and changing crap..."}
{"post_id":23737,"thread_id":23647,"title":"[SOLVED]820-3536 Backlight","user_id":893,"username":"2andrewd","post_date":"2017-08-02 23:26:31","message":"No intent to hijack here.. Just some curiosity:\n\nChanging lcd cable requires prying off the bezel or top glass piece correct? How are you doing this without scratching the display itself. I puled a good LCD out of its housing without damaging it in order to throw it into a display with functional backlight. Got it in some how and misinterpreted Duke's instruction to re use original glue, clamp it and wait. Got to the last edge portion and good night nurse. \n\nI layed kapton tape around the border to negate cosmetic damage to the display.. What's the trick?"}
{"post_id":23738,"thread_id":23647,"title":"[SOLVED]820-3536 Backlight","user_id":375,"username":"gcain","post_date":"2017-08-03 00:11:24","message":"The rMBP have the other side of the LVDS (or DP really I think) under the plastic cover. It's not under the glass like with the older A1286 et al."}
{"post_id":23739,"thread_id":23647,"title":"[SOLVED]820-3536 Backlight","user_id":893,"username":"2andrewd","post_date":"2017-08-03 01:17:10","message":"Ahhh. Got ya."}
