[
    {
        "post_id":24779,
        "thread_id":24779,
        "title":"820-3209 - Random power downs and 1\/5 chance of getting \"3 beeps\"",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-08-29 08:01:34",
        "message":"Hi everyone,\n\nNo idea about the backstory here.\nDoesn't look like water damage as all the indicators are white and I see no marks at all on the motherboard. The motherboard has most likely never been removed from the case, but the cpu cooler has been before (Noticeable because the little rubber on the fan was not sticking on anymore). There was not a lot of paste on there so I replaced this for good measure but it did not solve the issue. I don't think this could've caused any issue because even though there was not a lot of paste, it did have enough paste not to destroy the cpu.\n\nThe battery in this system is not original, but from a different company called LMP. The battery works fine\n\nThe system boots into the OS but after a while (sometimes 10 seconds, sometimes a couple of minutes) it just powers down all of the sudden. No warning, it just goes back to S5. The charging light stays consistent (no SMC reboot). In some rare cases the system does not respond to the power button anymore after this happened and the charger needs to be reconnected to get it to respond again. This is with the battery holding enough change and keeping the S5 and G3H power lines up so the system does not reset or anything.\n\nOn battery the system pretty much always works but powers down randomly, but with the charger plugged in there is a random 20% chance of getting 3 beeps before the system powers down again.\n\nWhere to look in this case? To me it sounds like the 3 beeps are just happening because something is going wrong with the CPU and that happens to be while the memory is being initialized. PPDDR_S3 is stable at 1.34V\n\nEDIT: The hotter the system is the bigger the chance of it passing POST but powering off right after or sometimes even while the \"dong\" sound is still being played. Not sure what this might mean though. Cracked solder joint? After the system crashed off it can not be powered on again (the SMC does not respond to SMC_ONOFF_L)\nEDIT2: Seems to be the PCH thats overheating"
    },
    {
        "post_id":24780,
        "thread_id":24779,
        "title":"820-3209 - Random power downs and 1\/5 chance of getting \"3 beeps\"",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-08-29 08:08:54",
        "message":"This one is going to suck...probably a bad RAM chip. Very small chance of crap under one of the chips, but with no liquid (presumably), then it's going to be a lot more difficult. Such an old board, might want to consider if it's worth taking this repair on."
    },
    {
        "post_id":24781,
        "thread_id":24779,
        "title":"820-3209 - Random power downs and 1\/5 chance of getting \"3 beeps\"",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-08-29 08:29:09",
        "message":"I'll see if a nice and good reflow helps but I'm definitely not replacing or taking off the chips, I don't charge enough for that haha\n\nJust to be sure, the system sometimes does actually POST and boot. Would this still be a ram issue? Woudn't the system just freeze and\/or kernel panic if it was?"
    },
    {
        "post_id":24789,
        "thread_id":24779,
        "title":"820-3209 - Random power downs and 1\/5 chance of getting \"3 beeps\"",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-08-29 11:25:00",
        "message":"PCH is overheating\n\nKeeping it cooled by rubbing soaked cotton swaps over it and making sure there is isopropanol laying on top of it (Meaning it is less then 82C on the surface) keeps the system booted for a little while. But once I stop applying fresh isopropanol it takes just a couple of seconds before the system shuts down.\n\nPower cycling the system while the PCH is very hot (right after all the isopropanol has evaporated) gives the 3 beep error, letting it cool down for a couple of seconds makes it POST again.\n\nSo I found the issue, now the solution :)\n\nEDIT: Did some testing because I wanted to know if it was just me wanting to believe its the issue or it actually being.\nSeconds are the time it takes before the system powers down unexpectedly, cooldown is the time I wait between testing after a unexpected powerdown\n\n61s, air - 2 min. cooldown period\n98s, air - 15 min. cooldown period\n119s, isopropanol, 2 min. cooldown period\n162s, big heat transfer pad, 2 min. cooldown period\n\nEDIT2: Might it be worthwhile to give the big heat transfer pad method another try while running EFI ASD to check the sensors? EFI ASD because I'm not sure if I can get it to OS ASD in time. The small tests should take about 60 seconds so the 2 to 3 minutes I can get the system to run should be enough\n\nEDIT3: Too bad, EFI ASD gives no sensor errors [ATTACH alt=\"Click image for larger version  Name:\tIMG_20170829_232431.jpg Views:\t1 Size:\t811.9 KB ID:\t24805\"]24805._xfImport[\/ATTACH]\n\nProbably going to reflow it tomorrow if no one else has any other idea's. If that won't fix it its probably semi-shorted internally and just not worth my time"
    },
    {
        "post_id":24818,
        "thread_id":24779,
        "title":"820-3209 - Random power downs and 1\/5 chance of getting \"3 beeps\"",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-08-29 18:13:14",
        "message":"Reflow won't fix anything. If you are going to do anything then replace the PCH and fix the ME region. These boards are garbage."
    },
    {
        "post_id":24905,
        "thread_id":24779,
        "title":"820-3209 - Random power downs and 1\/5 chance of getting \"3 beeps\"",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-08-31 10:27:31",
        "message":"I assume the PCH can not be replaced by hand and requires a BGA machine to have a reasonable chance of success?"
    },
    {
        "post_id":24944,
        "thread_id":24779,
        "title":"820-3209 - Random power downs and 1\/5 chance of getting \"3 beeps\"",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-09-01 16:01:46",
        "message":"I can do it without BGA machine, but really this board isn't worth the effort and risk I think. I may have a stack of these board somewhere, send me a DM if interested."
    },
    {
        "post_id":24979,
        "thread_id":24779,
        "title":"820-3209 - Random power downs and 1\/5 chance of getting \"3 beeps\"",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-09-02 19:08:58",
        "message":"If I'm going to be doing this in the future I feel like I should learn it on something thats not owned by the customer first.\n\nDecided to set the repair to unsuccessful and ready for pick up. The customer knows the device does work for a couple of minutes so if I don't succeed with soldering the PCH the system won't boot and I'm not risking a \"you broke it\" customer.\n\nThanks for the offer though!"
    }
]