{"post_id":51913,"thread_id":51913,"title":"MBP Early 2013 15\" Retina - Battery\/Charging","user_id":8328,"username":"CoastechNZ","post_date":"2019-08-31 18:15:32","message":"Kia Ora (hello) from New Zealand! \n\nmy first post on here, I'm still a complete NOOB when it comes to board repair, but you gotta start somewhere right!\n\nApologies for the novel, I'm looking for some troubleshooting advice on a customer's MacBook Pro Early 2013 15\" Retina that I've got here for what should have been a simple battery replacement, but I'm now thinking has a board\/SMC\/power problem of some sort.\n\nPrevious battery was completely shot, only held charge for a few minutes.\n\nOrdered 'OEM' battery (Supposedly....) from a supplier that I've used before and has been pretty good to date. Seemed ok at first, Battery stats in System Report looked ok, Coconut battery looked good too. I reset SMC after installing, cycled the battery a couple of times (Charged to 100%, left charging until coconut battery reported 100%, drained it until it shut off, left for a while, re-charged to 100.....)\n\nCustomer reported a couple of days later that the battery was working great, but while discharging, at around 60% remaining it would suddenly drop to 7%. It would stay at 7% for a good length of time, maybe another hour or so, and then slowly continue discharging until it went dead. Activity report showed the sudden drop, so I didn't think it was a problem with the system reporting % incorrectly.\n\nCustomer was OK to use it like this, he was just happy that he was getting a few hours out of it on battery, until a couple of weeks later, the batter's Max capacity suddenly dropped to around 70%. So I returned that battery under warranty, and got another one. This  one started out the same, (60% drop to 7%) but after a couple of cycles it started discharging consistently from 100 to ~60%, and then quite quickly from there (not a sudden drop though), and again within about a week, the Max capacity had dropped below about 80%.\n\nSo of course I'm still thinking faulty batteries. The funny thing is, there's a post on the iFixit forum with a bunch of people with similar problems quite recently on this and similar models after battery replacement, so perhaps there's a bad batch of batteries out there affecting a bunch of people all over the world!\n\nSo now I've got yet another battery, from a different supplier this time (definitely a different battery manufacturer from the first too), and this one has dropped max capacity to 82-84% after only one cycle. So I'm thinking surely all 3 batteries from 2 different suppliers aren't faulty!?!?!\n\nI have also noticed recently that I'm no longer getting a chime on startup. SMC reset seemed OK, have done PRAM reset multiple times throughout this process too.\n\nUsing 2 different genuine Apple power adapters to charge - no difference there either.\n\nSo now to my questions:\n\n1. Is it possible for a fault on the Logic Board to:\n\n     a. Cause this type of 'false' reporting (If it is false)?\n\n     b. Damage a battery and cause the drop in reported Max. capacity?\n\n2. Is there anything that I should be checking\/testing on the board to highlight any specific problem? - The board looks OK (under my crappy digital scope at least)\n\n3. Could it be a software\/OS issue?  \n\n4. Or just put it down to faulty batteries? I don't want to order another one of course!!\n\nI know it's a 6-year old MacBook, but it's never missed a beat, and the customer doesn't want to shell out several thousand $ for a new one. I hate to just put this one in the 'too hard' basket, and want to provide some sort of resolution for my customer, but don't just want to go back to him and say 'you've got a Logic Board issue' without at least checking what it could be first.\n\nIf you've gotten this far, thanks for enduring my long-winded post, any suggestions are most welcome and much appreciated!!\n\nThanks!!"}
{"post_id":51917,"thread_id":51913,"title":"MBP Early 2013 15\" Retina - Battery\/Charging","user_id":682,"username":"2informaticos","post_date":"2019-08-31 19:59:55","message":"You cannot trust new chinese battery at all.\nIs better to get original used one for test."}
