{"post_id":19909,"thread_id":19909,"title":"smc by pass","user_id":371,"username":"nate8organic","post_date":"2017-05-08 16:34:22","message":"Does a smc bypass confirm that the smc is bad or can there be x other problems causing the smc to not work,  I have a few boards that green light and charge a battery but i can only get the fan to spin with a smc by pass, i tried a couple smc chips already and no luck so far. i wanted to confirm that the smc is at fault so i can consider bad soldering and or a bad smc chip from the donors. don't want to through out good smc chips from a simple mistake.  the board i'm working on has smc reset present.  \n\nthanks \nNate"}
{"post_id":19915,"thread_id":19909,"title":"smc by pass","user_id":2,"username":"dukefawks","post_date":"2017-05-08 18:06:36","message":"Usually not. Most of the time the issue is the sense resistors around ISL6259."}
{"post_id":19927,"thread_id":19909,"title":"smc by pass","user_id":371,"username":"nate8organic","post_date":"2017-05-08 21:24:55","message":"okay, looking into this i'm getting a voltage drop on pins 5-8 of the q7085, solid 18v on pins 1-4. however if i swap it out it changes nothing. .62v to ground in diode mode.\n\n820-2850 board"}
{"post_id":19933,"thread_id":19909,"title":"smc by pass","user_id":557,"username":"MDY","post_date":"2017-05-09 07:14:56","message":"Duke told you to check Sense resistors. Not to replace isl.\nCheck pin 17-18 and 27-28"}
{"post_id":19949,"thread_id":19909,"title":"smc by pass","user_id":371,"username":"nate8organic","post_date":"2017-05-09 13:15:36","message":"[USER=\"557\"]MDY[\/USER]  Not sure if you read correctly but the q7085 is def not the isl... u7000 is the isl and i have prop res on pin 17-18 and 27-28...  i also checked r7020 pulled it off to see if the drain would go away no change.  q7085 is what is sending power through to the sense resistor line."}
{"post_id":19955,"thread_id":19909,"title":"smc by pass","user_id":2,"username":"dukefawks","post_date":"2017-05-09 14:41:31","message":"\"prop res on pin 17-18 and 27-28\" is not a value\nR7005 ok? Remove F7040 and try again. Dead ISL likely."}
{"post_id":19965,"thread_id":19909,"title":"smc by pass","user_id":371,"username":"nate8organic","post_date":"2017-05-09 16:19:32","message":"3.3 ohms and 20.4 ohms on the isl.. i changed the isl out already. also i have a couple boards with this same issue.  they all have power drain on the q7085.  not all of them fan spin with smc bypass.  the one i'm pulling reading from does not spin from an smc bypass.  \n\nr7005 is solid 18v on both sides.  \n\nremoved f7040 and still a voltage drop,pin 2 is 1.4v and pin 1 is dropping to 0v. you wanted me to remove f7040 and check voltages again right? not sure 100% what i am suppose to do after i remove the f7040. (sorry)"}
{"post_id":19983,"thread_id":19909,"title":"smc by pass","user_id":2,"username":"dukefawks","post_date":"2017-05-10 05:31:43","message":"Badly soldered ISL, I have no clue. Seeing as in your other topic you kill the green light by just replacing a FET, anything is possible at this point.\nF7040 was removed to rule out the board tripping the PPBUS line. The issue is 100% sure in the U7000 circuit. Check R7005 value, not just voltage."}
{"post_id":20006,"thread_id":19909,"title":"smc by pass","user_id":371,"username":"nate8organic","post_date":"2017-05-10 14:17:28","message":"okay thanks that makes sense.  i did swap the isl out a few times with no luck but i'm always happy to try again haha.  \nr7005 is 20.7 ohms i compared with another board and was getting 20.6 ohms so it seems good."}
{"post_id":20015,"thread_id":19909,"title":"smc by pass","user_id":2,"username":"dukefawks","post_date":"2017-05-10 14:52:41","message":"No idea. Read datasheet on ISL6255 it is sorta the same and explains under which conditions the input FETs get opened."}
{"post_id":20032,"thread_id":19909,"title":"smc by pass","user_id":371,"username":"nate8organic","post_date":"2017-05-10 17:03:05","message":"okay i will read over that and try to get a better understanding of how everything is working there."}
