{"post_id":6563,"thread_id":6563,"title":"820-3115 Main DC-In Voltage Cycling Up and Down. Low is 1.8V. High is unknown.","user_id":135,"username":"bjf","post_date":"2016-09-10 15:48:27","message":"I have an 820-3115 board that had a destroyed ISL6259. Liquid-damage. I've run a number of wires to repair the charging-sense lines. Replaced U7000, U7085, U7080, Q7030 and all charging-sense resistors. The main 18.5V DC line cycles up and down from 1.8V up to an unknown number. No magsafe light. No known shorts. I've been digging through the Inrush Limiter and Reverse-Current Protection circuits looking for bad components or lines but can't find anything. Any ideas where to go next?"}
{"post_id":6565,"thread_id":6563,"title":"820-3115 Main DC-In Voltage Cycling Up and Down. Low is 1.8V. High is unknown.","user_id":2,"username":"dukefawks","post_date":"2016-09-10 16:22:50","message":"Do you have a fake Chinese charger? They will not shut down and make trouble shooting easier. First you need a green light."}
{"post_id":6822,"thread_id":6563,"title":"820-3115 Main DC-In Voltage Cycling Up and Down. Low is 1.8V. High is unknown.","user_id":135,"username":"bjf","post_date":"2016-09-16 14:15:12","message":"Ok, pulled one out of the junk pile, thanks for that tip. It gives me steady DC-in voltage (18.5V) and 4.4V on CHGR_ACIN. SMC_BC_ACOK is 0.09V. Diode measurement on that pin 14 is .475. All other ISL diode measurements are also normal."}
{"post_id":6825,"thread_id":6563,"title":"820-3115 Main DC-In Voltage Cycling Up and Down. Low is 1.8V. High is unknown.","user_id":1,"username":"larossmann","post_date":"2016-09-16 14:26:09","message":"If CHGR_DCIN is 16v and current sensing circuit is ok(resistance between pins 17\/18 of U7000 is 2.3 ohms and resistance between pins 27\/28 of U7000 is 20.2 ohms), then that's a bad U7000 or some odd soldering in that area, or perhaps a fucked pullup. How is R5087 looking? SMC_BC_ACOK has to be up before we can go through the rest. On rare occasion a sensor transistor or the SMC can pull SMC_BC_ACOK down but it would still be 0.54v, not 0.09v. So I think funky ISL6259 area or screwed R5087."}
