[
    {
        "post_id":93498,
        "thread_id":63211,
        "title":"iMac 2017 21.5 820-00597 Logic Board No Power",
        "user_id":35583,
        "username":"ideachief",
        "post_date":"2022-10-25 21:28:32",
        "message":"Hello, I have an 820-00597 Logic Board from a 2017 21.5 inch iMac.  I bought this board as-is so I don't know the history.  There were two electrolytic caps that were broken off that I replaced (C6515 & C6526), other than that I can not find any damage.  I'm bench powering this board, and my power supply reads it's drawing 0.000 Amps, but I can measure voltage at the connector and at the first few components that the power is connected to (caps, resistors, IC's, etc.).  Obviously there is something open on the board, since it doesn't draw any power and none of the diagnostic LED's are coming on at all.  Before I go any farther with it, can anyone recommend where to look to see what might be open?  I don't see anything that was damaged (like a blown IC or cap or resistor).  I will continue to look to see if anything else was knocked off the board.\n\nUpdate:  I noticed that the board does draw a small amount of current when I first turn on the power supply (~0.020 Amps) and that the first diagnostic LED briefly lights.  So, I probably have a short somewhere?"
    },
    {
        "post_id":93532,
        "thread_id":63211,
        "title":"iMac 2017 21.5 820-00597 Logic Board No Power",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-10-28 17:30:22",
        "message":"First of all, remove CMOS cell; board should turn on automatically.\n\nQ6970 is the first suspect; try changing it.\nQ8450 is another classic suspect.\n\nIf still the same, check for short to ground on all big coils."
    },
    {
        "post_id":93628,
        "thread_id":63211,
        "title":"iMac 2017 21.5 820-00597 Logic Board No Power",
        "user_id":35583,
        "username":"ideachief",
        "post_date":"2022-11-02 22:29:27",
        "message":"[QUOTE=\"2informaticos, post: 93532, member: 682\"]\nFirst of all, remove CMOS cell; board should turn on automatically.\n\nQ6970 is the first suspect; try changing it.\nQ8450 is another classic suspect.\n\nIf still the same, check for short to ground on all big coils.\n[\/QUOTE]\nI appreciate the reply and the info but, unfortunately, I blew the die right off the chipset.  Was pretty cool I guess.  But yeah, this motherboard is toast."
    }
]