{"post_id":93662,"thread_id":63242,"title":"820-2936-b","user_id":35752,"username":"Anterweb","post_date":"2022-11-03 16:07:15","message":"I'm presuming this is something daft before I start stripping the board out but haven't seen it before, \n\nGreen light on charger, (no orange light) boots and runs fine! Just won't charge \nTried 3 known good batteries. But the odd thing is with the battery disconnected I get No green light and it won't turn on not even in smc bypass.?"}
{"post_id":93672,"thread_id":63242,"title":"820-2936-b","user_id":682,"username":"2informaticos","post_date":"2022-11-03 19:21:42","message":"What voltages did you measure on the board with charger alone (no battery)?\nDid you disconnet the BIL?\nTest the board alone on the desk."}
{"post_id":93688,"thread_id":63242,"title":"820-2936-b","user_id":35752,"username":"Anterweb","post_date":"2022-11-04 17:16:19","message":"Now have just the board on the bench,  Nothing at all connected.\n\nJust spent some time checking all voltages caps and resistors on page 64  of schematic. I cant seem to see anything wrong. all caps and resistors measure good,.\nBut i'm only get around 1.2v and slowley drops on f7040 measuring g3H.\n\nEven when on the bench, I connect the battery and g3hot is fine again and i get a green light and fan spin again! but if I remove the battery f7040 g3h measures 1.2v and slowly drops until magsafe light goes dim green.\n\nIf i reconnect the battery all is fine but it wont recognize the battery or charge then if I remove the battery same effect voltage on g3h slowley drops until magsafe goes dim green\n\nAny help much appreciated,"}
{"post_id":93703,"thread_id":63242,"title":"820-2936-b","user_id":35752,"username":"Anterweb","post_date":"2022-11-06 10:58:53","message":"I convinced myself it was u7000 causing the issue and as I have a bunch of them I poped a new one on today, this has solved the problem with g3h dropping its now a solid 12.22v without battery connected starts fan spin, but fan runs fast! \n\nStill no orange light on charger though. I'll try later to put it back together and see if the system can see the battery.. \nBut looks like I have still got a not charging issue?"}
{"post_id":93704,"thread_id":63242,"title":"820-2936-b","user_id":35752,"username":"Anterweb","post_date":"2022-11-06 15:23:45","message":"OK, I got it all  back together in the case with everything connected. it now boots and runs fine off both mains and battery and with battery connected or not connected, but the system doesn't show a year on about this mac and it doesn't recognise any battery, I've tried 4 known good ones.\nThis has me stumped!"}
{"post_id":93705,"thread_id":63242,"title":"820-2936-b","user_id":35752,"username":"Anterweb","post_date":"2022-11-06 16:16:13","message":"Just tried a known good bios with clean me I grabbed of this forum,, same result\n\nIt seems seems to now run and perform perfectly, from mains, battery or both connected, just no orange light no battery recognised"}
{"post_id":93706,"thread_id":63242,"title":"820-2936-b","user_id":682,"username":"2informaticos","post_date":"2022-11-07 02:05:36","message":"Did you try known good DCIN board?\nAlso test disconnecting BIL.\nIf stiil the same, post U6900\/1 voltages."}
{"post_id":93731,"thread_id":63242,"title":"820-2936-b","user_id":35752,"username":"Anterweb","post_date":"2022-11-07 10:25:54","message":"Did you try known good DCIN board? - Yes tried 3 known good ones to be safe, \n\nBIL I noticed on first removing the board that the BIL cable was ripped in two! ( Could this have caused the problem? must have been done when customer fitted a new battery ) so that has been disconnected for all testing mentioned. \n\nU6900\nSMC_BC_ACOK_VCC = 3.47v\ngnd = 0\nunconnected = 0\nSYS-Onewire = 3.47v\nAdapter_sense = 3.47v\n\nU6901\n1) SMC_BC_ACOK = 2.7v\n 2)SMC_BC_ACOK = 2.7v\ngnd = 0\nSMC_BC_SCOK_VCC= 3.47v\npp3v42_g3h = 3.47v"}
{"post_id":93734,"thread_id":63242,"title":"820-2936-b","user_id":682,"username":"2informaticos","post_date":"2022-11-07 11:06:49","message":"All voltages look good.\nCheck continuity from U6900 to the central pin of DCIN board.\nOn the MLB may be a broken trace between board sides."}
{"post_id":93738,"thread_id":63242,"title":"820-2936-b","user_id":35752,"username":"Anterweb","post_date":"2022-11-07 11:38:26","message":"[ATTACH]60852[\/ATTACH]\n\nI presume you mean take the measurements here?\n\nOnly continuity from the center pin to pin 2 GND on U6900 all traces look good"}
{"post_id":93752,"thread_id":63242,"title":"820-2936-b","user_id":682,"username":"2informaticos","post_date":"2022-11-08 04:41:13","message":"Between pin 5 of U6900 and the central pin of Magsafe connector.\nThere must be a small coil, or 22 ohm series resistor, inside DCIN board.\nBe sure the trace J\/U6900 is good."}
{"post_id":93773,"thread_id":63242,"title":"820-2936-b","user_id":35752,"username":"Anterweb","post_date":"2022-11-08 11:33:08","message":"ahh gotcha \nADAPTER_SENSE  central pin of Magsafe connector to pin 5 U6900 tests fine for continuity, no problem there at all."}
{"post_id":93782,"thread_id":63242,"title":"820-2936-b","user_id":682,"username":"2informaticos","post_date":"2022-11-08 12:06:09","message":"Without BIL connected, battery still not recognised?\nPost diode mode to ground and voltage, on its SCL\/SDA lines.\nTried known good battery for sure (not chinese new)?"}
{"post_id":93787,"thread_id":63242,"title":"820-2936-b","user_id":35752,"username":"Anterweb","post_date":"2022-11-08 12:43:39","message":"[ATTACH]60853[\/ATTACH] I have a pile of these all genuine Apple and all in a good working condition, all same result,\n\nBIL is removed from start of troubleshooting\n\nMeasuring  SCL\/SDA lines on J6950 i get\n\nSDA = 3.46 v \nSCL = 3.46 v\n\nDiode mode to ground\nSDA = 51.0K and slowley rising\nSCL =  51.0K and slowley rising"}
{"post_id":93802,"thread_id":63242,"title":"820-2936-b","user_id":682,"username":"2informaticos","post_date":"2022-11-08 16:51:07","message":"K in diode mode, I don't think.\nHowever should be good, as you got identical ohm values.\n\nRemove SMC and check continuity for its traces to battery and U6900; then replace SMC."}
