{"post_id":42390,"thread_id":42390,"title":"820-4924 No Audio","user_id":468,"username":"ALB-Repairs","post_date":"2018-11-20 06:59:35","message":"820-4924 that has had its audio jack replaced elsewhere. Showing no audio devices in OSX (no chime either)\nI have replaced the codec (u6201) twice, and still pin 4 of J6600 (jack) is O\/L instead of 780 ohms (same with both codec's) \n\nIve followed the line and found no bad traces (but have not checked the pad under the codec, but the BGA site looks clean without damage). \n\nIm not sure i want to lift the codec and have to re-ball again. But something is wrong. I am also worried because it shows no audio devices in system report.\nAnyone got any ideas?"}
{"post_id":42391,"thread_id":42390,"title":"820-4924 No Audio","user_id":468,"username":"ALB-Repairs","post_date":"2018-11-20 07:04:33","message":"Oh yeah, i forgot to say, All the power lines to the Audio codec are fine!"}
{"post_id":42394,"thread_id":42390,"title":"820-4924 No Audio","user_id":682,"username":"2informaticos","post_date":"2018-11-20 08:14:28","message":"Codec should appear in system report, even if bad audio jack...\nHowever, check all small coils L660x.\nAlso check for other knock off components, reball chip if you are not sure about solders."}
{"post_id":42404,"thread_id":42390,"title":"820-4924 No Audio","user_id":468,"username":"ALB-Repairs","post_date":"2018-11-20 09:17:20","message":"Ive checked all small coils.\nThe jack is not bad, The codec has been replaced twice and im pretty certain of the soldering. \nIve checked against other boards for knocked of components, i did find a bad 5V trace to the amplifiers and repaired that, however that will not fix the codec not being recognised in OSX.\n\nDoes anyone know how OSX communicates with the Codec? I think its through the HDA lines?"}
{"post_id":42413,"thread_id":42390,"title":"820-4924 No Audio","user_id":682,"username":"2informaticos","post_date":"2018-11-20 10:21:08","message":"Yes, HDA_ lines, but audio codec should be in conditions to talk with PCH.\nCheck frist high level at HDA_RST_L and R6331."}
{"post_id":42565,"thread_id":42390,"title":"820-4924 No Audio","user_id":468,"username":"ALB-Repairs","post_date":"2018-11-23 04:46:36","message":"Fixed, seems i messed up the codec twice. Wasnt soldering very well that day."}
