{"post_id":5346,"thread_id":5346,"title":"820-3115 no green light","user_id":90,"username":"ytesfay80","post_date":"2016-08-12 21:53:21","message":"The customer said there was no liquid spilled this machine. I did end up seeing very small corrosion on R5072\/R5082 so I replaced them but that looks like the only area I can see liquid damage.\nWhen I plugged in the charger I was seeing a very dim flickering green light. Now there is no green light at all. I tried with another known working dc-inboard but still the same.\n\nWhen I measure F6905 and hold the probe there the voltage is constantly changing from 15.9v to around 18v. The fuse measured fine.\nNext I measured U6901 and I got 0v on every pin. In diode mode I got a 0v short to ground on pin 5(PP3V42_G3H)\nD6990 and pin 4 of U6990 measured around 17v.\n\nL6995 was showing a short to ground in diode mode so I removed it to see which side the short was on and it was on Pin 2.\nI measured the resistance on Pins 17\/18\/27\/28 of U7000 and they were correct so I still went ahead and replaced U7000 but the short is still there.\n\nWhat should I check next?"}
{"post_id":5347,"thread_id":5346,"title":"820-3115 no green light","user_id":2,"username":"dukefawks","post_date":"2016-08-12 22:06:59","message":"Inject 3V from external power supply and see what heats up. Infamous shorted cap is the one under the piece of foam next to the battery indicator connector."}
{"post_id":5363,"thread_id":5346,"title":"820-3115 no green light","user_id":90,"username":"ytesfay80","post_date":"2016-08-13 13:13:11","message":"You were correct I replaced that component and the machine started up. Once I logged in the charger symbol showed 'battery is not charging' and the light on the charger stayed green. On the system information page it did show the battery as being installed and its cycle count.\nI tried with another battery and still the same issue so I replaced R7051\/R7052\/C7050 first then when that didn't solve it I replaced U7000 again.\n\nThis time the green light changed to orange with the battery plugged in but there is no fan spinning or anything. PP3v42_G3H is there but PPBus_G3H is not. I measured F7040 in diode mode and it gives me a short to ground. \n\nMight this be an issue with Q7030 and Q7035?"}
{"post_id":5364,"thread_id":5346,"title":"820-3115 no green light","user_id":1,"username":"larossmann","post_date":"2016-08-13 13:16:07","message":"Remove F7040 and tell us which side of F7040 the short is on."}
{"post_id":5367,"thread_id":5346,"title":"820-3115 no green light","user_id":90,"username":"ytesfay80","post_date":"2016-08-13 13:25:58","message":"The short is on Pin 1.(ISL side)\n\nI measured Q7030 in diode mode and I got shorts to ground on pins 1\/2\/3."}
{"post_id":5379,"thread_id":5346,"title":"820-3115 no green light","user_id":2,"username":"dukefawks","post_date":"2016-08-13 17:09:49","message":"Remove 6259 and check if short is gone, if ok replace with new 6259"}
{"post_id":5399,"thread_id":5346,"title":"820-3115 no green light","user_id":90,"username":"ytesfay80","post_date":"2016-08-14 01:35:08","message":"Ok so a bunch of crap has happened.\nI removed the 6259 and the short was still there so I removed Q7030\/Q7035 and the short was gone. I did as louis says and replaced the ISL6259, Q7030, and Q7035 altogether.\n\nAfter replacing them the short was gone and when I plugged the charger(board only) in the green light came on but no fan spin but PPBUS_G3H was 12.6v. I was checking through the power rails and pp5v_s5 was there was PP5V_S3 was not. Before I could check anymore rails the charger light went back to the dim green light and PPBUS_G3H to 0.18v .\n\nOn U6901 pp3v42_g3h is present but here is no SMC_BC_ACOK. There is no short to ground on SMC_BC_ACOK. SMC_RESET_L is at 3.46v.\n\nIs this a rabbit hole board?"}
{"post_id":5401,"thread_id":5346,"title":"820-3115 no green light","user_id":90,"username":"ytesfay80","post_date":"2016-08-14 07:54:32","message":"Okay some more funny business happening.\nI go to check CHGR_ACOK and I see 3.4v so I check u6901 and I get 3.4v on SMC_BC_ACOK and the 3.4v made its way to Pin 1 of U6900. Pins 4\/5 of U6900 also have 3.4v so I don't understand why the charger light is not bright green yet.\n\nUpdate: I checked the resistance of R7005 and it was showing somewhere in the 3 milliohms area which is way more than the 20 ohms it should be so I replaced it with one from a board that measured the proper resistance and when I put it on this board it is measuring 7 mohms."}
{"post_id":5403,"thread_id":5346,"title":"820-3115 no green light","user_id":2,"username":"dukefawks","post_date":"2016-08-14 11:39:08","message":"milliOhms, Ohms, MOhms. You throw around measurements and units that don't make sense. The only problem with this board was the shorted cap until you messed with the 6259. I have no idea what is wrong now and I cannot rely on your measurements either. ACOK is gone now it is back......\nMy vote is another dead or badly soldered 6259. I cannot diagnose if soldering and measurements are not reliable."}
{"post_id":5405,"thread_id":5346,"title":"820-3115 no green light","user_id":90,"username":"ytesfay80","post_date":"2016-08-14 11:57:02","message":"Sorry about that. I meant MOhms.\nBut I checked the board again and I don't know if it cooling down had any effect but r7005 is measuring properly and the green light is back on but there is no fan spin. I\nI checked a few of the main rails. \nPP5V_S5 and PP3V3_S5 are present\nPP5V_SUS, PP5V_S3, PP5V_S0, PP3V3_SUS, PP3V3_S3, PP3V3_S0 - missing\nPM_SLP_S5_L, PM_SLP_S4_L - missing\nPP3V3_S4 shows around 0.54v and slowly goes down"}
{"post_id":5406,"thread_id":5346,"title":"820-3115 no green light","user_id":1,"username":"larossmann","post_date":"2016-08-14 12:08:13","message":"We need more information to solve PM_SLP_S4_L missing on a board with this. I am with duke that something is badly soldered here, signals that show up then don't show up like SMC_BC_ACOK point to poorly soldered ISL6259."}
{"post_id":5415,"thread_id":5346,"title":"820-3115 no green light","user_id":90,"username":"ytesfay80","post_date":"2016-08-14 16:13:37","message":"Okay I replaced the ISL6259 and I made sure to solder it on correctly. The fan spun so the s0 rails were working. I went to go plug the board into the machine and attach all the cables(HDD LVDS, etc) and when I plugged the charger in the light turned green but no fan spin. \nAgain I went back and replaced the ISL and again the fan spun and I check and PM_SLP_S4_L was 3.4v and PP3V3_S0 was present. I waited about 30 minutes before plugging the charger in again and once more the fan didn't spin.\n\nCould it be that when I am putting the ISL on something in the area is working temporarily from the heat?"}
{"post_id":5431,"thread_id":5346,"title":"820-3115 no green light","user_id":1,"username":"larossmann","post_date":"2016-08-14 22:21:53","message":"something in the machine is obviously causing this, go component by component and figure out what it is.my guess is fucked keyboard\/battery indicator\/trackpad."}
{"post_id":5432,"thread_id":5346,"title":"820-3115 no green light","user_id":90,"username":"ytesfay80","post_date":"2016-08-15 02:55:09","message":"wait I don't understand how those things can cause it to work at one moment then stop working some time later. On the second time I replaced the ISL it was working with only the board plugged into the charger. I didn't plug any external cables into the board."}
{"post_id":5433,"thread_id":5346,"title":"820-3115 no green light","user_id":90,"username":"ytesfay80","post_date":"2016-08-15 04:26:48","message":"Okay I did some reading of the system diagram to see where ppbus_g3h goes and it led me to the TPS51125 and the missing voltages led me to more chips. I also see that some of these enable signals come from the PCH so I hope that is not the issue.\n\nNo PM_SLP_S5_L or PM_SLP_S4_L.\n\nPM_SYSRST_L - 0v\nPM_PCH_PWROK - 0v\nALL_SYS_PWRGD - 0v\n\nPP5V_S5 and PP3v3_S5 are both present.\n\nu7200 (TPS51125) (didn't want to list all 25 pins so I just picked the main ones)\nPin 1(entrip1) - 0v\nPin 2(vfb1) - 0v\nPin 6(entrip2) - 0.785v\nPin 13(en0) - 3.45\nPin 16(vin)- 12.53v\nPin 17(vreg5) - 4.94v\nPin 23(pgood) - 0v\n\nQ7221\n1- 0v\n2- 3.48v\n3- 0.78v\n4- 0v\n5- 0v\n6- 0v\n\nu7941\n1 - 3.5v\n2 - 3.49v\n3 - 3.48v\n4 - 0v\n6 - 3.31\n7 - 0v\n8 - 3.48v"}
{"post_id":5461,"thread_id":5346,"title":"820-3115 no green light","user_id":90,"username":"ytesfay80","post_date":"2016-08-15 20:38:59","message":"Here are some more measurements I got that lead me to believe there is an issue with U7940 but I could be wrong.\n\nPP5V_SUS_FET and P5V_3V3_SUS_EN show 0v\nP5V_3V3_SUS_EN comes from U7940.\nPM_SLP_SUS_L, SMC_BATLOW_L,  and PP3V3_S5_PWRCTL all have at least 3.3v but there is no output on PM_SUS_EN"}
{"post_id":5482,"thread_id":5346,"title":"820-3115 no green light","user_id":90,"username":"ytesfay80","post_date":"2016-08-16 09:58:50","message":"Finally my own troubleshooting has paid off. \nI replaced U7940 and now the board is working and it boots up.\n\nThanks for the help guys."}
{"post_id":5508,"thread_id":5346,"title":"820-3115 no green light","user_id":1,"username":"larossmann","post_date":"2016-08-16 11:04:13","message":"The question here is how U7940 was dying when it was inserted into case!"}
{"post_id":5511,"thread_id":5346,"title":"820-3115 no green light","user_id":90,"username":"ytesfay80","post_date":"2016-08-16 11:08:39","message":"What do you mean by 'inserted into case'?'"}
