{"post_id":55942,"thread_id":55942,"title":"820-00928 shorted UB000","user_id":1744,"username":"PJs","post_date":"2020-01-20 03:13:27","message":"Hello, I've got an issue with 820-00928 (15\" 2017), it came to me dead. Board has no corrosion, but someone obviously reflowed or maybe replaced U7000 and CB704 - I guess that's because Louis did this in one of his videos (it's funny how often I'm getting boards from other repair shops where they did exactly the same thing that Louis did with the same board... even if it's a completely different issue, only with similar symptoms). However there is no problem with PPBUS_G3H, so I guess this part is fine.\n\nI measured and found a short on PP3V3_TBT_T_S0 through UB000. After removing UB000, the short is gone, the board boots and partially works. However when I soldered \"new\" UB000 (from 820-00840 as I don't know where to buy a whole 820-00928 with this chip, or the chip itself), it shorted again after connecting the power supply. So I removed UB000 again and measured every pin of UB000 - nothing is shorted in there. Area around U5670 looks untouched. PP3V3_S0 works flawlessly with UB000 removed (and with bad UB000 it's partially shorted, that's why the machine cannot turn on I guess).\n\nI've got one last UB000 from 820-00840 and I don't want to waste it the same way as the first one, what else should I check?\nThank you"}
{"post_id":55949,"thread_id":55942,"title":"820-00928 shorted UB000","user_id":682,"username":"2informaticos","post_date":"2020-01-20 05:45:36","message":"If you get short on a power rail (or low value to ground), ALWAYS check in diode mode BEFORE power up the board again.\nYou cannot be sure now if chip has been burnt again, or you had bad solders.\nYou can compare readings between UB000 and U2800..."}
{"post_id":55956,"thread_id":55942,"title":"820-00928 shorted UB000","user_id":1744,"username":"PJs","post_date":"2020-01-20 06:36:10","message":"Of course, I measured PP3V3_TBT_T_S0 in diode mode before I connected PS and it was OK. It's burned exactly the same way as the original one - only PP3V3_TBT_T_S0 pads are shorted to GND pads."}
{"post_id":55957,"thread_id":55942,"title":"820-00928 shorted UB000","user_id":682,"username":"2informaticos","post_date":"2020-01-20 07:26:41","message":"Really strange, because both chip receive 3V3_S0.\nU2800 has U8295 in the middle and UB000 receives 3V3_S0 directly.\nBut I don't suspect an onvervoltage at 3V3_S0, cause it should damage more things.\n\nProbably you've got a bad chip from donor board.\nChange it, check all power rails of UB000 and compare with UB2800."}
{"post_id":56168,"thread_id":55942,"title":"820-00928 shorted UB000","user_id":1744,"username":"PJs","post_date":"2020-01-24 17:09:17","message":"OK, so after changing the chip and measuring everything accessible, it looked fine, so I successfully turned it on. So I guess the first chip was really defective. However the board boots, I can install OS, but after that it hangs on \"critical update\" issue and I don't know why (SSD is fine as I can install OS on it, battery is fine, touchbar looks fine, no luck with PRAM\/SMC reset or installing macOS from scratch on formated drive). Shield on U3900 looks quite busted, so I will try to take it off and inspect U3900, but I'm quite afraid of it as it's an underfilled chip with some ridiculously small BGA balls (I think it's smaller than 0.2mm?). Also I don't get why, but someone pulled C7900, C7901 and F4500 - I replaced those, but that just fixed clicking of touchpad.\n\nI will probably open a new thread later as this is probably different issue. You can mark this one as solved I think, thank you."}
{"post_id":56170,"thread_id":55942,"title":"820-00928 shorted UB000","user_id":682,"username":"2informaticos","post_date":"2020-01-24 18:45:54","message":"There are few things to check on critical update issue on touchbar machine.\nDo a search on the forum and see if something helps you.\nDid you try installing without touchbar connected?\nAlso try to start in safe mode."}
{"post_id":56794,"thread_id":55942,"title":"820-00928 shorted UB000","user_id":1744,"username":"PJs","post_date":"2020-02-15 18:16:44","message":"I ruined this board by removing U3900 - I tried to be extremely careful and I successfully reballed the chip itself, but it was not possible to clean the underfill from board without ripping a few (not unconnected) pins. It still boots, but it will never work properly again. \n\nI'm unexperienced with touchbar machines - the question is: Can I buy different used 820-00928 motherboard and use it instead of the old one without any problems? I heard that the TouchID button is linked to the motherboard and cannot be changed, so the button will not work? Or the whole laptop will not work properly (like having that critical update issue because of that)?\n\nThank you"}
