{"post_id":91742,"thread_id":62977,"title":"820-4924 No Backlight","user_id":20634,"username":"StraightToThePoint","post_date":"2022-08-08 19:54:11","message":"Hello, 820-4924 with some water damage on the LVDS connector, replaced and still no backlight, pin 1 was frayed and bent, so I replaced it. That is the only known history on this board. Backlight circuit looks untouched.\n\nTested with a 100% known working display, and the display had the bad LVDS connector, both show same symptoms.\n\nDisplay is getting an image, tested with flashlight behind, flashing question mark folder shows.\n\nI get 0V on pin 1 of the LVDS connector, no short to ground on anything as far as I can tell. F7700 is good.\n\nQ7700 has proper 12.6V on pin 4, pin 3 always has a little bit less voltage (around 12.0-12.1V). Pins 1,2,5,6 sometimes have voltage, sometimes dont, dont know if this is my shitty multimeter however im noticing Q7700 does open but voltage will drop from around 6-8v to 0v slowly (visibly decreases on multimeter) never seen this so not too sure what it means. When I say slowly, I mean it fully decreases in no more than 15-20 seconds.\n\nLCDBKLT_EN_L is not being pulled down, otherside (BKLT_SD) is also 12V.\n\nU7700 is getting 5V on pin 5.\n\nSMC_LID is 3.3V\n\nEDP_BKLT_PWM is 3.3V\n\nR7700 and U7700 have continuity on pins 9 and 10 with 3 and 4.\n\nStuck on this one, anymore info or needed voltages please let me know!\n\nedit: Also to clarify, 100% known these are both 2015 screens"}
{"post_id":91745,"thread_id":62977,"title":"820-4924 No Backlight","user_id":682,"username":"2informaticos","post_date":"2022-08-09 03:06:15","message":"Apart of BKLT_EN_R, U7700 requires correct communication through I2C bus with LCD screen.\nPCH sends the PWM signal to LCD assembly being encoded into T-CONN, going then to U7700.\nCheck R7750-53 and diode mode to ground on SCL\/SDA lines.\n\nBe sure D7710 is not shorted (A-K) and has good continuity until J8300.\nCheck R7731\/2 and traces."}
{"post_id":91762,"thread_id":62977,"title":"820-4924 No Backlight","user_id":20634,"username":"StraightToThePoint","post_date":"2022-08-09 15:59:47","message":"Diode mode to ground on SCL\/SDA lines, red probe to ground.\nR7750 - 0.530 (Measured again, goes to 0.526)\nR7751 - 0.526\nR7752 - 0.526\nR7753 - 0.526\n\nD7710 is not shorted, diode mode to ground reads 1.155 (pin 2), and 0.848 (pin 1). D7710 has continuity to J8300.\n\nFeedback trace and R7731 and R7730 look good, no scratches, or water damage, or anything out of the ordinary.\n\nR7731 reads 13.30 K Ohms\nR7730 reads 149.2 K Ohms\n\nThese readings seem correct as im comparing them with a good board I have here.\n\nGoing to check continuity with I2C lines to display.\n\nI2C lines all have continuity throughout and going to J8300. Going to boot to OS to see if communication is happening with brightness keys.\n\nedit: Could this be a bad U7700? Also with further inspection, top left of back of the board was hit with water damage, U3210 has 2 pins that were corroded, but not too bad, could one of those capacitors (C8358-59) possibly be causing communication issues if they got hit with water? No corrosion on them, they look fine though. edit 2: TP for BKLT_SDA looks like it possibly had some corrosion, or something is it, very very small though, doesnt affect continuity however, or any reading, just throwing this out there though."}
{"post_id":91764,"thread_id":62977,"title":"820-4924 No Backlight","user_id":682,"username":"2informaticos","post_date":"2022-08-09 18:29:47","message":"I meant to check R7750-53 values in ohm; not diode mode to ground.\n\nShould be good to change U7700; just in case, nothing to lose.\nIt should pull down BKLT_SD, when has correct communication with T-CONN."}
{"post_id":91766,"thread_id":62977,"title":"820-4924 No Backlight","user_id":20634,"username":"StraightToThePoint","post_date":"2022-08-09 18:53:18","message":"R7750 - 0.5 Ohm\nR7751 - 0.5 Ohm\nR7752 - 1.5 K Ohm\nR7753 - 1.6 K Ohm\n\nThese seem normal?\n\nWhen I booted to OS X, Ive noticed very weird symptoms. It also told me how old and used the machine is, battery has 1200+ cycles lol. \n\nOS X Registers brightness keys, and keyboard backlight brightness keys, Keyboard backlight does work, HOWEVER, when tilting the display 70 degrees or higher, brightness goes away, and keys do not register anymore (Circle sign) When putting it below 70 degrees it returns to normal. Display backlight is always out though. \n\nI thought the keyboard backlight connector was caught on a hinge somehow, or connection was weird, it wasnt. Keyboard backlight connector is completely normal, no tear, no rip, solid connection and only does it when the display is open higher than 70 degrees. Is this an ALS issue or something? Could this be related to the issues im having? Very wierd. System preferences and information both recognize the keyboard backlight and display perfectly fine too.\n\nIm going to replace U7700 as these issues are very weird, and im suspect of this chip as everything else is perfectly normal.\n\nAlso last question, would a bad inductor (possibly L7710) cause any issues like this?"}
{"post_id":91767,"thread_id":62977,"title":"820-4924 No Backlight","user_id":682,"username":"2informaticos","post_date":"2022-08-09 19:54:49","message":"I never heard about backlight inductor failure.\nDoesn't mean not possible.\n\nYou have flexgate problem.\nNot only backlight flex can suffer of this problem.\nSeems that (at least) camera flex is damaged in this case; ALS connection is affected."}
{"post_id":91768,"thread_id":62977,"title":"820-4924 No Backlight","user_id":20634,"username":"StraightToThePoint","post_date":"2022-08-09 21:23:53","message":"I wonder if display is damaged internally then too? Very strange. This has basically been a very weird rabbit hole. I replaced U7700 and still same issues. \n\nAny other advice?\n\nBacklight flex (Do you mean keyboard backlight cable) was not being bent however, in anyway. This is an A1502, I know 2016's and up suffer the same problem with display, however that is connected to the hinge, the keyboard backlight flex is not, only connected to the backlight itself, not flexing when the display is open or closed."}
{"post_id":91774,"thread_id":62977,"title":"820-4924 No Backlight","user_id":682,"username":"2informaticos","post_date":"2022-08-10 02:33:01","message":"Yeah, webcam is connected with wires here, as video too (no flex).\nIn fact, you've said have tested board with two good screens; shouldn't be video, or webcam cables issue.\n\nTried classic 2-3 times PRAM reset?\nBe sure any trace and component in the area is good.\n\nCheck if EDP_BKLT_PWM reacts when pressing backlight adjust keys.\nAn o-scope will help you to detect reaction on the I2C_BKLT bus at same time."}
