{"post_id":63695,"thread_id":59840,"title":"820-01041 NAND shorted T2 restore issues","user_id":2508,"username":"No-Clean","post_date":"2020-08-13 13:04:22","message":"Clean board, U9080 looked fried I removed it and the short was still there, I injected voltage to PP2V5_NAND_SSD0 and realized that 3 of the NAND chips were shorted, I confirmed this by removing and testing each one of them with an iPhone NAND programmer and by checking the NAND for shorts, I put new NAND chips from compatible NAND chips and a new U9080, I get 20v now and with the board on its case with everything connected board gets to about 1amp then back to 0 and loops around that with no image. \n\nI have tried to restore the T2 firmware several times getting different errors like error 9, this T2 boards suck, I hate crApple..."}
{"post_id":63696,"thread_id":59840,"title":"820-01041 NAND shorted T2 restore issues","user_id":682,"username":"2informaticos","post_date":"2020-08-13 14:00:48","message":"Do you get all voltages, including VCORE and SSD?"}
{"post_id":63704,"thread_id":59840,"title":"820-01041 NAND shorted T2 restore issues","user_id":2508,"username":"No-Clean","post_date":"2020-08-13 15:52:52","message":"No vcore at any point, SSD 2.5v"}
{"post_id":63709,"thread_id":59840,"title":"820-01041 NAND shorted T2 restore issues","user_id":682,"username":"2informaticos","post_date":"2020-08-13 19:06:13","message":"As dukefawks said, \"all in all only a project if you have time to waste\"...\n\nNAND chips must have some specific information, which need to be copied from working board.\nOr you can try replacing NAND chips from donor board.\nT2 damage is also possible."}
{"post_id":63713,"thread_id":59840,"title":"820-01041 NAND shorted T2 restore issues","user_id":2508,"username":"No-Clean","post_date":"2020-08-13 19:39:03","message":"Got it, it is the same with iPhone NAND chips, however on iPhones you can still restore but end up with some issues, I will try my iPhone programmer and see if it allows me to read something from the only NAND left that doesn't have a short.\n\nI asked this customer for more time and they are fine with that, I want to learn and hopefully fix this board, luckly I have practice doing NAND work from iPhone repairs.\n\nI will post results here if I get somewhere."}
{"post_id":64183,"thread_id":59840,"title":"820-01041 NAND shorted T2 restore issues","user_id":2508,"username":"No-Clean","post_date":"2020-08-25 20:26:45","message":"Just a follow on, I replaced all 4 nand chips with ones from iphone boards, same Gb each and tried to restore T2 firmware but no luck, if anyone finds a way around this please post here. I tried to read the good working NAND with a NAND programmer for iPhone but it did not read it."}
{"post_id":64186,"thread_id":59840,"title":"820-01041 NAND shorted T2 restore issues","user_id":682,"username":"2informaticos","post_date":"2020-08-26 03:27:20","message":"You should try to replace them with chips from donor board, same model..."}
{"post_id":64225,"thread_id":59840,"title":"820-01041 NAND shorted T2 restore issues","user_id":2508,"username":"No-Clean","post_date":"2020-08-26 12:50:22","message":"I don't have a donor board for this one and parts board for this model are in the $400 range, those NAND chips are fragile to heat, it will suck to get a board for this and damage the chips, or worse yet get a board that has the same problem."}
