{"post_id":26564,"thread_id":26564,"title":"[SOLVED]820-3330-B Not charging battery","user_id":906,"username":"Joesipaq","post_date":"2017-10-09 14:30:31","message":"Hey all, This is a warranty repair from a previous job I had. You can see previous thread in the link.\n\nI am suspicious that the battery I got was crap (amazon purchase). Unfortunately I do not have another battery to test it with on hand and I am located in south america so shipping will take its sweet time.\n\nBattery is detected in os but not charging an at 0%. Client said it started to charge slowly. Knowing that Q7055 is the common problem of slow charging, I changed it out again. (I think I was an idiot before when I originally got this unit in and tried to stick an A1321 battery in the thing like a jackass after reading one forum that said they were compatible... without doing voltage tests myself first.) So I expect revers polarity entered the battery port.\n\nTo jump right to the problem,\nQ7055\n\nWith battery connected\npin 1-3 12.57v\npin 4 shifts between 12.1ish and 12.53v\npin 5 ~1-3v\n\nWithout battery connected\nPin 4 will change between 5v and 12.54V every 5 or so seconds.\nPin 5 will change accordingly to a correct throughput voltage\n\nFeedback resistors are good,\n\nBad ISL due to incorrect battery polarity before or bad battery now?"}
{"post_id":26572,"thread_id":26564,"title":"[SOLVED]820-3330-B Not charging battery","user_id":2,"username":"dukefawks","post_date":"2017-10-09 16:36:02","message":"Battery from 13\" MacBook pro are compatible. Try known good battery first. Also check if battery is fully recognized in OSX with charge cycles and battery status: normal."}
{"post_id":26582,"thread_id":26564,"title":"[SOLVED]820-3330-B Not charging battery","user_id":906,"username":"Joesipaq","post_date":"2017-10-09 18:03:42","message":"I just stuck an A1322 Battery in it and i get an orange light, and its working off of battery. SO seems that pos batterie is the problem.... Its sad that I have more confidence in my Chinese vendor than i do amazon now.. FYI stay away from SIKER\n\nAs for the other info - condition says normal, 12 cycles, cattery charging no - Charge capacity 7299, charge remaining 7299 (whut - bad bat sending circuit?) Battery installed, yes.\nAll looks normal to me except for the no charging and charge remaining (before it was showing 0% in osx, now it is showing 100% in osx)\n\nI noticed the mouse lagging a bit earlier only when logged into the user profile, in the user selection screen it is fine. is this because the A1322 doesnt have the right code to talk to the smc for its temp sensors or such? I was just able to get to activity monitor finally and found kernel task taking up 600+% cpu. Im running malwarebytes at the moment (no malware found), as last time i found a virus on her computer - but could the battery be causing this because the temp sensor comunication is different between model for the smc?"}
{"post_id":26586,"thread_id":26564,"title":"[SOLVED]820-3330-B Not charging battery","user_id":2,"username":"dukefawks","post_date":"2017-10-09 19:51:17","message":"Wrong\/dead battery will cause system lag. Don't buy copy batteries, spend some more and get an original one."}
{"post_id":26590,"thread_id":26564,"title":"[SOLVED]820-3330-B Not charging battery","user_id":906,"username":"Joesipaq","post_date":"2017-10-09 23:07:40","message":"Any suggestions as to a good source for original batteries? Will the system still lag without a battery in the system?\nMy seller for my stocked batteries has done well for me so far, the 2 air batteries I used and only unibody one have been top tier from what I can tell. Just this Amazon one has been crap."}
{"post_id":26624,"thread_id":26564,"title":"[SOLVED]820-3330-B Not charging battery","user_id":2,"username":"dukefawks","post_date":"2017-10-10 15:50:52","message":"It's all a gamble, buy local so you can send it back if it is fucked. Yes system will lag without working battery."}
{"post_id":26706,"thread_id":26564,"title":"[SOLVED]820-3330-B Not charging battery","user_id":906,"username":"Joesipaq","post_date":"2017-10-11 23:02:17","message":"Alright, replacement battery on the way. BTW, do all systems lag without a battery? If not which ones do? Thanks!"}
{"post_id":26710,"thread_id":26564,"title":"[SOLVED]820-3330-B Not charging battery","user_id":2,"username":"dukefawks","post_date":"2017-10-12 05:12:38","message":"All will be slow without battery. CPU is clocked to lowest speed if no battery or totally empty is installed."}
{"post_id":26713,"thread_id":26564,"title":"[SOLVED]820-3330-B Not charging battery","user_id":906,"username":"Joesipaq","post_date":"2017-10-12 06:14:06","message":"Wonderful! Thanks for the heads up. Feel free to mark this one as solved. If I still run into problems I can reference this post as well."}
