{"post_id":86824,"thread_id":62402,"title":"820-3787 - powercycling","user_id":28284,"username":"dudipupan","post_date":"2022-03-01 11:06:54","message":"Hi,\ni got a MABP 15\" 2014 that came with some mechanical damage... looked like somebody scratched over the board and ripping out components to prevent it from beeing repaired.\nThe ripped off components were: R1412, R1440, R1996, R1995, R1178, L7360, L8760, L8710, L3095, Q3080. Some scratches are on the RAM chips U2350 and U2550.\nThe rest of the board looks perfectly fine - the board was never removed from the case before and i dont see any further damage.\nI replaced all components but the board (board alone only with battery and DC connected) gives me fan spin for few seconds then powering off again, turning on again for few seconds, turning off again, and so on...\nI checked the big coils for shorts - didn't found any.\n\nAny clue what could cause this?\n\nThank you"}
{"post_id":86825,"thread_id":62402,"title":"820-3787 - powercycling","user_id":28284,"username":"dudipupan","post_date":"2022-03-01 11:17:21","message":"[ATTACH type=\"full\"]60440[\/ATTACH][ATTACH type=\"full\"]60441[\/ATTACH][ATTACH type=\"full\"]60442[\/ATTACH][ATTACH type=\"full\"]60443[\/ATTACH]\n\nForgot to mention that CPU is getting voltage on fanspin. PPBUS_G3H is not pulsing."}
{"post_id":86826,"thread_id":62402,"title":"820-3787 - powercycling","user_id":682,"username":"2informaticos","post_date":"2022-03-01 13:56:51","message":"Probably knocked off components in other areas.\nAre you sure all traces are good and changed all needed components?\nWhich was the initial problem of the machine?"}
{"post_id":86833,"thread_id":62402,"title":"820-3787 - powercycling","user_id":28284,"username":"dudipupan","post_date":"2022-03-01 17:10:28","message":"I will check the traces around U1100 again. I checked the whole Board for more missing components but didn't found anything. \nI replaced all except the two RAM chips. Should I try to reflow these? \nUnfortunately I don't know anything about the history of this board. Maybe the knocked off components were the only problem 🤷🏼‍♂️"}
{"post_id":86984,"thread_id":62402,"title":"820-3787 - powercycling","user_id":28284,"username":"dudipupan","post_date":"2022-03-05 16:46:36","message":"Just checked all rails around the ripped off components - they seem all good. Sometimes the boeard starts beeping, but the beep is cut off because it is tuning off again."}
{"post_id":86985,"thread_id":62402,"title":"820-3787 - powercycling","user_id":682,"username":"2informaticos","post_date":"2022-03-05 17:48:00","message":"Intentionally damaged board, very likely waste of time..."}
