{"post_id":19155,"thread_id":19155,"title":"Mac mini usb port repair problems 820 3228","user_id":77,"username":"leonattpcs","post_date":"2017-04-26 07:17:17","message":"This is a long shot, but does anyone have a schematic and board view for 820 3228 from a Mac mini. Originally borough from eBay with usb ports not working, 2 then came back to life and work. I have fixed things like this on macbook pros before so will be looking for similar issues which are it's supplying power to the ports or burnt out caps.\nThanks"}
{"post_id":19162,"thread_id":19155,"title":"Mac mini usb port repair problems 820 3228","user_id":2,"username":"dukefawks","post_date":"2017-04-26 07:45:29","message":"Nothing available for Mac Mini. Dead USB should be easy, if there is power it can only be the 2 data lines. The usual dead coils in the data lines or dead protection diodes. The schematic will be exactly the same as any macbook from the 2012 era."}
{"post_id":19165,"thread_id":19155,"title":"Mac mini usb port repair problems 820 3228","user_id":77,"username":"leonattpcs","post_date":"2017-04-26 08:05:24","message":"Hi,\nThanks for the information. I will check it out then update."}
{"post_id":20551,"thread_id":19155,"title":"Mac mini usb port repair problems 820 3228","user_id":77,"username":"leonattpcs","post_date":"2017-05-19 13:53:40","message":"Got this sorted out, there are 2 filters, then 4 caps behind each pair of connectors that look like they are all laid out in pairs. Leading to these are tracks from an IC and measuring the 2 filters then 4 caps and comparing them to the other pair, the 4 caps were nearly shorted to ground and the values in the filters were higher than you would expect. Taking the ic off altered the values to what you would expect, then fitting a different ic got them working again. Got the part from another scrap Mac mini board that I bought from Spain. I live streamed the repair at 5:14AM from the UK one morning at the link below:\n[URL]https:\/\/www.youtube.com\/watch?v=JfsPeDac4iE[\/URL]\nExperience I have from other USB port repairs lead me to the problem and solution.\nFollow up:\n[URL]https:\/\/www.youtube.com\/watch?v=TuZTGStTLYs[\/URL]"}
