{"post_id":8205,"thread_id":8205,"title":"[SOLVED]820-3330-B Chimes and turns on, but no display","user_id":507,"username":"nbosna","post_date":"2016-10-17 23:06:32","message":"Louis, big fan, I appreciate all the content you're putting out for everyone to use.  It's a big help as I venture into motherboard repair.\n\nWould love some help with a 2012 MacBook Pro A1286 (820-3330-B).  It turns on, I hear the chime, but no display:\n\n1) I tried another display - same result, so I'm assuming the issue is at component level.  The board looks great apart from some some dust - no liquid damage or prior work that I can tell.\n\n2) I measured the backlight fuse F9700 (with display connected) - 12.5 volts on both sides.\n\n3) Going down the line ppbus_s0_lcdbklt, I measured Q9706 on output (pin 6) - 0 volts.  Would this be the first thing to replace?\n\n4) Diode measure for R9789 and R9788 are .450 and .900."}
{"post_id":8206,"thread_id":8205,"title":"[SOLVED]820-3330-B Chimes and turns on, but no display","user_id":7,"username":"Therealkilometers","post_date":"2016-10-17 23:47:09","message":"What do you have on Pin 2 and 3 of the LCD connector. If you don't have 3.3V what do you have on the pins of U9000?"}
{"post_id":8209,"thread_id":8205,"title":"[SOLVED]820-3330-B Chimes and turns on, but no display","user_id":1,"username":"larossmann","post_date":"2016-10-18 02:54:15","message":"You don't replace Q9706 because it is not passing voltage. What if it is not supposed to be? If the voltage on its gate is the same as its source, then it will not output anything, which is normal behavior.\n\nDo you get 3.3v on pin 4 of the LCD connector, or on LCD_PWR_EN on U9000?"}
{"post_id":8225,"thread_id":8205,"title":"[SOLVED]820-3330-B Chimes and turns on, but no display","user_id":507,"username":"nbosna","post_date":"2016-10-18 15:22:19","message":"I get 0 volts on pin 2, 3, and 4 on the LCD connector, 0 volts on LCD_PWR_EN on U9000.\n\nPardon the rookie questions, still learning to reason through a schematic. Next step would be to test wherever LCD_PWR_EN originates?"}
{"post_id":8231,"thread_id":8205,"title":"[SOLVED]820-3330-B Chimes and turns on, but no display","user_id":2,"username":"dukefawks","post_date":"2016-10-18 18:55:43","message":"Pin 4 should have 3V, check L9008. If it fried it fried for a reason, usually shorted LCD cable, so check what caused it."}
{"post_id":8240,"thread_id":8205,"title":"[SOLVED]820-3330-B Chimes and turns on, but no display","user_id":507,"username":"nbosna","post_date":"2016-10-19 10:07:59","message":"Thanks for responding.  There is no L9008 on this board - I think that's for the A1278 model, but I think I understand what you mean.  The equivalent on this board is L9000, but as I mentioned there's 0 volts going through U9000, so none would reach the inductor L9000.  I'm having trouble figuring out what to jump to next."}
{"post_id":8241,"thread_id":8205,"title":"[SOLVED]820-3330-B Chimes and turns on, but no display","user_id":2,"username":"dukefawks","post_date":"2016-10-19 10:33:43","message":"Ah indeed. Pin 4 is directly connected to 3v3_s0 so there must be 3V there or PCB track is broken. Measure on R9010\/11 there should be 3V there too."}
{"post_id":8440,"thread_id":8205,"title":"[SOLVED]820-3330-B Chimes and turns on, but no display","user_id":507,"username":"nbosna","post_date":"2016-10-22 00:23:28","message":"0 voltage on R9010\/11 as well.  I tried checking the whole 3v3_s0 line, and 0 voltage everywhere.  When I plug the charging cord in, the fans do not spin.  If I plug in the battery, and turn it on, I get the chime, but no display - not sure if that helps the diagnosis."}
{"post_id":8444,"thread_id":8205,"title":"[SOLVED]820-3330-B Chimes and turns on, but no display","user_id":2,"username":"dukefawks","post_date":"2016-10-22 04:22:21","message":"No way this thing turns on without 3v3_s0. Check at Q7830 for 3v3_s0, it must be present somewhere.\nIt is not turning on on AC because you are using either a fake 85W charger or a non 85W. It MUST be 85W."}
{"post_id":8460,"thread_id":8205,"title":"[SOLVED]820-3330-B Chimes and turns on, but no display","user_id":507,"username":"nbosna","post_date":"2016-10-22 10:38:47","message":"Oy, idiot! I'm using a 65W for the 13\" - back to the beginning of the thread - thank you."}
{"post_id":8465,"thread_id":8205,"title":"[SOLVED]820-3330-B Chimes and turns on, but no display","user_id":2,"username":"dukefawks","post_date":"2016-10-22 10:55:18","message":"That will not affect 3v3_s0, as long as there is a battery in there it will power up."}
{"post_id":8480,"thread_id":8205,"title":"[SOLVED]820-3330-B Chimes and turns on, but no display","user_id":500,"username":"JoAg","post_date":"2016-10-22 14:39:22","message":"Should it really be 3,3v on LCD_PWR_EN (pin1) on U9000? Maybe if you have display connected???"}
{"post_id":8704,"thread_id":8205,"title":"[SOLVED]820-3330-B Chimes and turns on, but no display","user_id":507,"username":"nbosna","post_date":"2016-10-26 22:38:32","message":"With battery plugged in, I get 3.3V on pin 4 of the LCD connector as you mentioned. I thought maybe prodding everything has cleaned up some kind of minor oxidation. I turn on the laptop, and sure enough, the display works - excellent. I put it back together, but no more display - chimes, blinks for a split second, then black.\n\nNot sure how it's related to the display, but the issue turned out to be the battery indicator cable - I checked this three times. Plug in the battery indicator cable, no more display. Unplug it, display works just fine. I went ahead and replaced the battery indicator cable and board, and sure enough, the display works normally.\n\nThank you for your insight Louis and dukefawks. Please close this thread."}
