{"post_id":72463,"thread_id":60867,"title":"820-00426 sensor issue?","user_id":28284,"username":"dudipupan","post_date":"2021-03-01 13:27:00","message":"Hey there :-)\n\nI'm working on my first sensor issue and don't really know where to start.\nHWMonitor says GPU2, Heatpipe incoming air & Heatpipe outcoming air 129°C.\n\nAny suggestions where to start searching? \nThe board looks perfekt - no signs of liquid or anything - it was just a little dusty.\n\n Thank you :-)"}
{"post_id":72464,"thread_id":60867,"title":"820-00426 sensor issue?","user_id":28284,"username":"dudipupan","post_date":"2021-03-01 13:30:45","message":"i forgot the most important fact :-D The MBP is running slow \/ stucks with increasing fan spin (up to 6k rpm)."}
{"post_id":72466,"thread_id":60867,"title":"820-00426 sensor issue?","user_id":29628,"username":"Askaleto","post_date":"2021-03-01 13:48:25","message":"First you should download schematics. The thermal sesnors are shown on page 48 of the schematics (use Google to find it).\nThere are two IC chips: U5850 and U5870. To these ICs many sensors are attached.\nU58050 is connected to \"GPU PROXIMITY\/GPU DIE\/LEFT FIN STACK\/RIGHT FIN STACK\". This is most probably what you're interested into, because even though the names are weird, GPU is mentioned and these left and right stack could be heat pipes incoming and outcoming air.\n\nPerform visual inspection around the chip and its resistors and lines. Then measure resistance and see if any resistor is in bad condition.\n\nEDIT: You can also check this out: [MEDIA=youtube]yuunAVCAd0g[\/MEDIA]"}
{"post_id":72475,"thread_id":60867,"title":"820-00426 sensor issue?","user_id":682,"username":"2informaticos","post_date":"2021-03-01 15:01:01","message":"Disconnect webcam first and see if works good.\nAmbient Light Sensor is the first suspect there..."}
{"post_id":72488,"thread_id":60867,"title":"820-00426 sensor issue?","user_id":28284,"username":"dudipupan","post_date":"2021-03-01 18:26:04","message":"Testet it with no webcam but didn't changed anything. Now it works sometimes and Heatpipe Temp Values look good (GPU2 still at 130°C but system is not slow and fan spin goes down to 2k rpm with low Heatpipe values) most of the time but it still jumps sometimes from 30°C to 130°C... Already tried a known working trackpad with the same result. Maybe I should try another trackpad flex? Before I can do this I need to order one :)"}
{"post_id":72489,"thread_id":60867,"title":"820-00426 sensor issue?","user_id":28284,"username":"dudipupan","post_date":"2021-03-01 18:32:51","message":"[USER=29628]@Askaleto[\/USER] that was my first thought too - just measured voltage on the pins of U5850 and compared them to the values on the pins of U5870 for the thermal sensor of the CPU. They lookes very similar."}
{"post_id":72490,"thread_id":60867,"title":"820-00426 sensor issue?","user_id":682,"username":"2informaticos","post_date":"2021-03-01 18:36:15","message":"GPU temp is not correctly reported when Intel graphics is in use.\n\nYou probably had bad contacts at trackpad, or webcam connectors."}
{"post_id":72493,"thread_id":60867,"title":"820-00426 sensor issue?","user_id":28284,"username":"dudipupan","post_date":"2021-03-01 19:48:05","message":"I think it's the trackpad flex... i can reproduce the wrong temparature sensor value by pressing on the flex at the side of the trackpad (with the old and a known good one). So I will wait for the new flex cable and report her if this solved the problem :-)\nThank you!"}
{"post_id":72624,"thread_id":60867,"title":"820-00426 sensor issue?","user_id":28284,"username":"dudipupan","post_date":"2021-03-04 14:56:04","message":"It's working fine now with new trackpad flex :-)"}
