{"post_id":187,"thread_id":187,"title":"[solved] 802-2915 PP3V42_G3H appears to be shorted to ground...","user_id":61,"username":"wrbailey","post_date":"2016-03-21 23:09:32","message":"I have a 2011 15\" 820-2915 board. I don't have a green light on charger (computer is completely dead. Using a known working OEM 85W charger.\n\nI checked PPBUS_G3H and I get 0.642V... I then check PP3V42_g3h and I get 0.000V.\n\nPPBUS_G3H is not shorted to ground 0.437 diode measurement.\nPP3V42_G3H measures as 0.003 diode measurement... Sounds like something is shorting it to ground.\n\nI have felt around the board and see nothing that is getting hot. I do not have a power supply that i can use to \"inject\" voltage into the board in order to make whatever component to get hot... Is there any other way to find a short? Or a \"common\" component that may short? Do I just start pulling things off the board in hopes it makes the short go away?\n\nThis does not appear to be a liquid damage board, nor a board which took a fall...\n\nAny ideas or bread crumbs would be great :)"}
{"post_id":189,"thread_id":187,"title":"[solved] 802-2915 PP3V42_G3H appears to be shorted to ground...","user_id":2,"username":"dukefawks","post_date":"2016-03-21 23:14:19","message":"The short can really be anywhere. You need to rig up something to inject a low voltage onto the 3V42 bus. Either get an adjustable power supply or use a scrap machine and tap into the 1V5 bus. The shorted component should heat up nicely. Randomly pulling parts is just not effective, too many of them."}
{"post_id":191,"thread_id":187,"title":"[solved] 802-2915 PP3V42_G3H appears to be shorted to ground...","user_id":61,"username":"wrbailey","post_date":"2016-03-21 23:16:22","message":"[QUOTE=\"dukefawks, post: 189\"]The short can really be anywhere. You need to rig up something to inject a low voltage onto the 3V42 bus. Either get an adjustable power supply or use a scrap machine and tap into the 1V5 bus. The shorted component should heat up nicely. Randomly pulling parts is just not effective, too many of them.\n[\/QUOTE]\n\nYeah, that's what I was thinking... Thanks!"}
{"post_id":195,"thread_id":187,"title":"[solved] 802-2915 PP3V42_G3H appears to be shorted to ground...","user_id":2,"username":"dukefawks","post_date":"2016-03-21 23:36:27","message":"You could just take a 1.5V battery. Never tried it, just an idea I had. Get a fat D-cell so it can supply enough current. Mind the polarity of course!"}
{"post_id":200,"thread_id":187,"title":"[solved] 802-2915 PP3V42_G3H appears to be shorted to ground...","user_id":53,"username":"XooP","post_date":"2016-03-22 09:28:21","message":"If you are going to use a battery to find the short you must make sure that  the resistance on the circuit is more than 0.2 ohms which is about the inner resistance of an alkaline battery. If the circuit is less than 0.2 ohms all the heat will be inside the battery."}
{"post_id":319,"thread_id":187,"title":"[solved] 802-2915 PP3V42_G3H appears to be shorted to ground...","user_id":76,"username":"Tony Tone","post_date":"2016-03-23 22:02:17","message":"Try Super Cold 134 MG Chemicals."}
{"post_id":372,"thread_id":187,"title":"[solved] 802-2915 PP3V42_G3H appears to be shorted to ground...","user_id":46,"username":"Crizz","post_date":"2016-03-24 20:09:11","message":"I used an ATX power supply before I get myself a proper bench power supply.\nBUT you have to be very careful where and how you inject the voltage since the 3.3V rail of the PSU delivers over 14 amps and that could blow your traces right of the board!"}
{"post_id":405,"thread_id":187,"title":"[solved] 802-2915 PP3V42_G3H appears to be shorted to ground...","user_id":77,"username":"leonattpcs","post_date":"2016-03-25 15:06:44","message":"I don't have as much experience as you guys on these boards, but I know you have talked about voltages so are you not able to measure where the voltage starts then stops or drops down then see what is between where the voltage is correct and where it is not?\nIf you can do that, would tat give a point to start from?"}
{"post_id":411,"thread_id":187,"title":"[solved] 802-2915 PP3V42_G3H appears to be shorted to ground...","user_id":2,"username":"dukefawks","post_date":"2016-03-25 19:19:07","message":"If it the bus is shorted the voltage will be 0 everywhere, so there is nothing to measure."}
{"post_id":413,"thread_id":187,"title":"[solved] 802-2915 PP3V42_G3H appears to be shorted to ground...","user_id":46,"username":"Crizz","post_date":"2016-03-25 19:37:03","message":"The most parts of the motherboard (not to say all :)) are connected to this specific rail so if one of this parts is shorting to ground you won't be able to tell which one unless you realize which one gets hot.\nBUT PP3V42 can only handle about 250-300mA so it will take reeeeealy long something gets hot.\nMore likely the hole rail will collapse due to the short so you will measure 0V on every point of the rail! \nThat's why you need an external power source with more power to get a stable voltage on the rail :)"}
{"post_id":452,"thread_id":187,"title":"[solved] 802-2915 PP3V42_G3H appears to be shorted to ground...","user_id":61,"username":"wrbailey","post_date":"2016-03-26 15:45:01","message":"U5755 Was shorted to ground. I knew the general area of the short as there were a few components getting warm. I started removing the caps first, in hopes it would be \"easier\" but then started with u5750 and still had the short and then u5755 was the culprit!! Replaced both u5750 and u5755 and green light and machine turns on. Need to run AHT but all seems to be going well...\n\nThanks again!!!"}
{"post_id":453,"thread_id":187,"title":"[solved] 802-2915 PP3V42_G3H appears to be shorted to ground...","user_id":46,"username":"Crizz","post_date":"2016-03-26 16:00:47","message":"Nice to hear that :)"}
