{"post_id":19539,"thread_id":19539,"title":"2010 MacBook Pro 17\" intermittent memory slot","user_id":631,"username":"razorwoods","post_date":"2017-05-02 00:32:49","message":"I had a 2010 MacBook Pro 17\" come in the other day with a memory issue.  Easily figured out that the bottom memory slot is intermittent and after a few minutes the machine would freeze or reboot itself or toss the dreaded 3 beeps if any memory module was in there.  I did verify with several new memory modules that this was the case and not bad memory.  Just using the top slot works fine with any module I tested.  While some people just say \"max out the single slot and call it a day\" I have a little time and would like to investigate how I might go about repairing this.  Also this customer wants to run 8GB's and from what I've seen you can't put a single 8GB (pc3 10600) module in the working slot without the machine giving 3 beeps.  Any suggestions would be appreciated."}
{"post_id":19544,"thread_id":19539,"title":"2010 MacBook Pro 17\" intermittent memory slot","user_id":2,"username":"dukefawks","post_date":"2017-05-02 01:58:15","message":"You really can't. RAM slot is BGA and good luck reballing that. You can get a RAM slot tester to see which data line is fucked. If you are lucky it is accessibly from the rear of the slot so you can fix the ripped trace.\nBut really, don't mess with it, if you screw up the working slot the board is trash."}
{"post_id":20262,"thread_id":19539,"title":"2010 MacBook Pro 17\" intermittent memory slot","user_id":631,"username":"razorwoods","post_date":"2017-05-15 15:54:33","message":"Picked up a memory slot tester and after playing with it on other known bad boards so I knew what I was looking for when something wasn't right..... the tester reported that all connections were good. The tester basically looks like a regular DDR3 stick with a bunch of LED lights. If any of the connections in the slot are bad that corresponding light won't be lit up. On the board I'm working on the tester shows good LED lights on all points. So at least it looks like the slots are good. Since the problem is with just one slot and all the connections seem good what else would cause the system to have an issue with this specific (lower of the 2 ) slot ? As mentioned above we are using known good \/ new memory that works normally in several other Macbook Pro's."}
{"post_id":20267,"thread_id":19539,"title":"2010 MacBook Pro 17\" intermittent memory slot","user_id":461,"username":"Gurmon","post_date":"2017-05-15 16:50:35","message":"Just max out the good ram slot and move on. Trust me many have tried to fix these slots, its never a permanent fix."}
{"post_id":20276,"thread_id":19539,"title":"2010 MacBook Pro 17\" intermittent memory slot","user_id":631,"username":"razorwoods","post_date":"2017-05-15 18:56:33","message":"From what I can see the single slot will only hold 4GB sticks.  He's been told he needs to run 8 for some program he uses for work.  I've tried putting single 8GB sticks and I just get the memory error beeps and no post."}
{"post_id":20281,"thread_id":19539,"title":"2010 MacBook Pro 17\" intermittent memory slot","user_id":2,"username":"dukefawks","post_date":"2017-05-15 21:12:54","message":"Must use PC10600 RAM. If that doesnt work then there is no option to fix this."}
{"post_id":20436,"thread_id":19539,"title":"2010 MacBook Pro 17\" intermittent memory slot","user_id":631,"username":"razorwoods","post_date":"2017-05-17 17:50:43","message":"Yeah I have a single 8gb 10600 stick and it refuses to do anything but beep with that in the good slot.  Guess this is a bust after all.  Bummer."}
