[
    {
        "post_id":24061,
        "thread_id":24061,
        "title":"820-00164 No Green Light With 45W Charger?",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-08-10 07:52:32",
        "message":"Have an odd one here. This unit was repaired by us before and had liquid damage. We replaced several components, cleaned it well and all seemed good to go. Unit worked great, but we did not test it with a 45W charger--it works great with our 85W chargers (we just have several 85W chargers to make things simpler), but for some reason the 45W and 60W Magsafe 2 chargers don't work (which is of course what the customer had). When we plug in a 45W or 60W Magsafe 2 into the unit, we get no green light. When we plug in an 85W charger, we get green\/orange light every time.\n\nSince it's a 2015 model, we can't run ASD, so not sure where to start on this one. I'll try replacing the DC-In cable\/board first, but I was curious how it was possible for the 85W charger to work perfectly with the unit, but the 45W and 60W chargers don't work at all (no green\/orange light). Any ideas? Thanks in advance, as always."
    },
    {
        "post_id":24067,
        "thread_id":24061,
        "title":"820-00164 No Green Light With 45W Charger?",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-08-10 08:55:23",
        "message":"EDIT: Not fixed after all. Green light worked for a second, then no more. I was too quick to post!\n\nIssue still present; R7202 was blown (43ohm instead of 10ohm). I may replace U7200 now, to be safe. Any other tips appreciated."
    },
    {
        "post_id":24069,
        "thread_id":24061,
        "title":"820-00164 No Green Light With 45W Charger?",
        "user_id":36,
        "username":"aprendiz",
        "post_date":"2017-08-10 09:18:10",
        "message":"45W and 60W are Original Chargers?? Other than that could be an overload that only 85W charger can handle... Also you could try running Diagnostic (holding D key at startup) and check if gives you any error..."
    },
    {
        "post_id":24070,
        "thread_id":24061,
        "title":"820-00164 No Green Light With 45W Charger?",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-08-10 09:22:24",
        "message":"Thanks, Aprendiz. I think it's definitely overloading the charger...the light will turn on for 1-2 seconds now, then immediately off. It will repeat this if I unplug and re-plug in a few minutes later.\n\nI'll try running diagnostics."
    },
    {
        "post_id":24074,
        "thread_id":24061,
        "title":"820-00164 No Green Light With 45W Charger?",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-08-10 09:56:14",
        "message":"OK, so I think I actually (finally) got this one sorted. I decided to check the power coming into the board before running diagnostics. I pulled Q7180 and immediately saw a burned pin\/pad. I was pretty sure, then, that this was the culprit and was causing the charger to go into protection mode. I replaced it, and my green light from 45W charger seems to be steady and consistent now. I'm still going to run diagnostics, but fingers crossed this is the fix."
    }
]