[
    {
        "post_id":63866,
        "thread_id":59861,
        "title":"820-3437-B",
        "user_id":1242,
        "username":"ddahlstrom",
        "post_date":"2020-08-18 12:45:14",
        "message":"Afterlight liquid spill, device powers on with green\/orange light, and we get fan spin, but absolutely no image and no backlight visible. Took a few board measurements and tested that all power rails were present, until I noticed 0.001V present on PPVIN_S0SW_LCDBKLT_FET. So far, there is 8.6V present on pin 4 of Q7707, and also 8.6V present on pin 3 of Q7706. I probably am misunderstanding this, but doesnt there have to be a negative voltage difference between gate and source to allow transistor to turn on and allow power to flow through Q7706? I can provide other measurements if you need, but am not sure what may be the problem or where else to test. Any help is greatly appreciated!!"
    },
    {
        "post_id":63867,
        "thread_id":59861,
        "title":"820-3437-B",
        "user_id":1242,
        "username":"ddahlstrom",
        "post_date":"2020-08-18 12:46:27",
        "message":"Also 0.001V present on PPHV_S0SW_LCDBKLT"
    },
    {
        "post_id":63892,
        "thread_id":59861,
        "title":"820-3437-B",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-08-18 17:03:40",
        "message":"Do NOT go so fast for backlight; image MUST appear first.\nCheck first for USB activity, probably not just video issue...\n\n\"all power rails were present\"\nIncluding VCORE and all from pages 57\/58?\n\nPLT_RESET_L goes high?\n\nCheck all SPI Bus Series Termination resistors and their traces.\nClean\/remove J6100.\nTry known good BIOS dump; links posted on the forum."
    },
    {
        "post_id":63934,
        "thread_id":59861,
        "title":"820-3437-B",
        "user_id":1242,
        "username":"ddahlstrom",
        "post_date":"2020-08-19 16:11:36",
        "message":"Not sure why the change, but after sitting down today to test the board, I currently am missing pp5v_s4rs3... (well I should say it is power cycling). If I am not mistaken, this signal comes from the charging port, so I replaced with a known-good charging board but still same issue. Do not measure a short on that line. Not sure what to do from here, but not getting the same results as yesterday and am stuck again. Thanks again for the help."
    },
    {
        "post_id":63935,
        "thread_id":59861,
        "title":"820-3437-B",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-08-19 16:18:27",
        "message":"Test the board alone on the desk, without LIO flex connected; keep only 5 pins DC cable connected.\n5V_S4 comes from L7520.\nPPBUS_G3H and 3V42_G3H both stable?\nAlso check 3V3_S5\/SUS.\n\nAre you using original Magsafe 2 charger?"
    }
]