{"post_id":8791,"thread_id":8791,"title":"820-3536-A dead","user_id":442,"username":"LaptopRepair","post_date":"2016-10-28 12:08:54","message":"Hello;\n\nI ve got a macbook pro model A1502 with board number 820-3536-A with a the problem that the battery does not charge till 100%. After 40% it stops charging.\nThe laptop stays on my shop for a while waiting for the battery from china that after waiting 5 weeks it seems that the supplier didn t send it. Then I ve ordered the second one. After waiting alomost 3 months on the battery shows up, I ve placed it, but on my surprise the laptop did not want to start. After the first check I ve noticed that Q7010 got PPDCIN_G3H at the source but no voltage is passed to the Drain. The reason was because the Gate has a high voltage. After looking well I ve seen that the DIODE D7010 was absent. Maybe a nail s work.\n\nNext problems shows up, because I didnot had such diode. I ve used a resistor there instead of a diode just to be able to troubleshoot verder. I ve loweradge the voltage at the gate to let the Q7010 pass the voltage the drain.\nNow first problem was solved, but the problem is still the same. Mac does not want to boot.\n\nI ve checked some coils to ground, like L7130 and L7520 and they give short to ground. The next check shows up that the U7700 does not looks well like if it was explodes.  I ve lifted it but the short still on both coils.\n\nAny hind is welcome.\n\nGreeting\n\nRachid"}
{"post_id":8797,"thread_id":8791,"title":"820-3536-A dead","user_id":2,"username":"dukefawks","post_date":"2016-10-28 15:37:59","message":"Did you leave it without power for a while before measuring the short on L7130 and L7520? How low is the short in Ohms?"}
{"post_id":9035,"thread_id":8791,"title":"820-3536-A dead","user_id":442,"username":"LaptopRepair","post_date":"2016-11-02 07:39:22","message":"After 4 days without power still giving short to ground. the value of the short is 0.002"}
{"post_id":9040,"thread_id":8791,"title":"820-3536-A dead","user_id":2,"username":"dukefawks","post_date":"2016-11-02 09:54:12","message":"On both L7130 and 7520?"}
{"post_id":9285,"thread_id":8791,"title":"820-3536-A dead","user_id":442,"username":"LaptopRepair","post_date":"2016-11-07 04:01:35","message":"Still waiting for a tip..."}
{"post_id":9304,"thread_id":8791,"title":"820-3536-A dead","user_id":2,"username":"dukefawks","post_date":"2016-11-07 07:46:17","message":"Still waiting for an answer...."}
{"post_id":9343,"thread_id":8791,"title":"820-3536-A dead","user_id":442,"username":"LaptopRepair","post_date":"2016-11-07 17:19:21","message":"5 days ago already said that the short is on both coils. and just before writing my last post my answer was still there. now i don't see it anymore. strange!!!\n\nAnyway..."}
{"post_id":9429,"thread_id":8791,"title":"820-3536-A dead","user_id":442,"username":"LaptopRepair","post_date":"2016-11-09 09:54:10","message":"Hello;\ni don't get the meaning of this!! i hope that i can get some support soon here in this forum.\ngreeting"}
{"post_id":9438,"thread_id":8791,"title":"820-3536-A dead","user_id":2,"username":"dukefawks","post_date":"2016-11-09 12:06:39","message":"I have no idea what you are doing. One day you have shorts now you don't. I cannot give advice if your measurement don't make sense.\nYou need to leave the board without power for a few minutes before measuring.\nAre you using a REAL 60W charger? It should auto power on with a good 60W charger"}
{"post_id":9521,"thread_id":8791,"title":"820-3536-A dead","user_id":442,"username":"LaptopRepair","post_date":"2016-11-10 10:29:03","message":"Short is always there. And detecting the short on both coils is done without the charger plugged.\nhope this will make sense.\nand yes i have the original charger 85w brought by the customer"}
{"post_id":9523,"thread_id":8791,"title":"820-3536-A dead","user_id":2,"username":"dukefawks","post_date":"2016-11-10 10:41:57","message":"Lift L7520 and see on which side the short is."}
{"post_id":9531,"thread_id":8791,"title":"820-3536-A dead","user_id":442,"username":"LaptopRepair","post_date":"2016-11-10 11:57:19","message":"Short is on pin 2."}
{"post_id":9532,"thread_id":8791,"title":"820-3536-A dead","user_id":2,"username":"dukefawks","post_date":"2016-11-10 12:00:38","message":"That would suggest Q7520 is at least shorted. Replace Q7520 and U7501 together. Then check for shorts before powering up again."}
{"post_id":9533,"thread_id":8791,"title":"820-3536-A dead","user_id":442,"username":"LaptopRepair","post_date":"2016-11-10 12:28:46","message":"Q7520 lifted but short is still there. also U7501 lifted and short is still there. test point for short is pin 2 of coil L7520"}
{"post_id":9539,"thread_id":8791,"title":"820-3536-A dead","user_id":2,"username":"dukefawks","post_date":"2016-11-10 13:43:42","message":"Look at diagram, there is nothing else connected to pin 2 of L7520. Only parts there that can cause a short are L7520, Q7520 and U7501."}
{"post_id":9563,"thread_id":8791,"title":"820-3536-A dead","user_id":442,"username":"LaptopRepair","post_date":"2016-11-11 09:46:59","message":"Appologies, i ve made a mistake. instead of saying pin1 of the coil L7520, I said Pin2.\nwhat I ve done so far is lifting the 4 caps: C7550, C7571, C7552 and C7553. but the short is still there on pin1 of coil L7520. it is coming from PP5V_S4. but at the other coil L7560 no short is there at the line PP3V3_S5.\nI ve realised that the coil L7130 is also shorted. After lifting it the short was noticed at pin2."}
{"post_id":9571,"thread_id":8791,"title":"820-3536-A dead","user_id":2,"username":"dukefawks","post_date":"2016-11-11 12:48:29","message":"Inject voltage on the shorted side of L7520 and see what heats up. I suspect it will be a dead CPU though."}
{"post_id":9666,"thread_id":8791,"title":"820-3536-A dead","user_id":442,"username":"LaptopRepair","post_date":"2016-11-14 07:09:29","message":"I ve injected 5V on pin1 of the coil L7520, the fan begins spinning while the CPU is not getting hot niether other part on the board. only the speed of the fan changes when increasing or decreasing the PP5V_S4 at pin1 of L7520.\nby the way the ic U7500 and U7501 are out of board when injecting 5v. also the two coils L7520 and L7531 are lifted."}
{"post_id":9667,"thread_id":8791,"title":"820-3536-A dead","user_id":2,"username":"dukefawks","post_date":"2016-11-14 09:39:25","message":"Why is L7530 removed? You said short was on L7130....."}
{"post_id":9670,"thread_id":8791,"title":"820-3536-A dead","user_id":442,"username":"LaptopRepair","post_date":"2016-11-14 10:48:44","message":"On my first post I already said that 2 coils give short. L7520 and L7130. so on L7130 short is also present.\n(Not L7531 ).\n\nnow after injecting 5V at pin1 of coil L7520. i can measure on buzzer mode 0.011 in stead of 0.003 what I always measure even after half hour . but on coil L7130 pin 2 the short is 0.002."}
{"post_id":9677,"thread_id":8791,"title":"820-3536-A dead","user_id":2,"username":"dukefawks","post_date":"2016-11-14 12:04:59","message":"Inject voltage on L7130 then, you can go higher there as normal is 12V there. Something must get hot if you run 5A into that."}
{"post_id":9683,"thread_id":8791,"title":"820-3536-A dead","user_id":442,"username":"LaptopRepair","post_date":"2016-11-14 12:22:10","message":"Just 5v it lets almost 5A be runned. and the CPU become hot. the small DIN become hot first then the big DIN."}
{"post_id":9685,"thread_id":8791,"title":"820-3536-A dead","user_id":2,"username":"dukefawks","post_date":"2016-11-14 12:27:20","message":"Well, I think we can assume there is a high side FET shorted in the CPU power supply. This kills the CPU, so this board is done."}
{"post_id":9711,"thread_id":8791,"title":"820-3536-A dead","user_id":442,"username":"LaptopRepair","post_date":"2016-11-14 15:20:01","message":"I ve lifted all 4 FET's on the CPU circuit. 1 of them is indeed shorted. \nyou said that this will kill the CPU, is it possible to replace the CPU? And can you explain me how this can be caused?"}
{"post_id":9712,"thread_id":8791,"title":"820-3536-A dead","user_id":2,"username":"dukefawks","post_date":"2016-11-14 15:29:42","message":"Of course you can replace the CPU but this is not worth it. It was probably caused by liquid spilled on the CPU regulator or someone shorting something out."}
{"post_id":9723,"thread_id":8791,"title":"820-3536-A dead","user_id":442,"username":"LaptopRepair","post_date":"2016-11-15 02:40:17","message":"Do you ve a simillar good working board and how much it will cost?"}
{"post_id":9737,"thread_id":8791,"title":"820-3536-A dead","user_id":2,"username":"dukefawks","post_date":"2016-11-15 09:41:48","message":"I have no boards for sale, sorry."}
{"post_id":9761,"thread_id":8791,"title":"820-3536-A dead","user_id":442,"username":"LaptopRepair","post_date":"2016-11-16 04:19:48","message":"Ok. before closing this thread. can you tell me how i can confirm for sure that this CPU is dead?"}
{"post_id":9762,"thread_id":8791,"title":"820-3536-A dead","user_id":2,"username":"dukefawks","post_date":"2016-11-16 05:07:58","message":"You can't unless you make the board work again. This is from experience, once the high side shorts the CPU is dead in 90% of the boards."}
{"post_id":9776,"thread_id":8791,"title":"820-3536-A dead","user_id":442,"username":"LaptopRepair","post_date":"2016-11-16 10:13:44","message":"You said \"the high side\" what do you mean by that?\nBy measuring the coil L7630 I found it short also on pin2 side.\n\nAfter lifting the CPU the short is gone from the board.\n\ni ve found thouse CPU on aliexpress for sale. 125$ new price. what is your experience on those chips from aliexpress (quality)? if you buy from those.\nDo you have any good chip supplier to advise me.\nis there a way to test the cpu outside the board for short? like testing caps on bottom of it with continuity tester."}
{"post_id":9778,"thread_id":8791,"title":"820-3536-A dead","user_id":2,"username":"dukefawks","post_date":"2016-11-16 10:59:06","message":"I'm only going to give you one advise: This board is done, why spend $125 on a Chinese junk CPU then find out more things wrong with the board. Possibly frying the new CPU again. Also ME region must be corrected in BIOS.\nThis one is done over end of story."}
{"post_id":10261,"thread_id":8791,"title":"820-3536-A dead","user_id":442,"username":"LaptopRepair","post_date":"2016-11-26 16:32:39","message":"I want to come back on this case;\n\nLike Louis said 3 days ago on his live streem that CPU's can be replaced if we don t get  often macs to repair a day. If not I can replace it. In my case I get just 1 a 3 macs a month for repair. \nAlso the customer blaims me that I m responsable for damaging his board, because he gave it me working. Now I said to him that the board is dead. He didn t picked it up.\n\nMy question is can somebody here help me with ME region rectification if I buy the CPU?"}
{"post_id":10266,"thread_id":8791,"title":"820-3536-A dead","user_id":2,"username":"dukefawks","post_date":"2016-11-26 22:36:34","message":"Uhm, first you replace the CPU then see if it works and only after that we will fix the ME. But be warned you are wasting your time and money, this will probably end in tears.....\nPlease take the advice from someone that does 10 of these a day. Do not replace the CPU unless you have one sitting around that is free, do NOT spend $100+ on some chinese junk CPU DO NOT WASTE YOUR MONEY."}
