[
    {
        "post_id":13938,
        "thread_id":13938,
        "title":"MacBook Pro 13.3\" - Mid 2012 - does not recognize charger most of the time",
        "user_id":631,
        "username":"razorwoods",
        "post_date":"2017-01-30 16:51:28",
        "message":"I'm working on a A1278 MacBook Pro 13.3\" - Mid 2012 that boots normally from the battery but will not charge 90% of the time. Occasionally the charger is recognized and shows a green then orange light and will charge the battery, BUT 90% of the time the charger is not recognized at all and there is no green light.\n\nThe board has no signs of liquid damage, orange high temp spots, corrosion of any kind, etc... visually the board looks almost new.\n\nI've already replaced the battery (just to be sure), the magsafe board, and tried with different original apple chargers. Everything has the same results.  I've tried with the battery unplugged as well and get pretty much the same results. \n\nOn the few occasions where it does recognize the charger it sometimes has a very faint flicker on the orange light like it's straining.\n\nAlso if someone has the boardview & schematic file for this board that would be very kind of you too :)\n\nAny assistance would be appreciated."
    },
    {
        "post_id":13939,
        "thread_id":13938,
        "title":"MacBook Pro 13.3\" - Mid 2012 - does not recognize charger most of the time",
        "user_id":36,
        "username":"aprendiz",
        "post_date":"2017-01-30 16:52:57",
        "message":"Try another magsafe......"
    },
    {
        "post_id":13942,
        "thread_id":13938,
        "title":"MacBook Pro 13.3\" - Mid 2012 - does not recognize charger most of the time",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-01-30 17:15:48",
        "message":"Check if ACOK from U7000 is high."
    },
    {
        "post_id":13998,
        "thread_id":13938,
        "title":"MacBook Pro 13.3\" - Mid 2012 - does not recognize charger most of the time",
        "user_id":631,
        "username":"razorwoods",
        "post_date":"2017-01-31 14:30:34",
        "message":"Does anyone have a boardview file for the A1278 Mid 2012 ? 820-3115-B"
    },
    {
        "post_id":14001,
        "thread_id":13938,
        "title":"MacBook Pro 13.3\" - Mid 2012 - does not recognize charger most of the time",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-01-31 15:12:54",
        "message":"Google it, it is everywhere."
    },
    {
        "post_id":14003,
        "thread_id":13938,
        "title":"MacBook Pro 13.3\" - Mid 2012 - does not recognize charger most of the time",
        "user_id":631,
        "username":"razorwoods",
        "post_date":"2017-01-31 15:50:09",
        "message":"Yepp found the boardview.  PIN 14 from U7000 (SMC_BC_ACOK) shows no voltage at all.  Nothing when off and nothing when connecting the charger (Yes, I did try with several original Apple chargers), and nothing when starting from battery.  I repeated this test with and without the battery plugged in just to be sure.  Same results.\n\nIt did do something odd today when running these tests.  At one point the charger gave me  a green light and triggered turned on the board and it started to boot.  I disconnected the charger and it shut off.  After that it wouldn't power on with the battery installed.  The battery meter on the side showed nothing as if the battery wasn't connected.  It's has always worked during these tests.  I disconnected the battery and plugged it back in and still no power level meter function or ability to start up on battery power.  I unplugged the battery for about a solid minute then plugged it back in and now it's working normally off the battery again.  Just to be sure I replaced the battery with a new original apple battery but had the same results during the time it wouldn't power on from battery alone."
    },
    {
        "post_id":14005,
        "thread_id":13938,
        "title":"MacBook Pro 13.3\" - Mid 2012 - does not recognize charger most of the time",
        "user_id":451,
        "username":"jgraffis",
        "post_date":"2017-01-31 17:15:47",
        "message":"i would check the current sensing resistors on acin(r7010\/r7011) and make sure they are correct, then just to be safe( when its not working) check for short to ground on smc_bc_acok(pin 14). if all is well change u7000."
    },
    {
        "post_id":14011,
        "thread_id":13938,
        "title":"MacBook Pro 13.3\" - Mid 2012 - does not recognize charger most of the time",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-02-01 02:34:26",
        "message":"I suspect corrosion under the SMC."
    },
    {
        "post_id":14230,
        "thread_id":13938,
        "title":"MacBook Pro 13.3\" - Mid 2012 - does not recognize charger most of the time",
        "user_id":631,
        "username":"razorwoods",
        "post_date":"2017-02-03 10:49:38",
        "message":"Couldn't see any coorosion or anything else on the SMC with the scope but gave it a good side cleaning anyways.  Reset the SMC (again) and now for some magic reason that totally escapes me it's working normally now.  Honestly I don't know what combination of things , if anything I did at all fixed this but it's back to normal now and in 2 days of testing it randomly with different chargers, firing it up, putting it to sleep, rebooting, etc... it's functioning 100% normal.  Thanks everyone for the help & input."
    },
    {
        "post_id":14233,
        "thread_id":13938,
        "title":"MacBook Pro 13.3\" - Mid 2012 - does not recognize charger most of the time",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2017-02-03 11:52:35",
        "message":"duke saw the corrosion from the netherlands. THAT is a magic reason!!"
    }
]