[
    {
        "post_id":96421,
        "thread_id":63569,
        "title":"820-02091 - A2348 - No power",
        "user_id":1509,
        "username":"Kappy",
        "post_date":"2023-02-07 06:22:11",
        "message":"This has landed on my bench with just stopped working one day and has no power.\n\n Hooked up to my bench supply (max 5A) gives 12v 0A. I've check for a short to ground on the Caps - nothing found. \n\nAs soon as I connect my bench supply to the board I get a jump of amps from 0.06 to 0.00 and that's where is stays.\n\nI've check the coils and only 1 is giving an output of 12v the others nothing. \n\nI tried DFU mode - that's a no go and also at the button connector it's not showing any voltage so I presume that's why it's not entering DFU mode. (not even for a split second when connecting power to the board)\n\nThe power supply is fine and giving 12v output - so I've ruled that out to be the problem.\n\nFrom what I can find I've check 0ohm and fuses - none are blown.\n\nI had a look under the thermal camera but nothings getting hot and a pointless exercise as it's drawing 0A.\n\nHistory from the customer is just stopped working and no liquid signs anywhere.\n\nI'm stuck now of what to try next and also why it's not drawing any Amps what-so-ever."
    },
    {
        "post_id":96429,
        "thread_id":63569,
        "title":"820-02091 - A2348 - No power",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-02-07 10:32:51",
        "message":"Find 3V8_AON power rail; check diode mode to ground, if no voltage.\nAlso check PMU voltages (the small coils)."
    },
    {
        "post_id":96435,
        "thread_id":63569,
        "title":"820-02091 - A2348 - No power",
        "user_id":1509,
        "username":"Kappy",
        "post_date":"2023-02-07 12:47:12",
        "message":"Nothing on the PMU rails - checked all coils..\n\nI've check every cap - no short to ground.  I think i'm going to have to leave this as I cannot understand why the amp's don't move from 0 when applying power!!"
    },
    {
        "post_id":96439,
        "thread_id":63569,
        "title":"820-02091 - A2348 - No power",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-02-07 13:49:30",
        "message":"Without schematic\/boardview is waste of time.\nThe is no amperage, if PMU doesn't send out any power to M1.\nYou should check atleast its LDOs; probably impossible to locate them."
    }
]