{"post_id":18888,"thread_id":18888,"title":"[SOLVED] What does NO STUFF mean in a schematic?","user_id":792,"username":"macitech","post_date":"2017-04-21 17:18:45","message":"Hi\nI looking at 2 logic boards and there is no component on both boards for the same location.\nAre the Schematics always correct? I also search for a substitute part. Says should be a capacitor but its black and not grey.\nI see many places on board that look like components could go there on both boards but there are none.\nThanks\n820-3437\nPart C5625\nSeems as Board is working weird. I replaced many components but machine is getting hot but it is charging battery was at 0%.Battery is charging.\nDidn't wok without battery.\n."}
{"post_id":18895,"thread_id":18888,"title":"[SOLVED] What does NO STUFF mean in a schematic?","user_id":371,"username":"nate8organic","post_date":"2017-04-21 18:13:28","message":"the schematics are not always correct but relatively close. there are going to spots all over the board that are not connected to anything but have power\/data running to them, why? ask an engineer.  just check some of the same boards to make sure there is not suppose to be a part there. also in the schematics it will often say something like \"no stuff\" meaning there is no component there.  the most obvious why for me to tell is to look if the solder is perfectly rounded and has no marks etc.  most missing parts pull off leaving the tabs from the component and makes them obvious there was a part.  not always but most of the time this is the case.  hope this helps."}
{"post_id":18897,"thread_id":18888,"title":"[SOLVED] What does NO STUFF mean in a schematic?","user_id":792,"username":"macitech","post_date":"2017-04-21 19:51:41","message":"Thanks Nate!\nI have been adding parts for 3 days now.\nI now need to go back and double check my work.\nOn the bright side it has been good practice.\nAround the u5000 chip"}
{"post_id":18907,"thread_id":18888,"title":"[SOLVED] What does NO STUFF mean in a schematic?","user_id":2,"username":"dukefawks","post_date":"2017-04-22 03:02:26","message":"C5625 is \"NO STUFF\""}
{"post_id":18929,"thread_id":18888,"title":"[SOLVED] What does NO STUFF mean in a schematic?","user_id":792,"username":"macitech","post_date":"2017-04-22 15:03:59","message":"Ok I get it now Tx as always!"}
