[
    {
        "post_id":61399,
        "thread_id":59540,
        "title":"820-00928 Slow boot\/kernel panic when battery connected",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-06-24 21:19:54",
        "message":"Hello. I got a 820-00928 that looks completely clean of corrosion. It was originally booting to critical software update but I was able to get that download after a couple of tries. Now it will either boot slow (1-2 minutes for full boot), or it will attempt to boot and then it will kernel panic and reboot. Eventually when it does make it to the login screen, it lets me login, and the computer seems to work fine. I noticed that if I disconnect the battery, it boots much faster (10-15 seconds) and never kernel panics. I figured the battery was bad, so I tried the board in another topcase with another battery and it does the same thing, so seems to be related to this board. Any idea what would cause this?"
    },
    {
        "post_id":61413,
        "thread_id":59540,
        "title":"820-00928 Slow boot\/kernel panic when battery connected",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-06-25 05:35:55",
        "message":"Did you try PRAM reset?\n2-3 times, just in case.\n\nYou can also try to clean ME region..."
    },
    {
        "post_id":61442,
        "thread_id":59540,
        "title":"820-00928 Slow boot\/kernel panic when battery connected",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-06-25 11:26:05",
        "message":"Yea I have tried both PRAM reset and SMC reset multiple times but it did not help. I just tried with a clean ME but it is still acting the same way. I was wrong originally when I said the computer seems to work fine when it does boot. Once the computer gets to the login screen, it lags and freezes for a couple of seconds and then the whole screen turns white for about 2 seconds and then the screen goes back to normal and I can enter my password and login without issue. I tried booting into Safe mode with the battery still connected and it does not seem to do this in safe mode. The only time I have these issues is during normal boot, with battery connected."
    },
    {
        "post_id":61445,
        "thread_id":59540,
        "title":"820-00928 Slow boot\/kernel panic when battery connected",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-06-25 11:50:57",
        "message":"Try another known good working battery; even old, just for test..."
    },
    {
        "post_id":61453,
        "thread_id":59540,
        "title":"820-00928 Slow boot\/kernel panic when battery connected",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-06-25 21:00:17",
        "message":"The clean ME may have actually worked. It was still doing the same thing the first few times I turned it on, but the I did another PRAM reset and it booted normally with everything connected and has been working fine all day. Ill do some more testing with it but this is solved for now. Thanks"
    }
]