{"post_id":58470,"thread_id":58470,"title":"iMac 27\" Late 2013 820-3481-A Only Boots Face Down","user_id":24797,"username":"Jim F","post_date":"2020-04-19 18:53:06","message":"A1419 EMC 2639\n\nComputer came in booting to question mark folder. 2TB Seagate Drive was dead. This occurred shortly after owner updated from Mojave to Catalina.\n\nReplaced Hard drive with 6TB Western Digital. Recreated Fusion Drive with APFS. Worked fine. Used on and off for 3 days loading updates and so on. Finally decided to re-adhere screen (I had been using with it just taped on). As soon as screen was glued in place booted to question mark folder and refused to see 6TB Harddrive would only show the 128GB PCIe SSD. Disassembled and removed logic board checked SATA connectors and power connectors for 6TB Hard Drive. Everything looked normal, no signs of corrosion or wear. Basically this board is pristine. Re-assembled still wouldn't work. Ordered new cable. Installed new cable, everything working again. After testing for 3 days I glued screen back on. Test, still working. Deliver to customer, he calls back and says boots to question mark folder. Again it can't see 6TB WD SATA drive. It occured to me everytime I adhere screen i place iMac on its back, maybe something to do with that. Sure enough If I place this computer face down, it boots fine...lol. Once I place it upright its fine. But jostle it or lay it face up (like transporting it to clients house) and next time you start it, it starts with fans blazing and not seeing the SATA drive. Hoping someone else has had this before. Cheers!"}
{"post_id":58476,"thread_id":58470,"title":"iMac 27\" Late 2013 820-3481-A Only Boots Face Down","user_id":682,"username":"2informaticos","post_date":"2020-04-19 20:01:34","message":"Did you try another HDD?"}
{"post_id":58477,"thread_id":58470,"title":"iMac 27\" Late 2013 820-3481-A Only Boots Face Down","user_id":24797,"username":"Jim F","post_date":"2020-04-19 20:11:49","message":"I haven't. Suppose could be something wrong with drive, but 30 years of IT I have never run across a positional hard drive, but as soon as you say that, there's a situation that will stand up and say, \"pleased to meet you, I'm your first.\"    ;)"}
{"post_id":58491,"thread_id":58470,"title":"iMac 27\" Late 2013 820-3481-A Only Boots Face Down","user_id":682,"username":"2informaticos","post_date":"2020-04-20 04:30:27","message":"You can try any SATA HDD\/SSD on the same connector; even 2.5\" one..."}
{"post_id":58965,"thread_id":58470,"title":"iMac 27\" Late 2013 820-3481-A Only Boots Face Down","user_id":24797,"username":"Jim F","post_date":"2020-04-30 10:58:16","message":"SOLVED.\n\nNot that many people probably will be helped by this. But after much swapping of hard drives (both the mechanical and the blade) and swapping of cables, and inspection of board etc. etc.  The issue was actually being caused by a short generating from the exposed back of the power supply to the back side or the LCD screen.  There was no actual contact with the two components but apparently the voltages were high enough that there was occasional arcing between the two.  I was running out of ideas as to what the problem was but this idea occurred to me so to test it I applied Kapton tape to the back of the LCD panel that faces the power supply and motherboard.  For the first time in a month the system is running flawlessly.  Go figure.\n\n\nTL\/DR\nI had removed this screen from this machine 5 times....  When in testing phase and therefore the screen was not tightly adhered to housing the machine ran fine.  I would reattach screen with adhesive strips and within minutes to no more that a day it would start randomly rebooting and often when restarting loose the ability to \"see\" the mechanical drive of the Fusion drive setup.  This problem happened over and over again.  I had decided that either the power supply was dying (but why just when screen tightly adhered?) or somehow once screen was on there had to be a short since system worked fine with screen either loose or off (and running off external monitor).  It does appear that this is not an original Apple screen, so maybe its just a bit thicker on the backplate than OEM original, idk.  But I have always wondered why Apple has high voltage exposed back of power supply so close to the metallic back of LCD screens in their slim line iMacs.\n\nFor what its worth.\n\nCheers."}
{"post_id":58967,"thread_id":58470,"title":"iMac 27\" Late 2013 820-3481-A Only Boots Face Down","user_id":682,"username":"2informaticos","post_date":"2020-04-30 11:09:31","message":"Thanks for detailed explanation.\nCould help someone else in the future..."}
