{"post_id":23148,"thread_id":23148,"title":"[SOLVED]820-3330 Board, No Green Light, Powers from Battery","user_id":515,"username":"SMMRepair","post_date":"2017-07-18 13:43:37","message":"Sort of stumped by an 820-3330 right now. Board came in with a short on ppbus_g3h, which I located to U7000\/Q7030\/Q7035. Replaced those components, and short is gone, and board will power on from battery, but I have no green light and I'm missing basically everything (3v42, ppbus, etc). My ppdcin_g3h is essentially 0v, but no short is present. I'm getting the feeling that I have a critical resistor that's blown or something, but I can't find it. I checked all resistors around U7000, and they all measure out fine. Also checked R7001, R7005, R6990, etc. I tried to start \"from the top\", but with 0v on ppdcin_g3h and no short, I don't really know where else to go.\n\nAny ideas where to go from here? All help appreciated."}
{"post_id":23154,"thread_id":23148,"title":"[SOLVED]820-3330 Board, No Green Light, Powers from Battery","user_id":1,"username":"larossmann","post_date":"2017-07-18 14:45:57","message":"Bad Q7080."}
{"post_id":23155,"thread_id":23148,"title":"[SOLVED]820-3330 Board, No Green Light, Powers from Battery","user_id":515,"username":"SMMRepair","post_date":"2017-07-18 14:48:53","message":"Hey Louis, thanks! I replaced Q7080 as part of my troubleshooting, and still the exact same issues. I'll replace it again to be sure (at least my thinking was in the right direction!). Will do that now then update."}
{"post_id":23156,"thread_id":23148,"title":"[SOLVED]820-3330 Board, No Green Light, Powers from Battery","user_id":515,"username":"SMMRepair","post_date":"2017-07-18 14:58:39","message":"Replaced Q7080 and no change; unless both Q7080's I've used were bad, I think the issue may lie somewhere else. Any ideas?"}
{"post_id":23160,"thread_id":23148,"title":"[SOLVED]820-3330 Board, No Green Light, Powers from Battery","user_id":515,"username":"SMMRepair","post_date":"2017-07-18 16:02:42","message":"I don't have an identical board here to check, but can someone check the diode readings below for Q7080 and compare?\n\nDiode readings Q7080:\n\nPin 1\/2 = .538 (confirmed continuity to R7080)\nPin 4\/5 = 1.7 (confirmed continuity to R7085)\nPin 3 = OL\nPin 6 = OL"}
{"post_id":23182,"thread_id":23148,"title":"[SOLVED]820-3330 Board, No Green Light, Powers from Battery","user_id":1,"username":"larossmann","post_date":"2017-07-18 23:39:02","message":"remove the DC in fuse and apply 18.5v to the dc in fuse from an external power supply, then plug the magsafe in and tell me what behavior you get."}
{"post_id":23202,"thread_id":23148,"title":"[SOLVED]820-3330 Board, No Green Light, Powers from Battery","user_id":515,"username":"SMMRepair","post_date":"2017-07-19 10:19:00","message":"Thanks, Louis; I removed the fuse and injected 18.45v at 2 amps, and immediately something \"popped\". I don't see any damage to anything I can tell, but I did smell that distinct \"burnt electronics\" smell, so something definitely bit the dust immediately. Didn't see any smoke, and can't locate the component visually or via smell, but I do notice that my U7000 got very hot as well.\n\nThinking I'll need to replace U7000\/Q7030\/Q7035\/Q7080 all together again?"}
{"post_id":23205,"thread_id":23148,"title":"[SOLVED]820-3330 Board, No Green Light, Powers from Battery","user_id":515,"username":"SMMRepair","post_date":"2017-07-19 10:58:30","message":"Got this one solved, I think; I decided to replace U7000\/Q7030\/Q7035\/Q7080 all together again, and found a cap that was cracked in the process. Not sure which it was, the cap or one of the FETs, but I have green light and fan spin with charger now! Thank goodness; I'm going to get this guy into a test case and hopefully it will not have any other issues. I'll post back for sure once it passes everything, but did want to post this update now. Thank you Louis! I believe it may have been Q7080 after all."}
