[
    {
        "post_id":24620,
        "thread_id":24620,
        "title":"[SOLVED]820-00164 no backlight (fuse keeps blowing)",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2017-08-24 20:34:38",
        "message":"This board had liquid damage around the LCD area and the connector\/cable were burned. I replaced all the components around the LCD connector, the connector and the LVDS cable. When I plugged in the new lvds cable I got 0v on backlight at the connector. I had 3.32v on BKL_PWM and 0v on BKL_EN at one point. I replaced the 2 BKL_EN resistors but that didn't fix the bkl_en issue.\n\nI put a new fuse on there but I ended up seeing there was 0v on Pin 2 of F7700. I put a couple more fuses on there and they kept blowing. I replaced Q7706\/7 again and put another fuse on there and it blew again.\n\nI'm not sure what could be causing this. I'm not sure if this is noteworthy but I did previously plug in the damaged LVDS to see if I had an image so I don't know if that damaged the connector internally.\n\nThe LP8550 area is spotless and I am seeing an image on the screen.\n\nR7788\/89 measure the proper resistance."
    },
    {
        "post_id":24629,
        "thread_id":24620,
        "title":"[SOLVED]820-00164 no backlight (fuse keeps blowing)",
        "user_id":468,
        "username":"ALB-Repairs",
        "post_date":"2017-08-25 02:06:07",
        "message":"Theres a short somewhere,\nCould be the LP8850, could be the connector you plugged a bad cable into, They burn up quickly if plugged into garbage.\nWhats the resistance to ground on the connectors backluight output pins?"
    },
    {
        "post_id":24644,
        "thread_id":24620,
        "title":"[SOLVED]820-00164 no backlight (fuse keeps blowing)",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2017-08-25 12:07:14",
        "message":"Okay I believe I was getting around 1.5kohms of resistance to ground on backlight pins. I replaced the connector, used another lvds cable and put another fuse on and it blew again. I replaced the lp8550 then put a new fuse on and that blew as well. It looked like the backlight was turning on for half of a second before I saw the fuse blow.\nI am getting 0.26v in diode mode on pins 3\/4 of the connector(that is with the blown fuse on the board).\n\nWhat else could cause this?"
    },
    {
        "post_id":24648,
        "thread_id":24620,
        "title":"[SOLVED]820-00164 no backlight (fuse keeps blowing)",
        "user_id":468,
        "username":"ALB-Repairs",
        "post_date":"2017-08-25 13:02:41",
        "message":"Is the screen your using known good?\nIts rare for the fuse to blow, are the measurements your taking with a screen plugged in or unplugged?"
    },
    {
        "post_id":24653,
        "thread_id":24620,
        "title":"[SOLVED]820-00164 no backlight (fuse keeps blowing)",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2017-08-25 14:09:54",
        "message":"Those measurements were with the new lvds cable plugged in and without any power source plugged in. \nI just put another fuse on and plugged in a known working bare lcd. I can manuever the backlight strip so I can plug it into the bare lcd but I decided to see if the fuse would blow with just the lvds cable plugged in and once again the fuse blew so I don't think the original display assembly is the issue."
    },
    {
        "post_id":24673,
        "thread_id":24620,
        "title":"[SOLVED]820-00164 no backlight (fuse keeps blowing)",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-08-26 11:44:31",
        "message":"Inject voltage on the backlight line an watch current draw, slowly increase voltage. Something must be shorted out and cause the fuse to blow."
    },
    {
        "post_id":24690,
        "thread_id":24620,
        "title":"[SOLVED]820-00164 no backlight (fuse keeps blowing)",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2017-08-26 17:05:22",
        "message":"Okay I injected voltage on Pin of F7700 and got up to around 6v and there was no current so I put a little alcohol in that area and immediately Q7706 started sizzling and 0.83 Amps appeared. I measured Pins 1\/2\/5\/6 of Q7706 and they were both 0v to ground in diode mode. I removed Q7706 and the pads are still shorted to ground. The top layer and pad of Pin1 on R5490 is almost gone so I figure there was some bad liquid damage there that caused this. Pin 2 of R5490 is not shorted to ground though\n\nUpdate: I measured L7701 in diode mode and both sides gave me around 0.08v to ground so I removed it from the board and Pin 1 gave me 0.08v and Pin 2 is around 0.39v so I assume the short is before pin 1. I have removed C7712\/13 and Q7706\/7 but the short still remains. I injected voltage on Pin 1 of L7701 and only got around 0.1amps so I put alcohol on the Q7706 pads and it immediately sizzled and it showed over 3 amps. Is this a short inside the board?"
    },
    {
        "post_id":24698,
        "thread_id":24620,
        "title":"[SOLVED]820-00164 no backlight (fuse keeps blowing)",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-08-27 12:42:37",
        "message":"Looks like a short in the board. You can try to isolate all parts on the shorted rails and create a new one with some wires."
    },
    {
        "post_id":24712,
        "thread_id":24620,
        "title":"[SOLVED]820-00164 no backlight (fuse keeps blowing)",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2017-08-27 19:50:27",
        "message":"Okay I ran a bunch of wires to L7701 and now backlight is working. Thanks duke."
    }
]