[
    {
        "post_id":28730,
        "thread_id":28730,
        "title":"[SOLVED]820-00045 - Random crashing with graphical glitches",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-12-01 06:02:07",
        "message":"First time working on one of these macbooks.\n\nThis system will boot and work fine for a little moment (although slowly due failing sensors?) and then just crash with graphical glitches just as on its old friend the Macbook Air 2011.\nIs this the same as with those, Bad CPU\/Bad ram traces\/Bad ram?\n\nAHT failes with the errors PFM006 (SMC) and PPN001 (PWR Managment)\n\nOnce the system crashes and it shuts down it doesn't turn back on again unless you press the little SYS_CONNECT button to fully disconnect the G3H rails.\n\nWhere to start?\n\nCheers"
    },
    {
        "post_id":28741,
        "thread_id":28730,
        "title":"[SOLVED]820-00045 - Random crashing with graphical glitches",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-12-01 07:47:56",
        "message":"Yeah good luck with that....RAM\/CPU\/traces\/liquid, hopeless.\n\nI do need a donor board for the ISL95530, so if this gets scrapped let me know."
    },
    {
        "post_id":29736,
        "thread_id":28730,
        "title":"[SOLVED]820-00045 - Random crashing with graphical glitches",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-12-22 04:36:47",
        "message":"Got a replacement board, this one does not crash but AHT still has errors with PFM006 and PPN001. Any idea what this could be from?\n\nEDIT: We don't have working audio so maybe it has something to do with that single board from the headphone connector. HWSensors gives me a 128C reading for Heatpipe outgoing air, but there is no fan so I assume this is simply not connected? Also the \"motherboard S0 rail\" sensor reports as 15V and the \"+12V rail\" sensor as 8.6V\n\nI assume 15V is the USB-C incomming and 8.6V the PPBUS line and that the application just doesn't understand what sensors its reading\n\nEDIT2: Probably we're missing SMBUS_SMC_3_SCL coming from J6799. The cable does not look very well and the board is missing the little bar you push down to secure the cable."
    },
    {
        "post_id":29740,
        "thread_id":28730,
        "title":"[SOLVED]820-00045 - Random crashing with graphical glitches",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-12-22 07:45:41",
        "message":"Replacing the headphone jack\/audio assembly resolved the PFM006 and PPN001 issues, Resolved!"
    },
    {
        "post_id":29770,
        "thread_id":28730,
        "title":"[SOLVED]820-00045 - Random crashing with graphical glitches",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-12-22 21:45:00",
        "message":"I am looking for a donor board. PM me if you want to sell."
    }
]