[
    {
        "post_id":30785,
        "thread_id":30785,
        "title":"Source for logic board to refurbish?",
        "user_id":917,
        "username":"galvestonmac",
        "post_date":"2018-01-28 06:40:54",
        "message":"Anyone have a reliable source to get logic boards to refurbish? Not donor board with the hole drilled through, but boards that are not working that can be bought in a lot to fix.  Thanks!"
    },
    {
        "post_id":30789,
        "thread_id":30785,
        "title":"Source for logic board to refurbish?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-01-28 10:51:30",
        "message":"Nope. My rule is if the original board cannot be fixed the machine is written off. Too much hassle and crap if you buy any board to repair. All the stuff on Ebay is garbage and undisclosed repair attempts. It is not worth the headache to deal with sourcing boards. The stuff from China we of course don't even need to mention."
    },
    {
        "post_id":30802,
        "thread_id":30785,
        "title":"Source for logic board to refurbish?",
        "user_id":1190,
        "username":"Gmorb",
        "post_date":"2018-01-28 17:13:44",
        "message":"I bought one off ebay so far and it was a pretty easy fix. It depends on your luck also i suggest you buy the full mac not just board. That way if the board is unfixable at least u have a body for a board that may be fixable. i suggest you try to scope out people on craigslist or offerup app which is what ive been doing and have had success fixing those. My rule is never buy anything with cracked screens and dont spend more than 100 dollars on one. Maybe also try doing business with your local electronics recycling center. They dont usually do board repair and if theyre cool people will sell y boards super cheap.\n\nalso scope out local repair shops most dont go beyond water damage repair and sometimes have stuff lying around they didnt think was fixable. Again depending on the people they may give u a good deal or not. Just gotta out and look for them."
    }
]