{"post_id":8358,"thread_id":8358,"title":"[820-3536] Knocked over case pin, ruined board?","user_id":289,"username":"smiba","post_date":"2016-10-20 18:37:43","message":"Currently working on a 820-3536 which doesn't boot at all (No fan spin, green light then turns orange) and I've noticed that one of those pins that ground the casing have been knocked over. This exposes some of the traces in the board but I don't think there are any broken connections.\n\nPicture:[URL]https:\/\/i.imgur.com\/GFpcouU.jpg[\/URL] & [URL]https:\/\/i.imgur.com\/LJFhL3S.jpg[\/URL]\n\nThe few metal things that are stuck on the pin all seem to be connected to the pin itself, which if it was still on the board would probably just connect the pin to those pads\/holes?\n\nI think it should be alright, but I just wanted to make sure this is not the reason why the board would be non-functional. I rather don't want to spent hours of time just to realise its fucked :p\n\nThanks!"}
{"post_id":8360,"thread_id":8358,"title":"[820-3536] Knocked over case pin, ruined board?","user_id":2,"username":"dukefawks","post_date":"2016-10-20 19:12:08","message":"Nah, just rip it off. Look for liquid, PPBUS, 3V3_S5"}
{"post_id":8363,"thread_id":8358,"title":"[820-3536] Knocked over case pin, ruined board?","user_id":289,"username":"smiba","post_date":"2016-10-20 21:13:27","message":"I ripped it off cleanly\n\nAnyways some more serious stuff, this doesn't look too well...\n\n[URL]https:\/\/i.imgur.com\/5cOlKsk.jpg[\/URL]\n\nAny tips on what approach to take to restore these pads?\n\nAlso C1031, C7323 and C7372 seem to be ripped off but their legs are still soldered on. I've never soldered caps like this so I have no idea how to properly desolder them from a donor board and solder them on. Especially when the legs are still in. What approach to take?\n\n(Since these caps are missing, would this be a reason for it not to enter a S0 state?)\n\nThanks again and sorry for being the biggest noob :o, Glad you're here to help\n\nEDIT: Also the yellow stuff on the pads, is that just glue or are those actual lines? I've never had ripped off pads before on a board and I need to know if I can scrape them away without ruining the complete board."}
{"post_id":8374,"thread_id":8358,"title":"[820-3536] Knocked over case pin, ruined board?","user_id":2,"username":"dukefawks","post_date":"2016-10-21 05:03:28","message":"There are no pads to restore, there is nothing damaged you are just looking at fibers of the PCB material.\nAll those missing caps are not critical for operation. It does make me question as to what happened to this board. Looks like it was thrown around, so more missing parts are to be expected."}
{"post_id":8505,"thread_id":8358,"title":"[820-3536] Knocked over case pin, ruined board?","user_id":289,"username":"smiba","post_date":"2016-10-23 15:00:41","message":"This board has definitely seen better times, I have no idea what happened to it, other then it being damaged or missing some components I see no other damage to the board and\/or his traces though. It has suffered from water damage but sadly I think someone else tried to \"fix\" it by just putting it in a ultrasonic (Which might have been to aggressive and knocked these parts off?). The water indicators are bright red but I don't see any corrosion at all\n\nI'll continue diagnosing the board soon, when I'm finished I'd love to put at least a few of those capacitors back. I don't think its alright to call it a quality repair while various parts are missing from the board.\n\nHow do I go and restore the pads for C7619 and replace the 6 other caps just like it? (Some of them only have legs, but a few at a different part of the board have cracks going through them and I don't trust them to last) I tried looking on Louis his channel but I'm unable to find a video where he replaces these capacitors."}
{"post_id":8507,"thread_id":8358,"title":"[820-3536] Knocked over case pin, ruined board?","user_id":2,"username":"dukefawks","post_date":"2016-10-23 15:48:43","message":"So far you have not provided any measurements. PPBUS? 3V3_S5? etc\nC7619 is not needed for the board to work"}
{"post_id":8568,"thread_id":8358,"title":"[820-3536] Knocked over case pin, ruined board?","user_id":289,"username":"smiba","post_date":"2016-10-24 17:14:44","message":"PPBUS_G3H 12.47v\nPPBUS_S5_HS_COMPUTING 12.45v\nPPBUS_S5_HS_OTHER3V3 12.45v\nPPBUS_S5_HS_OTHER5V 12.45v\n\nPP3V42_G3H 3.37v\nPPDCIN_G3H_ISOL 16.47v (Yes, its a 60W charger, the other one is currently in use but since its a 13\" model it should be alright)\nPPDCIN_G3H 16.43v\n\nPP5V_S5 5.00v\nPP5V_S4 0v\n...\n\nPP3V3_S5 3.3v\nPP3V3_S4 0v\n...\n\nThe board is also missing quite a few parts, most of them are ripped off but some are actually desoldered:\n\nMissing: C0890, C0891, C0892, C1264, U1900, C6919, C1031, C7323, C7372\n\nThere has definitely been screwed with this board, I'll try to fix it but honestly I think I should accept I've been scammed for a very expensive donor board"}
{"post_id":8573,"thread_id":8358,"title":"[820-3536] Knocked over case pin, ruined board?","user_id":2,"username":"dukefawks","post_date":"2016-10-24 17:53:55","message":"How is resistance on PPVRTC_G3H looking?"}
{"post_id":8575,"thread_id":8358,"title":"[820-3536] Knocked over case pin, ruined board?","user_id":289,"username":"smiba","post_date":"2016-10-24 18:22:13","message":"Short on PPVRTC_G3H (measured at R1300, pin 1)\n\nIts currently 1AM so I'll continue working on it tomorrow, I'll probably check out the schematics to follow the line and check the parts along the way. Any tips or specific area's to look at?\n\nThanks!"}
{"post_id":8576,"thread_id":8358,"title":"[820-3536] Knocked over case pin, ruined board?","user_id":2,"username":"dukefawks","post_date":"2016-10-24 18:27:44","message":"Probably shorted CPU then if U1900 and those caps are already gone."}
{"post_id":8579,"thread_id":8358,"title":"[820-3536] Knocked over case pin, ruined board?","user_id":289,"username":"smiba","post_date":"2016-10-24 18:58:44","message":"Darn, there indeed isn't anything left on PPVRTC_G3H to cause a short other then the CPU.\n\nDo you think the CPU is toast or could re-balling may work?"}
{"post_id":8580,"thread_id":8358,"title":"[820-3536] Knocked over case pin, ruined board?","user_id":2,"username":"dukefawks","post_date":"2016-10-24 19:23:55","message":"Probably toasted, but for practice you can try and reball."}
