{"post_id":46599,"thread_id":46599,"title":"No backlight after liquid damage","user_id":1482,"username":"BCN_Techs","post_date":"2019-02-22 08:57:49","message":"Hi, \n\nI have 820-3115 logic board that boots and all is ok except of backlight. There were some water damaged componentes with wrong values aroung  U9701 so changed them and U9701 too and backlight turned on. After a couple of hours it was off again. Checked and seems that all values are correct. The only thing i can see is that PPVIN_SW_T29BST line is shitted, some components has pins like black but there is no short to ground. \n\nPPVIN_SW_T29BST - 2.6V\n\n\nMy question is PPVIN_SW_T29BST can make backlight not work propery?"}
{"post_id":46601,"thread_id":46599,"title":"No backlight after liquid damage","user_id":682,"username":"2informaticos","post_date":"2019-02-22 09:10:22","message":"PPVIN_SW_T29BST is Thunderbolt power rail and is not even enabled, untill something is connected on the dedicated connector.\n\nI suspect bad solders under U9701; reflow it.\nHowever, I recommend to measure some voltage around it first.\nCheck BKL_EN, BKL_PWM, 3\/5V power, voltage both pins of D9701.\nCheck continuity from D9701 to ball A5 of U9701.\nAlso look if all resistors have good value and terminals..."}
{"post_id":46606,"thread_id":46599,"title":"No backlight after liquid damage","user_id":1153,"username":"JohnB8812","post_date":"2019-02-22 10:17:11","message":"What voltage currently on BKLT output? I'm with 2informaticos sounds like bad soldering."}
{"post_id":46608,"thread_id":46599,"title":"No backlight after liquid damage","user_id":1482,"username":"BCN_Techs","post_date":"2019-02-22 10:47:02","message":"Checked again. all componentes around U9701 and it's all ok. \n\nBKL_EN  - 3.1 V\nBKL_PWM - 3.3V\nTHere is continuity between D9701 to A5\n\nWill try to change U9701 by new one."}
{"post_id":46610,"thread_id":46599,"title":"No backlight after liquid damage","user_id":1482,"username":"BCN_Techs","post_date":"2019-02-22 11:04:13","message":"The voltage on out is 12,57V\n\nFixed. 2informaticos was right:) \n\nIt was continuity from A5 to D9701. The problem is that the trace was damaged righ near a5 under the chip so i didnt see it before. Restored and now working. Thanks a lot"}
