{"post_id":79286,"thread_id":61618,"title":"iMac 21\" 2017 - 820-01237 - Missing Common Mode Chip Inductors and LAN Trasformer","user_id":12,"username":"Ictc","post_date":"2021-08-25 09:58:11","message":"I got this board from a client wich attempted a self upgrade of the NVme unit messing up some smt passive components o the board.\n\nThe missing component are one LAN trasformer and its relative common mode choke.\nI've been able to find the type of product and may be the OEM (Murata) but they have so many different impadance value and without a schematic I'm not abe to choose the right replacement and I'm stuck with this repair. Does anybody know which impedance value I need to choose for the replacement (Trasformer + cmci) in order to have that gigabit port back operating?\n\n[ATTACH]60125[\/ATTACH]"}
{"post_id":79295,"thread_id":61618,"title":"iMac 21\" 2017 - 820-01237 - Missing Common Mode Chip Inductors and LAN Trasformer","user_id":682,"username":"2informaticos","post_date":"2021-08-25 13:05:28","message":"Try to find a scrap board with similar specs."}
{"post_id":79329,"thread_id":61618,"title":"iMac 21\" 2017 - 820-01237 - Missing Common Mode Chip Inductors and LAN Trasformer","user_id":12,"username":"Ictc","post_date":"2021-08-26 05:35:00","message":"Couldn't find any... Also couldn't find any datasheet of the LFE8904CF which is the packed version of the discrete transformer and CMI already used on another version of iMac. I also tried to look for the datasheet application example of the ethernet controller named BCM57766A but also in this case I've not been able to find anything including the basic datasheed of the product from broadcom home site...\n\nUsually other board with the same chipsets uses integrated trasformes but I couldn't find any specifications concerning this components on google.\n\nIs there a way to measure the impedance of the transformer and the common mode choke? I do not know how the impedance is measured and where this value come from. For a normal choke with only one pair of terminals is quite straight forward but with this tiny transformers with different pins I do not really know where to start from."}
{"post_id":79490,"thread_id":61618,"title":"iMac 21\" 2017 - 820-01237 - Missing Common Mode Chip Inductors and LAN Trasformer","user_id":12,"username":"Ictc","post_date":"2021-08-30 08:29:14","message":"I managed to solve this issue using scraped parts from an ethernet port of a desktop motherboard. Digging in to the metal encapsulated pcb mount RJ45 connector, I've been able to find a similar common mode choke (smt mount) and its relative transformer but trough hole mounting. I had to struggle little bit to find out the correct pinout of the transformer and solder it on the logicboard in stead of the original smt mount one... At the end I managed to have the ethernet port back operating. I also had to renew some missing traks and pads and after protecting the flying assembly using some silicon transparent glue the job was done.\n\n\n[ATTACH type=\"full\"]60133[\/ATTACH]"}
