[
    {
        "post_id":103563,
        "thread_id":64448,
        "title":"820-01987 - 5V @ 245mA.  Water damage around hall sensor.  Boots ok on batt?",
        "user_id":27543,
        "username":"down1nit",
        "post_date":"2024-01-08 14:58:34",
        "message":"PP1v8 was shorted due to internal board short i THINK I successfully resolved. 1v8 is present and stable. Damage was extremely localized thankfully. I think that's all good, hall sensor isn't even populated right now, i plan on running wires, not using internal traces.\n\n====\nIts behavior now: First time inserting, 5V... pull it out and reinsert it's instantly 20V.  Only when battery is connected do I get 20V, but only after I do a reinsert, so it's negotiating with something. Stays at 5V with no battery.  I have reason to believe it works fine on a charged battery. Seems like bad 3217s, right?\n\nI replaced the u7000 from a 01987 donor.  I tested for DFU over and over again, and it just shows up as Macintosh no matter the keypress timing blah blah\n\nI did order and replace the CD3217s from a 01987 today. I don't know if they're legit but they're acting the same as the originals.  I still have the original CD3217s. I have the original u7000 too.  Maybe the originals are working OK since this behavior was the same before and after replacing the CD3217s. \n\nPPDCIN 5V PPBUS 12.3 @ 0.245Awhen on adapter \/ PPDCIN 20V PPBUS 12.57 @ 0.00014A when battery connected.  PPBUS is present when adapter is removed, so it switches to battery power OK. It's just a dead battery. I'm gonna start manually charging the battery if i can, as I suspect the board boots fine on battery, which can let me get data.  \n\nI had normal voltage on CPU and SSD when I pressed power button, just didn't have display connected and it died. Please help me I'm so confused here. Why won't this dumb battery charge?  Shit is it a bad battery?"
    },
    {
        "post_id":103564,
        "thread_id":64448,
        "title":"820-01987 - 5V @ 245mA.  Water damage around hall sensor.  Boots ok on batt?",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2024-01-08 15:38:19",
        "message":"You should discard the battery anyway.\n\nBe sure 1V8 is present on all expected points."
    },
    {
        "post_id":103600,
        "thread_id":64448,
        "title":"820-01987 - 5V @ 245mA.  Water damage around hall sensor.  Boots ok on batt?",
        "user_id":27543,
        "username":"down1nit",
        "post_date":"2024-01-09 16:38:16",
        "message":"1v8_slps2r is present in all the places I expect it to be. : I measured on pin 27 of j6600 and both the cd3217s.  Any other ideas? It should get 20v without a working battery right? \n\nFound the battery flex copper was split, so i replaced it too but still no love."
    },
    {
        "post_id":103604,
        "thread_id":64448,
        "title":"820-01987 - 5V @ 245mA.  Water damage around hall sensor.  Boots ok on batt?",
        "user_id":27543,
        "username":"down1nit",
        "post_date":"2024-01-10 00:55:32",
        "message":"Going through power on sequence, everything is present seemingly until\n.\n.\n.\nPMU_Active_Ready : 1.8V\npp3v3_g3h: 3.24V\n\"\"\np3v3main_pgood: 0v\n\nIs this a T2 thing? Should I keep messing with DFU?  Flash the t2 rom?"
    },
    {
        "post_id":103607,
        "thread_id":64448,
        "title":"820-01987 - 5V @ 245mA.  Water damage around hall sensor.  Boots ok on batt?",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2024-01-10 01:13:34",
        "message":"If all required SLPS2R and AWAKE voltages are good, it should enter DFU."
    },
    {
        "post_id":103644,
        "thread_id":64448,
        "title":"820-01987 - 5V @ 245mA.  Water damage around hall sensor.  Boots ok on batt?",
        "user_id":27543,
        "username":"down1nit",
        "post_date":"2024-01-10 13:51:57",
        "message":"Thank you, I will continue doing DFU things with another mac."
    },
    {
        "post_id":103728,
        "thread_id":64448,
        "title":"820-01987 - 5V @ 245mA.  Water damage around hall sensor.  Boots ok on batt?",
        "user_id":27543,
        "username":"down1nit",
        "post_date":"2024-01-12 11:43:50",
        "message":"I could not get the charging function fixed. The customer is tired of waiting for my ass, maybe i can buy it off him and use it as a \"known good\" donor for all but the charging system\n\nThe laptop powers on and works perfectly with the manually charged battery.  The destroyed lid sensor works fine now. BUT IT WILL NOT ENTER DFU AT ALL. Keyboard is working fine, tested all the keys, shift keys, cmd keys trying all sorts of techniques, timings blah blah. worked on it so long i ended up draining the battery from 100% to 45% with no progress at all.  Just \"Macintosh\" in system inspector.  I did not order from L2 computer but i bet the cd3217s i got are not compatible even though they say b12, the second line is unknown to me, maybe they're the hard coded ones.  [B]Gotta source my own chips from icloud locked boards[\/B]"
    },
    {
        "post_id":103735,
        "thread_id":64448,
        "title":"820-01987 - 5V @ 245mA.  Water damage around hall sensor.  Boots ok on batt?",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2024-01-12 15:08:46",
        "message":"You may consider to replace TBT ROM with the one from scrap board where you've got CD3217 chips from."
    }
]