[
    {
        "post_id":99503,
        "thread_id":63925,
        "title":"820-2849 power cycling, missing PPVCORE_GPU",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2023-05-28 17:37:06",
        "message":"This 820-2849 Turns on for 5 seconds, off for 5 seconds and repeats this over and over again. If its on every Rail except PPVCORE_GPU is present. PPVCORE_GPU is 0.05V. U8900 seems to have all signals it needs and i get ~6 Ohms to GND on it. Is that to low? Is there anything i forgot to check or is it the GPU? From my experience with the 15\" 2010 models i know these Nvidia GPUs as normally reliable - not only in comparison with the 2011 AMD ones..."
    },
    {
        "post_id":99504,
        "thread_id":63925,
        "title":"820-2849 power cycling, missing PPVCORE_GPU",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-05-29 01:00:59",
        "message":"Did you try known good BIOS?\n\nYou should expect C9560 failure, before Nvidia.\nSeems that is not the case here."
    },
    {
        "post_id":99506,
        "thread_id":63925,
        "title":"820-2849 power cycling, missing PPVCORE_GPU",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2023-05-29 14:41:43",
        "message":"Thank you. I saved the original file and flashed one i downloaded from badcaps. Unfortunately nothing changed."
    },
    {
        "post_id":99507,
        "thread_id":63925,
        "title":"820-2849 power cycling, missing PPVCORE_GPU",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-05-29 15:21:22",
        "message":"Change U8900, just in case..."
    },
    {
        "post_id":99511,
        "thread_id":63925,
        "title":"820-2849 power cycling, missing PPVCORE_GPU",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2023-05-29 18:21:30",
        "message":"I never hat a bad U8900 but in this case it seems top have done the trick. Now it turns on and boots. Only problem is that i cant get an image on the screen. LVDS connector looks a little bend inside and i have seen this causing no image before if its not making good contact. Right noe i have no 40 pin connectors in stock or on donors so ill need to wait until they arrive. I come back to this if i changed the connector."
    },
    {
        "post_id":99518,
        "thread_id":63925,
        "title":"820-2849 power cycling, missing PPVCORE_GPU",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-05-30 06:29:15",
        "message":"Did you test external video?"
    },
    {
        "post_id":99527,
        "thread_id":63925,
        "title":"820-2849 power cycling, missing PPVCORE_GPU",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2023-05-30 12:21:13",
        "message":"Yes and it did not work. But i had problems with my HDMI adapter recently (unfortunately i cant trust it 100%) and the pins in the LVDS look out of place and the cable won't go in easily. So i want to be sure that the connection is working. Screen dosen't do anything. No Light, no image. So i assumed its not properly detected (have seen this before)... Also if i wait long enought voice over starts talking to me so i am sure its completely booted into my install USB."
    },
    {
        "post_id":99640,
        "thread_id":63925,
        "title":"820-2849 power cycling, missing PPVCORE_GPU",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2023-06-02 12:19:17",
        "message":"Update: LVDS arrived and device is now working fine. Old one came off the board really easy - was not original. Ill flash the original Bios back on it and it should be fixed. Thank you very much - mark as solved please."
    }
]