[
    {
        "post_id":338,
        "thread_id":338,
        "title":"Macbook Air 820-3437 works again but PPBUS_GH3 too low",
        "user_id":46,
        "username":"Crizz",
        "post_date":"2016-03-23 23:39:06",
        "message":"Hi there,\nI am glad to be a member of this community and here is my first post :)\n\nI managed to fix a 820-3437 Board by removing a short to ground on PP3V42.\nI had to replace some Caps getting very hot when I was injecting 3.4V with my bench power supply.\n\nFurthermore i had to replace the Con-Board flex cable. The pins where burned to dust!\n\nAfter all that the fan went on - off - on - off - on - off - on and finally it remains on and everything seems to work and my work were done right? Not really :)\n\nASD reports PPBUS is too low and I measure 7.6V on the whole rail. I don´t think something is shorting to ground since nothing gets really hot.\nFurthermore all the resistors in the ISL6259 area measure good values...\n\nSo what did you think about this problem?\nShould I follow the rabbit or leave the machine as is?\n\n--> The customer has his machine already back for data backup since the machine works and he knows about the issue and he will report unusual behavior."
    },
    {
        "post_id":339,
        "thread_id":338,
        "title":"Macbook Air 820-3437 works again but PPBUS_GH3 too low",
        "user_id":36,
        "username":"aprendiz",
        "post_date":"2016-03-23 23:47:09",
        "message":"Did you run EFI or OS ASD????"
    },
    {
        "post_id":340,
        "thread_id":338,
        "title":"Macbook Air 820-3437 works again but PPBUS_GH3 too low",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-03-24 01:21:43",
        "message":"7.6V is fine with a battery that is not fully charged. You should have checked the actual value in ASD. Problem is probably around Q5500, R5501\/02. The machine will work slow"
    },
    {
        "post_id":343,
        "thread_id":338,
        "title":"Macbook Air 820-3437 works again but PPBUS_GH3 too low",
        "user_id":46,
        "username":"Crizz",
        "post_date":"2016-03-24 04:14:11",
        "message":"No Title\n\nThank You for the reply\nQ5500 was the first place i looked at - I forgot to mention it\nEverything measures and looks fine \n\nI attached a picture so you don't need to search it your self\nPPBUS_G3H on the left side is already 7.6V so the outgoing signal on PIN 3 is also 7.6V\n\nThe outgoing signal SMC_PBUS_VSENSE on the right side is created from PIN3 of Q5500 and the voltage divider R5503\/ R5504 -  all measures fine\nSo for me this section was OK and I went on.\n\nMy guess is there is no sensor issue but the real  value of PBUS is\/was indeed too low! \nWhich raises the question on why PBUS is\/was too low?\n\nMaybe you're right and 7.6V is fine for a not fully charged battery and I will run ASD with a charged battery again when I get my hands on it!\n\nI will report back"
    },
    {
        "post_id":348,
        "thread_id":338,
        "title":"Macbook Air 820-3437 works again but PPBUS_GH3 too low",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-03-24 06:56:46",
        "message":"You can check in ASD the actual value that is being measured. It will be a lot lower than 7.6V before it reports an issue. Run EFI ASD and check under hardware profile."
    }
]