[
    {
        "post_id":39423,
        "thread_id":39423,
        "title":"820-00165 fan NOT spining",
        "user_id":1464,
        "username":"Bouba148",
        "post_date":"2018-09-10 13:09:43",
        "message":"Hi RRG team, folks\n\nI have a 820-00165 which had a liquid damage around the U7600 area ( i had to replace some resistors and rebuit some traces) and also liquid around U6100 and 6101.\nGreen light ok main rails all OK until it arrives around U0500 so I' ve checked all the resistors and traces involved in the \"SPI Bus Series Terminaison\" : All OK\nThen I suspected \/conclued that it was certainly  the U6100 so I've replaced it then the board turned ON (Fan spinned ). New SPI rom ordered from ebay with Clean ME Region and serial injected\/wrote by the Vendor.\nOnce I've replaced the board back in the chassis and replugged everything, it turned ON: Chime, display , backlight, No Over Heating,  all OK except the fan does NOT spin, I did an SMC and PRAM reset without effect.\nI think that i'll disconnect elements one by one and try, if not i'll take it out from the chassis and retry it on the desk.............\nIn the mean time any clue is welcome.\n\nThanks in advance"
    },
    {
        "post_id":39425,
        "thread_id":39423,
        "title":"820-00165 fan NOT spining",
        "user_id":36,
        "username":"aprendiz",
        "post_date":"2018-09-10 13:46:48",
        "message":"The fan should spin on startup, check voltages on fan connector....."
    },
    {
        "post_id":39445,
        "thread_id":39423,
        "title":"820-00165 fan NOT spining",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-09-10 15:42:28",
        "message":"I hope you tried another fan too.\nRun ASD to see if that BIOS you got is really any good. I bet they used the wrong method of \"cleaning\" the ME. You should really get a programmer and do this yourself."
    },
    {
        "post_id":39450,
        "thread_id":39423,
        "title":"820-00165 fan NOT spining",
        "user_id":1464,
        "username":"Bouba148",
        "post_date":"2018-09-10 16:11:44",
        "message":"Hi Dukefawks, Aprendiz\nBefore ordering the bios chip, i've asked and mentionned how important it was, and they confirmed me that the ME Region is cleaned.\nAlso I have a TL866 programmer , a supposed good bin file but asked you guyz a clear procedure how to do it. Because what i've found on the web is not \"clear\", specially for 00165.\nBefore soldering it i've done a backup of it, i can post it to you in PM if you want, then you can confirm me if the ME Region is clean.\nDukefawks if you don't mind could you please post a procedure or message me in private. It's as you wish: I really want to learn how to do it."
    },
    {
        "post_id":39452,
        "thread_id":39423,
        "title":"820-00165 fan NOT spining",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-09-10 16:38:21",
        "message":"Buy a Medusa2 from CMIzapper.com if you want to clean ME yourself and fix Fsys checksum etc."
    },
    {
        "post_id":39468,
        "thread_id":39423,
        "title":"820-00165 fan NOT spining",
        "user_id":1464,
        "username":"Bouba148",
        "post_date":"2018-09-11 03:35:32",
        "message":"OK Thanks but it could not be done with a programmer like TL866?\n\nBy the way, you can mark the topic as solved: the Fan flex cable wasn't secured because of missing latch on the connector."
    },
    {
        "post_id":39596,
        "thread_id":39423,
        "title":"820-00165 fan NOT spining",
        "user_id":1464,
        "username":"Bouba148",
        "post_date":"2018-09-14 17:28:52",
        "message":"Hi you can close this topic: the Fan ribbon latch was missing."
    },
    {
        "post_id":41156,
        "thread_id":39423,
        "title":"820-00165 fan NOT spining",
        "user_id":1464,
        "username":"Bouba148",
        "post_date":"2018-10-24 16:47:07",
        "message":"hi Team,\n\nThis board came back, just to remind you that the original issue was the board was not turning ON because of water damage around U6100 and U7600: replace U6100 and reworked the U7600 area ( check my first post ).\nNow it came back because of the fan running at full speed, after intalling MACS Fan Control it appears that none of the sensors is showing overtemp ( check attached pictures ), in fact if I touch the board nothing is getting hot.\nOnce in that application I've set manually the speed to adjust itself to the GPU which has the highest temp (36 deg), then te fan ran normally. But if I set it to auto it immediatly runs at full speed......\nI did PRAM and SMC Reset without succes.\nshould I run ASD? I there anything to check\/test before......?"
    },
    {
        "post_id":41159,
        "thread_id":39423,
        "title":"820-00165 fan NOT spining",
        "user_id":1464,
        "username":"Bouba148",
        "post_date":"2018-10-24 16:55:27",
        "message":"Also first it was turning OFF after around 10 min with fan at full speed, now it stays ON.\nI've of course cleaned and changed the thermal past.\n\nHere are the pictures sorry:\n\n[ATTACH alt=\"Click image for larger version  Name:\tDSC_0788.JPG Views:\t1 Size:\t1.23 MB ID:\t41160\" type=\"full\" width=\"30%\"]41162._xfImport[\/ATTACH]"
    },
    {
        "post_id":41218,
        "thread_id":39423,
        "title":"820-00165 fan NOT spining",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-10-25 17:43:52",
        "message":"No ASD available since 2015 and up...\nSomewhere in the forum you can find clean ME BIOS for your machine."
    },
    {
        "post_id":41306,
        "thread_id":39423,
        "title":"820-00165 fan NOT spining",
        "user_id":1464,
        "username":"Bouba148",
        "post_date":"2018-10-28 00:08:19",
        "message":"OK thanks .. \nBefore you replied i saw that there is no ASD  \n​​​​​​. I'll try to clean the ME and let you know. \nThanks"
    }
]