[
    {
        "post_id":52389,
        "thread_id":52389,
        "title":"MacBook SSD not recognized after board swap!",
        "user_id":5210,
        "username":"KC Micro Tronix",
        "post_date":"2019-09-18 09:12:18",
        "message":"I have discovered that when I replace a board with one I have fixed that there must be a bios update present before it reads the new O\/S file system. \nIs there a place I can just grab these files and update the board without having to play upgrade the O\/S from USB and waste all that time?"
    },
    {
        "post_id":52392,
        "thread_id":52389,
        "title":"MacBook SSD not recognized after board swap!",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-09-18 11:12:30",
        "message":"BIOS of replaced board MUST support APFS.\nYou can swap BIOS from old board, but need to keep ME region from new board.\nIn this case you will still maintain serial number of the machine."
    },
    {
        "post_id":52401,
        "thread_id":52389,
        "title":"MacBook SSD not recognized after board swap!",
        "user_id":5210,
        "username":"KC Micro Tronix",
        "post_date":"2019-09-18 19:32:33",
        "message":"Is there a way to update the bios so it supports APFS without having the old board.?"
    },
    {
        "post_id":52402,
        "thread_id":52389,
        "title":"MacBook SSD not recognized after board swap!",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-09-19 01:42:43",
        "message":"You need a BIOS dump with APFS support.\nIn such case, keep the ME region of actual (new) board.\nIn case you change the serial number, don't forget to fix the checksum!\nI hope you have Medusa programmer..."
    },
    {
        "post_id":52441,
        "thread_id":52389,
        "title":"MacBook SSD not recognized after board swap!",
        "user_id":5210,
        "username":"KC Micro Tronix",
        "post_date":"2019-09-20 16:58:47",
        "message":"I have a programmer and adapters for the J-TAG. I can read bios and change SN.\nI would like to learn more about the ME programming. I have a ME analyzer and I also have the Intel MX\/TXE injector utility. I have downloaded all the ME versions and they are loaded into the database.  The ME analyzer does not do much good with out the original bios for the board. \n\nI am currently working on a basket case board. It was shipped to me with out many of the parts on it. including the SMC and the Bios chip. I have put a bios chip on it and loaded a bios from the same series board and cpu. I get it in a S0 state but it isn't right and does not turn on screen power or try to talk to the display. It takes a long time to start using the ram. Pulls 0.030 for a second. then 0.330 then finally after about 15-20 seconds pulls 0.550 and the ram lights up in thermal imaging. Other than that it does not do much. Never enables the 3.3V screen power or tries to talk to the screen. It is not loading properly. Not sure what to do.  I did try to load a 10.3 clean ME onto the board.  \n\nIs there a repository for these bios files\/\n\nThe information on the web is pretty bad in this area."
    },
    {
        "post_id":52448,
        "thread_id":52389,
        "title":"MacBook SSD not recognized after board swap!",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-09-21 02:15:23",
        "message":"Swapping generic\/stock clean ME region is not the correct way!\nIs the way (almost) all youtubers show, because they don't have any idea what are doing.\n\nSeveral threads can be found on the forum, about how to clean ME region.\nSearching and reading will help you better than receive the solution in the moment.\n\nAs above mentioned, Medusa can clean ME for you, w\/o even removing the SPI chip."
    },
    {
        "post_id":52613,
        "thread_id":52389,
        "title":"MacBook SSD not recognized after board swap!",
        "user_id":5210,
        "username":"KC Micro Tronix",
        "post_date":"2019-09-25 21:04:34",
        "message":"I don't have a Medusa. I have a bios programmer with J-Tag adapters and ME utilities. I change SN daily but with a utility called LBE.\nI am not sure I need a Medusa but am always interested in new devices and how they will help me. My current equipment does not require removal of the chip or power on the board. I am watching videos on Medusa 2 and it looks pretty simple to use."
    },
    {
        "post_id":52618,
        "thread_id":52389,
        "title":"MacBook SSD not recognized after board swap!",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-09-26 01:24:57",
        "message":"LBE just swap ME region with stock one, doesn't configure it for a particular board.\nAlso LBE doesn't fix checksum after SN is changed, be aware of that."
    },
    {
        "post_id":52653,
        "thread_id":52389,
        "title":"MacBook SSD not recognized after board swap!",
        "user_id":5210,
        "username":"KC Micro Tronix",
        "post_date":"2019-09-26 18:51:26",
        "message":"I was not aware of that.\nPerhaps I should switch.\n\nI have only been in this industry about 6 months."
    }
]