{"post_id":28115,"thread_id":28115,"title":"[SOLVED]A1466 emc 2559 - dong loop after failed external drive boot","user_id":906,"username":"Joesipaq","post_date":"2017-11-16 06:28:24","message":"Hello all. Received a working MBA the other day, along with a new MB to do a data transfer too.\nTransfer went fine using migration assistant.\nLast night I left the MBA on doing a time machine back before wiping it and installing high Sierra.\nBooted fine this morning, stuck in my live thumb drive that has high Sierra to install.\nBooted to efi partition - hung on Apple bar screen at about 90%\nPulled thumbdrive and powered off the machine. Switched USB ports, option - per and once the apple dong stops - it dongs again and again.. Indefinitely.\n\nSMC reset and pram reset didn't do anything to help.\nPulled ssd, wifi\/bt, battery. Still same symptoms.\n​​​​\nAny suggestions on where to go from here?\n\nOnly previous work history reported from user was due to 100% full ssd. Had the apple store clear it up for her. I do see some fingerprints on odd places internationally though. Going to pull the motherboard and check for any heat damage\/probably bios area first.\n\nIll keep you guys posted and give you the motherboard number once I get the board out. (820-3209-a)\n\nUpdate: fan spins fine. Isl sense resistors are ok, no water damage anywhere. Bios resistors are reading what I would expect. Going to bust out the microscope and bv\/schem to start checking voltages, but not sure what to look for in this case."}
{"post_id":28120,"thread_id":28115,"title":"[SOLVED]A1466 emc 2559 - dong loop after failed external drive boot","user_id":906,"username":"Joesipaq","post_date":"2017-11-16 08:04:45","message":"Ok. All apart, on my bench, one speaker hooked up. After going over the whole board, looks perfect. A few to look like they got some heat around the R5127 area.\nOddly, Q7801 looks like it's on upside down... Ground pad is on top (see pic) not the problem as it's been like that - but my 3 doaner boards have a normal looking FET. Out of curiosity, kina looks like trace Flux on the board? Would this be typical of a refurbished board?\n\nDecided I'd try a boot, seems to be working fine... Wtf. Going to test in housing. I didn't unplug the Webcam in my first tests. [ATTACH type=\"full\" width=\"30%\"]28121._xfImport[\/ATTACH]"}
{"post_id":28122,"thread_id":28115,"title":"[SOLVED]A1466 emc 2559 - dong loop after failed external drive boot","user_id":906,"username":"Joesipaq","post_date":"2017-11-16 09:04:54","message":"Update #3\nPut back into housing - Chime loops again. Started testing with lest and less attached. Screen seems to be causing the issue? LVDS Cable has a 0 written on the bottom of it with a silver marker. Looks like the screen or cable is a replacement. Did I just have a clients screen crap out on me? On to measurements for the LVDS connector."}
{"post_id":28123,"thread_id":28115,"title":"[SOLVED]A1466 emc 2559 - dong loop after failed external drive boot","user_id":906,"username":"Joesipaq","post_date":"2017-11-16 09:39:08","message":"Upddate #4\nI don't have a spare screen on hand to just try swapping it out. So here are some measurements around the LVDS conn. All are in diode mode with the screen connected unless otherwise noted.\nR5250 p1@ 0.309 p2@ 0.72wo\/screen 0.496w\/screen\nR5251 p1@ 0.309 p2@ 0.723wo\/screen 0.492w\/screen\n\nR9060 1@.47 2@.47\nR9070 90kohm 1@.465 2@ol\nR9017-18 1mohm tested ok\nR9080 1@.621\nR9050 1@.469"}
{"post_id":28136,"thread_id":28115,"title":"[SOLVED]A1466 emc 2559 - dong loop after failed external drive boot","user_id":2,"username":"dukefawks","post_date":"2017-11-16 17:57:33","message":"Repeating chime is usually a RAM issue. I bet this is a 2011 board, they are infamous. Don't even bother to try and fix it.\n\nSeems unlikely it is the LCD but it is of course possible. Try a known good assembly."}
{"post_id":28148,"thread_id":28115,"title":"[SOLVED]A1466 emc 2559 - dong loop after failed external drive boot","user_id":906,"username":"Joesipaq","post_date":"2017-11-16 21:16:58","message":"I sure hope it's not a goner... Here is the sn.C02D2QCLDRVC. Because it was introed in 2011, would that essentially make it have a 2011bd instead of a 2012?\nI'm not someone that wants to play the ram game :( on a personal level, how would you recommend I talk to my client about it.. She brought me a working unit that died with normal use for me. Or am I going to be out a few hundred to get her a replacement?"}
{"post_id":28160,"thread_id":28115,"title":"[SOLVED]A1466 emc 2559 - dong loop after failed external drive boot","user_id":2,"username":"dukefawks","post_date":"2017-11-17 13:45:59","message":"It's a 2012 board, those are less common than the 2011 with RAM issues. If you disconnect LCD it does not echo? External LCD working?"}
{"post_id":28893,"thread_id":28115,"title":"[SOLVED]A1466 emc 2559 - dong loop after failed external drive boot","user_id":906,"username":"Joesipaq","post_date":"2017-12-05 12:24:54","message":"Woah! Missed this update... Dang. So, with LCD disconnected it does not echo - and I don't have one of those fancy dongles yet for testing an external monitor. I did order a parts computer with a cracked but working display and a \"good\" motherboard based on the theory of the ram dying - Guess I should invest in an adapter for a display eh?\nWill the generic ones work, like the amazon basics versions to hdmi and to vga?"}
{"post_id":28911,"thread_id":28115,"title":"[SOLVED]A1466 emc 2559 - dong loop after failed external drive boot","user_id":2,"username":"dukefawks","post_date":"2017-12-05 19:47:00","message":"No idea if they work. I just got the original ones so I know 100% sure it works. I'm not going cheap on that and cause frustration with Chinese garbage."}
{"post_id":28945,"thread_id":28115,"title":"[SOLVED]A1466 emc 2559 - dong loop after failed external drive boot","user_id":906,"username":"Joesipaq","post_date":"2017-12-06 13:56:29","message":"Ok... What the fack.... So, today i got my replacement mobo\/test machine. Poped the old mobo in to the working houseing - same problem - so not the screen. Pop the replacement mobo into the old computer, works perfectly\n\nInstall SSD, all is good. Boots and all. No obvious issues.\n\nClient wants unit cleaned and installed to high sierra. No problem, right?\n\nFormat SSD, go to install High Sierra from my thumbdrive (using UniBeast) - Says there is an error - Boot while holding D says the 4hdd\/11\/40000whatever. Run First aid - its ok. Try to reinstall from scratch again same issue.\n\nPause here for dumb question hindsight - Is there a difference between the versions of sierria I would download from the app store depending on if it was from a macbook, macbook pro or macbook air? These sierra and high i have were downloaded from the app store on my macbook (old af edition)\n\nPlug Sierra install usb in to usb on charging board, (same as before) Try installing, all seems to go great, get to the point where it says to restart to complete install (didnt get this far originally). Do so - System hangs at white screen for like 25 min... no apple logo or nothing... Rebooted.... Same - pulled ssd, same. No chime this time, no response, Dead fkin motherboard again... WTF? Pram and smc reset dont do anything at all. No charger change, and no reboot for pram.\n\nIs this something that is messing up the SMC while trying to write or such to it with the update? Not sure if that even takes place... What do you think duke? or anyone else?\n\nThanks!"}
{"post_id":28949,"thread_id":28115,"title":"[SOLVED]A1466 emc 2559 - dong loop after failed external drive boot","user_id":906,"username":"Joesipaq","post_date":"2017-12-06 14:46:14","message":"Quick update -\nSMC reset with no battery - light goes from amber to green, then the moment amber again, the screen turns on and just hangs still.\n\nIf, while the screen is on - cmd, opt, shift, power - like an smc reset but the system is on - The screen instantly turns off - amber light goes green, the repeat.\n\nMy gut is saying that somehow, during the update the SMC is getting wiped and not written to or something with the smc... or bios? Looks like I have 820-3209 doaners with smc and bios..."}
{"post_id":28951,"thread_id":28115,"title":"[SOLVED]A1466 emc 2559 - dong loop after failed external drive boot","user_id":906,"username":"Joesipaq","post_date":"2017-12-06 15:36:01","message":"Brain juices flowing - 4hdd\/11\/4 error with high sierra... I don't know how the updates work. I am going to take an educated guess and say that during the update process, the SMC is updated too with new code? So, SSD problem could potentially cause a failure to write valid\/new info to the SMC? Shooting in the dark here. This will be a good lesson learned though. I'm pretty sure I will need to replace the SMC to get this to boot again, but the root cause, is the SSD?"}
{"post_id":28953,"thread_id":28115,"title":"[SOLVED]A1466 emc 2559 - dong loop after failed external drive boot","user_id":2,"username":"dukefawks","post_date":"2017-12-06 15:57:00","message":"This is just bad RAM or cracked solder\/trace. Time waster board...."}
{"post_id":28954,"thread_id":28115,"title":"[SOLVED]A1466 emc 2559 - dong loop after failed external drive boot","user_id":906,"username":"Joesipaq","post_date":"2017-12-06 16:00:25","message":"this is 2 different boards now though... Both all of a sudden came down with bad ram or a randomly cracked trace?\n\nI mean, I just bough this board and received it today working. Sure, it wasn't new - but that's the original working board and now this replacement board both died while I was in the update process with the same SSD"}
{"post_id":28966,"thread_id":28115,"title":"[SOLVED]A1466 emc 2559 - dong loop after failed external drive boot","user_id":2,"username":"dukefawks","post_date":"2017-12-07 00:31:00","message":"Do these boot ok from a USB drive?"}
{"post_id":28977,"thread_id":28115,"title":"[SOLVED]A1466 emc 2559 - dong loop after failed external drive boot","user_id":906,"username":"Joesipaq","post_date":"2017-12-07 04:03:49","message":"They were, untill I started the updates to sierra"}
{"post_id":28998,"thread_id":28115,"title":"[SOLVED]A1466 emc 2559 - dong loop after failed external drive boot","user_id":2,"username":"dukefawks","post_date":"2017-12-07 09:08:15","message":"Did you take out the SSD and tried to boot a known good OSX from USB?"}
{"post_id":29007,"thread_id":28115,"title":"[SOLVED]A1466 emc 2559 - dong loop after failed external drive boot","user_id":906,"username":"Joesipaq","post_date":"2017-12-07 10:42:23","message":"I did, but as I mentioned, now both boards hang before the apple logo - With or without SSD or other boot media\nIll clifnote till now\n\nOriginal working board - Was working perfect for 3 years, no prior repairs or problems. Basic data transfer and reinstall job. Tried to load from sierra installer usb - Hung - gave chime echo no apple logo. All work was done in a warm environment- maybe failed ram due to heat?... ok\n\nReplacement working board purchased, all done in nice air-conditioning- Booted ok from original ssd, passed basic diagnostics (d key) High sierra thumbdrive installer failed with \"something wrong with system press D while booting\" thing, Did that, Gave HDD generic error - Ran first aid from recovery - said it was ok. Tried again, with High sierra, same error. ---- Tried installing sierra, went perfectly. Got to \"reboot now to finish\" Rebooted, hung at white screen. Waited 25min, rebooted and same thing. PRAM reset doesnt trigger, SMC reset doesnt resolve.\n\nOdd thing with new replacement board, when it is on and hung in the white screen w\/o battery installed, pressing smc reset keys and tapping power button initiates smc reset. Never seen that before.\n\nCould a bad ssd cause a corruption to the smc update sequence durring osx install?\n\nThat is where my mind is now."}
{"post_id":29024,"thread_id":28115,"title":"[SOLVED]A1466 emc 2559 - dong loop after failed external drive boot","user_id":2,"username":"dukefawks","post_date":"2017-12-07 20:29:02","message":"I would more suspect a corrupted ROM than SMC. Try a known good dump and then fix the ME region. Keep the original!!\nI dunno what you mean by SMC reset keys, but you need to press shitt+ctrl+alt+power to reset SMC, but without battery and disconnecting power is of course exactly the same.."}
{"post_id":29030,"thread_id":28115,"title":"[SOLVED]A1466 emc 2559 - dong loop after failed external drive boot","user_id":906,"username":"Joesipaq","post_date":"2017-12-07 21:39:08","message":"I can't ever remember the key names, just the patern. SMC reset keys meaning that exactly, shift+Ctrl+alt then touch power - while screen is on - and the SMC reset initiates. That I found odd.\nHolidays here till Monday, will pull the BIOS and take a read, should I trust my doaner board\/s for a good read?"}
{"post_id":29031,"thread_id":28115,"title":"[SOLVED]A1466 emc 2559 - dong loop after failed external drive boot","user_id":2,"username":"dukefawks","post_date":"2017-12-07 22:13:43","message":"Donor boards are sometimes cleared, just swap the chip with a donor board and see what happens."}
{"post_id":29155,"thread_id":28115,"title":"[SOLVED]A1466 emc 2559 - dong loop after failed external drive boot","user_id":906,"username":"Joesipaq","post_date":"2017-12-11 11:09:26","message":"Switched with a doaner ROM, Booted to folder with ?. Great start. SSD in disk utility said it was an APFS Container.\nI am now getting an error with High Sierra that the application is damage and cant be used to install macOS. That is odd... I have. the originally installers for Sierra and High Sierra on my shop macbook that I used to make the install thumbdrives. I guess they could be bad\/made wrong? Or, back to the SSD possibly being flakey?\n\nInstalling Sierra (not high) cause it seems to be going fine again. Will report back if BIOS corrupts again"}
{"post_id":29163,"thread_id":28115,"title":"[SOLVED]A1466 emc 2559 - dong loop after failed external drive boot","user_id":2,"username":"dukefawks","post_date":"2017-12-11 13:13:46","message":"You should install 10.11 first and let it flash the EFI, then update to newest OSX. Also you cannot just leave the donor chip there as now your ME region is messed up. Upload your original BIOS and the donor one if you do not know how to transfer the ME region."}
{"post_id":29174,"thread_id":28115,"title":"[SOLVED]A1466 emc 2559 - dong loop after failed external drive boot","user_id":906,"username":"Joesipaq","post_date":"2017-12-11 15:33:54","message":"OK, confirmed that both boards had corrupted ROM. Ideas as to why? Both happened during clean installs to sierra.\nSierra (same pen drive and installer from before) Installed and worked fine after.\nTried to go from sierra to High Sierra, said there was a problem and couldn't install at the end (sdd related?)\n\nAfter trying to install Sierra again, bios went corrupt, and I have been fighting with it. Tried a different bios chip from a doaner but same issues. - This is all on the original board."}
{"post_id":29175,"thread_id":28115,"title":"[SOLVED]A1466 emc 2559 - dong loop after failed external drive boot","user_id":906,"username":"Joesipaq","post_date":"2017-12-11 15:39:09","message":"[QUOTE=\"dukefawks, post: 29163\"]You should install 10.11 first and let it flash the EFI, then update to newest OSX. Also you cannot just leave the donor chip there as now your ME region is messed up. Upload your original BIOS and the donor one if you do not know how to transfer the ME region.[\/QUOTE]\n\nThanks a bunch Duke, a couple month ago I asked about that video where Luis did it, seemed pretty streight forward and worked ok for me - KRID area to 17D000 block size pasted\/written to OK bios.BIN. Yeah, shitty cliff-notes version. But that's the idea right?\n\nSo... 10.11 first, Let flash EFI, then update.\nI tried that first, copied the high sierra app to the desktop and ran it, but that is where it gave out and said there was a problem. Back to 10.11 and corrupt bios."}
{"post_id":29178,"thread_id":28115,"title":"[SOLVED]A1466 emc 2559 - dong loop after failed external drive boot","user_id":906,"username":"Joesipaq","post_date":"2017-12-11 16:30:22","message":"ok, so, with my spare board, in a spare test housing - with the same ssd and sierra install thumbdrive\nboot into installer, try to install and i get the error\nThis copy of the Install macOS Sierra application is damaged, and can't be used to install macOS.\n\nThen after rebooting the Bios is corrupt.\n\nBoth boards, same ssd, same installer. I have re-made the installer thumb drive just in case.\n\nI don't have a test\/shop SSD to try out yet :(\n\nOpinions?"}
{"post_id":29179,"thread_id":28115,"title":"[SOLVED]A1466 emc 2559 - dong loop after failed external drive boot","user_id":289,"username":"smiba","post_date":"2017-12-11 16:43:42","message":"Well I'd say your sierra installation is corrupted or even malicious, where did you get it from? I highly doubt under normal conditions it can damage the BIOS in a way it requires to be reflashed.\n\nIf you compare the bios dump before the sierra install and the (corrupted) bios dump after the sierra install. Does anything major change (outside of the ME region)?\n\nOther thing I can think about is that the SSD is simply damaging data and your boot sector or even partition map gets corrupted."}
{"post_id":29181,"thread_id":28115,"title":"[SOLVED]A1466 emc 2559 - dong loop after failed external drive boot","user_id":906,"username":"Joesipaq","post_date":"2017-12-11 17:24:54","message":"smiba,\nThanks for dropping by! Haha I see you on here a bit giving some great advice too.\n\nThe sierra installer is from the app store just before high sierra came out. Same with HS.\n\nI did have the installer work fine at the beginning of the day with sierra, and previously with other updates from earlier systems. I just had the bios go corrupt again, and will check out where the difference are. there were somthing like 60k+ between the corrupted and good (with the correct ME region) Tomorrow morning I will check that out again"}
{"post_id":29188,"thread_id":28115,"title":"[SOLVED]A1466 emc 2559 - dong loop after failed external drive boot","user_id":2,"username":"dukefawks","post_date":"2017-12-11 19:57:38","message":"The only common thing here is the SSD. You can just connect a USB drive and install on that."}
{"post_id":29285,"thread_id":28115,"title":"[SOLVED]A1466 emc 2559 - dong loop after failed external drive boot","user_id":906,"username":"Joesipaq","post_date":"2017-12-13 07:33:02","message":"Ok. Feeling stupid for not trying this before. Pulled SSD, Stuck in Sierra installer usb - Said it was damaged an could not install. Rebooted with High Sierra installer usb - hung during loading apple bar and corrupted BIOS for reboot. - So, not the ssd... Has to be the install medium now. The only thing consistent between everything tried until now.\n\nLook like I am dealing with shit usb sticks? They are sandisk cruzer blade 8gb - but purchased locally - so possibly counterfeit - Market here is crap.\n\n2 questions.\n\n1. Testing the USB sticks with CheckFlash writing pattern a few times, should be enough to know if they are good or not?\n2. Making an installer USB for sierra and High Sierra - Whats the best method and download for the actual app? (been using official mac app store for app and this menthod in terminal for the boot drive [url]https:\/\/support.apple.com\/en-us\/HT201372[\/url])\n\n- Just noticed it says 12gb min available for the pendrive - is this the cause of all my problem? Man if so, I'm feeling like an idiot.... Before I was using Unibeast and it said 8gb min, so that's where I stared and how I originally made my installer pen drives."}
{"post_id":29292,"thread_id":28115,"title":"[SOLVED]A1466 emc 2559 - dong loop after failed external drive boot","user_id":2,"username":"dukefawks","post_date":"2017-12-13 08:30:34","message":"I always used Diskmaker X. Just get another pen drive it is probably one of those fake capacity ones you have."}
{"post_id":29409,"thread_id":28115,"title":"[SOLVED]A1466 emc 2559 - dong loop after failed external drive boot","user_id":906,"username":"Joesipaq","post_date":"2017-12-15 11:29:27","message":"Thanks for the heads up on Diskmaker X. Still wouldn't install. But the program worked well for me! So... Ran some integrity w\/r tests for volume on the pen drives. They checked out as ok so that's nice.\n\nMust be the installers then... Deleted both, and redownload (took all day) but with a lan cable, not wifi. Tried installing High Sierra - first try worked like a charm. Must have been 2 corrupt install files... Odd, but lesson learned. Still need to try out Sierra to make sure it installs fine.\n\nThanks for your help with this odd problem and the input you guys gave - and lesson learned...\n\nA bad installer can corrupt your BIOS and brick your mother board. I never expected that.\n\nThis can be marked as solved! You guys rock"}
