{"post_id":28177,"thread_id":28177,"title":"820-3023 - Replaced motherboard, new motherboard can not boot from APFS filesystems","user_id":289,"username":"smiba","post_date":"2017-11-17 19:22:50","message":"Hey everyone,\n\nReplaced a 820-3023 board for a customer with one I had around, everything was alright and good until I figured out it could not boot from the internal SSD.\nIf you boot a 10.13 recovery or installation it will happily see the APFS container and you're able to unlock it and browse around, but the EFI can not use it.\n\nI assume somewhere through the update from 10.12 to 10.13 apple updated the BIOS\/Boot ROM to support APFS. This motherboard has definitely been without owner for over a couple of months so there is no way its aware of APFS.\nI already tried reinstalling 10.13 from recovery on a USB in the hope this would also apply the update, but after finishing the installation and rebooting I was greeted with the system just booting from the USB again as it could not see and use its just freshly installed OS X on a APFS partition.\n\nWhat is the reason for this and what is the quickest way to teach the new motherboard on how to use APFS?"}
{"post_id":28183,"thread_id":28177,"title":"820-3023 - Replaced motherboard, new motherboard can not boot from APFS filesystems","user_id":2,"username":"dukefawks","post_date":"2017-11-18 11:24:02","message":"Installing 10.13 from USB like that is kind of a hack. I would assume that installing 10.12 and then updating to 13 will fix the issue."}
{"post_id":28200,"thread_id":28177,"title":"820-3023 - Replaced motherboard, new motherboard can not boot from APFS filesystems","user_id":289,"username":"smiba","post_date":"2017-11-18 17:15:39","message":"Alright, I was just wondering if there was a quicker way.\n\nThe worst about this is that Internet Recovery installs OS X 10.7 by default, which can not upgrade to High Serria. (App stores says it requires 10.8 or higher to download). So I have to log in to my own iTunes account where I have a old installation on my purchases page of something like Yosemite to install that first.\nIf I knew this I would just have downloaded a OS X 10.9 ISO right away :\\"}
{"post_id":28209,"thread_id":28177,"title":"820-3023 - Replaced motherboard, new motherboard can not boot from APFS filesystems","user_id":289,"username":"smiba","post_date":"2017-11-18 20:26:29","message":"Anyways installing 10.9 from a ISO and then updating to 10.13 caused the boot rom to get updated as well, its accepting the customer's SSD now.\n\nResolved, thanks!"}
