{"post_id":50869,"thread_id":50869,"title":"GPU rework","user_id":5210,"username":"KC Micro Tronix","post_date":"2019-07-20 08:41:13","message":"I am planning on doing GPU rework. I have a customer that wants me to start this service and can supply me with about 5-10 machines \/ week that need this done.\nWhat is a good source for GPU chips that are actually good! I have read some on the forums about intermittent supplies and counterfeit GPUs. I am new to this process and just got my rework machine.\n\nI am also interested in changing the CPUs on some boards. Curious of anyone out there is doing this?  I had a friend tell me that warping is a big issue."}
{"post_id":50874,"thread_id":50869,"title":"GPU rework","user_id":1153,"username":"JohnB8812","post_date":"2019-07-20 10:49:43","message":"CPU pretty much not doable. GPU which model? If 2011, forget it not going to find good chips. If other models, I?m sure they exist as long as they aren?t old machines. Duke used to say best thing to do was practice on old Windows laptops to begin with"}
{"post_id":50875,"thread_id":50869,"title":"GPU rework","user_id":5210,"username":"KC Micro Tronix","post_date":"2019-07-20 11:12:56","message":"I was reading that they are hopeful that a new supply of chips would be around in a few weeks."}
{"post_id":50971,"thread_id":50869,"title":"GPU rework","user_id":5210,"username":"KC Micro Tronix","post_date":"2019-07-23 21:41:49","message":"OK> I took the plunge. Got my first BGA rework station. I know I am in for abuse going down this road but I have a Metcal APR-5000-DZ on the way and it only cost me $1000.00. It did not come with nozzles or thermal couples and the nozzles I need. The machine is still supported and they will make me a custom nozzle or sell me one off the shelf. I am currently purchasing the thermal couples and the nozzles for the 2011 MacBook GPU. I have located a source for the chips. I have test boards. I am ready to abuse myself.\n\nI wish I got to the party a few years ago but better late then never. My customer can provide me with 10 GPU repairs a month so I figured it was worth it to buy the machine. I know I will use it fore more than just 2011 MacBooks. I like that is a American company and has support and I can order nozzles for it. Chinese machines scare me.\n\nI am also going to order a custom nozzle for the CPU and see if I can get those figured out as well. I have so many boards that need a new CPU I hate to give up on them.\n\nI feel fortunate to get into this segment for such a low cost.  The Metcal APR-5000 looks like a solid machine that will do exactly what I need.  I have had to pass on so much work not being able to do these chips."}
