[
    {
        "post_id":29948,
        "thread_id":29948,
        "title":"820-3115 not charging",
        "user_id":1190,
        "username":"Gmorb",
        "post_date":"2017-12-28 19:13:55",
        "message":"Macbook runs off of battery but only when battery is connected the green light turns off but computer functions as normal.\n\ni get a voltage drop of .779 on pin 1 and .782 on pin 2 of d6950 a good board shows i should be getting 1.246 on both those pins. I cannot find the issue.\n\nupdate: after further fidling with the issue i found that the area around u7000 and u9410 was getting really hot. As i was touching the area i made contact with u7000 and u9410 the board shut off and will no longer give me a green light. I then connected my power supply to find a short and the the area in between l7030, q7035 and q7080 were smoking up a lot i noticed q7035 was heating up the most so removed it. After my power supply would show its normal voltage and power up the board as well show a green light while charger is connected. Problem is i cannot get it to start without the power supply throwing 18 volts at the dcin fuse. Board will not power on with charger alone.. any tips?\n\nupdate 2: board poweres on normal after unsoldering my power supply cables lol but im back where i started no charge. I removed the components which i could see emmit smoke l7030,q7035 and q7080 and i got a small voltage drop increase on d6950 pins 1 and 2 from 779\/782 to 795. Any tips??"
    },
    {
        "post_id":29962,
        "thread_id":29948,
        "title":"820-3115 not charging",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-12-29 11:37:45",
        "message":"Replace U7000, Q7030\/35, Q7080. Check resistance between pins 17\/18 27\/28 of U7000. Check R7005."
    },
    {
        "post_id":29968,
        "thread_id":29948,
        "title":"820-3115 not charging",
        "user_id":1190,
        "username":"Gmorb",
        "post_date":"2017-12-29 12:52:33",
        "message":"I get 3.4 ohms between 17\/18 and 20.5 ohms between 27\/28 ive replaced the mentioned chips above and chcked and get 41.24 ohms on r7005"
    },
    {
        "post_id":29969,
        "thread_id":29948,
        "title":"820-3115 not charging",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-12-29 13:10:42",
        "message":"And what should R7005 be?"
    },
    {
        "post_id":29971,
        "thread_id":29948,
        "title":"820-3115 not charging",
        "user_id":1190,
        "username":"Gmorb",
        "post_date":"2017-12-29 13:17:51",
        "message":"Schematic says 20 ohms but on a known good it shows 60ohms i replaced it and now i get 60 ohms on r7005 but issue persists"
    },
    {
        "post_id":30015,
        "thread_id":29948,
        "title":"820-3115 not charging",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-01-01 20:50:02",
        "message":"A known good board and a known good multimeter will show 20 Ohm. Check again, a dead U7000 will kill R7005."
    }
]