{"post_id":35689,"thread_id":35689,"title":"820-00165 no power","user_id":386,"username":"wirelessplanet","post_date":"2018-06-11 18:09:12","message":"slight water damage on u7200. replaced it and ran a trace from pin 20 to pin 3 of u7310. (corroded pad)\n\nI get orange light.\nppbus is short to ground (.3ohms) and gets no voltage on pin 1 on d7005"}
{"post_id":35693,"thread_id":35689,"title":"820-00165 no power","user_id":386,"username":"wirelessplanet","post_date":"2018-06-11 19:21:25","message":"okay replaced f7140 and now i have .367v. \nd7005 is now at 5ohms"}
{"post_id":35713,"thread_id":35689,"title":"820-00165 no power","user_id":2,"username":"dukefawks","post_date":"2018-06-11 21:35:22","message":"PPBUS is short.....should that not the first thing to be fixed? That is probably what killed F7140 is the first place."}
{"post_id":35737,"thread_id":35689,"title":"820-00165 no power","user_id":386,"username":"wirelessplanet","post_date":"2018-06-12 12:29:50","message":"yes I know need to find the short, but couldn't find it.  put 8v 2amp on pin 2 of f7140.  nothing gets hot.  even tried cold spray."}
{"post_id":35738,"thread_id":35689,"title":"820-00165 no power","user_id":1153,"username":"JohnB8812","post_date":"2018-06-12 14:45:26","message":"Remove F7140 and check resistance on pins 1 and 2 of the fuse. If you’re confident the short is on pin 2, something must absolutely be getting hot at 8 volts unless the short is inside the board."}
{"post_id":35740,"thread_id":35689,"title":"820-00165 no power","user_id":386,"username":"wirelessplanet","post_date":"2018-06-12 17:21:03","message":"without the fuse pin 1 on f7140 gets 8v. pin 2 gets 0\n\nwith a new fuse pin 1 gets .44 pin 2 .386\n\ni'm so confused.\n\nive tested with and without the fuse. spay and alcohol test. nothing heats up. i mean there arn't that many components on ppbus. i even removed all the caps and replaced them.  pin 2 is short to ground with .2ohms"}
{"post_id":35741,"thread_id":35689,"title":"820-00165 no power","user_id":1153,"username":"JohnB8812","post_date":"2018-06-12 17:30:40","message":"Remove the fuse again because putting new fuses on with a shorted component is just going to keep killing your fuses.....This would indicate that your creation side of PPBUS is fine and the system side is shorted. Remember there is a lot on the system side such as PPBUS_S5_HS_COMPUTING_ISNS and all the derivates of PPBUS. It could be any of the big caps, little caps, backlight fuse area, thunderbolt, etc. The one thing you don't want to be shorting it to ground is Q7310 because if it's shorted, then RIP."}
{"post_id":35758,"thread_id":35689,"title":"820-00165 no power","user_id":2,"username":"dukefawks","post_date":"2018-06-12 19:34:47","message":"Inject voltage on pin 2 of the fuse or it will just blow the fuse. Crank up the voltage until you have 2-4 Amp current draw and then something must heat up. It could be the CPU so remove the heat sink and check that too."}
{"post_id":35777,"thread_id":35689,"title":"820-00165 no power","user_id":386,"username":"wirelessplanet","post_date":"2018-06-13 11:51:37","message":"is it okay to go past 8v?  thats what i was putting.  i have already taken off the fuse, should i put it back on?"}
{"post_id":35778,"thread_id":35689,"title":"820-00165 no power","user_id":1153,"username":"JohnB8812","post_date":"2018-06-13 12:25:59","message":"8.6 volts is max. The reason you start low is to avoid sparking the CPU if it's dead. Don't put the fuse on until you find the short. Check all of the big caps for holes in the sides of them or any smoking."}
