[
    {
        "post_id":100017,
        "thread_id":63986,
        "title":"2018 13\" MBP, to touchpad\/keyboard when powered on. 820-00850",
        "user_id":331,
        "username":"daxxone",
        "post_date":"2023-06-17 10:52:59",
        "message":"Shift+Ctrl+Opton SMC reset works. Can't boot recover, no KB BL coming on. System was bent slightly, Replaced palmrest and screen. Same issue with replacement touchpad and keyboard. So I checked LB700, no power, looked at QB701, 11.8v on pin 8 with battery connected. Does this mean UB700 isn't turning it on? What should I look at to verify the source of my issues?"
    },
    {
        "post_id":100022,
        "thread_id":63986,
        "title":"2018 13\" MBP, to touchpad\/keyboard when powered on. 820-00850",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-06-17 15:02:24",
        "message":"I'm not sure about the tile.\nKB\/TP work in macOS, but no before?\n\nL3500 and LB700 only gets power when USB-C device is detected on corresponding port.\nNot related with TP\/KB..."
    },
    {
        "post_id":100023,
        "thread_id":63986,
        "title":"2018 13\" MBP, to touchpad\/keyboard when powered on. 820-00850",
        "user_id":331,
        "username":"daxxone",
        "post_date":"2023-06-17 15:43:05",
        "message":"KB\/TP don't work in the OS, and don't show as connected. SMC reset works.\n\nI need to turn my subscription back on to edit my typos... Thought it would prompt me to subscribe when I went to make a post. Rules must have changed here or my account is bugged."
    },
    {
        "post_id":100024,
        "thread_id":63986,
        "title":"2018 13\" MBP, to touchpad\/keyboard when powered on. 820-00850",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-06-17 15:52:06",
        "message":"Writing a post requires paid subscription.\nThe forum is still free to read.\n\nKeyboard has embedded electronics, where the matrix is encoded and information sent to trackpad, through I2C_KBD_SCL\/SDA lines.\nTrackpad sends the information to T2 via SPI bus.\nYou should try known good trackpad board\/flex.\nSMC reset is possible, because PMU_RSLOC_RST_L doesn't pass through trackpad."
    },
    {
        "post_id":100025,
        "thread_id":63986,
        "title":"2018 13\" MBP, to touchpad\/keyboard when powered on. 820-00850",
        "user_id":331,
        "username":"daxxone",
        "post_date":"2023-06-17 16:52:53",
        "message":"Thought I turn off my subscription when I moved, and just getting a work flow going again, so it's good to still have this active.\n\nI try another part and see if that works. I don't have a working model on hand, but I'll update this when I get parts in. Thanks."
    }
]