[
    {
        "post_id":35660,
        "thread_id":35660,
        "title":"820-00840-A liquid damage not turning on",
        "user_id":1630,
        "username":"o1y",
        "post_date":"2018-06-10 12:21:03",
        "message":"Hi, this is my first board repair ever. This is my personal learning project to learn microsoldering and troubleshooting boards. I don't get paid for it. I'm trying my best not to be stupid.\n\nHaving a 820-00840-A with liquid damage. Don't now the exact story behind this MacBook. The battery has corrosion on its board and was disconnected with kapton tape from the logicboard. Seems that someone worked on it already (maybe it was a Genius).\n\nThe board has some corrosion on the F4800 area and as well on Q7065 and also next to Q8030. I think that most of the board had contact with water, because I can clearly see some calcification all over the board which may come from dried water (I highlighted this in one of my uploads). I can scrape the white stuff from the contacts or clean it with PCB cleaner. Never seen something like that on Louis videos before.\n\nNot so good looking caps are C7650 and C7470 but the corresponding rails are not shorted.\n\n* PPBUS_G3H is there with 13.1V\n* P5VS4_VSW is 0V\n* PP5V_S5 is 0.15V\n* There is a short to ground on P3V3_S5. I get 0.5 Ohm resistance to ground on that rail.\n\nMy first question: what should I do next?\n\nI started the investigation on P3V3_S5. I have learned from Louis Videos that I can inject voltage to a rail to find out what is shorted. When I set my Power Supply to 1V and limit the current to 2A it only uses 0.4V. Nothing gets warm. Should I increase the current? I don't want to roast anything there. Or should I check a different rail?"
    },
    {
        "post_id":35700,
        "thread_id":35660,
        "title":"820-00840-A liquid damage not turning on",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-06-11 19:06:03",
        "message":"So at 0.2V you are already hitting 2A? You can up the voltage some more something must get hot for sure. \n\nAlso on another note, these are not really the boards to learn on. There is not much experience with these yet and they are just a pain in the ass in general to fix."
    },
    {
        "post_id":35799,
        "thread_id":35660,
        "title":"820-00840-A liquid damage not turning on",
        "user_id":1630,
        "username":"o1y",
        "post_date":"2018-06-14 06:50:10",
        "message":"Yes, it is not easy to get information about these boards. But I'm trying my luck and I think that I'm still learning something with this project :)\n\nI've increased the current to 3.2A (0.5V). Unfortunately, I do not have a thermal camera and only feel a very slow increase in heat in the area right next to the CPU. It could be also on the other side of the board underneath the CPU, but I'm not sure. I tried the alcohol trick, but as I said, it's not really something really hot (except my bench power supply). \n\nIf the CPU has a short to ground, will the entire CPU become hot, or only a part of it?"
    },
    {
        "post_id":35841,
        "thread_id":35660,
        "title":"820-00840-A liquid damage not turning on",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-06-15 11:56:39",
        "message":"Just use your lips and feel the CPU. I bet the CPU high side FET is shorted. If that is the case the board is trash."
    }
]