{"post_id":22032,"thread_id":22032,"title":"820-4924 Freezing Issue","user_id":515,"username":"SMMRepair","post_date":"2017-06-21 11:25:56","message":"Working on an 820-4924 that had liquid damage. Board had liquid near ISL6259 and near the 3v3\/5v TPS IC. Replaced ~10 burned caps\/resistors and both ICs, ran a few wires and all seemed well. Ran the board through the cleaner really well, and tested board today. Board powers on and boots\/chimes, but when it reaches the login window (or shortly after logging in), the board freezes. This was in a known-good test assembly (2 of them, in fact). I always have difficulty diagnosing issues like this one, as it's tricky to get measurements when the issue pops up. I suppose I could have an SSD installed with the board out of the case, wait ~20 seconds and then assume the issue has occurred and go from there with measurements?\n\nJust curious what would be some good things to check first. All of my main rails are present, and the board is clearly posting and getting to OS fine, but freezes immediately (without having to move the unit--so maybe it isn't a RAM issue?). All help\/direction appreciated."}
{"post_id":22033,"thread_id":22032,"title":"820-4924 Freezing Issue","user_id":515,"username":"SMMRepair","post_date":"2017-06-21 11:40:36","message":"I also want to add; the board WILL cut off every now and then at login instead of just freezing. Much more often, it freezes, but just now it did cut off completely."}
{"post_id":22039,"thread_id":22032,"title":"820-4924 Freezing Issue","user_id":1,"username":"larossmann","post_date":"2017-06-21 12:18:25","message":"90% of the time for me it's the cpu vcore mosfets. if you remove them you'll see green stuff under them. However, in every case where this has occurred in spite of replacing the cpu vcore mosfets along with the controller, it comes back months later with a dead CPU. They don't like getting spikes of 12v much, just ask the 3662\/3787s..  check that area."}
{"post_id":22041,"thread_id":22032,"title":"820-4924 Freezing Issue","user_id":515,"username":"SMMRepair","post_date":"2017-06-21 13:31:16","message":"Thanks, Louis! I'll check those; it appears the liquid was all isolated to one spot, but who knows! I'll definitely check those, though--thanks!"}
