[
    {
        "post_id":46748,
        "thread_id":46748,
        "title":"820-3435 No Charging MESS",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-02-26 18:07:27",
        "message":"I have a major major PITA one that I need help with. For sure, sees and runs off of a known good battery. Came in with \"possible previous liquid damage\" but it looks like a refurb board to me (edge bonding on CPU was heated and on some other chips as well). Originally, R7180 was knocked loose from the board so I thought hmm easy one. Put a new one on got a light then no light after a half second. Ok thought shorted Q7180. Replaced it and the ISL and got fan spin! However, it only did once then stopped. PPBUS went from 8.58 to 1.6 volts pretty much after that. Since then, I have been chasing a rabbit to figure out why it won't charge. PPBUS is not shorted to ground. Pins 17\/18 and 27\/28 of the ISL check out great. All of the traces and probe points have continuity from the ISL to the next component in line. I have so far replaced Q7180 (twice), the ISL several times, Q7130 and Q7155 at the same time as the ISL, two resistors I knocked free, and since that, not much more. CHGR ACIN and DCIN are both present. PP5v1_CHGR is present. SMC_BC_ACOK is present, SMC_RESET_L is present, the SMBUS lines are both 3.4 no issues there. CHGR A GATE and B GATE both appear to be zero. I get 16 volts on pin 1 of C7185 but 6.8 on pin 2. 0.004 volts on pin 2 of R7186. I've tried 5 ISL's from different batches and donor boards. Any ideas??? This one is a nightmare."
    },
    {
        "post_id":46750,
        "thread_id":46748,
        "title":"820-3435 No Charging MESS",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-02-26 18:20:35",
        "message":"\"I get 16 volts on pin 1 of C7185 but 6.8 on pin 2. 0.004 volts on pin 2 of R7186\"\nThat's correct.\n\nYou should have 16V at pin 2\/Q7130; confirm that.\nIf not, bad Q7180, R7120, or broken trace.\nChange C7125 and check its traces.\n\nPost CHGR_A\/BMON voltage.\nCheck all components from pins 5-7-8."
    },
    {
        "post_id":46756,
        "thread_id":46748,
        "title":"820-3435 No Charging MESS",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-02-26 18:53:07",
        "message":"Ok will do in the morning"
    },
    {
        "post_id":46794,
        "thread_id":46748,
        "title":"820-3435 No Charging MESS",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-02-27 07:36:10",
        "message":"I do have 16 volts at pin 2 of Q7130.\nReplaced C7125 both traces are fine no change.\nAMON: 0.03 volts\nBMON 0.06 volts\nall resistors for pins 5,7, and 8 have been replaced no change."
    },
    {
        "post_id":46795,
        "thread_id":46748,
        "title":"820-3435 No Charging MESS",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-02-27 07:41:33",
        "message":"\"two resistors I knocked free\"\nWhich ones?\nBe sure to put correct values.\n\nPost voltages for U7100, pins 2, 3, 12, 13, 14, 17, 19, 20, 25, 27.\nRemove F7140 and check again L7130 voltage."
    },
    {
        "post_id":46797,
        "thread_id":46748,
        "title":"820-3435 No Charging MESS",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-02-27 08:01:25",
        "message":"Solved I don't know what component was bad I windshield wipered all components near the ISL6259 and now it's working. I'm guessing either one of the resistors I replaced originally (R7113\/5) were damaged OR one of the other caps or resistors was damaged."
    }
]