{"post_id":80650,"thread_id":61769,"title":"820-00840-A no backlight","user_id":27092,"username":"mbcontrol","post_date":"2021-09-26 11:54:54","message":"This board came with water damage arround Q8400 and no backlight. Picture is present and it boots into the login-screen. The board was in terrible condition. I think it was a refurbished board from apple. the customer promised me that he bought an refurbished macbook and there was no repair. There was flux an solderballs an bad solder joints all over the board. So i made a video to safe the hints and did first an ultrasonic-cleaning. Normaly i make ultrasonic after repair, but at this board you could not see anything - i never saw something like this before.\n\nI cleaned the water damage an changed, over hours of troubleshooting, the following parts:\nU8400 (new chip), U8400 (from donor), R8450, R8451, R8452, R8453, R8432, C8412, C8413, C8414, C8475, Q8400, C8400, R8401, R8402. C8476, C8477, C5451, C5452, R8400, F8400\n\nOther hints:\nBacklight keyboard works and is dimmable with function keys.\nPRAM-Reset don't work - tried many times with int. keyboard.\nDisplay-Backlight always tested with original display in macbook and known good display from us.\nI don't see any data signals on the oszi - only the dc voltage with 5.1v.\nR8450-R8453 was good, but i changed it with new ones (you never know).\n\nHere are the measurements:\nI2C_BKLT_SCL = 5.1v (no data-signal on oszi)\nI2C_BKLT_SDA = 5.1v (no data-signal on oszi)\nISNS_LCDBKLT_P = 13.061v\nISNS_LCDBKLT_N = 13.061v\nPP5V_S0_BKLT_D = 5.109v\nLCDBKLT_FET_DRV_R = 0v\nLCDBKLT_SW = ca.115mV\nPPVIN_SW_LCDBKLT_SW = ca.240mV\nBKLT_SD = 12.879v\nBKLT_EN_R = 3.3057v\nPP5V_S0_BKLT_A = 5.1096v\nBKLT_SENSE_OUT = 0v\nLCDBKLT_FB = ca.250mV\nPPVOUT_S0_LCDBKLT = ca.282mV\nLCDBKLT_TB_XWR = ca.281mV"}
{"post_id":80651,"thread_id":61769,"title":"820-00840-A no backlight","user_id":682,"username":"2informaticos","post_date":"2021-09-26 12:56:51","message":"Check EDP_BKLT_PWM; changes pressing backlight buttons?\n\nCheck diode mode at backlight output, w\/ and w\/o LCD connected.\nJ8500 wasn't affected by liquid spill?"}
{"post_id":80654,"thread_id":61769,"title":"820-00840-A no backlight","user_id":27092,"username":"mbcontrol","post_date":"2021-09-26 14:43:53","message":"EDP_BKLT_PWM changes by pressing buttons in this range: 0.17v to 3.297v\nJ8500 wasn't affected by liquid spill.\nDiode mode PPVOUT_S0_LCDBKLT with LCD connected: 1.1646v\nDiode mode PPVOUT_S0_LCDBKLT without LCD connected: 1.1704v"}
{"post_id":80655,"thread_id":61769,"title":"820-00840-A no backlight","user_id":682,"username":"2informaticos","post_date":"2021-09-26 17:42:32","message":"So high?\nDid you check with red probe at ground?\n\nIf PWM works, then you should have activity on I2C backlight bus too.\nIf not, there is a problem with LCD assembly, video connector, or U8400.\nDid you try another small video cable with other LCD assembly?"}
{"post_id":80674,"thread_id":61769,"title":"820-00840-A no backlight","user_id":27092,"username":"mbcontrol","post_date":"2021-09-27 14:33:07","message":"Yes, red probe at ground, black probe at PPVOUT_S0_LCDBKLT (for example at C8464 Pin1)\nWhat value did you expect?\n\nI also changed now Q8401, C8460\/2\/3\/5\/6\/7\/8 and U2890 (had corrosion before ultrasonic).\nI did a reflow of J8500 and measured every pin with the continuity tester.\nWhat do you mean with \"small video cable\"? The Cable from J8500 to the display? I tested with 3-4 cables - known good ones and new ones - every one at both displays i have (original from the mb and an known good test-display.\n\nI told you i changed U8400 two times (new chip and from donor). What do you think, shall i change it one more time?\n\nIs it possible that the displays are not compatible? Or is there only one type existing for the A1708?"}
{"post_id":80675,"thread_id":61769,"title":"820-00840-A no backlight","user_id":682,"username":"2informaticos","post_date":"2021-09-27 15:18:27","message":"You may have corroded traces, or components in backlight area.\nAs I said, backlight control comes from LCD assembly, through I2C bus.\nIf you see PWM activity from PCH, then the problem is between LCD and U8400."}
