[
    {
        "post_id":3814,
        "thread_id":3814,
        "title":"[SOLVED]820-00165 all power rails present but cpu not turning on",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2016-06-20 18:40:41",
        "message":"I got this board today that was liquid damaged. The user told me they took it to 'ubreakifix' and they replaced the keyboard and cleaned the board. It looked like they didn't clean it well because I saw corrosion and red probe points around the u1950 \/ u7870 area.\nThere was a light on the charger but no fan spin. The only power rails that were missing were PP3V3_S4SW_SNS and PP1V5_S0.\nI added flux to the corroded areas and heated it up before throwing it in the crest ultrasonic.\nAfter the ultrasonic the fan spins and now PP3V3_S4SW_SNS and PP1V5_S0 are present but I get nothing on the screen.\nPPVCC_S0_CPU is showing 1.8v but yet when the machine isn't chiming nor is the cpu getting hot.\n\nI'm not sure why the cpu is not turning on if the voltage is present.\nAlso, the fan doesn't turn on and off 3 times like the '13 and 14' airs. Does that not happen with these 2015 Airs?\n\nUpdate: ALL_SYS_PWRGD and both sides of R1950 are 3.32v and the resistors around U1950 measured proper resistance. When I measure pin 7 of U1950 I get around .25v and it goes down.\nAlso, on R1962 when I plug the charger in the highest voltage I got was 0.7v and it goes down quickly from there. For some reason the fan will spin on high and I'm not sure if it is has anything to do with me probing on R1962 but the fan will just stop spinning and not come back on.\n\nNote: These measurements were done with the board separated from the Macbook."
    },
    {
        "post_id":3824,
        "thread_id":3814,
        "title":"[SOLVED]820-00165 all power rails present but cpu not turning on",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-06-21 09:20:36",
        "message":"U1950 will have a corroded pin. Pull it and inspect\/replace."
    },
    {
        "post_id":3852,
        "thread_id":3814,
        "title":"[SOLVED]820-00165 all power rails present but cpu not turning on",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2016-06-21 14:21:16",
        "message":"I removed U1950, gently scraped one of the pins and replaced it and now it works. Thanks problem solved."
    }
]