{"post_id":32910,"thread_id":32910,"title":"[SOLVED]820-2850 Only Posts With 2 GBs of RAM","user_id":868,"username":"computercaverva","post_date":"2018-03-24 02:35:53","message":"This computer had the GPU cap problem. I replaced the cap with the larger capacitor and verified that the repair was working and the GPU passed stress testing. I then put the board in the ultrasonic to clean of the leftover flux, after the cleaning process the computer only chimes and POSTs with 2 GB of RAM installed. I have tried each stick in each slot and confirmed that both sticks are still good as well as both slots, even for grins I tried using a single 4 GB stick. When there is 4 GB of RAM installed the computer power cycles constantly and the optical drive will initialize over and over along with the power cycling. There is no red light on a USB mouse when the computer is power cycling either. Any ideas?"}
{"post_id":32914,"thread_id":32910,"title":"[SOLVED]820-2850 Only Posts With 2 GBs of RAM","user_id":2,"username":"dukefawks","post_date":"2018-03-24 12:44:58","message":"What kind of cleaner are you using? Cheap ass Chinese ones will kill parts and even the PCB."}
{"post_id":32927,"thread_id":32910,"title":"[SOLVED]820-2850 Only Posts With 2 GBs of RAM","user_id":868,"username":"computercaverva","post_date":"2018-03-24 15:33:23","message":"I have a Crest 2.5 Gallon without heat. Using the 103 mL of Branson EC per gallon of distilled H20. I was low on 99.9% IPA when I did the post cleaning alcohol bath before going into the toaster to dry I am worried I didn't get all the water off the board even with 30 mins at 200 F."}
{"post_id":32934,"thread_id":32910,"title":"[SOLVED]820-2850 Only Posts With 2 GBs of RAM","user_id":2,"username":"dukefawks","post_date":"2018-03-25 16:49:02","message":"I really have no idea. All the mess you put the board through is not needed. You can just replace the cap with a normal soldering iron and avoid any such damage. Possibly there is crap in the RAM slot or the pins got stuck due to residue in the slot."}
{"post_id":32990,"thread_id":32910,"title":"[SOLVED]820-2850 Only Posts With 2 GBs of RAM","user_id":868,"username":"computercaverva","post_date":"2018-03-27 13:47:13","message":"We can mark this guy resolved! I put it through the cleaning process one more time and things are all good, probably crap that didn't get fully cleaned the first time."}
{"post_id":33007,"thread_id":32910,"title":"[SOLVED]820-2850 Only Posts With 2 GBs of RAM","user_id":2,"username":"dukefawks","post_date":"2018-03-27 17:33:35","message":"Don't clean boards that don't need cleaning. C9560 can be replaced with a simple soldering iron. No need to remove RAM or heat sink or anything. Keep it simple."}
