{"post_id":85044,"thread_id":62211,"title":"820-3787-A No Video internal or external, boots up and chimes, gpu heats up.","user_id":32178,"username":"prodigy83","post_date":"2022-01-14 16:23:54","message":"I have a 820-3787-A, my customer spilled tea on it. At first it would not power on, I cleaned up the mobo, got it to power on, the customer brought it home, used it all night, closed the lid, which I am assuming placed it to sleep or suspend, the next day, the laptop would not power on, and the magsafe light would not come back on. I removed the board, cleaned it up again, and after lots of testing, the magsafe light worked, the computer powered on, everything seemed great, but here is where my problem started. I forgot the keyboard backlight cable underneath the motherboard when installing the motherboard back in, so I unscrewed a few screws (not all), propped up the board with a nylon spudger, this did flex the board a bit, I got the keyboard backlight cable out, but when I went to turn on the mac, to test everything out, I had no video on the display, and via HDMI and Mini-dispalyport, no video at all whatsoever. The computer does chime, you can hear it boot up, I have thermal imaging and it shows the GPU, CPU, and u1100 all heating up. I already tried reflowing the U9650, but no luck. I may not be measuring things correctly so I am a bit of a novice when it comes to reading the schematics. I tried searching for any missing or broken components visually, but everything looks good visually. What should I do next? Thank you in advance. I am thinking this may have something to do with one of the S0-S5 components, but this is just an assumption because of the customer telling me she closed the lid. I also already tried a SMC and PRAM reset."}
{"post_id":85045,"thread_id":62211,"title":"820-3787-A No Video internal or external, boots up and chimes, gpu heats up.","user_id":682,"username":"2informaticos","post_date":"2022-01-14 17:08:45","message":"First of all, welcome to the forum!\n\nInspect for corroded components on the areas affected by liquid spill.\nCan be accumulated crap under CPU, GPU, or some VRAM chip.\n\nJust in case, be sure SMC_LID is steady 3V."}
{"post_id":85115,"thread_id":62211,"title":"820-3787-A No Video internal or external, boots up and chimes, gpu heats up.","user_id":32178,"username":"prodigy83","post_date":"2022-01-17 09:29:49","message":"Thank you! \nSMC_LID is a steady 3.434. \nI do not have an ultrasonic cleaner, however the corrosion\/liquid damage (I cleaned this up prior), I did find was over in two areas, R5250 and surrounding area, then U4650 and surrounding area.\nCPU, GPU, and VRAM areas all look good."}
{"post_id":85116,"thread_id":62211,"title":"820-3787-A No Video internal or external, boots up and chimes, gpu heats up.","user_id":682,"username":"2informaticos","post_date":"2022-01-17 09:45:00","message":"R5250 is right on SMC_LID signal.\nIt should have 3V on both pins, when lid is open.\nShould drop to 0V when lid is closed.\nIn case of broken trace, check BUTTON_DISABLE signal at same time."}
{"post_id":85129,"thread_id":62211,"title":"820-3787-A No Video internal or external, boots up and chimes, gpu heats up.","user_id":32178,"username":"prodigy83","post_date":"2022-01-17 13:39:23","message":"R5250 is 3.435.\nThe BUTTON_DISABLE on Q4801 is also the same 3.435."}
{"post_id":85133,"thread_id":62211,"title":"820-3787-A No Video internal or external, boots up and chimes, gpu heats up.","user_id":682,"username":"2informaticos","post_date":"2022-01-17 14:58:57","message":"SMC_LID and BUTTON_DISABLE cannot have the same voltage!\nYou have broken trace somewhere..."}
{"post_id":85142,"thread_id":62211,"title":"820-3787-A No Video internal or external, boots up and chimes, gpu heats up.","user_id":32178,"username":"prodigy83","post_date":"2022-01-17 16:03:51","message":"I did not test all contact points on Q4801, but the BUTTON_DISABLE is 0 volts, and SMC_LID is 3.43 (all from Q4301). Still have a broken trace?"}
{"post_id":85148,"thread_id":62211,"title":"820-3787-A No Video internal or external, boots up and chimes, gpu heats up.","user_id":682,"username":"2informaticos","post_date":"2022-01-17 16:52:43","message":"0V looks good; you've said 3.435V on BUTTON_DISABLE before.\nSo SMC_LID should be good all trace.\nInspect corroded area for bad resistors or crap between chip pins."}
{"post_id":85393,"thread_id":62211,"title":"820-3787-A No Video internal or external, boots up and chimes, gpu heats up.","user_id":32178,"username":"prodigy83","post_date":"2022-01-21 10:45:31","message":"I found the issue, I looked where I had stuck my spudger more in detail, and I pulled away the protective black film covering the row of large capacitors, off to the side, C9237 was the culprit. After I tested for continuity, found both sides were beeping. As I pulled the probes away, the capacitor disintegrated. So I replaced with a new capacitor, and tested on an external monitor, then tested the display, and both worked! Thank you so very much!!"}
