[
    {
        "post_id":4409,
        "thread_id":4409,
        "title":"[SOLVED]Mac 2013 SSD shows cancel logo on startup",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2016-07-10 14:44:46",
        "message":"I have a Samsung SSD (Model: MZ-JPU512T\/0A3) that I pulled from a Late '13 MBP Retina whose screen is not turning on. \nI don't have another MBP Retina to plug this into so I plugged it in this 11 inch 2015 Macbook Air and instead of showing the Apple logo it shows me a circle with a slash through it. The apple website says that means \"your Mac couldn't find a valid System Folder to start up from\". \n\nWhen I booted with OSX Recovery I was able to see the username of the SSD. \n\nIs there any way to boot up with this ssd without having to get another Retina MBP?"
    },
    {
        "post_id":4413,
        "thread_id":4409,
        "title":"[SOLVED]Mac 2013 SSD shows cancel logo on startup",
        "user_id":145,
        "username":"Sykulski",
        "post_date":"2016-07-10 15:22:01",
        "message":"Install\/upgrade newer OSX (El Capitan) on it. 2015 models cannot boot older systems. You can just install El Capitan without formatting it to preserve the data."
    },
    {
        "post_id":4432,
        "thread_id":4409,
        "title":"[SOLVED]Mac 2013 SSD shows cancel logo on startup",
        "user_id":63,
        "username":"spakhnyuk",
        "post_date":"2016-07-10 17:21:37",
        "message":"It's called a Prohibitory symbol. Happens either when there is an issue with the OS, or if you're trying to boot to anything older than OS X Yosemite 10.10 on a 2015 Mac.\n\nDo you have another drive with El Capitan 10.11 on it? Boot from an external OS, format it the SSD in Disk Utility if you don't care about the data, install a fresh copy of OS X El Capitan 10.11.\nYou can also boot into Internet Recovery on that 2015 MacBook Air, format the SSD in Disk Utility and install a fresh copy of OS X El Capitan 10.11."
    },
    {
        "post_id":4463,
        "thread_id":4409,
        "title":"[SOLVED]Mac 2013 SSD shows cancel logo on startup",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-07-10 23:06:31",
        "message":"If data is important you can start the machine in target mode and connect it to a working machine through the thunderbolt port. Or boot from USB and get save data that way."
    },
    {
        "post_id":4470,
        "thread_id":4409,
        "title":"[SOLVED]Mac 2013 SSD shows cancel logo on startup",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2016-07-11 10:48:09",
        "message":"I just installed El Capitan 10.11 onto the ssd and after it was done I was able to boot into El Capitan and the data was still there. Thanks guys."
    },
    {
        "post_id":4471,
        "thread_id":4409,
        "title":"[SOLVED]Mac 2013 SSD shows cancel logo on startup",
        "user_id":63,
        "username":"spakhnyuk",
        "post_date":"2016-07-11 10:58:21",
        "message":"That's great!"
    }
]