[
    {
        "post_id":7353,
        "thread_id":7353,
        "title":"[SOLVED]820-3437 issues turning on from charger",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2016-09-27 19:10:37",
        "message":"This board had liquid damage in the 3v42 and battery circuit area when I received it. It was not turning on at all and no light on the charger either.\nThe I\/o board is damn near spotless and the other side of the board looks to have no liquid damage anywhere including the smc and isl6259 area.\nI put flux on the damaged components and heated it up a little and then the fan spun and there was a light on the charger. I UC'd the board and I was able to install an OS on the SSD.\n\n[I]The problem is that when I plug in the battery and then plug in the charger the machine turns on automatically. Afterwards if I shut down the machine and try plugging the charger in again it will not turn on automatically and I have to hit the power button.[\/I]\nWhen the battery is removed the machine turns on automatically every time the charger is plugged in.\n\nWhen I go to the power information page I see the battery charges and runs off the battery fine and is in good condition.\n\nThe only components I have replaced are R7005\/R7006. R7006 looked burned and was measuring around 50 ohms so I replaced it along with R7005 even though it measured fine.\n\nHere are the areas I wrote down for having liquid damage before cleaning the board.\nj6100\nu7090\nr7006\nq7155 area\nc7117 area\nq7560 area"
    },
    {
        "post_id":7355,
        "thread_id":7353,
        "title":"[SOLVED]820-3437 issues turning on from charger",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2016-09-27 21:05:38",
        "message":"I'm confused. Maybe I am missing something at midnight, but if this turns on when you hit the power button and not when just plugging in the charger this is normal condition. This works man, move onto next ticket!"
    },
    {
        "post_id":7357,
        "thread_id":7353,
        "title":"[SOLVED]820-3437 issues turning on from charger",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2016-09-27 23:01:11",
        "message":"Yea you are right. I don't know why but I thought that whenever you plug the charger in it should turn on automatically. \nThis machine works fine then.  Thanks."
    }
]