[
    {
        "post_id":40930,
        "thread_id":40930,
        "title":"820-3437 Wont boot Part 2",
        "user_id":1850,
        "username":"rsiesta",
        "post_date":"2018-10-19 07:49:45",
        "message":"I have a board that was liquid damaged, stuck in boot loop. I installed a new bios chip and now it chimes and will start booting.\n\nAny attempt to load macos results in progress bar to 3\/4 then slows down greatly,\nit eventually gets to the end of the progress bar and then just stays there.\n\nAfter fighting this for days here is what I have found.\n\nhold D and running Diagnostics finds no problems other then needs new battery soon.\n\nBooting off a High Sierra recovery partition has same result freezes at 100% progress bar.\n\nExecute an internet recover runs fine, all recovery options seem to work. I select reinstall OS and it proceeds\nto downloading mountain lion and install it. This all runs fine, It completes successfully I do the final\nreboot and same thing, hangs at end of progress bar. I can now run the recovery partition, ie a ML recovery\nprogram will load\/run where as the HS would not.\n\nNext I create an Ubuntu Live disk, runs fine, I then install Ubuntu 18.04 to the internal SSD drive, works fine\nubuntu starts and runs no issues.\n\nA Hardware issues I have found. When you plug into the display port\/thunderbolt port you get no boot screen when\ntrying to start macos. Under Ubuntu it detects the port, It correctly detects the monitor size and brand, the internal\nscreen flashes like it normally does when adding another display but nothing on the external monitor.\n\nUnder Ubuntu when I plug in a thundebolt drive it does not power up and is not detected by Ubuntu. The thunderbolt\nport is detected in the hardware settings.\n\n\nSo something wrong with the thunderbolt\/display port. I am guessing this is what is causing MacOS not to boot.\n\nAny thoughts, can you change the thunderbolt chip from a donor board?"
    },
    {
        "post_id":40931,
        "thread_id":40930,
        "title":"820-3437 Wont boot Part 2",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-10-19 09:01:58",
        "message":"Flash BIOS with clean ME region..."
    },
    {
        "post_id":40932,
        "thread_id":40930,
        "title":"820-3437 Wont boot Part 2",
        "user_id":1850,
        "username":"rsiesta",
        "post_date":"2018-10-19 09:08:46",
        "message":"Done it myself, same affect, Bought a new bios with clean ME region, same result, now I can see me screwing up the flash but I would think that someone that\nsells them for a living would have it right. I know he got the serial number correct as the requested serial number show up after running the Diagnostics on the new chip.\nThis is the one I bought based on the serial number I got when I downloaded the bios from the bad chip.\n\n[URL=\"https:\/\/www.ebay.com\/itm\/EFI-BIOS-Firmware-chip-for-MacBook-Air-13-Core-i5-A1466-Mid-2013-EMC-2632-ONLY\/192471775897?ssPageName=STRK%3AMEBIDX%3AIT&_trksid=p2057872.m2749.l2649\"]https:\/\/www.ebay.com\/itm\/EFI-BIOS-Fi...72.m2749.l2649[\/URL]\n\nThe serial number also matches the bottom plate which is rare. I am game to try again but don't know another way\nto attempt it.\n\nThis is what I got from the bad bios after I downloaded it off the original chip\n\noverride-version..Base_18..kcal..US.ssn..C02MXMLEG086.hwc..G086.son..MD761LL.EOF"
    },
    {
        "post_id":40934,
        "thread_id":40930,
        "title":"820-3437 Wont boot Part 2",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-10-19 09:29:44",
        "message":"I think on the forum we have already uploaded clean dump for 3437.\nUse it as is, just for test.\nIf all OK, then you can change serial.\nIf try to change it yoursels and is not dome properly, you cannot discard BIOS issue.\nSTOP to buy dumps from eBay; 90% are not clean at all.\n\nYour symptom points to ME region issue..."
    }
]