[
    {
        "post_id":61061,
        "thread_id":59506,
        "title":"820-2850-A Charging slowly",
        "user_id":26658,
        "username":"OliverHolmgren",
        "post_date":"2020-06-16 17:25:07",
        "message":"Hey, Firstly, thanks very much for what you guys do! Its a huge contribution to changing the culture of throw-away.\n\n2010 15 MBP 2.66 i7 (820-2850-A board)\n\nCurrent state is fully operational but charging is slow 240-500 ma according to system Information.\nMachine has a new DC In board and new SMP battery. Have tried different power supplies.\nCHGR_DCIN is 16.5v\n\nPerviously customer brought machine to me with issue of dull green light on magsafe, would not charge but would stop battery drain. Battery was swollen and magsafe looked poor. \n\nWondering if I have some component of the charging system failing but not yet failed and am look for suggestions on what to check.\n\nThanks again."
    },
    {
        "post_id":61077,
        "thread_id":59506,
        "title":"820-2850-A Charging slowly",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-06-17 04:03:13",
        "message":"First of all, welcome to the forum!\n\nDo you have original Magsafe 85W charger?\nTry other known good battery too; even old, just for test..."
    },
    {
        "post_id":65844,
        "thread_id":59506,
        "title":"820-2850-A Charging slowly",
        "user_id":26658,
        "username":"OliverHolmgren",
        "post_date":"2020-09-30 04:46:21",
        "message":"Thanks for the help. I wanted to report back and let you know that I ended up having an issue with a faulty new battery. The laptop is now working properly. The issue was harder to solve partly I think because I also had a bad (new) dc in board. I think I might have had a bad batch actually. Cheap Chinese is the only source I have.\n\nI stayed subscribed for three months. I've cancelled now but I will come back if and resubscribe when I need further help.\n\nI want to thank you for your work.\nCheers,\nOliver Holmgren\nFirefly Apple Support"
    },
    {
        "post_id":65846,
        "thread_id":59506,
        "title":"820-2850-A Charging slowly",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-09-30 05:37:57",
        "message":"You're welcome, glad to see you found help on the forum."
    }
]