{"post_id":85332,"thread_id":62238,"title":"MBP 16in 820-01700 - Powers, fans, backlight flashes instantly, then powers off.","user_id":34271,"username":"crumblenaut","post_date":"2022-01-20 13:56:15","message":"Hey folks!  I'm a long time member of the Discord but this is my first post here on the forums.  Super happy to be a paying subscriber and to have this as a resource.  Thank you for being here!  :D\n\nI have a 16in 820-01700 board that had damage to the SSD area on the right wing (when inverted, so the wing with the J5110 touchbar display connector) and after a LOT of work I've got it through a successful DFU revive and it is now powering up all the way to a S0 state... for a split second before hard powering off.\n\nStarting with the system fully assembled with the battery tab and flex disconnected and no external power, and then plugging in power, the sequence of events is:\n\n- 5V -> 20V\n- 20V \/ ~0.30A\n- Solid fan spin for a few seconds, although I'm just realizing this model runs fans off of PP5V_G3S so it's NOT necessarily S0 at that state\n- 20V \/ ~2.1\n- Backlight flashes on for a split second, and THAT indicates that it reaches S0 for SOME amount of time...\n- Hard power down to 20V \/ ~0.04A.  In this state PPBUS remains stable at 12.6V.\n\nA SMC reset following the hard power down works, and is essentially the same in effect as pulling the power cord out and plugging it back in.\n\nThe SSD current sensing area U5620\/R5620 was hit pretty hard and I needed to rebuild the traces, so I'm concerned that those paths being slightly different could be a problem.  Continuity is good but since I'm grasping at straws here I'm wondering if having ANY difference in a current sense path might register a problem?\n\nAlso, much earlier I had a partial short to ground on PPBUS at 60-80ohms that I was able to determine was due to a via under pad 1 of C9573 - which connects to PPBUS_G3H_SSD0_SNS - shorting against a ground plane.  I was able to dig that out to resolve the partial short, and to provide the 10uF of buffer capacity C9573 provided, I have two 10uF 0603 caps fitted on C9574's pads in parallel. I can't imagine that's a problem... but I figure it's worth mentioning.\n\nMy hope, though, is that since DFU mode works and the revive didn't spit out errors while \"installing system\" then the SSDs and SSD controllers are functional.\n\nData recovery is the first goal here with a full repair being secondary but obviously very much what we're going for.\n\nAny insights anyone could offer would be very much appreciated.  :D  I suppose my primary question is \"What could occur in the known boot order immediately after backlight illumination that could cause the system to crash down out of a S0 state as I've described?\" and then any suggestions as to how to address whatever's occurring would be very much appreciated.\n\nThank you so much!"}
{"post_id":85343,"thread_id":62238,"title":"MBP 16in 820-01700 - Powers, fans, backlight flashes instantly, then powers off.","user_id":682,"username":"2informaticos","post_date":"2022-01-20 17:52:00","message":"First of all, welcome to the forum!\n\nSee if machine still goes off starting in SMC bypass mode.\nProbably more traces, or resistors damaged by corrosion."}
