[
    {
        "post_id":59788,
        "thread_id":59363,
        "title":"820-00239 20v 0.06A",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-05-18 20:52:14",
        "message":"Hello. I have a 820-00239 that originally had 5v only but I replaced U3200 and that restored 20v and the board booted fully. I had only the board sitting on my bench connected to a test screen and charger and I saw it make it to the login screen. I then put it back in the case and tried to turn it on again and now it was stuck at 20v 0.25A with both fans on high and no image on the screen. When I took the board out of the case again, it would only go to 20V 0.06A now with nothing else connected. The board seems to have all S0 voltages except for PP3V3_S0, which is 0.63v. It is not short to ground and I cannot seem to figure out where that 0.6v is coming from. I checked U8205 and PP3V3_S5 and PM_SLP_S3_L are 3.3v. I removed U8205 but PP3V3_S0 is still 0.63v with it removed from the board. Not sure what to check next."
    },
    {
        "post_id":59800,
        "thread_id":59363,
        "title":"820-00239 20v 0.06A",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-05-19 02:58:03",
        "message":"Change U8205.\nBe sure C8206 is good."
    },
    {
        "post_id":59842,
        "thread_id":59363,
        "title":"820-00239 20v 0.06A",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-05-19 12:50:10",
        "message":"Yea I changed U8205 and the board is booting now. I tried to boot from my USB test OS, but it load about halfway and then it shows the prohibitory symbol. I tried all 4 USB ports and it does the same thing and it also does the same thing using a USB stick with the Catalina installer on it. Both of these USB devices work fine on other macbooks so I know its not the drives. Is there some setting that would prevent booting from USB on this model?"
    },
    {
        "post_id":59843,
        "thread_id":59363,
        "title":"820-00239 20v 0.06A",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-05-19 13:43:10",
        "message":"Something related with security settings..."
    }
]