{"post_id":50770,"thread_id":50770,"title":"820-3662 Issues getting out of sleep mode","user_id":2552,"username":"EsteTron","post_date":"2019-07-16 15:38:01","message":"I have an 820-3662 board that came in today for random shutdowns. After researching here on the forums, it looks like random shutdowns are a very common issue with this board and mostly pertain to a video issue. I am not sure if the issue with this computer is related or not but here are the following issues.\n\nDevice will run perfectly fine with Unigine Valley Benchmark, and can stream videos for hours. However, once the device goes into sleep mode, the fans will begin to slowly get faster until maxed out and the screen will not display anything. When looking into Console after performing an SMC reset, there are no errors in System.log around the time the computer went to sleep. It is almost as if the entire OS halts and isn't being detected as a Kernal Panic in Console. I am able to replicate the fan and blank screen issue every time the computer goes to sleep, or has the lid closed. I have also replicated this sleep issue using an external Test OS to rule out software corruption.\n\nDoes any of this seem related to the typical FDMF6808 issue I am finding on the forums? If so, should I even bother attempting to resolve this board?"}
{"post_id":50771,"thread_id":50770,"title":"820-3662 Issues getting out of sleep mode","user_id":682,"username":"2informaticos","post_date":"2019-07-16 15:39:32","message":"Chenge FDMF6808 chips with real new FDMF6708 from Mouser, or other serious store."}
{"post_id":50773,"thread_id":50770,"title":"820-3662 Issues getting out of sleep mode","user_id":2552,"username":"EsteTron","post_date":"2019-07-16 16:00:31","message":"Thank you for your quick response. The client bought this computer second hand a few weeks ago, so I will see if they want to move forward with the repair. If so, I will purchase some FDMF6808 chips off of Mouser and follow up with how it went. Thank you."}
{"post_id":50775,"thread_id":50770,"title":"820-3662 Issues getting out of sleep mode","user_id":1153,"username":"JohnB8812","post_date":"2019-07-16 16:31:29","message":"FDMF6708 NOT FDMF6808. 6708 chips will indeed work. Make SURE when you replace the chips they are soldered properly and do NOT power up the board until it has time to cool after ultrasonic. Powering up to quick will kill the CPU due to heat. If done correctly, should work."}
{"post_id":50777,"thread_id":50770,"title":"820-3662 Issues getting out of sleep mode","user_id":2552,"username":"EsteTron","post_date":"2019-07-16 16:46:50","message":"Thank you, JohnB8812. Before I called the client to give a final diagnosis, I noticed that someone has replaced the TopCase before. I removed the logic board to inspect if anything was suspicious, and I discovered that the Microphone cable was taped down with Kapton tape. Two thoughts went through my head. Either someone was being paranoid and purposely had the microphone unplugged, or someone installed the new TopCase and forgot to remove tape from the microphone. Just for the hell of it, I reassembled MacBook with Microphone plugged in.\n\nSo far, I have not been able to replicate the original sleeping issues. After looking at the schematics, it doesn't make sense that this would be related to the high fan speed and black screen issue. Is it possible there is a sensor required in the microphone cable?\n\nDoes this sound like a red haring?\n\nThe only reason I am unsure if this is an issue with the FDMF6808 chips is because the computer does not randomly shut off like other people have reported. It only had issues going to sleep before I reconnected the Microphone."}
{"post_id":50781,"thread_id":50770,"title":"820-3662 Issues getting out of sleep mode","user_id":1153,"username":"JohnB8812","post_date":"2019-07-16 18:15:26","message":"In this case, you could be lucky and only have had a sleep issue from the mic :D. I would definitely tell customer to monitor the black screen issue tho"}
{"post_id":50782,"thread_id":50770,"title":"820-3662 Issues getting out of sleep mode","user_id":2552,"username":"EsteTron","post_date":"2019-07-16 18:29:19","message":"It is a strange one, but that is what it is looking like. I told the customer to pick up as is and if issue comes back, then we will discuss board repair. Thanks for your input. Just in case, I am getting some FDFMF6708 chips from Digikey to keep in stock."}
{"post_id":50785,"thread_id":50770,"title":"820-3662 Issues getting out of sleep mode","user_id":1153,"username":"JohnB8812","post_date":"2019-07-17 00:24:02","message":"Yeah I usually stock 3 at a time. Not a repair I see constantly, but good to have a few just in case"}
{"post_id":51051,"thread_id":50770,"title":"820-3662 Issues getting out of sleep mode","user_id":2552,"username":"EsteTron","post_date":"2019-07-29 11:08:34","message":"So a week has passed and the customer came back in with the same issue. It looks like the Microphone cable was indeed a red herring. At this point, it looks like the FDFMF6808 chips will need to be replaced. I did get 3 FDFMF6708 chips from DigiKey. I will follow up with the success of this repair."}
{"post_id":51052,"thread_id":50770,"title":"820-3662 Issues getting out of sleep mode","user_id":682,"username":"2informaticos","post_date":"2019-07-29 13:21:12","message":"Don't forget to remove CPU heatsink.\nIf not, will need a lot of heat to replace these chips; stressing board and CPU..."}
{"post_id":51060,"thread_id":50770,"title":"820-3662 Issues getting out of sleep mode","user_id":2552,"username":"EsteTron","post_date":"2019-07-29 15:54:57","message":"Thank you for the suggestion. That makes a lot of sense."}
{"post_id":51066,"thread_id":50770,"title":"820-3662 Issues getting out of sleep mode","user_id":1153,"username":"JohnB8812","post_date":"2019-07-29 17:25:19","message":"Yep 100% remove heatsink and DO NOT power up the board right away after replacing. Check to make sure your PPBUS is not shorted after replacing and ultrasonic the board and\/or let the board cool down for at least and hour or so. Otherwise, you will hear a pop and have a dead CPU"}
{"post_id":51068,"thread_id":50770,"title":"820-3662 Issues getting out of sleep mode","user_id":2552,"username":"EsteTron","post_date":"2019-07-29 18:07:17","message":"Thanks JohnB8812. I have replaced all three chips. PPBUS is not shorted, however CPUVR_PHASE is reading 5 ohms. Does this sound normal? Or did I bridge a ground pad to a CPUVR_PHASE pad? I know certain lines around CPUs and GPUs typically have a low Resistance. But I just wanted a second opinion before I ultra sonic clean the board. Thanks."}
{"post_id":51069,"thread_id":50770,"title":"820-3662 Issues getting out of sleep mode","user_id":1153,"username":"JohnB8812","post_date":"2019-07-29 18:53:12","message":"5 ohms is fine. Just do NOT power the board up until it cools! Once it cools, I think you should be fine to test and see what happens. I typically test these for several days before giving them back."}
{"post_id":51081,"thread_id":50770,"title":"820-3662 Issues getting out of sleep mode","user_id":2552,"username":"EsteTron","post_date":"2019-07-30 13:14:38","message":"I finished the repair last night and performed an Ultra Sonic cleaning before I closed up. Came in this morning, inspected all of my joints and reassembled the MacBook Pro. Ran a quality control test for an hour. The MacBook Pro is no longer having sleeping issues, let alone any power issues. The repair was a success. Thank you JohnB8812 and 2informaticos for all of your help with this repair. I am truly grateful for your guidance."}
{"post_id":51082,"thread_id":50770,"title":"820-3662 Issues getting out of sleep mode","user_id":1153,"username":"JohnB8812","post_date":"2019-07-30 15:37:57","message":"Great job! I actually have the same kind of repair in front of me now, so here's to hoping mine is as successful as yours!"}
