[
    {
        "post_id":58267,
        "thread_id":58267,
        "title":"2013-2019 MacBook Air A1466 \/ A1932 graphical glitching  RESEARCH TOPIC",
        "user_id":637,
        "username":"TCRScircuit",
        "post_date":"2020-04-15 09:07:30",
        "message":"I have seen several of these machines that exhibit graphical glitches (typically green) while playing full screen video. The machine will otherwise behave normally with no other issues. I suspect this is either one of 2 things. \n\nA. Driver issue related to a specific MacOs version \n\nOR. \n\nB. Dying Intel iGPU or a driver issue with a specific revision of the intel iGPU. \n\nIf you have seen one of these machines, or have one of these machines in your shop, could you please post the MacOs version number as well as the info under System Report - Graphics and Displays? \n\nThanks! Also curious to what others think of this. It has been bugging me lately."
    },
    {
        "post_id":58277,
        "thread_id":58267,
        "title":"2013-2019 MacBook Air A1466 \/ A1932 graphical glitching  RESEARCH TOPIC",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2020-04-15 14:17:35",
        "message":"A1466 and A1932 are 2 totally different platforms so I doubt it will be hardware related.\n\nI think the Netflix bug with flickering video is still present when running in Safari, so maybe it is that?"
    },
    {
        "post_id":58286,
        "thread_id":58267,
        "title":"2013-2019 MacBook Air A1466 \/ A1932 graphical glitching  RESEARCH TOPIC",
        "user_id":637,
        "username":"TCRScircuit",
        "post_date":"2020-04-15 19:24:31",
        "message":"[QUOTE=\"dukefawks, post: 58277\"]A1466 and A1932 are 2 totally different platforms so I doubt it will be hardware related.\n\nI think the Netflix bug with flickering video is still present when running in Safari, so maybe it is that?[\/QUOTE]\n\nThat is a possibility, I will check with people and see if it is a netflix and safari issue alone. \n\nI have heard of this same issue on both 1466 and 1932, so I just wanted to see if maybe, both machines were running the same MacOs version #."
    }
]