{"post_id":12289,"thread_id":12289,"title":"[SOLVED]820-2610 Cuts off halfway through booting","user_id":515,"username":"SMMRepair","post_date":"2017-01-04 16:12:31","message":"I got a great deal on a lot of these 17\" machines, so I've been going through fixing a lot of common issues, including C7771. This board had no green light due to a blown Q6910 (replaced Q6910 and U6915). Replaced both and got a green light and fan spin. Tested board and it cuts off halfway through booting. Checked C7771 and it gave the correct reading, but I replaced it anyway. Same issue persists. The board will stay on indefinitely if left at the EFI\/boot select menu, but once I select OSX to boot, it shuts off about 15-20 seconds later (at about ~1\/3 of the Apple loading bar filled).\n\nI actually have two identical boards that are having this exact same issue, so I'm wondering if there are any common failures for this model that cause this issue? Replaced C7771 on both, and problem persists on both. No liquid to either board.\n\nAny help appreciated! Thanks."}
{"post_id":12293,"thread_id":12289,"title":"[SOLVED]820-2610 Cuts off halfway through booting","user_id":2,"username":"dukefawks","post_date":"2017-01-04 18:27:39","message":"Not a common issue. Check in verbose mode if you can spot the process killing it."}
{"post_id":12323,"thread_id":12289,"title":"[SOLVED]820-2610 Cuts off halfway through booting","user_id":515,"username":"SMMRepair","post_date":"2017-01-05 11:07:16","message":"Thanks, Duke. I got one resolved.\n\nThe other one, I have a question about; is J3500 critical to the board starting? The reason I ask, is that I actually found some slight discoloration (which I think was liquid) around U7710. I replaced U7710, and the board actually doesn't cut off anymore, but the screen goes from the typical bright-white\/light-gray screen to a dark gray, which I think means it's dropping video data. I had started using this board for parts (thinking it had a dead MCP prior to all of this, when I replaced C7771 and it didn't boot), so I pulled J3500 for another board. This board now has the video data drop issue, and has no J3500 on the board. I just wanted to make sure this wouldn't cause issues, since I notice in the schematics that J3500 is actually communicating directly with the MCP, and wasn't sure if that connector being missing could cause issues.\n\nIf J3500 is not critical, does the LCD data-drop issue sound MCP related? Board powers on normally, chimes, shows the white screen as normal, but the screen turns to the dark gray screen before it reaches boot-select menu or OSX loading, etc. Known-good test assembly, etc."}
{"post_id":12338,"thread_id":12289,"title":"[SOLVED]820-2610 Cuts off halfway through booting","user_id":2,"username":"dukefawks","post_date":"2017-01-05 16:23:01","message":"How does a connector affect anything unless there is a short in it? So no, without J3500 does of course not matter.\n\nThese boards are known for MUX problems. MCP rarely fails just on its own, with liquid it is common, but usually totally dead then. MUX is a good suspect now."}
{"post_id":12374,"thread_id":12289,"title":"[SOLVED]820-2610 Cuts off halfway through booting","user_id":515,"username":"SMMRepair","post_date":"2017-01-06 08:37:45","message":"Yeah I was confident a connector has no affect on the board powering, but just thought it was odd that the board had video (albeit for only 10 seconds or so) before swapping C7771 and removing J3500, now it doesn't cut off, but loses video even SOONER than it did when I swapped out C7771. Having done the tantalum\/poly-film swap dozens of times, I felt comfortable I did it fine, so was just confirming that J3500 wasn't in some weird way critical. Glad to know it isn't.\n\nGoing to heat up the mux now and see how that goes--thanks, duke."}
{"post_id":12375,"thread_id":12289,"title":"[SOLVED]820-2610 Cuts off halfway through booting","user_id":515,"username":"SMMRepair","post_date":"2017-01-06 08:49:24","message":"You nailed it; reflowed the mux and it booted into OSX. We rarely, rarely work on boards older than 2011, so haven't had much experience with issues on this model board. Thanks, duke. You can close this one up as solved. Take care."}
