{"post_id":49690,"thread_id":49690,"title":"820-3437 - Randomly Restarts","user_id":4718,"username":"fredddd","post_date":"2019-06-03 03:59:18","message":"Hi all, I have an 820-3437 Macbook Air board which was water damaged. I have managed to get the Macbook to a state where it passes everything in ASD and boots into the OS as you would expect. \n\nIt boots into the OS a little slowly (progress bar gets to about 60% then stalls for a while then jumps to 100%) and the lighting of the screen changes whilst it's loading, looks like someone is changing the picture to the \"warm\" setting. The laptop works perfectly in the OS. However, it will randomly restart. The temp on the CPU is around 40-50, the fans don't ramp up, it just dies and restarts. Usually, after the apple logo it comes straight back to the log on screen, occasionally it shows the \"your mac restarted because of a problem\" message and even more occasionally it will restart 2 or 3 times quickly in a loop before coming back to the logon screen. \n\nAs I don't have a spare SSD for this machine, I booted the computer into ASD and left it. It also re-boots on that so my logic dictates this isn't an SSD\/OS issue? \n\nAny help would be much appreciated!"}
{"post_id":49693,"thread_id":49690,"title":"820-3437 - Randomly Restarts","user_id":682,"username":"2informaticos","post_date":"2019-06-03 04:59:28","message":"Possibly corrosion under SMC, or CPU, maybe under a RAM chip.\nUltrasonic cleaner needed here; use sweep function."}
{"post_id":49703,"thread_id":49690,"title":"820-3437 - Randomly Restarts","user_id":4718,"username":"fredddd","post_date":"2019-06-03 15:03:50","message":"Put it through the ultrasonic, I don't have a sweep mode so it was just normal with a proper PCB cleaning fluid. Touch wood it seems fine. Left it open for 2 hours earlier playing some music and it was still on when I came back. Usually it was lasting 20 minutes max before. \nThanks for your advice!"}
{"post_id":49706,"thread_id":49690,"title":"820-3437 - Randomly Restarts","user_id":682,"username":"2informaticos","post_date":"2019-06-03 17:12:02","message":"If no sweep available on your UC machine, then move 1-2cm the board every 30s, even 20s better.\nThis way avoid the hot spots focused on the same points of MLB."}
