{"post_id":77019,"thread_id":61363,"title":"Understand caps a little bit more! Short on PPBUSG3H","user_id":26060,"username":"Maxibon","post_date":"2021-06-25 21:35:25","message":"Hey guys! I’m wondering if anyone can help me with a knowledge gap I have that can either point me in the right direction or explain the following to me! \n\nThe device: A1706 820-00236 \nThe issue: short to ground on PPBUSG3H \nWhat caused the short: failed cap. Cap specs: 33uf 16v 20% \nMy questions I can only get my hands on 47uf caps in 10 packs from mobile sentrix. Is this the case, because one size fits all?\n\nI’m a little lost why I can find multiple different spec and sizes caps for sale in bulk. Is harvesting a cap from the same spot on the same model device, same spec the only way to ensure you’re using 100% the right one. On that same PPBUS line there is a cap that is 2.2uf 25v 20% totally different physical size as well. So far anytime I have a short on VCC main or PPBUS etc I just leave the caps off. I’ve been doing this for years and have no issues with this though I want to understand why.\n\nThanks in advance! \n\nMax"}
{"post_id":77022,"thread_id":61363,"title":"Understand caps a little bit more! Short on PPBUSG3H","user_id":682,"username":"2informaticos","post_date":"2021-06-26 04:40:29","message":"The ESR factor is very important factor of the big caps.\nThey are used as energy reservoir and must allow high current discharge.\nYou can pick them from older scrap boards.\nSometime you can put bigger size, scratching the copper pads.\n\nTollerance is not important at all, just be sure to choose same, or bit higher nominal voltage.\nDepending where the cap is placed, you can use the same capacity, or higher (not too much).\n\nMany times will not solder back small capacity caps, but must understand if is really needed, or not.\n1-22uF seem to be not high capacity, but when these are placed near the drain of an High-Side MOSFET from a secondary supply, these caps are CRITICAL!\n\nDo NOT buy book kits with ceramic caps, or resistors + caps from eBay, or Aliexpress.\nYou will not use more than 1% of them.\nGood to have all sizes book resistors kit only; 0201 to 1206.\nUse scrap boards for capacitor replacements.\n\nYou can use 25V instead of 16V, but may need to make space for it.\nHigher nominal voltage imply bigger package usually."}
