[
    {
        "post_id":103543,
        "thread_id":64443,
        "title":"Diode mode, conduction mode",
        "user_id":52544,
        "username":"jxx",
        "post_date":"2024-01-07 07:36:50",
        "message":"Hello, this is a basic question.\nWhen checking the capacitor in diode mode and conduction mode with multimeter.\nDiode mode measurements come in V and DC, Is that means voltage value?\nIs the measurement in conduction mode a resistance value?"
    },
    {
        "post_id":103544,
        "thread_id":64443,
        "title":"Diode mode, conduction mode",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2024-01-07 07:58:33",
        "message":"The multimeter can only measure the voltage between component pins.\nIt injects a constant current, which creates a voltage across the component, V=IxR.\nFor a pure resistor (pasive component) is very simple, you get exact ohm value R=V\/I, after some transformations inside the multimeter.\nKeep in mind, the multimeter measures the voltage over the resistor, not its ohm value directly!\n\nFor diode mode is used another current value; that's the reason you get distinct reading than in ohm scale.\nNon linear behavior of diodes, transistors, or any active components create high range values.\nThe multimeters show \"V\" at the end scale in this case.\nHowever, I strongly recommend, do NOT post that on diode mode readings; avoid misunderstoods with pure voltage readings.\n\nWhen testing capacitors, the reading varies a lot.\nAn (initial) empty capacitor tries to get the max injected current; like a short, or very low resistance.\nHowever, that parasitic resistance increases rapidly and current drops a lot.\nIts capacitance requires another method to measure; based on the time to charge it until specific porcentage (with constant current).\n\nIf you need personal training, please contact Rossmann staff.\nThat can be done through other networks.\nThe forum goal is to help with repair assistances."
    }
]