{"post_id":95802,"thread_id":63501,"title":"820-01598 no wifi","user_id":26621,"username":"grmacs","post_date":"2023-01-23 11:42:17","message":"No history on this. Board was clean. A2159 820-01598 that has no wifi for no known\/visible reasons. 1.8V and 3v3 are present so I believed it was the wifi chip itself. I tried reballing it but no change. I tried pulling same part number wifi chip from other board with associated ROM chips and no change. I then ordered a A2159 donor board to see if it was related to prior attempt being from a different model. Pulled Wifi and WLAN and BT roms from 01598 donor and no change. I tried restoring from DFU to see if maybe T2 needed reflash and no change.\n\nBroken trace wouldn't make sense to me. I'm thinking there's a weak link. Suggestions?"}
{"post_id":95803,"thread_id":63501,"title":"820-01598 no wifi","user_id":682,"username":"2informaticos","post_date":"2023-01-23 12:40:54","message":"U3701 controls both wifi and bluetooth.\nBluetooth works correctly?\nNo wifi hardware detected at all on System Information?"}
{"post_id":95815,"thread_id":63501,"title":"820-01598 no wifi","user_id":26621,"username":"grmacs","post_date":"2023-01-23 14:45:13","message":"No bluetooth or Wifi hardware detected in system info. It shows software versions only for wifi.\n\nSo, I had tried pulling U3701, U3710, U3750 from another 01598 board and I believe it went pretty well as far as reballing the donor U3701 and placing. I thought that would've resolved any issues or at least after T2 restore but nada."}
{"post_id":95816,"thread_id":63501,"title":"820-01598 no wifi","user_id":682,"username":"2informaticos","post_date":"2023-01-23 16:09:34","message":"Apart of power rails (1V8\/3V3_G3S_WLANBT), check all resistors from page 32.\nFew caps to check on the PCIE data lines too."}
{"post_id":95836,"thread_id":63501,"title":"820-01598 no wifi","user_id":26621,"username":"grmacs","post_date":"2023-01-24 16:50:33","message":"Going to be a no fix. All I can guess is maybe T2 issue. Connectivity on U3701 seemed pretty good and couldn't find any issues with the caps or resistors around it. Inspected the board again and just not seeing anything out of place."}
{"post_id":95839,"thread_id":63501,"title":"820-01598 no wifi","user_id":682,"username":"2informaticos","post_date":"2023-01-24 18:33:19","message":"Check J3850\/60 signals..."}
