[
    {
        "post_id":96452,
        "thread_id":63572,
        "title":"iMac Don't Boot After Onboard Ram Upgrade - A1418 - 820-00430-A",
        "user_id":37634,
        "username":"MeTech Turkey",
        "post_date":"2023-02-08 02:13:42",
        "message":"Hello everyone,\n\nFirst time I have tried to upgrade my iMac ram storage from 8GB to 16GB. Let me tell you the story first.\n\nIt had 4 of HYNIX H9CCNNNBLTBL-ARNUD ram (each 2gb) totally 8GB. Then we started to search and found out that my computer is compatible with 16GB of ram too.\nThen we have found another 4 ram chips which makes totally 16GB with the code of ELPIDA FA232A2MA-JD-F. Then we have applied the ram configuration on schematic as you can see attached photos.\n\n1) Removed the R1687 and put 100K resistor to R1683 on RAMCFG0\n2) Removed the R1686 and put 100K resistor to R1682 on RAMCFG1\n3) Removed the R1685 and put 100K resistor to R1681 on RAMCFG2\n4) Kept R1684 on its place on RAMCFg3\n5) Removed the R1689 and put 100K resistor to R1688 on RAMCFG4\n\nBut after I did this configuration the device stays on black screen, I can hear that HDD works, fan spins, no beeps from speaker and the LED lights on the mainboard\nLE0301 (ITS_PLUGGED_IN), LE0302 (CORE_VOLTAGES_ON_R, CORE_VOLTAGES_ON) but LE0303 (MEMORY_GOOD_R, MEMORY_GOOD) LEDs do not light on. I have waited nearly a minute but nothing changed.\n\nI have checked with thermal camera after plugged in and also press the power button nothing seems short.\n\nAny suggestions or advices you can give me to check because I was struggled with understanding this ram configuration thing? I do still think that I did something wrong there or rams from another mainboard are not working. And is there anyway I can understand if the rams are working or not?\n\nThank you\n\nEmre[ATTACH type=\"full\" alt=\"1.png\"]60979[\/ATTACH][ATTACH type=\"full\" alt=\"2.png\"]60980[\/ATTACH]"
    },
    {
        "post_id":96455,
        "thread_id":63572,
        "title":"iMac Don't Boot After Onboard Ram Upgrade - A1418 - 820-00430-A",
        "user_id":1547,
        "username":"CRC2018",
        "post_date":"2023-02-08 04:49:02",
        "message":"The configuration you did is correct if you replaced all RAM chips with the ELPIDA ones of 16GB and 1866 speed. If however I am reading this correctly - you left the Hynix ones on the board and just added 8GB of ELPIDA chips? You cannot mix and match like this you need to have the chips all matched and with the correct config resistors set."
    },
    {
        "post_id":96456,
        "thread_id":63572,
        "title":"iMac Don't Boot After Onboard Ram Upgrade - A1418 - 820-00430-A",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-02-08 05:48:00",
        "message":"You can't mix the chips.\nAs per schematic, the strap configuration is brand dependent."
    },
    {
        "post_id":96501,
        "thread_id":63572,
        "title":"iMac Don't Boot After Onboard Ram Upgrade - A1418 - 820-00430-A",
        "user_id":37634,
        "username":"MeTech Turkey",
        "post_date":"2023-02-09 00:07:36",
        "message":"[QUOTE=\"CRC2018, post: 96455, member: 1547\"]\nThe configuration you did is correct if you replaced all RAM chips with the ELPIDA ones of 16GB and 1866 speed. If however I am reading this correctly - you left the Hynix ones on the board and just added 8GB of ELPIDA chips? You cannot mix and match like this you need to have the chips all matched and with the correct config resistors set.\n[\/QUOTE]\nNo I have changed all the rams with Elpida ones. So I have removed 4 Hynix rams and put 4 elpida rams ( I meant chips with this). I dont know if I need to do something else? Reball the rams maybe? Or the rams may be corrupted and not working?\n\nThank you\n\nEmre"
    },
    {
        "post_id":96504,
        "thread_id":63572,
        "title":"iMac Don't Boot After Onboard Ram Upgrade - A1418 - 820-00430-A",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-02-09 00:30:44",
        "message":"Measure MLB_RAMCFG0-4 voltages, to be sure the correct scheme is achieved (HHHLH).\nBe sure all chips are correctly soldered.\n\nYou can try to put RAMCFG3 high, in case your chips are 1600, not 1866.\nIn fact, may play with RAMCFG3\/4 levels, 4 combinations possible."
    },
    {
        "post_id":97900,
        "thread_id":63572,
        "title":"iMac Don't Boot After Onboard Ram Upgrade - A1418 - 820-00430-A",
        "user_id":37634,
        "username":"MeTech Turkey",
        "post_date":"2023-03-25 02:21:22",
        "message":"I got back to keep repairing this imac. I have reballed the ram chips. And boo it is back on again. But now I am having troubles of going to into the OS. The apple logo appears and it starts loadind but on the half it restarts itself. When I try to restore it from cmd+alt+r first it loads but after it restarts itself. When I try to log into the diagnose screen. It stays on the beginning and do not diagnose. What should be the problem with this imac? What should I do wrong?"
    },
    {
        "post_id":97901,
        "thread_id":63572,
        "title":"iMac Don't Boot After Onboard Ram Upgrade - A1418 - 820-00430-A",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-03-25 02:27:35",
        "message":"Possibly bad solders, or one chip is defective.\nCan you boot something like HBCD and run a memory test?\n\nJust in case, try known good clean ME BIOS."
    },
    {
        "post_id":97902,
        "thread_id":63572,
        "title":"iMac Don't Boot After Onboard Ram Upgrade - A1418 - 820-00430-A",
        "user_id":37634,
        "username":"MeTech Turkey",
        "post_date":"2023-03-25 02:34:39",
        "message":"Unfotunately it is my first time hearing HBCD can you explain to me what it is?"
    },
    {
        "post_id":97907,
        "thread_id":63572,
        "title":"iMac Don't Boot After Onboard Ram Upgrade - A1418 - 820-00430-A",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-03-25 08:07:00",
        "message":"Hirens Boot CD; even using it from pendrive.\nYou can find more software tools on Internet..."
    },
    {
        "post_id":97916,
        "thread_id":63572,
        "title":"iMac Don't Boot After Onboard Ram Upgrade - A1418 - 820-00430-A",
        "user_id":37634,
        "username":"MeTech Turkey",
        "post_date":"2023-03-25 13:53:59",
        "message":"I found Hirens Boot Cd and boot it from usb but it stucks on windows logo. Tried it on an another macbook and worked well. Also reballed the rams again.\nHow can I inspect if one of the rams is defectice? Only with these tools like Hirens Boot Cd?\nBut wont it beep if there is a problem with a ram or if there is a defective ram?\nAnd I have read articles and I realised that it  could be a bad trace between cpu and ram. And you adviced someone to heat cpu with 180 - 200 degrees for 15 - 20seconds. Should I do that too?\nBecause once it went to internet recovery but it happened for 1 or 2 times then when I press cmd+alt+r it starts loading and at the end it restarts itself. I have a big sur installation usb, when I choose it on boot options it directly goes to screen which gives an error saying your computer needs to be restarted because of a problem, press a key or wait for it - something like that. I dont know what can cause this as I havent heard anyone doing this onboard and ssd upgrades. So I really want to learn everything about this subject. If there is anywhere I can buy these ram chips or SSD chips.\n\nThank you"
    },
    {
        "post_id":97917,
        "thread_id":63572,
        "title":"iMac Don't Boot After Onboard Ram Upgrade - A1418 - 820-00430-A",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-03-25 15:36:54",
        "message":"Put back original chips and test.\nIf works, then (at least) one of the new chips is bad; or not properly soldered."
    },
    {
        "post_id":97918,
        "thread_id":63572,
        "title":"iMac Don't Boot After Onboard Ram Upgrade - A1418 - 820-00430-A",
        "user_id":37634,
        "username":"MeTech Turkey",
        "post_date":"2023-03-26 06:22:20",
        "message":"Okay will do thank you\n\nAnd can I ask another question? For example any ram but in a right way for example like if imac supports 16gb ram and if the rams from another board is 16gb. Will it work anyway? Or is there again a code or serie that I have to double check for a compatible ram? Or any 16gb (4 chips totally) will work with the right ram configuration?"
    },
    {
        "post_id":97919,
        "thread_id":63572,
        "title":"iMac Don't Boot After Onboard Ram Upgrade - A1418 - 820-00430-A",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-03-26 07:41:45",
        "message":"You must configure the straps according with brand, size and speed..."
    }
]