{"post_id":60530,"thread_id":59458,"title":"820-00850 stuck at 5V 280mA","user_id":26559,"username":"clusterfsck","post_date":"2020-06-05 14:01:46","message":"I've got an 820-00850 logic board that suffered water damage. Board cleaned up well, may have a little corrosion around U9080. The board draws 5V 280mA when connected to a charger alone, 20V 0mA when the battery is connected. Behavior is the same on all 4 USB-C ports. I measured all the usual suspects and nothing seems off.\n\nPP3V3_G3H 3.34V\nPPBUS_G3H 12.31V\nPP20V_USBC_XB_VBUS 5.24V\nPMU_ONOFF_L 3.40V\nPP0V8_SLPS2R 0.8V\nPP1V1_SLPS2R 1.1V\nPP1V8_SLPS2R 1.8V\n\nI was really hoping it was a T2 firmware issue. I can get the board into DFU mode, but it's seen as a generic \"Apple Controller\" in Apple Configurator 2.6 on a Mac mini. The mini complains \"Cannot use thunderbolt accessory\" when first connected. Could it be a cable issue?\n\nSymptoms seem similar to this thread [URL]https:\/\/boards.rossmanngroup.com\/threads\/59438\/[\/URL]. I checked all CD3215 LDO outputs in diode mode and got readings ranging 0.43V-0.48V. Replacing the CD3215s seems to issue in that instance. Is there anything else I should check\/try first?"}
{"post_id":60539,"thread_id":59458,"title":"820-00850 stuck at 5V 280mA","user_id":682,"username":"2informaticos","post_date":"2020-06-05 16:35:02","message":"\"PPBUS_G3H 12.31V\"\nThis points to T2 firmware issue...\n\nBe sure to use dedicated USB-C port for recovery; read Apple documentation.\nAlso be aware, some people reported to have problem with original Apple cables.\nAnd try using another machine, maybe a MacBook, for recovery process."}
{"post_id":60636,"thread_id":59458,"title":"820-00850 stuck at 5V 280mA","user_id":26559,"username":"clusterfsck","post_date":"2020-06-08 15:39:27","message":"Tried on a 2016 MacBook pro with a different cable. Doesn't show the thunderbolt accessory error anymore, but still shows up as \"Apple Controller\". Tried Revive anyway, it times out in Step 4.\n\n[ATTACH]59266[\/ATTACH][ATTACH]59267[\/ATTACH]\n\nI'm going to try replacing the CD3215s. Do they all need to be present for the machine to function or can I get away with only installing one? Just trying to get the data off the MacBook."}
{"post_id":60667,"thread_id":59458,"title":"820-00850 stuck at 5V 280mA","user_id":682,"username":"2informaticos","post_date":"2020-06-09 09:00:58","message":"Do NOT touch CD3215 chips!\nAll are good, as you get 12.3V at PPBUS_G3H."}
{"post_id":61645,"thread_id":59458,"title":"820-00850 stuck at 5V 280mA","user_id":26559,"username":"clusterfsck","post_date":"2020-06-30 12:44:08","message":"I've been trying with different cables on different Macs and the board always identifies in DFU mode as \"Apple Controller\". It's supposed to say \"iBridge\", correct? Makes me thing something goes wrong very early with the T2 and it isn't even in a state that can be revived by Apple Configurator.\n\nIt still bothers me, though, that the USB-C voltage isn't changing to 20V. Anything else you can think of to try?"}
{"post_id":61663,"thread_id":59458,"title":"820-00850 stuck at 5V 280mA","user_id":682,"username":"2informaticos","post_date":"2020-06-30 18:31:16","message":"T2 must talk with CD3215 chips, in order to switch to 20V on USB-C port.\nA T2 firmware issue can block this communication..."}
