{"post_id":64146,"thread_id":59898,"title":"820-01041 A1990 2018 - 20V 0.06A - no power","user_id":612,"username":"Atomrepair","post_date":"2020-08-25 10:06:39","message":"This board has water damage. Someone else put it through an UC, wiping clues, but something remains: J6700 has loose pins for PP5V_G3S_FAN_CONN and PP5V_G3S.\n\nMeasurements:\n                                                                                                                                                                                                                                                                                                                                                                                                  \n[TABLE]\n[TR]\n[TD][LEFT]PPBUS_G3H[\/LEFT][\/TD]\n\n[TD][LEFT]12,6V[\/LEFT][\/TD]\n\n[TD][LEFT][\/LEFT][\/TD]\n[\/TR]\n[TR]\n[TD][LEFT]PP5V_G3S[\/LEFT][\/TD]\n\n[TD][LEFT]5,1V[\/LEFT][\/TD]\n\n[TD][LEFT][\/LEFT][\/TD]\n[\/TR]\n[TR]\n[TD][LEFT]PP3V3_S5[\/LEFT][\/TD]\n\n[TD][LEFT]0V[\/LEFT][\/TD]\n\n[TD][LEFT]no short[\/LEFT][\/TD]\n[\/TR]\n[TR]\n[TD][LEFT]PP3V3_G3H_T[\/LEFT][\/TD]\n\n[TD][LEFT]3,3V[\/LEFT][\/TD]\n\n[TD][LEFT][\/LEFT][\/TD]\n[\/TR]\n[TR]\n[TD][LEFT]PP3V3_G3H_SOCPMU[\/LEFT][\/TD]\n\n[TD][LEFT]3,3V[\/LEFT][\/TD]\n\n[TD][LEFT][\/LEFT][\/TD]\n[\/TR]\n[TR]\n[TD][LEFT]PP3V3_G3H_RTC_X[\/LEFT][\/TD]\n\n[TD][LEFT]3,3V[\/LEFT][\/TD]\n\n[TD][LEFT][\/LEFT][\/TD]\n[\/TR]\n[TR]\n[TD][LEFT]PP1V1_SLPS2R[\/LEFT][\/TD]\n\n[TD][LEFT]1,1V[\/LEFT][\/TD]\n\n[TD][LEFT][\/LEFT][\/TD]\n[\/TR]\n[TR]\n[TD][LEFT]PP1V8_SLPS2R[\/LEFT][\/TD]\n\n[TD][LEFT]1,8V[\/LEFT][\/TD]\n\n[TD][LEFT][\/LEFT][\/TD]\n[\/TR]\n[TR]\n[TD][LEFT]PP3V3_AWAKE[\/LEFT][\/TD]\n\n[TD][LEFT]3,3V[\/LEFT][\/TD]\n\n[TD][LEFT][\/LEFT][\/TD]\n[\/TR]\n[TR]\n[TD][LEFT]PMU_ONOFF_L[\/LEFT][\/TD]\n\n[TD][LEFT]3,3V[\/LEFT][\/TD]\n\n[TD][LEFT][\/LEFT][\/TD]\n[\/TR]\n[TR]\n[TD][LEFT]PM_SLP_S5_L[\/LEFT][\/TD]\n\n[TD][LEFT]0V[\/LEFT][\/TD]\n\n[TD][LEFT][\/LEFT][\/TD]\n[\/TR]\n[\/TABLE]\n\nI tried getting the board into DFU mode, but have not succeeded. So far I've tried:\n\nAll ports, though focused mainly on the left port closest to trackpad as instructions indicate.\nOriginal thunderbolt cable (with lightning symbol)\nOriginal magsafe charger cable (no symbol)\nBelkin cable\nanother off-brand cable\n\nWhen I use the non-thunderbolt cables, I get the message ''cannot use thunderbolt accessory. connect accessory using a thunderbolt-capable cable''.\nWhen I use the proper thunderbolt cable, I get nothing. No device is seen in apple configurator. Host machine runs catalina, i'm fairly sure the broken board does too.\n\nI've tried getting into DFU mode both with juse the loose board, nothing attached (this has worked for me on an 820-01041 board from an A1708 before), but I also tried with the assembled device. Is there something else left to try here?"}
{"post_id":64149,"thread_id":59898,"title":"820-01041 A1990 2018 - 20V 0.06A - no power","user_id":612,"username":"Atomrepair","post_date":"2020-08-25 11:18:46","message":"update: I've fixed J6700 and tried to get into DFU  with the assembled machine using [URL='https:\/\/logi.wiki\/index.php\/DFU_mode_restore']these instructions[\/URL]:\n\nHold right shift + left option + left control + power keys simultaneously for about 3 seconds (according to Apple, other sources say 4-8 seconds).  NOTE:  We found that if you press the power button for 1 one thousand and then simultaneously hold the right shift + left option + left control, you should be successful each time.  We also found that we were able to get in DFU mode around 4 to 6 (one one thousand, etc.) seconds.  The Target Mac will remain as a black screen but you should see the DFU box pop up in Apple Configurator window on the Host Mac. \n\nStill nothing on the mac running apple config (original or non original cable)"}
{"post_id":64156,"thread_id":59898,"title":"820-01041 A1990 2018 - 20V 0.06A - no power","user_id":7922,"username":"tcampbell34","post_date":"2020-08-25 13:16:24","message":"Use the thunderbolt cable with the lightning bolt on it and hold the keys down for 10 seconds and that should get you into DFU. You may have to try a few times, but it does work for me. I have a A1989 with similar symptoms, and was able to get it into DFU using this process, but the restore fails every time for me. Hopefully it works for you."}
{"post_id":64202,"thread_id":59898,"title":"820-01041 A1990 2018 - 20V 0.06A - no power","user_id":612,"username":"Atomrepair","post_date":"2020-08-26 07:13:33","message":"Alas, holding the keys down longer didn't work either. My guess is that the keyboard itself, the flatcable or something in J6700 is broken. I don't have a keyboard or flatcable for these new machines lying around so its difficult to test further right now. I think I'll abort this one, as the customer has already decided to give up on repair for this board.\n\nmaybe of note: According to system information on the host, none of the thunderbolt ports have a device connected (no matter which port I connect the macbook to)"}
