{"post_id":46761,"thread_id":46761,"title":"820-3437 high fan spin","user_id":338,"username":"arnonabuurs","post_date":"2019-02-27 00:05:03","message":"Hi guys, i got a Macbook Air 13 inch that came in dead no orange\/green light. It was still in the box from another repair shop, and it looks like they replaced the SMC and resoldered or replaced the clock chip as well. We had no 5V, after replacing U7100 we got 5V. After resoldering U1900 we also get 32mhz output. Now the fan turns on spins high, no 3 x spin. I have 8.6 volts on PPBUS and SMC is giving SMC_PM_G2_EN. Seems the SMC is working. U1950 get 3.4v on pin 1 from R1963 and C1950, 0 on R1962 and 3.3 on R1950. U6100 gets 3.3. What should i do next, would this be U6100\/traces related?\n\nEdit: i also have CPU Vcore 1.05 and USB mouse lights up"}
{"post_id":46771,"thread_id":46761,"title":"820-3437 high fan spin","user_id":682,"username":"2informaticos","post_date":"2019-02-27 04:43:23","message":"Does the mouse get steady light if reconnect it with machine on?\nUse USB pendrive with OSX. If LED Link flashes, USB activity confirmed 100%.\n\nDo PRAM reset few times.\nDid you test external video?\nPost some voltages on LCD connector.\n\nThis board should restart two times before turning on, so maybe none of above tests work.\nTry new BIOS, with clean ME of course..."}
{"post_id":47010,"thread_id":46761,"title":"820-3437 high fan spin","user_id":338,"username":"arnonabuurs","post_date":"2019-03-05 01:49:12","message":"USB drive with OSX has a flashing LED. After connect power it just starts to spin high immediately, PRAM doesnt seem to do much. Since im missing the 2x fan spin before boot, I think its not starting so there wont be any video output anyway? I have 0v on LCDBKL and 0v on the 3.3v lines, LED-Returns 0.360v. On the fuse 8.57 on both sides.\n\nUnfortunately I have no clue how to flash BIOS chips. Will see if I can find some info on that online. Will try to resolder it first had some success with that before:)"}
