[
    {
        "post_id":69048,
        "thread_id":60483,
        "title":"820-2915 AMD shorted. Can firmware bypass get graphics back with AMD removed?",
        "user_id":26621,
        "username":"grmacs",
        "post_date":"2020-12-11 06:43:34",
        "message":"I have often permanently bypassed AMD on many 2915 boards with a couple of tweaks to board and firmware change. I have a board that wouldn't go boot at all with the AMD chip on and saw somewhere that it would boot with no graphics without the AMD. I thought I'd be able to get the board to run with the firmware change but the remaining GPU doesn't apparently work at all without the AMD there. A long shot but wondering if there is only a circuit or two that could be jumpered relating to the AMD to allow the existing GPU to potentially run graphics with the AMD completely removed?"
    },
    {
        "post_id":69051,
        "thread_id":60483,
        "title":"820-2915 AMD shorted. Can firmware bypass get graphics back with AMD removed?",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-12-11 06:59:42",
        "message":"Tiresias GPUkiller shoud work.\nDid you try GMUX flash, or BIOS mod?"
    },
    {
        "post_id":69056,
        "thread_id":60483,
        "title":"820-2915 AMD shorted. Can firmware bypass get graphics back with AMD removed?",
        "user_id":26621,
        "username":"grmacs",
        "post_date":"2020-12-11 07:30:40",
        "message":"I normally use a boot drive created from RealMacMods work around which boots into Ubuntu to run the firmware mod and this uses the dedicated GPU so you have GUI. If the firmware hasn't been altered yet or has been reset, I normally can disconnect the drives from the board, connect the bootable and then hit the enter key after about a minute after the chime to pull up Ubuntu and display from the dedicated GPU then run firmware changes. Not getting the GUI when I load from the bootable like I normally do... maybe this board has another issue as well that is preventing image. I was thinking i was getting no image despite my normal methods because I've never tried with the AMD removed."
    }
]