{"post_id":83063,"thread_id":62014,"title":"820-01987 stuck 5v.","user_id":5109,"username":"Yoel Ren","post_date":"2021-11-25 22:29:09","message":"this board came in. customer say its been dropped.\nboard looks clean. when plugged to charger, its taking only 5v 0 amp.\nppbus is shorted at c9081 ( im using 820-01598boardview ).\nnow its 5v and cycling from 0 to 250amp.\nbut only one port will restart. the other board also cycling amp consumption but its not restarting the usb ammeter. is this bad cd3217 ?"}
{"post_id":83071,"thread_id":62014,"title":"820-01987 stuck 5v.","user_id":682,"username":"2informaticos","post_date":"2021-11-26 03:09:05","message":"There must be broken trace\/solders; possibly under some BGA chips.\nDropped machines are many times nightmare.\n\nWas the charger connected when the machine was dropped?\n\nSomething happened into USB-C area, as you get different behaviour for the USB ports.\nCompare diode mode readings between CD3217 chips."}
{"post_id":83177,"thread_id":62014,"title":"820-01987 stuck 5v.","user_id":5109,"username":"Yoel Ren","post_date":"2021-11-30 01:44:38","message":"forget to update here, so the board actually turn on, but there's no backlight.\ni found a short caps at ppvout, and mac turn on. unfortunately customer forget password so i have to reinstall, but its not charging and not detecting usb.\ntested with another usb c port still the same, so not part problem.\nboth of cd3217 behave the same now.\n\nbattery is detected, and it can run on battery.\n\nis the problem from isl side or still cd3217 side ?"}
{"post_id":83178,"thread_id":62014,"title":"820-01987 stuck 5v.","user_id":682,"username":"2informaticos","post_date":"2021-11-30 01:53:20","message":"If board runs on battery, poroblem must be on USB-C area.\nBoth ports stuck in 5V now, without battery?"}
{"post_id":83180,"thread_id":62014,"title":"820-01987 stuck 5v.","user_id":5109,"username":"Yoel Ren","post_date":"2021-11-30 02:21:13","message":"clarify.\n\nIF mac is turned on, both port behave the same. 5v 0 amp.\nbut if i test board alone without battery, both port consume 0.25amp to zero amp but the port associated with u3100 is looping every 5 second.\nthe port associated with u3200 isnt looping at all.\nfrom my expereince, the non looping one is usually the faulty one is it ?"}
{"post_id":83183,"thread_id":62014,"title":"820-01987 stuck 5v.","user_id":682,"username":"2informaticos","post_date":"2021-11-30 04:03:27","message":"Should be.\nCompare diode mode on various points between both ports."}
