[
    {
        "post_id":101630,
        "thread_id":64208,
        "title":"820-02020 a2338 not charging\/ low ppbus_aon",
        "user_id":33852,
        "username":"DDVL",
        "post_date":"2023-09-18 17:09:06",
        "message":"My second post yay. \nAlright so i have another a2338 with liquid damage. This machine is confusing. Initially it was 5v 0.05a. So checked ppbus_aon and it was 0.7 v. Figured maybe shorted so injected voltage around 1v on f5200, got no power consumption. Plugged it in and then machine booted. As i went down the testing ladder it seems the machine will always attempt to boot make a chine and then reboot and be successful. This will happen each time. Aside from this issue the battery isnt charging. While diagnosing the battery not charging q5155 wasn't acting right. After replacing it and connected device. It did the boot and then reboot, charged the battery for a couple of seconds and then the amperage dropped, starting charging and then repeated the same behavior for a 10 seconds and then stopped charging again and hasn't since.\nPpbus_aon is 12.01 v after it started working again.\n\nWhat to do?"
    },
    {
        "post_id":101631,
        "thread_id":64208,
        "title":"820-02020 a2338 not charging\/ low ppbus_aon",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-09-19 06:58:05",
        "message":"Actually machine still works with charger?\nIs the battery recognized at least?\n\nPost SYS_DETECT and SYS_DETECT_L voltage level."
    },
    {
        "post_id":101633,
        "thread_id":64208,
        "title":"820-02020 a2338 not charging\/ low ppbus_aon",
        "user_id":33852,
        "username":"DDVL",
        "post_date":"2023-09-19 12:26:52",
        "message":"The machine does work with a charger. The battery is identified. 1% and says service now. Its has 150 cycles. \nSys detect is about 3v\nSys detect was about 0.9v\nThis was checked last night. I will check again and confim"
    },
    {
        "post_id":101636,
        "thread_id":64208,
        "title":"820-02020 a2338 not charging\/ low ppbus_aon",
        "user_id":33852,
        "username":"DDVL",
        "post_date":"2023-09-19 16:09:40",
        "message":"Alright so checked again. This is with only battery connected.\nSys detect 3.7v\nSys detect l - 0v\nLast time i checked was right after i replaced q5155 and it charged for 30 seconds. It has about a 1v on it.\n\nAlso checked ppbus aon. \nAt one point was 10.35v however the most consistent i can get is starts off at 12.30 then drops to 12.01 reboots. Starts at 12.30 and then stays at 12.01."
    },
    {
        "post_id":101638,
        "thread_id":64208,
        "title":"820-02020 a2338 not charging\/ low ppbus_aon",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-09-20 01:48:15",
        "message":"As you get \"Service Now\" message about battery, you should test with known good one.\n\nBattery may still be good, but internally locked by its processor.\nIn such case, dedicated tool like NLBA1 can solve the problem."
    },
    {
        "post_id":101642,
        "thread_id":64208,
        "title":"820-02020 a2338 not charging\/ low ppbus_aon",
        "user_id":33852,
        "username":"DDVL",
        "post_date":"2023-09-20 06:54:54",
        "message":"I will test the battery with another board and i have more batteries if this one is actually bad, but i think something else is causing this. What are you're thoughts on the restarts while booting to then successfully boot and ppbus aon being 12.01 v. I will let you know about my battery findings later.\nThis behavior to me isn't normal. Also to elaborate on when i said the device charged the battery for about 30 secs. It wasn't a consistent charge. The amerpage would go upto 2.4a and the drop to 0.20a and did that multiple times with a 5 sec gap in between and then altogether stopped."
    }
]