[
    {
        "post_id":36519,
        "thread_id":36519,
        "title":"AMD Radeon GPU for iMac 2011 - How to flash a PC card",
        "user_id":680,
        "username":"phuketmymac",
        "post_date":"2018-07-02 19:36:09",
        "message":"Hi guys,\n\nFollowing last Louis\/Duke video, I am wondering how complex that process of flashing a PC card with the Mac Bios card is?\nHas anyone tried yet?\n\nFrom what I understand you simply need to add the EFI part that the PC Bios is missing.\nBuy a similar model card for a PC laptop and flash the card.\n\nYou can even see with this link that Rominator, the GPU guru from the hackintosh scene, has installed a GTX780M in an iMac 27\" 2011: [url]http:\/\/netkas.org\/forum\/index.php\/topic,13815.0.html[\/url]\nPretty amazing!\n\nDuke, as you may know a lot on this subject, please enlight us!"
    },
    {
        "post_id":36547,
        "thread_id":36519,
        "title":"AMD Radeon GPU for iMac 2011 - How to flash a PC card",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-07-03 15:04:57",
        "message":"Yes you can use PC cards in iMacs.....BUT\n\nIf the GPU is not originally supported by the iMac model it will have no thermal control. So installing a GTX780 in a 2011 iMac will melt it down pretty quickly. Also will not work with bootcamp.\n\nI have modified Dell M5950 cards to work in 2011 iMacs and it works the same way as all other mods on Netkas are done. I don't really want to share my VBIOS as that will result in an instant run on all M5950 cards and I will have none left to buy. If you can figure it out yourself go for it, it does work."
    },
    {
        "post_id":36565,
        "thread_id":36519,
        "title":"AMD Radeon GPU for iMac 2011 - How to flash a PC card",
        "user_id":680,
        "username":"phuketmymac",
        "post_date":"2018-07-03 19:05:15",
        "message":"I understand. Thanks for the info though."
    },
    {
        "post_id":36652,
        "thread_id":36519,
        "title":"AMD Radeon GPU for iMac 2011 - How to flash a PC card",
        "user_id":680,
        "username":"phuketmymac",
        "post_date":"2018-07-04 19:36:17",
        "message":"I have been a Netkas forum user for years since I started hackintoshing back in the days (Pentium 4 in 2007)\nLately the Netkas forum was sending tons of spams message so I did close my account.\n\nNow that I need to register again, I just can't as his Captcha system is outdated.\nHave you had the same problem or were you registered before this happened?"
    },
    {
        "post_id":37482,
        "thread_id":36519,
        "title":"AMD Radeon GPU for iMac 2011 - How to flash a PC card",
        "user_id":680,
        "username":"phuketmymac",
        "post_date":"2018-07-23 19:32:24",
        "message":"Do you get the boot screen + brightness control with that card?\nWondering if you could do what some GPU gurus couldn't..."
    },
    {
        "post_id":37533,
        "thread_id":36519,
        "title":"AMD Radeon GPU for iMac 2011 - How to flash a PC card",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-07-24 18:24:43",
        "message":"Yes everything works fine in OSX. Windows has no backlight."
    }
]