{"post_id":9583,"thread_id":9583,"title":"Thinkpad t430s Ultrabay battery recognized but 0%","user_id":562,"username":"sendas","post_date":"2016-11-11 18:38:03","message":"I have a thinkpad t430s and I bought a new supposedly oem lenovo 43 ultrabay battery. When I insert the battery it is recognized that a battery was plugged in but it stays at 0%. I've tried all different combinations of reinserting it before and after reboots turning on and off the ultrabay in the bios. The CD \/ DVD ultrabay drive works fine, although since the connectors inside are totaly different I doubt that is relevant info.\n\nWhat is the best way for me to figure out if the problem is this battery or the laptop? Or could it be a software issue... \n\nany help would be hugely appreciated. One of the main reasons I acquired this laptop was the use of the ultrabay batteries.\n\nThanks"}
{"post_id":9586,"thread_id":9583,"title":"Thinkpad t430s Ultrabay battery recognized but 0%","user_id":2,"username":"dukefawks","post_date":"2016-11-11 19:35:18","message":"Sounds like a dead battery to me. Only way to test is a known good one..."}
{"post_id":9588,"thread_id":9583,"title":"Thinkpad t430s Ultrabay battery recognized but 0%","user_id":451,"username":"jgraffis","post_date":"2016-11-11 19:40:31","message":"Some of the old machines would charge the secondary battery only after the primary battery was charged 100% first, or u could remove primary battery and see if it charges then."}
{"post_id":9590,"thread_id":9583,"title":"Thinkpad t430s Ultrabay battery recognized but 0%","user_id":562,"username":"sendas","post_date":"2016-11-11 22:33:40","message":"thanks for the replies.\n\nTried removing the primary with no change. Probably is a dead battery. Going to be terrible returning it to china lol. Cant find a local source that sells the battery in canada.\n\nFor the hell of it I ordered a external battery charger."}
{"post_id":9591,"thread_id":9583,"title":"Thinkpad t430s Ultrabay battery recognized but 0%","user_id":558,"username":"arghhh","post_date":"2016-11-11 23:46:03","message":"Alternatively you could probably open it up and then source and replace the cells locally."}
{"post_id":9592,"thread_id":9583,"title":"Thinkpad t430s Ultrabay battery recognized but 0%","user_id":2,"username":"dukefawks","post_date":"2016-11-12 00:17:10","message":"You cannot just replacer the cells on these batteries. The controller with set a permanent failure flag when a cell died. Disconnecting working cells will also trip that. You will need to reset the controller chip through SMBUS commands and most of them are locked with password. All of this is not feasible for on off projects."}
{"post_id":9602,"thread_id":9583,"title":"Thinkpad t430s Ultrabay battery recognized but 0%","user_id":451,"username":"jgraffis","post_date":"2016-11-12 11:54:50","message":"RMA and get a good battery."}
