[
    {
        "post_id":18713,
        "thread_id":18713,
        "title":"[SOLVED]820-2850 will not recognize battery",
        "user_id":371,
        "username":"nate8organic",
        "post_date":"2017-04-19 23:09:37",
        "message":"got a 2850 with green light, check system info and battery not being detected. it will run off the battery, and i have voltage on SMBUS_SMC_BSA R5280 R5281 have 3.39v pin 1 and 3.38volts on 2 its the same for both. and every spot it shows up on the board i checked.  res is good 1.746 in diode mode. \n\nalso i checked a second battery already so that has been ruled out.  \n\nwould this be the smc? i checked the isl and res on 17-18 and 27-28 is good."
    },
    {
        "post_id":18720,
        "thread_id":18713,
        "title":"[SOLVED]820-2850 will not recognize battery",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-04-20 03:03:01",
        "message":"Disconnect battery indicator to rule that out. After that it will be SMC or ISL6259 or both."
    },
    {
        "post_id":18777,
        "thread_id":18713,
        "title":"[SOLVED]820-2850 will not recognize battery",
        "user_id":371,
        "username":"nate8organic",
        "post_date":"2017-04-20 11:50:19",
        "message":"okay smc was the problem.  changed it out and have an orange light.  also was wondering if this supplier is good or if you have one you are willing to recommend for smc chips.  i need 4 chips and only have 3 donor boads instock. also for the price seemed great for pre balled chips whats your take?  [url]http:\/\/www.ebay.com\/itm\/181100617512[\/url]"
    },
    {
        "post_id":18782,
        "thread_id":18713,
        "title":"[SOLVED]820-2850 will not recognize battery",
        "user_id":36,
        "username":"aprendiz",
        "post_date":"2017-04-20 12:17:26",
        "message":"I bought some from this seller and none works, i prefer to buy complete donor boards, this way im sure where SMC came from .......... Of course there is a chance that SMC dont work, for me and till now, all came in good working conditions..."
    },
    {
        "post_id":18790,
        "thread_id":18713,
        "title":"[SOLVED]820-2850 will not recognize battery",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-04-20 12:28:59",
        "message":"Of course they won't work, need to take from IDENTICAL donor board."
    },
    {
        "post_id":18862,
        "thread_id":18713,
        "title":"[SOLVED]820-2850 will not recognize battery",
        "user_id":371,
        "username":"nate8organic",
        "post_date":"2017-04-21 11:17:12",
        "message":"i'm not sure my Question was understood correctly,  I am aware the smc is Identical to each board number,  i checked the smc and i need the F2117LP20H V for a stack of the Same model boards i have on the shelf.   wondering if this supplier is selling legit chips.  But aprendiz said he bought from them and none works,  I assume you were trying to put them onto the right board model? \n\nI buy donor boards just don't feel like buying $200 of one model donor boards for $10-20 in smc chips."
    },
    {
        "post_id":18865,
        "thread_id":18713,
        "title":"[SOLVED]820-2850 will not recognize battery",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-04-21 11:20:55",
        "message":"I'm not sure you understand. All SMCs have the same part number, just the firmware is different and no way to tell on the outside which board they came from. New ones will of course never work cause they are blank."
    },
    {
        "post_id":18870,
        "thread_id":18713,
        "title":"[SOLVED]820-2850 will not recognize battery",
        "user_id":371,
        "username":"nate8organic",
        "post_date":"2017-04-21 12:26:46",
        "message":"oh, i was looking at other boards and saw the number on the smc is different.  do the speeds of the board also matter? 2.4 2.5 2.6 2.8? or do they just need to be the same board number so 820-2850 will work for all 820-2850's?  I understand now what your saying about the chips could be from any computer\/device that was using that smc chip so the firmware is not going to be right. i have not found that smc number on any other donor boards  i have in house so was thrown off i guess.  \n i will just have to buy a stack of  donor boards."
    },
    {
        "post_id":18871,
        "thread_id":18713,
        "title":"[SOLVED]820-2850 will not recognize battery",
        "user_id":371,
        "username":"nate8organic",
        "post_date":"2017-04-21 12:27:24",
        "message":"also we can mark this as solved."
    },
    {
        "post_id":18872,
        "thread_id":18713,
        "title":"[SOLVED]820-2850 will not recognize battery",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-04-21 12:28:04",
        "message":"Board number needs to match, that is all."
    },
    {
        "post_id":18873,
        "thread_id":18713,
        "title":"[SOLVED]820-2850 will not recognize battery",
        "user_id":371,
        "username":"nate8organic",
        "post_date":"2017-04-21 12:30:00",
        "message":"okay cool that's what i have always thought. Thanks Duke!"
    }
]