[
    {
        "post_id":23930,
        "thread_id":23930,
        "title":"[SOLVED]820-2915 (brrrr) new USB and DP ports",
        "user_id":547,
        "username":"rvanpruissen",
        "post_date":"2017-08-07 23:32:17",
        "message":"Hi guys, \nI've got an 820-2915 here with one USB-port and the DP port physically torn from the board. I've cleaned up the area and connections seem fine for new ports. \nAny suggestions on harvesting the ports from a donor board without melting the plastic? Just heat from below presumably?\nCheers,\nRick"
    },
    {
        "post_id":23956,
        "thread_id":23930,
        "title":"[SOLVED]820-2915 (brrrr) new USB and DP ports",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-08-08 19:27:41",
        "message":"Yeah, use ample bottom heat. Apply some leaded solder to the joints to make it melt easier too. \nAfter you fixed it you can get blamed for a dead GPU in 3 weeks....."
    },
    {
        "post_id":24225,
        "thread_id":23930,
        "title":"[SOLVED]820-2915 (brrrr) new USB and DP ports",
        "user_id":547,
        "username":"rvanpruissen",
        "post_date":"2017-08-13 02:26:38",
        "message":"I told the customer about the GPU problem and he wanted it fixed anyway. Not a very nice job to do though: it needs a lot of heat (on this scary board), some traces were broken and it needed a new current limiter for the USB ports (only outputting 2.4V). Anyway, fixed now. Thanks Duke!"
    },
    {
        "post_id":24227,
        "thread_id":23930,
        "title":"[SOLVED]820-2915 (brrrr) new USB and DP ports",
        "user_id":612,
        "username":"Atomrepair",
        "post_date":"2017-08-13 02:43:02",
        "message":"I wonder if a lower temp alloy would make this job easier. I used to have some chip-quick alloy back when I had no hot air station and it did its job for SMD's, but cleaning a throughhole of the stuff completely might be tough to do."
    },
    {
        "post_id":24235,
        "thread_id":23930,
        "title":"[SOLVED]820-2915 (brrrr) new USB and DP ports",
        "user_id":547,
        "username":"rvanpruissen",
        "post_date":"2017-08-13 23:36:38",
        "message":"I don't think the chipquick stuff would really help as it needs to replace the solder in the holes in the board. Possibly this is one of the few jobs where a desoldering pump might come in handy. However, I think it might be a few years before I have to do this repair again."
    }
]