[
    {
        "post_id":19087,
        "thread_id":19087,
        "title":"820-3330, Powers, Chimes, No Video",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-04-25 11:30:51",
        "message":"Working on an 820-3330 board that had liquid at some point. I got the board from a friend who cleans boards, but doesn't attempt any repairs. I can tell from the discolored pads that the liquid came in through the IO side of the board, and affect the area from the LCD connector and down roughly 2 inches. Nothing major at all--no corrosion or eaten solder on any ICs or caps\/resistors. Looks really good, actually, aside from ~10 red probe points. No traces visibly damaged or eaten away. LCD connector itself wasn't affected, just the area below the connector (mostly TBT area).\n\nBoard powers on and chimes fine, but has no video output and the front sleep LED stays on. It also will NOT accept a PRAM reset. I checked SMC_LID and it's 3.38v. I made sure the unit wasn't EFI locked (it's not), and I loaded a cleaned BIOS to be safe. Same behavior. Sleep LED stays lit with lid closed or opened; it doesn't get brighter or dimmer in any situation. No video on internal screen or external screen.\n\nAny ideas where to go from here?"
    },
    {
        "post_id":19093,
        "thread_id":19087,
        "title":"820-3330, Powers, Chimes, No Video",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-04-25 11:56:28",
        "message":"SMC_LID? Vcore for GPU coming on?"
    },
    {
        "post_id":19108,
        "thread_id":19087,
        "title":"820-3330, Powers, Chimes, No Video",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-04-25 14:21:43",
        "message":"Hey Duke, yeah SMC_LID is high (3.3v). Vcore is present and steady (1.10v)."
    },
    {
        "post_id":19112,
        "thread_id":19087,
        "title":"820-3330, Powers, Chimes, No Video",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-04-25 14:37:44",
        "message":"Possibly crap under firewire chip or network chip?"
    },
    {
        "post_id":19114,
        "thread_id":19087,
        "title":"820-3330, Powers, Chimes, No Video",
        "user_id":145,
        "username":"Sykulski",
        "post_date":"2017-04-25 14:51:31",
        "message":"I had the same model couple of months ago with exact same symptoms. It was crap under PCH in my case so check that also."
    },
    {
        "post_id":19119,
        "thread_id":19087,
        "title":"820-3330, Powers, Chimes, No Video",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-04-25 16:37:34",
        "message":"Yeah, since the liquid spill was in that area, I may pull those ICs and see. Otherwise I'll send this one off to more experienced hands. Thanks, you guys!"
    }
]