{"post_id":31651,"thread_id":31651,"title":"820-3115 No hard drive detect","user_id":1340,"username":"crea2k","post_date":"2018-02-16 07:55:57","message":"Hi iv got a  820-3115 and no hard drive is detected. If the drive is put into a usb caddy it works fine. I have tried a new cable to the drive, still the same problem. If I check the connector PP5V_SW_ODD is present at the connector. Im a bit lost on what to check next as iv not worked on one of these before."}
{"post_id":31653,"thread_id":31651,"title":"820-3115 No hard drive detect","user_id":1340,"username":"crea2k","post_date":"2018-02-16 08:38:12","message":"PP5V_S3_IR_R is present"}
{"post_id":31662,"thread_id":31651,"title":"820-3115 No hard drive detect","user_id":2,"username":"dukefawks","post_date":"2018-02-16 09:11:52","message":"Drive spinning up? Tried another \"new\" cable just to be sure, they are common to fail.\n\nCheck for missing caps\/resistors in the 4 data lines from J4501 to U4510."}
{"post_id":31674,"thread_id":31651,"title":"820-3115 No hard drive detect","user_id":1340,"username":"crea2k","post_date":"2018-02-16 10:32:26","message":"Iv tried the cable I ordered and the one that was in the mac when it arrived.The drive spins up fine, il check those lines now."}
{"post_id":31677,"thread_id":31651,"title":"820-3115 No hard drive detect","user_id":1340,"username":"crea2k","post_date":"2018-02-16 10:43:28","message":"All 4 resistors in spec, all inline caps measure the same. No shorts on any of the  lines."}
{"post_id":31678,"thread_id":31651,"title":"820-3115 No hard drive detect","user_id":1340,"username":"crea2k","post_date":"2018-02-16 10:54:25","message":"Just done a voltage drop to ground on the chip pins and each pair has the same reading as its partner."}
{"post_id":31681,"thread_id":31651,"title":"820-3115 No hard drive detect","user_id":1340,"username":"crea2k","post_date":"2018-02-16 11:55:20","message":"If I plug the drive in and do a continuity test from the resistors back to the drive (half plugged in with copper showing) SATA_HDD_R2D_N and SATA_HDD_R2D_P I dont get a beep SATA_HDD_D2R_C_P and SATA_HDD_D2R_C_N I do. so im going to test from the pins on the connector now back to the drive and see if that works. Il know then if its the cable'(S) or vias at fault.\n\nTested the other cable and the two same lines dont beep \/ nothing on resistance test. Im presuming they are both supposed to go all the way from the connector to the drive ?. If so il run a jumper round the kinks, as iv not got time to be waiting for more dodgy cables to turn up."}
{"post_id":31682,"thread_id":31651,"title":"820-3115 No hard drive detect","user_id":1340,"username":"crea2k","post_date":"2018-02-16 12:22:27","message":"Very interesting !. so iv just scraped the coating off the cable either side of the kinks and all cables beep fine apart from the two outer lines that are nearest to the screw hole. So I think we have found our common point of failure. those two lines are the two above data lines. So just going to run a jumper for the two lines and call it fixed."}
{"post_id":31743,"thread_id":31651,"title":"820-3115 No hard drive detect","user_id":1340,"username":"crea2k","post_date":"2018-02-17 17:05:20","message":"Bingo !, that worked as expected. I just scraped down to the copper on the two traces nearest to the screw hole on each side of the kink in the cable. Ran a jumper for each of the two lines, circuit board masked it, job done !. Once its screwed down its on the bottom side so you cant  even tell its been repaired now, works just fine. So the other cable that supposed to be new is being sent back as it has the same problem."}
{"post_id":31744,"thread_id":31651,"title":"820-3115 No hard drive detect","user_id":2,"username":"dukefawks","post_date":"2018-02-17 17:09:44","message":"It is very common, you should have these in stock. Real new ones come unfolded and should not be bend to sharply."}
{"post_id":31745,"thread_id":31651,"title":"820-3115 No hard drive detect","user_id":1340,"username":"crea2k","post_date":"2018-02-17 18:25:33","message":"Iv only just stated doing them and its the first one iv seen with a flex cable, all the other 4 iv got here are ssd slots  on the board. Il see if I can find any new ones that are actually new and just not advertised as such. Just fixing the bad traces seems to sort the problem though."}
