[
    {
        "post_id":22266,
        "thread_id":22266,
        "title":"Macbook pro A1502 no screen",
        "user_id":442,
        "username":"LaptopRepair",
        "post_date":"2017-06-27 08:34:34",
        "message":"Hello;\n\nAfter more then 5 months, here I am back with a niew case.\n\nI ve got a macbook that is not powering on. After check I ve found that the adapter was dead. Now I ve no replacement adapter I ve just soldered the defective macbook adapter plug to a normal laptop adapter that has 19V and 4A7. The green led was on then it goes to orange. But I could not power the mac.\n\nI ve used the power supplay to check if there is any current consumption. The amps begin increasing from 0A till 3A but and the voltage stays on 19V. But still the mac could not be powered on.\n\nI ve made some checks on the board and the 5V coils deliver 5V for 1 second then it waits 4 seconds, continiously.\n\n\nPlease help.\n\nGreeting\n\nRachid"
    },
    {
        "post_id":22272,
        "thread_id":22266,
        "title":"Macbook pro A1502 no screen",
        "user_id":637,
        "username":"TCRScircuit",
        "post_date":"2017-06-27 11:09:18",
        "message":"Soldering the MagSafe adaptor to a regular laptop power supply was probably a stupid thing to do. Get a genuine apple charger."
    },
    {
        "post_id":22277,
        "thread_id":22266,
        "title":"Macbook pro A1502 no screen",
        "user_id":557,
        "username":"MDY",
        "post_date":"2017-06-27 14:27:52",
        "message":"SMC need to talk with ac adapter of course."
    },
    {
        "post_id":22292,
        "thread_id":22266,
        "title":"Macbook pro A1502 no screen",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-06-27 18:31:43",
        "message":"This should actually work, the ID chip is in the magsafe connector, but yeah, you should have a known good ORIGINAL APPLE 85W test adapter.\nThe usual checks should be done. PPBUS, 3V3_s5, inspect for corrosion. \nThe dead adapter should of course NOT have been a 45W. Needs to be 60W or 85W!"
    },
    {
        "post_id":22304,
        "thread_id":22266,
        "title":"Macbook pro A1502 no screen",
        "user_id":442,
        "username":"LaptopRepair",
        "post_date":"2017-06-28 10:14:05",
        "message":"PPBUS_G3H is 12V66 with both the mac adapter and the PSU using the magsafe.\n\nAfter unplugging the board and made some mesurements. And connected it again to a mac adapter it boots up. But it gives an error and shut down after loging to the gast account. The OS is in italian. So I couldn t understood what the cause of the error.\n\nAfter a second try to boot it up. I get now 3 beeps continiously. with a black screen.\n\nWhat can be the problem?"
    },
    {
        "post_id":22327,
        "thread_id":22266,
        "title":"Macbook pro A1502 no screen",
        "user_id":442,
        "username":"LaptopRepair",
        "post_date":"2017-06-29 09:51:00",
        "message":"If posting one question in 4 a 5 months while paying a monthly fee of 29$, I expect at least getting answer within a day. Other wise I will just stop this membership. Because this should be a win win situation."
    },
    {
        "post_id":22328,
        "thread_id":22266,
        "title":"Macbook pro A1502 no screen",
        "user_id":316,
        "username":"G.Beard",
        "post_date":"2017-06-29 10:12:20",
        "message":"People have personal lives. Anything could be going on."
    },
    {
        "post_id":22351,
        "thread_id":22266,
        "title":"Macbook pro A1502 no screen",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-06-29 12:33:14",
        "message":"You posted a comment and not a reply. I have told multiple times that I do not know that you did that. DO NOT USE COMMENTS.\n\n3 BEEPS would indicate a RAM issue. This board was probably dropped. You can try to reflow the RAM, but this is probably a hopeless case unless you want to pull all the RAM chips and check for broken traces."
    },
    {
        "post_id":22389,
        "thread_id":22266,
        "title":"Macbook pro A1502 no screen",
        "user_id":442,
        "username":"LaptopRepair",
        "post_date":"2017-07-01 01:57:56",
        "message":"Like I ve said, I ve not been hier for more then 4 months. Thus, I didn t see your requestion \"DO NOT USE COMMENTS\". Anyway...\n\nI ve reflowed all the RAM chips but the result is the same. 3 beeps after an interval of 4 seconds, continiously."
    },
    {
        "post_id":22390,
        "thread_id":22266,
        "title":"Macbook pro A1502 no screen",
        "user_id":461,
        "username":"Gurmon",
        "post_date":"2017-07-01 02:06:40",
        "message":"Some of us actually PAY in here to provide help....thought about that...\n\n1) Did you check if RAM has correct voltage ? \n2) Start pulling those RAM chips off and Reball. I would just replace all the RAM to save time.\n\nOf course checking for broken traces is going to be a pain.\n\nGood luck."
    },
    {
        "post_id":22402,
        "thread_id":22266,
        "title":"Macbook pro A1502 no screen",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-07-01 05:37:59",
        "message":"Pull all RAM chips and inspect for trace\/pad damage. If none are found replace all RAM chips with NEW chips. If that does not fix it the problem is in\/under the CPU."
    }
]