[
    {
        "post_id":94899,
        "thread_id":63391,
        "title":"820 2915",
        "user_id":35752,
        "username":"Anterweb",
        "post_date":"2022-12-17 01:56:57",
        "message":"This is driving me nuts dude!\n\nCame in with classic faulty amd GPU, and a crack in the glass of the screen( Screen still worked fine but glass cracked )\n\nRemoved R8911 and killed gpu with medusa and set an EFI password all worked great so set about changing the screen .\n\nPut on what I had marked up as a good know screen fit it mac turns on but I get no screen output at all, Presume display is bad and try another as I have a pile of them, same thing on 3 different LCD panels. I then put back original screen with cracked glass same result, Powers on I hear a chime fan spin but no display!\n\n( Im concerned that while rushing to get this job done I may have forgotten to disconnect the battery when removing LCD ribbon! )\nTried Pram reset with medusa and re applying AMD disable same problem,. \n\nAlso cant try external display due to medusa killing AMD chip.,\n\nWhat would be the next step in fault finding this please?"
    },
    {
        "post_id":94906,
        "thread_id":63391,
        "title":"820 2915",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-12-17 06:50:44",
        "message":"Need to post some voltage and signals on the LVDS connector.\nCheck pins 3, 4, 6, 7; LCD connected, of course.\nBe sure no knocked off components, or broken traces near J9000."
    },
    {
        "post_id":94933,
        "thread_id":63391,
        "title":"820 2915",
        "user_id":35752,
        "username":"Anterweb",
        "post_date":"2022-12-18 09:44:21",
        "message":"3 - 0v \n4 - 3.3v\n6 - 3.26v\n7 - 3,26v\n\nI followed pin 3 back on the board all the way to R9678,  where i get\n\nGMUX_S3_PD_GND = 2.67v\nLCD_PWR_EN = 11.9mV\n\nBit stuck now?"
    },
    {
        "post_id":94934,
        "thread_id":63391,
        "title":"820 2915",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-12-18 11:26:53",
        "message":"Did you measure with LCD connected?\nDid you test known good LCD assembly?"
    },
    {
        "post_id":94936,
        "thread_id":63391,
        "title":"820 2915",
        "user_id":35752,
        "username":"Anterweb",
        "post_date":"2022-12-18 12:41:19",
        "message":"Yes and yes"
    },
    {
        "post_id":94939,
        "thread_id":63391,
        "title":"820 2915",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-12-18 18:07:28",
        "message":"Did you get any kind of image with GPU enabled?\nIf yes, put back R8911 and flash backup BIOS.\nLet see what happens."
    },
    {
        "post_id":94959,
        "thread_id":63391,
        "title":"820 2915",
        "user_id":35752,
        "username":"Anterweb",
        "post_date":"2022-12-19 09:23:28",
        "message":"Ive only got bios files for this with GPU disabled., Can I just reset pram to reverse medusa gpu disable? Im sure there is a medusa setting to force pram reset."
    },
    {
        "post_id":94964,
        "thread_id":63391,
        "title":"820 2915",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-12-19 10:51:20",
        "message":"\"Ive only got bios files for this with GPU disabled\"\nI was talking about original BIOS, if that gave some image at beggining.\nDidn't make backup???"
    },
    {
        "post_id":94989,
        "thread_id":63391,
        "title":"820 2915",
        "user_id":35752,
        "username":"Anterweb",
        "post_date":"2022-12-20 13:44:08",
        "message":"OK, as I do so many of these identical macs the 2915, ( my wife is a school teacher and they have hundreds of these in her school so I'm always getting asked to repair them.) \n\nI did have a backup bios, put back R8911 and got image with original screen, \n\nRe flashed bios removed R8911 all good. Used a different new screen and its all fixed. \n\nNot sure what happened on this one but its working sweet now. Thanks for your helps bro"
    }
]