[
    {
        "post_id":65404,
        "thread_id":60035,
        "title":"820-00850 Can't get past Activation Screen",
        "user_id":135,
        "username":"bjf",
        "post_date":"2020-09-20 17:17:40",
        "message":"I have a semi-functional 820-00850 that is stuck on the Activation Screen. I attached a picture. I'm talking to the previous owner so they went into their iCloud account and set it to delete when it makes contact with the internet (see attached screenshot). It keeps coming back to the Activation screen every time I try to erase it manually and won't erase automatically. Any ideas? I'm wondering if it's because the clock is not set and it can't connect to the Apple servers? I'm out of ideas otherwise."
    },
    {
        "post_id":65409,
        "thread_id":60035,
        "title":"820-00850 Can't get past Activation Screen",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2020-09-21 01:40:51",
        "message":"Have you booted from WLAN with the CMD+ALT+R? It should then be able to erase and reinstall it. Also they should remove the device from their iCloud just to be sure."
    },
    {
        "post_id":65430,
        "thread_id":60035,
        "title":"820-00850 Can't get past Activation Screen",
        "user_id":135,
        "username":"bjf",
        "post_date":"2020-09-21 11:19:24",
        "message":"Thanks, I thought about that, but I didn't think that would fix the clock\/Apple server issue. I'll give it a shot though. I'm out of ideas at this point."
    },
    {
        "post_id":65432,
        "thread_id":60035,
        "title":"820-00850 Can't get past Activation Screen",
        "user_id":135,
        "username":"bjf",
        "post_date":"2020-09-21 12:19:20",
        "message":"It skips past the screen asking me for wifi, so I know it's using WLAN now, but I still end up back at that same screen (see picture). Do you think if she gave me the password for the computer itself maybe I could get somewhere that way? I can't see how it would help, but I'm not sure what other options I have."
    },
    {
        "post_id":65435,
        "thread_id":60035,
        "title":"820-00850 Can't get past Activation Screen",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2020-09-21 13:33:14",
        "message":"The machine is linked to an Apple ID. They either need to give you account ID and password or remove the machine from their iCloud. This is no hardware issue."
    },
    {
        "post_id":65437,
        "thread_id":60035,
        "title":"820-00850 Can't get past Activation Screen",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2020-09-21 13:47:56",
        "message":"Yeah, and having them wipe it via their iCloud account on icloud.com can be VERY hit or miss. I think it's worked properly maybe...twice...for us. It's always easiest to do it from the unit itself via their login info. Just tell them this is the new reality of board repair; iCloud login info will be necessary in many cases. It is what it is."
    },
    {
        "post_id":65439,
        "thread_id":60035,
        "title":"820-00850 Can't get past Activation Screen",
        "user_id":135,
        "username":"bjf",
        "post_date":"2020-09-21 14:03:17",
        "message":"It's definitely not a hardware issue. We're just stuck because she doesn't want to give out her passwords or remove it from her account until she knows it's deleted, which is reasonable. But I literally can't tell her anything else to do because all the conventional paths are failing. [USER=515]@SMMRepair[\/USER] Thanks for the input, I have about 35 or 40 2018 and 2019 computers I've purchased that I've been avoiding for this reason, so I'm just getting into this issue with T2 and DFU stuff and haven't had to go through this yet. My apprehension was warranted, it blows. I guess I'll try to convince her to send the info. I have a feeling this functioning board is going in the garbage though unfortunately."
    },
    {
        "post_id":65440,
        "thread_id":60035,
        "title":"820-00850 Can't get past Activation Screen",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2020-09-21 14:26:26",
        "message":"Yep this is literally Apple's plan. Forcefully encourage users to log into their iCloud when setting up a T2 unit; enable boot security by default; remove data-recovery lifeboat connector; and make BIOS\/SPI inaccessible.\n\nYou should be able to wipe the unit without the iCloud information; you will of course need the MacOS login info, but you should not need iCloud info to erase the unit. Once erased, show the customer the drive info if they're really distrusting, then ask them for the iCloud info so you can remove it from the board\/unit. Tell them to go change their iCloud password before giving it to you, then they can just change it back once you've removed from the unit. It's definitely a tight rope to walk, but we've got to educate them on how this all works and why it's necessary. I tell customers with T2 units upfront that there's a very good possibility we will need their password(s) at some point. Hopefully we won't, but some things simply require it. Tell them you wouldn't risk your entire business just to log into some random customer's iCloud account. You're still going to have some customers who refuse, but act accordingly; If I'm buying a board\/unit for parts, and I want the iCloud info removed, I tell them, \"I'll pay you $100.00 if you don't remove your iCloud, or $300.00 if you do\". They tend to prefer the higher trade-in amount."
    },
    {
        "post_id":65442,
        "thread_id":60035,
        "title":"820-00850 Can't get past Activation Screen",
        "user_id":135,
        "username":"bjf",
        "post_date":"2020-09-21 14:51:46",
        "message":"Thanks, that's great info. Yeah, I realized the other night after starting to work on these that I'm going to have to add a new question for our purchasing site that asks if they've removed it from their iCloud account and have it add or deduct automatically accordingly. This is too crazy. I never thought something could make the garbage 2016\/2017 models look so good but T2, and no lifeboat, has managed to do so."
    },
    {
        "post_id":65453,
        "thread_id":60035,
        "title":"820-00850 Can't get past Activation Screen",
        "user_id":135,
        "username":"bjf",
        "post_date":"2020-09-22 00:05:25",
        "message":"Ok, she's not willing to do either scenario where she gives out her passwords. I'm wondering if I did a DFU restore and deleted the SSD that way if that might allow this to progress. Maybe it might signal to her account that it's been deleted and then she can remove it? Is there any harm in doing a DFU restore? Any reason not to?"
    },
    {
        "post_id":65475,
        "thread_id":60035,
        "title":"820-00850 Can't get past Activation Screen",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2020-09-22 08:02:06",
        "message":"Unfortunately restoring the unit won't be possible if it's locked. You can get into DFU and begin the restore process, but it will quickly fail and a padlock will show on your AC2 unit. The locked unit will just boot to a connect-to-wifi screen and eventually get back to the activation lock screen. Honestly, if she's that paranoid about it (which is understandable), then I'd just let it go. Either pay her parts-board pricing, or give it back to her. Not worth the hassle because there is literally no workaround at all without the passwords (or without having her figure out how to properly wipe\/restore it remotely). It CAN work remotely via WiFi, but for some reason it's not a smooth or straightforward process. It can be done, though. Just might take a bit of hand-holding on your part."
    },
    {
        "post_id":65481,
        "thread_id":60035,
        "title":"820-00850 Can't get past Activation Screen",
        "user_id":135,
        "username":"bjf",
        "post_date":"2020-09-22 10:49:34",
        "message":"Ok, thanks for the extra info. Unfortunately, she's already been paid so her interest in solving this is minimal at best. The nature of the business is that we pay people when the computer arrives and checks out model-wise\/year-wise, but we don't actually work on these for days and most times, weeks. Now that I'm adding the extra iCloud question we'll avoid this more often, but unfortunately, it looks like it's just going to be a terrible surprise that's encountered after \"fixing\" these models."
    },
    {
        "post_id":65562,
        "thread_id":60035,
        "title":"820-00850 Can't get past Activation Screen",
        "user_id":135,
        "username":"bjf",
        "post_date":"2020-09-23 11:23:48",
        "message":"To finish the story, in case it might help someone else in the same situation, I made a 3-second video that showed her activation lock screen and then  the empty Startup Disk screen (to illustrate to her that the drive was indeed deleted by Erase Mac option in the recovery.) I sent that to her and despite not being responsive to the last two emails, she sent one back saying she had removed it from her account. All good now."
    },
    {
        "post_id":65635,
        "thread_id":60035,
        "title":"820-00850 Can't get past Activation Screen",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2020-09-24 08:20:07",
        "message":"That's great to hear! Glad you got it figured out; quite a relief I'm sure. :)"
    }
]