{"post_id":60597,"thread_id":59462,"title":"820-01598: Power button not responding","user_id":1984,"username":"macRepairAmb","post_date":"2020-06-07 15:35:18","message":"I have a macbook pro 2019 (820-01598) with touch ID and Touch Bar that the power button is not responding. The touch ID itself works, but can get it to power on with the power button. It powers on if i connect the charger to it with the battery unplugged. Original issue was liquid spill but can't find any corrosion damage.\nI swapped out the headphone jack\/power connection board, which didn't fix the issue.\nThe laptop powers up and runs without any issue.\nI've not been able to find a board view for this model, i'm assuming there's none.\n\nCompared to 820-00840 J4810 pin 15, i'm get 2.2v instead of 3.3v.\n\nAny suggestions. Will A1706 touch ID\/Power button work on this model (i know this will mean the touch ID portion won't work), as i'm about to order that to test the power button? The only other option is to order one from china."}
{"post_id":60598,"thread_id":59462,"title":"820-01598: Power button not responding","user_id":682,"username":"2informaticos","post_date":"2020-06-07 16:10:45","message":"Some time ago, one member post few videos about recovering power button from Touch ID; in case of liquid spill.\nYou should find something searching on the forum..."}
{"post_id":61650,"thread_id":59462,"title":"820-01598: Power button not responding","user_id":1984,"username":"macRepairAmb","post_date":"2020-06-30 13:30:36","message":"None of the videos i found worked. \n\nSo I found the schematic, still searching for board view. Anyway, J6600 which is the same connector on 820-00840 J6600, \npin 21 - PMU_ONOFF_R_L_CONN\n\nthis pin is reading 1.7ohms with or without the power\/audio jack cable connected. I'm assuming this won't be a normal measurement for this pin."}
{"post_id":61658,"thread_id":59462,"title":"820-01598: Power button not responding","user_id":682,"username":"2informaticos","post_date":"2020-06-30 18:18:21","message":"I don't have 01598 schematic.\nIn 00840, I don't see that signal on J6600..."}
{"post_id":61670,"thread_id":59462,"title":"820-01598: Power button not responding","user_id":1984,"username":"macRepairAmb","post_date":"2020-06-30 21:35:36","message":"Yeah that signal isn't on 00840 board. J6600 is where the power\/touchID and audio jack goes into. I checked in comparison to 00850 that has the same signal and touchID, the measurement was a large resistance and not the small ground resistance i have on the bad board. Unfortunately i'm now trying to find what looks like a flipflop U6940 (same on the 00850 board)."}
{"post_id":61682,"thread_id":59462,"title":"820-01598: Power button not responding","user_id":682,"username":"2informaticos","post_date":"2020-07-01 05:06:09","message":"PMU_ONOFF_R_L_CONN cannot be shorted to ground.\nIn 00850 board, there is R4911; remove it to discard U6940 issue..."}
{"post_id":61700,"thread_id":59462,"title":"820-01598: Power button not responding","user_id":1984,"username":"macRepairAmb","post_date":"2020-07-01 08:50:37","message":"Yep that’s the resistor I’m searching for. A little tricky with not board view."}
