[
    {
        "post_id":54148,
        "thread_id":54148,
        "title":"usb installer \"broken\"",
        "user_id":1101,
        "username":"ielectron",
        "post_date":"2019-11-04 06:36:37",
        "message":"recently i tried to format and install osx 10.13 to the newer macbook with type c connectors, and i can boot up from usb, format the ssd, and when i want to install osx it says that this installer is damaged, then i had another 10.13 stick, the usb-A one, tried with type c adapter, same thing, can boot and format but not install, and i had to to internet recovery which worked, and those sticks are working fine on a a1502 for ex. \n\ndo i have to recreate those usb installers in a different way to make them work?"
    },
    {
        "post_id":54153,
        "thread_id":54148,
        "title":"usb installer \"broken\"",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-11-04 08:50:17",
        "message":"Did you set the correct time for the machine?\nDo it in terminal, before installing OSX."
    },
    {
        "post_id":54155,
        "thread_id":54148,
        "title":"usb installer \"broken\"",
        "user_id":1057,
        "username":"piernov",
        "post_date":"2019-11-04 09:50:01",
        "message":"[url]https:\/\/support.apple.com\/en-us\/HT208052[\/url]"
    },
    {
        "post_id":54559,
        "thread_id":54148,
        "title":"usb installer \"broken\"",
        "user_id":1101,
        "username":"ielectron",
        "post_date":"2019-11-18 08:51:41",
        "message":"for some reason i had to recreate all my usb installer, 10.13 is from app store, so when it downloads that is an .app , but when i go to ur link above i can download 10.11 but that is .dmg, how can i make a usb installer from that? i went in disk utility and tried to restore but it complains about some scanning info\n\ncan i just simply copy the .dmg on usb or that wont be bootable?"
    },
    {
        "post_id":54560,
        "thread_id":54148,
        "title":"usb installer \"broken\"",
        "user_id":1101,
        "username":"ielectron",
        "post_date":"2019-11-18 09:27:40",
        "message":"ok, so the .dmg i downloaded is compressed, and i have to double click open it, then \"install\" it, but that is not actualy installing it,   which will uncompress it to a .app file, now i can make usb iunstaller"
    }
]