[
    {
        "post_id":90904,
        "thread_id":62877,
        "title":"820-2850-A Black screen - No Display, No Chime, Fans Spin, Green Light on Charger",
        "user_id":39927,
        "username":"Vekkar",
        "post_date":"2022-07-09 18:17:15",
        "message":"Hello,\n\n I have a 2010 15\" Macbook Pro that was experiencing random shutdowns and reboots during use. It has progressed to the point where it doesn't even boot into recovery mode or display anything on the screen when powering on. When the charger is plugged in it is green and when the power button is pressed the screen remains black but the fans start up with no chime noise. I've tried removing the RAM to see if I could get it to beep at me but nothing beeps or makes noise with the RAM or SSD removed. \n\n I initially thought it was the kernel panic issue tied to the tantalum capacitor near the GPU so I swapped it out with a new polymer capacitor but the issue still persists exactly the same.\n\nI have provided a gallery of photos of the board back and front and up close near each section of the board:\n\n[URL unfurl=\"true\"]https:\/\/postimg.cc\/gallery\/ktfD9hQ[\/URL]\n\nI am new to this so I have not done anything else outside of what I mentioned here. I also just subscribed to the repair forum subscription as well.\n\nAny help would be appreciated!"
    },
    {
        "post_id":90909,
        "thread_id":62877,
        "title":"820-2850-A Black screen - No Display, No Chime, Fans Spin, Green Light on Charger",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-07-10 03:36:37",
        "message":"First of all, welcome to the forum!\n\nYou should have changed C9560 early, when the problem appeared.\nSomething more happened, as the machine doesn't boot now.\nC9560 doesn't help with actual problem, but is good to have it changed anyway.\n\nCheck if all voltages appear, especially CPU core (L7415\/25).\nPLT_RESET_L goes high?\n\nYou may have problems with GPU; try to heat for test."
    }
]