{"post_id":63585,"thread_id":59825,"title":"820-00281 Wont post, PPM002 error","user_id":7922,"username":"tcampbell34","post_date":"2020-08-11 12:24:21","message":"Hello. I got a 820-00281 board that looks very clean.I do not find any damage on the board at all. This macbook turns on, but will not boot to anything. When I try to start normally, it boots maybe about 40% and then turns off. If I hold the option key, The internal SSD does show up and if I try to boot into a Catalina installer, it makes it to the part where the grey background shows up on the installation screen, but then the computer turns off again. Same thing if you try and boot to USB copy of OSX. I was able to run diagnostic on this and it fails with error PPM002 \"There may be an issue with a memory module\". I then booted the board using a USB stick with memtest on it and ran the test and that also seems to fail. It stopped at 90% of the test with only 33% pass and over 10,000 errors. Sounds like a memory issue so would you recommend trying to reflow the ram chips or something else?"}
{"post_id":63588,"thread_id":59825,"title":"820-00281 Wont post, PPM002 error","user_id":682,"username":"2informaticos","post_date":"2020-08-11 14:28:50","message":"Looks like RAM issue, but can also be CPU problem.\nYou can try to reflow DDR chips for test; be aware, no more than 180-200 degree, no need to melt the balls.\n\nDid you try Windows, or Linux Live USB?"}
{"post_id":63645,"thread_id":59825,"title":"820-00281 Wont post, PPM002 error","user_id":7922,"username":"tcampbell34","post_date":"2020-08-12 18:35:35","message":"I tried to reflow ram chips at 200 degrees Celsius for 30 seconds each chip, but no change. Tried to boot into windows from and USB drive, and it actually made it to the login screen. As I was typing my password to login, it crashed on me with stop code MEMORY_MANAGEMENT. Is there anything else I can try with this one?"}
{"post_id":63662,"thread_id":59825,"title":"820-00281 Wont post, PPM002 error","user_id":682,"username":"2informaticos","post_date":"2020-08-13 06:24:46","message":"Clean ME region.\nIf still the same, try full known good working BIOS; clean ME, of course."}
{"post_id":64029,"thread_id":59825,"title":"820-00281 Wont post, PPM002 error","user_id":7922,"username":"tcampbell34","post_date":"2020-08-21 16:19:11","message":"I had already tried that before posting but it did not help. I was checking some measurements on the board in diode mode and found that PP1V5R1V35_S0_GPU_MEM measures .031 in diode mode on this board and .165 on a good board. I still have 1.4 volts on that line, but the low diode mode reading makes me think UA400\/450, UA500\/550 are bad. Question I have is can these chips be replaced, or do they have some kind of firmware? I have the tools to do so, and I found a seller on Aliexpress that sells them. [URL='https:\/\/www.aliexpress.com\/item\/33021990914.html?spm=a2g0o.productlist.0.0.280126e9deYDiA&algo_pvid=3700db00-0abf-40dd-9d74-7af2c44bd099&algo_expid=3700db00-0abf-40dd-9d74-7af2c44bd099-5&btsid=0ab6f83115980445690598657ef8b7&ws_ab_test=searchweb0_0,searchweb201602_,searchweb201603_']Samsung K4G41325FE-HC28[\/URL]"}
{"post_id":64030,"thread_id":59825,"title":"820-00281 Wont post, PPM002 error","user_id":803,"username":"SoloHarty","post_date":"2020-08-21 16:34:12","message":"Hi, by any chance could you let me know the diode mode readings of:\n\nPPVCC_S0_CPU \nPPVCORE_S0_GPU \n\non your good board? I dont have one to test.\n\nThanks."}
{"post_id":64032,"thread_id":59825,"title":"820-00281 Wont post, PPM002 error","user_id":7922,"username":"tcampbell34","post_date":"2020-08-21 18:04:43","message":"PPVCC_S0_CPU - 0.003 (5.5 ohm)\nPPVCORE_S0_GPU - 0.001 (2.3 ohm)"}
{"post_id":64034,"thread_id":59825,"title":"820-00281 Wont post, PPM002 error","user_id":682,"username":"2informaticos","post_date":"2020-08-21 19:05:44","message":"\"PP1V5R1V35_S0_GPU_MEM measures .031 in diode mode on this board and .165 on a good board.\"\nBoth boards have the same GPU type and VRAM size?\nIf yes, this could be sign of bad GPU, or VRAM chip."}
{"post_id":64039,"thread_id":59825,"title":"820-00281 Wont post, PPM002 error","user_id":7922,"username":"tcampbell34","post_date":"2020-08-22 11:30:25","message":"Yea both boards are identical except that this one has Samsung ram and my other board has Elpida ram, but they are both 4GB chips. Was going to try removing each chip one by one and then seeing if the diode mode value goes up. If I do find that only one of the chips are bad, can I replace that one with a Elpida ram chip even though the other 3 are Samsung?"}
{"post_id":64043,"thread_id":59825,"title":"820-00281 Wont post, PPM002 error","user_id":682,"username":"2informaticos","post_date":"2020-08-22 14:30:12","message":"\"Was going to try removing each chip one by one and then seeing if the diode mode value goes up\"\nYou've forgot UA000..."}
{"post_id":67160,"thread_id":59825,"title":"820-00281 Wont post, PPM002 error","user_id":7922,"username":"tcampbell34","post_date":"2020-10-26 22:23:40","message":"I started working on this board again because I got a donor board in that had a RAM chip still on it. 0.031 is a good diode mode measurement for PP1V5R1V35_S0_GPU_MEM. I confirmed this with a few other boards. I knew the issue was with one of the RAM chips so I replaced one at a time and tested to see if it fixed the error. After replacing U2500, it passed AD and I was able to boot into recovery and install Catalina on the drive. Everything seems to be working fine now. Thanks."}
{"post_id":67167,"thread_id":59825,"title":"820-00281 Wont post, PPM002 error","user_id":682,"username":"2informaticos","post_date":"2020-10-27 04:51:15","message":"You're welcome, good job; not easy at all..."}
