{"post_id":1013,"thread_id":1013,"title":"MBP 820-2936 with Short to Ground on PP3V42_G3H and No Orange or Green Light.","user_id":80,"username":"rany","post_date":"2016-04-04 15:47:13","message":"Have a 13\" MBP 820-2936 with short to ground on PP3V42_G3H and obviously no orange - nor green light.\nI connected a charger and got no signs of heat.\nSo I followed the short and mis-diagnosed and removed the SMC but the short remained. Before re-installing the SMC, can I inject 3V42 on the line, say on pin 2 of L6995? (Pin 1 is not shorted to ground).\nHow about ISL? The old one was bad and I removed it. Should I solder a new one in place first? Would like to know for this case and future reference what I can leave off when injecting current.\nNot sure if helpful, but I measured resistivity of PP3V42_G3H to ground and found it to be around 33 Ohm on pretty much most parts of the line.\nThe board is not WD. It seems it was killed by a bad MagSafe connector or charger. It was worked on before, as it came with the B\/L driver missing. The owner said it was harvested and asked me to put one back if the board powers up."}
{"post_id":1046,"thread_id":1013,"title":"MBP 820-2936 with Short to Ground on PP3V42_G3H and No Orange or Green Light.","user_id":1,"username":"larossmann","post_date":"2016-04-04 22:26:51","message":"Put a good SMC and ISL on there, remove L6995, and put 3.425v from bench power supply on pin 2 of L6995, and then plug magsafe in. Anything happen?"}
{"post_id":1047,"thread_id":1013,"title":"MBP 820-2936 with Short to Ground on PP3V42_G3H and No Orange or Green Light.","user_id":1,"username":"larossmann","post_date":"2016-04-04 22:28:34","message":"There is a cap on audio around that spongey foamy thingie by the BIL connector that always gives PP3V42_G3H a slight short to ground but since this has been fucked with it could be anything at this point. :( I would just run it with a strong PSU filling in for PP3V42_G3H, even if there is a minor short somewhere it will drive it and it should turn on unless something very important is fucked. There isn't much to PP3V42_G3H, it powers the SMC, the ISL6259, SMC_RESET circuitry, onewire circuitry, and some audio crap, there isn't much to fuck up there."}
{"post_id":1053,"thread_id":1013,"title":"MBP 820-2936 with Short to Ground on PP3V42_G3H and No Orange or Green Light.","user_id":80,"username":"rany","post_date":"2016-04-04 22:44:27","message":"Will try today! Thanks!"}
{"post_id":1112,"thread_id":1013,"title":"MBP 820-2936 with Short to Ground on PP3V42_G3H and No Orange or Green Light.","user_id":80,"username":"rany","post_date":"2016-04-06 06:56:05","message":"[USER=\"1\"]larossmann[\/USER] installed ISL and SMC and removed L6995, and injected 3.4V on pin 2. Got heat at U6990. Removed it and removed C6994 and found that pin 9 is still shorted to ground and resistivity of the line to ground is still 33OHM. So the short to ground is down the line.\nCan I keep U6990 off the board and re-inject 3V42 on pin 2 of L6995? I would think so...\nEDIT: after looking at the schematics I decided to go ahead and inject 3V42 from IBM desktop power supply because my bench DCPS can dump 20 AMPS in case of short. I found U5755 to be shorted (very slightly warming up). Removing it relieved the short. Gonna test and report back."}
{"post_id":1113,"thread_id":1013,"title":"MBP 820-2936 with Short to Ground on PP3V42_G3H and No Orange or Green Light.","user_id":80,"username":"rany","post_date":"2016-04-06 06:59:07","message":"Oh and did not find any shorted cap on that line near battery level indicator connector, if that's what you mean. BIL is new to me. Unless you can give me the cap # to double check..?"}
{"post_id":1182,"thread_id":1013,"title":"MBP 820-2936 with Short to Ground on PP3V42_G3H and No Orange or Green Light.","user_id":61,"username":"wrbailey","post_date":"2016-04-07 10:14:35","message":"I had the U5755 shorted on a 820-2915 board the other day. Always interesting to start noticing common points of weakness. (Glad that failed than something more important)"}
