[
    {
        "post_id":14794,
        "thread_id":14794,
        "title":"[SOLVED]820-3115 Boots, but no trackpad, fan on high.",
        "user_id":135,
        "username":"bjf",
        "post_date":"2017-02-14 13:48:30",
        "message":"I have an 820-3115 board without obvious liquid-damage that boots fine but has no trackpad. Testing with known-good trackpad and cable plugged in. 5V is present going to U5805. Boost circuit is not working. Z2_BOOST_EN is at 0.043V. The boost circuit area looks clean. R5811 is measuring fine at 100KΩ. Any thoughts on why Z2_BOOST_EN is not coming on?"
    },
    {
        "post_id":14798,
        "thread_id":14794,
        "title":"[SOLVED]820-3115 Boots, but no trackpad, fan on high.",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2017-02-14 14:07:11",
        "message":"Firstly trackpad function and trackpad sensor are totally different, even though they both go to the trackpad. You can have a working trackpad with a bad TS0P sensor, and you can have a trackpad that doesn't track but with TS0P sensor working. TS0P sensor failing is what causes fan to be on high.\n\nWhat is the history of the board? Water, drop, DIY repair? What is diode mode measurement on pin 2 of R5806, red probe ground, black probe on pin 2(no power applied of course)? \n\nThis is usually caused from trackpad not being detected sometimes from beat up connector, or R5806 being ripped off by fingernail."
    },
    {
        "post_id":14800,
        "thread_id":14794,
        "title":"[SOLVED]820-3115 Boots, but no trackpad, fan on high.",
        "user_id":135,
        "username":"bjf",
        "post_date":"2017-02-14 14:22:02",
        "message":"Pin 2 of R5806 measures fine (0.560) and the whole trackpad circuit area looks good. No physical damage. I removed and reattached R5806 and R5811 to make sure there was nothing hiding underneath them.  I was told it was not a spill and I'm 92% sure that's right. Connector looks good."
    },
    {
        "post_id":14812,
        "thread_id":14794,
        "title":"[SOLVED]820-3115 Boots, but no trackpad, fan on high.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-02-14 15:31:00",
        "message":"Check pin 18 and 22 of J5800 for correct voltage."
    },
    {
        "post_id":14934,
        "thread_id":14794,
        "title":"[SOLVED]820-3115 Boots, but no trackpad, fan on high.",
        "user_id":135,
        "username":"bjf",
        "post_date":"2017-02-16 11:53:19",
        "message":"Low 3V3_S4 enable. Bad U7970. Non-spill fixes are interesting. Somehow missed the fact that 3V3_S4 was slightly low. Working fine now. Thanks for the tips."
    }
]