{"post_id":19531,"thread_id":19531,"title":"820-4924, Few questions about LCD Assembly","user_id":515,"username":"SMMRepair","post_date":"2017-05-01 19:17:25","message":"I have a 2015 model 820-4924 I'm working on for a customer. It has no backlight and no video. I have 48v on pin 1 of J8300, which I'm pretty sure means no LCD detected. I have a solid 5v on L8300, so there *should* be an image. I get external video just fine--no issues. This board\/unit has no signs of impact or liquid damage at all. I have a really strong feeling the LCD assembly is a 2013\/2014 model and not 2015, but I have no way of being able to tell because I can't differentiate the 2013\/2014 LCD assembly from the 2015 LCD assembly. Is there any way to confirm which is which?\n\nWe don't have another 2015 LCD assembly to test with at the moment, but I was curious; can I use a 2015 15\" LCD to troubleshoot the no-backlight\/no-image on this board? Or do I need a 13\" assembly only? \n\nI have a 2015 LCD assembly on the way now, but would like to know how to differentiate the 2013\/2014 model LCD from the 2015 model assembly visually. Is there any way?"}
{"post_id":19534,"thread_id":19531,"title":"820-4924, Few questions about LCD Assembly","user_id":2,"username":"dukefawks","post_date":"2017-05-01 19:37:48","message":"Not 100% sure if the 2015 15\" ones work. Compare pinouts, if the same there is a good chance it will work. \nBut 48V on the backlight does mean the LCD is recognized. 5V on L8300 also suggests that there should be an image. I suspect a break in the backlight pin somewhere. Check connector\/cable\/LCD."}
{"post_id":19535,"thread_id":19531,"title":"820-4924, Few questions about LCD Assembly","user_id":515,"username":"SMMRepair","post_date":"2017-05-01 19:45:25","message":"Thanks, Duke. Yeah, this unit is tricky (especially since I can't identify if the LCD is original to the unit--been delaying ordering a 2015 test LCD for a few months). It has backlight sometimes, other times not. No rhyme or reason. Continuity through the connector is fine, no issues. It's acting like ones in the past I've seen where a 2015 board works with a 2013\/2014 assembly at first, but then has backlight issues after a few restarts\/cycles. Really confusing. No liquid, perfect board. But sometimes backlight\/video works, other times it doesn't. I held up a flashlight to the LCD several times when it didn't work, and there was 100% not an image, even though I had 5v on L8300.\n\nWill take a look at the connector and assembly cable a bit closer and update the thread tomorrow. Thanks!"}
{"post_id":19540,"thread_id":19531,"title":"820-4924, Few questions about LCD Assembly","user_id":2,"username":"dukefawks","post_date":"2017-05-02 01:52:58","message":"Had the intermittent LCD issue a few times too, always ended up being the LCD."}
{"post_id":19580,"thread_id":19531,"title":"820-4924, Few questions about LCD Assembly","user_id":515,"username":"SMMRepair","post_date":"2017-05-02 17:24:38","message":"Yeah, I think it's the LCD in this case, too. Board works fine, gives all proper voltages, but LCD is inconsistent. I actually re-seated the LCD cable in the display assembly hinge, and *fingers crossed*, the issue hasn't occurred in nearly 24 hours. I've restarted the unit 30-40 times and it's worked each time. I also see several displays on eBay for 2015 that say they don't produce an image or backlight, etc. Might be a defect on a certain run of units\/LCDs. \n\nThanks, duke!"}
