{"post_id":37914,"thread_id":37914,"title":"820-00045 dead, no PM_SLP_S4_L","user_id":1744,"username":"PJs","post_date":"2018-08-01 17:44:28","message":"820-00045 (A1534 e2015)\n\nThe machine looks like a new one, not even scratched, 17 cycles on battery, no signs of spill or previous repairs anywhere, board is spotless. It was dead when it came to me, no response on anything. Initially it had 8.6V on PPBUS_G3H and S3\/S0 rails were pulsing from 0V to high once in about two seconds. When I was taking measurements and inspecting the board under microscope, it even randomly (after reconnecting the charger to measure something) turned on twice, booted to OS and worked well until I turned it off. But one day later (without any repair attempt, just inspecting the board under microscope and measuring power lines) PPBUS dropped to 8.17V and S3\/S0 pulses disappeared.\nI thought U7100 is gone, so I changed it for a new one. At once I also changed U4700 (although there was no good reason to change it... I know), but that did not solve anything, PPBUS_G3H is still lower than it probably should be. I did not find any shorted rail. Charger is genuine Apple 29W, USB-C cable is in good condition, works well with other A1534's that I've got here. Connector and flex cable is also tested\/good.\n\nI'm not yet experienced with these boards and their design is quite different than the older ones, so I'm quite clueless... Even the schematics are worse than they used to be I think - I don't even understand how AON is produced.\n\nPPBUS_G3H 8.17V\nPP3V3R3V0_AON 3.23V\nPPDCIN_E85_SS 14.41V\nPP3V3_G3H 3.28V\nPPVRTC_G3H 3.28V\nPP3V3_S5 3.28V\n\nPM_SLP_S4_L is 0V, so all S4\/S3\/S0 rails are low\n\nThank you for any advice"}
{"post_id":37931,"thread_id":37914,"title":"820-00045 dead, no PM_SLP_S4_L","user_id":2,"username":"dukefawks","post_date":"2018-08-01 18:09:33","message":"This is a common issue with these boards and I have no idea what is causing it. Have a few with the same issues here too. For now these go in the \"some day\" pile."}
