{"post_id":24550,"thread_id":24550,"title":"820-4924 No Backlight","user_id":80,"username":"rany","post_date":"2017-08-23 10:37:31","message":"MBP 13\" Retina 820-4924 \"died suddenly\" as per owner. They tried \"resetting\" without success (not sure what they did).\nNo liquid damage. No prior repair apparent except local AASP diagnosed \"bad board.\" They removed the board at some time (missing screws).\nThey may have caused something in the process, since I found couple of resistors with pry damage near SMC (may have caused them myself tbh).\n\nUsing 85W original charger and 2 previously tested panels, noticed it was \"no backlight.\"\nPPVOUT_S0_LCDBKLT is 48.9V @ connector.\nLCD_HPD_CONN is 2.5V @ connector.\nPP5VR3V3_SW_LCD is 5.1V @ connector.\nEDP_BKLT_PWM is 0.225V @ connector => 1.8M Ohm resistance to GND =>SMC_LID is 3.39V on R5171 near SMC and EDP_BKTL_EN is 3.335V @ R1430. \n\nIs there a feedback for this circuit that I need to worry about? \nWhat could be causing PWM to be so low?\nCan I inject PWM to connector or may harm CPU?\nAny suggestion as what to do next is welcome. Thank you!"}
{"post_id":24564,"thread_id":24550,"title":"820-4924 No Backlight","user_id":2,"username":"dukefawks","post_date":"2017-08-23 18:37:01","message":"So the board is working just fine. 49V at backlight means there is no load on the circuit. Either bad connector\/cable\/LCD. Do a PRAM reset before anything, inspect connector, test with known good LCD assembly."}
{"post_id":24579,"thread_id":24550,"title":"820-4924 No Backlight","user_id":80,"username":"rany","post_date":"2017-08-24 08:07:00","message":"Ok something weird here.\nI conclude the following: the Mac was for some reason \"dead.\" As in if you drain the battery or reset it probably, it should restart.\nThey took it to a local AASP and the tech there knocked off some SMC resistors and pronounced it dead.\nIt came to me, I noticed and re-soldered the resistor, and it booted without B\/L on my new screen.\n1\/ Tested with the original screen, it works normally.\n2\/ Tested with my new screen again while fully reassembled except SSD, it works if we close then re-open lid. Restart, no B\/L. Close\/re-open lid => B\/L.\n3\/ Added SSD, now it boots normally and B\/L works normally.\n3\/ Tested the same with 2 other original cracked screens that we had laying around. Same as step 2 and 3. They work normally only when fully reassembled and SSD is installed.\nAm I missing something stupid? \nSo now it is working properly with all the screens, but I can't figure out the B\/L not working unless reassembled with SSD (except for the one that came with it)???"}
{"post_id":24582,"thread_id":24550,"title":"820-4924 No Backlight","user_id":2,"username":"dukefawks","post_date":"2017-08-24 08:29:47","message":"I have no idea. So without an SSD installed there is no BKL? What is voltage on BKL line then? PRAM reset done?"}
{"post_id":24589,"thread_id":24550,"title":"820-4924 No Backlight","user_id":80,"username":"rany","post_date":"2017-08-24 10:27:50","message":"Since it is working now we wrapped it up and sent it away to meet deadline. No time to take new measurements.\nSummary:\nYes we reset PRAM.\nObservations: \n1\/ Screen THAT CAME WITH IT => B\/L works from the moment it booted with\/without SSD. \n2-A\/ ALL OTHER screens, if no SSD attached => no B\/L when it boots until we close lid then re-open.\n2-B\/ ALL OTHER screens, if SSD attached => B\/L works from the moment it boots.\nWe noticed a similar odd behavior before with the same model from a different customer but did not explore it in details like the above as customer declined to repair."}
{"post_id":24594,"thread_id":24550,"title":"820-4924 No Backlight","user_id":468,"username":"ALB-Repairs","post_date":"2017-08-24 12:13:20","message":"You sure your screens are for 2015?"}
{"post_id":24637,"thread_id":24550,"title":"820-4924 No Backlight","user_id":80,"username":"rany","post_date":"2017-08-25 09:44:59","message":"You are right, we were using 2014 screens. Took me some time to check. Whereas the laptop was 2015. They have the same connectors, though it seems they are sold as different 2013\/2014 vs. 2015."}
