{"post_id":59793,"thread_id":59364,"title":"A1706 TB 13 inch 2016 freeze","user_id":5109,"username":"Yoel Ren","post_date":"2020-05-19 02:23:19","message":"Hi, i have my own (820-00239 i think?) i tried to test another lcd assembly, and when i try to reassemble everything, it doesnt boot at all, there’s apple logo but loading bar doesnt increase at all, i tried to boot to external, but it freeze at boot option with a bit of red tint at the lcd, caps lock doesnt work at boot option, so its not lcd problem( assuming caps lock light work at boot option ) does this have something to do with fmdf from mouser\/digikey?"}
{"post_id":59795,"thread_id":59364,"title":"A1706 TB 13 inch 2016 freeze","user_id":5109,"username":"Yoel Ren","post_date":"2020-05-19 04:39:38","message":"Update : found missing rb310 and cb300, and some corrosion there, i have replaced rb310 and cb300, board taking 20v with 1 amps, but display would occasionally show backlight but no caps lock light, is this cd3215 issues?"}
{"post_id":59796,"thread_id":59364,"title":"A1706 TB 13 inch 2016 freeze","user_id":682,"username":"2informaticos","post_date":"2020-05-19 04:41:43","message":"\"does this have something to do with fmdf from mouser\/digikey?\"\nI don't understand the question.\nDid you chabge some chips on the board, or just tried another LCD assembly???\n\nDisconnect LCD assembly and test the board alone.\nUse USB-C to HDMI adaoter, or just check for continous USB activity; or Caps Lock reaction.\n\nPossibly knocked off components in the LCD swap process, or broken traces..."}
{"post_id":59978,"thread_id":59364,"title":"A1706 TB 13 inch 2016 freeze","user_id":5109,"username":"Yoel Ren","post_date":"2020-05-23 04:44:53","message":"Sorry i mean fdmf chip ,\nLet me get this straight\nThe chronology; i bought this board from someone refurbished, i used this board to test another lcd assembly, after reassemble , it stuck at apple, i keep trying to restart and it suddenly freeze and i seen some red artifact at the screen, and its the last time i have seen image on the screen.. and it end up at only backlight, no image, without external video , no caps lock reaction too\nI open the board and see some corrosion on cd3215 which i mentioned above, but that shouldnt have anything to do with image ? Because i have 20v. Does this have anything to do with dead cpu output or this is no brain?"}
{"post_id":59982,"thread_id":59364,"title":"A1706 TB 13 inch 2016 freeze","user_id":682,"username":"2informaticos","post_date":"2020-05-23 05:32:26","message":"I still don't see the reason of that question.\nDid you change any FDMF5808 chip???\nIf not, why menrioned an online store then?\n\nVideo artifacts can be generated by RAM, or CPU..."}
{"post_id":59986,"thread_id":59364,"title":"A1706 TB 13 inch 2016 freeze","user_id":5109,"username":"Yoel Ren","post_date":"2020-05-23 06:29:39","message":"No i don change any fdmf5808 ,sorry I just thought there’s some correlation about sudden dead with that chip..\nSo is there anything i can do to solve this braindead?"}
{"post_id":59989,"thread_id":59364,"title":"A1706 TB 13 inch 2016 freeze","user_id":682,"username":"2informaticos","post_date":"2020-05-23 08:22:40","message":"Heat RAM, or\/and CPU; use quality flux.\nNo need to melt the balls, just to burn eventually crap acumulated underneath."}
