[
    {
        "post_id":36769,
        "thread_id":36769,
        "title":"820-3437 S0 Rail PGOOD",
        "user_id":1539,
        "username":"ThisIsWes:AASP",
        "post_date":"2018-07-08 01:09:08",
        "message":"820-3437 with moisture damage. Light, no fan. Board worked on previously - SMC reworked. No history on this repair. Believe this damage came after previous repair. \n\nS0 Rail PGOOD - Q8150 area corrosion. Pad for pin 1 of R8156 burnt away. Removed and cleaned up. Plugged board in to watch for short.. surprised by fan cycling as usual then came on.\nReplaced R8156 and ran jumper to near PP3v3_S5 (tested at 3.34v). Back to no power. Removed jumper all works. Replaced Q8150, same results. \nQ8150 provides ALL_SYS_PWRGD but R8156 appears to be the only non S0 supply... Does this mean it’s sensing an issue with PP3v3_S5 which I’m bypassing or S0 somewhere else? Or Is this an issue after, with the SMC or two other inputs from ALL_SYS_PWRGD?\n\nChecked area for shorts compared to good board. \nKnown good I\/O board and cable. \nPower supply and good Magsafe. \n\nMachine boots, loads to recovery mode, charges battery and runs ASD all fine. Only issue found is with a CPU thermal sensor (related?). \n\nCan I run without R8156 even though it supplies to a ‘critical’ component?"
    },
    {
        "post_id":36778,
        "thread_id":36769,
        "title":"820-3437 S0 Rail PGOOD",
        "user_id":1539,
        "username":"ThisIsWes:AASP",
        "post_date":"2018-07-08 12:56:18",
        "message":"R8151 pad 1 was corroded. Missed this. \n\nOnly issue on ASD is TCon verification test 12016 Error. Anyone know what this is? Has to do with the display tests. Mac appears to function fine."
    },
    {
        "post_id":36817,
        "thread_id":36769,
        "title":"820-3437 S0 Rail PGOOD",
        "user_id":1539,
        "username":"ThisIsWes:AASP",
        "post_date":"2018-07-09 23:40:05",
        "message":"Sharky...?"
    },
    {
        "post_id":36850,
        "thread_id":36769,
        "title":"820-3437 S0 Rail PGOOD",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-07-10 05:44:22",
        "message":"Tcon test is an LCD issue and could be because it has some Chinese LCD on it. Ignore if machine works otherwise."
    }
]