{"post_id":6703,"thread_id":6703,"title":"[SOLVED]820-2915 No charging doesn't boot from charger, However starts with battery inserted","user_id":289,"username":"smiba","post_date":"2016-09-14 11:46:45","message":"[PLAIN][SOLVED]820-2915 No charging doesn't boot from charger, However starts with battery inserted[\/PLAIN]\n\n[SOLVED] Solution: Use 85W Power supply instead of 60W\n\nHi,\n\nI have a 820-2915 motherboard which had a broken backlight issue, however after fixing the backlight it seems its not the only issue it had. (I repaired the backlight by replacing the fuse). The board looks relatively clean but it has a few signs that may show someone else worked on it before. I think the issues might have been caused by the very cheap adapter the previous owner used as I don't see anything indicating water damage or spots that used to be water damaged. I notice a few spots with solder that may looks like it has been reflowed though (Not replaced).\n\nThe system works perfectly when running on battery power and if you connect the magsafe charger it will run off the charger, however it won't charge. If you plug the charger in without battery connected the system won't boot. However if you connect a battery the fans start spinning and they system will boot (But run of the charger). You can remove the battery from the motherboard once its running and it will work just fine.\nThe Charger always shows a green light\n\n--\n\nI already tested if power was being generated with only the charger in.\n\nThese are the rails:\n- PPBUS_G3H: OK\n- PPVIN_S5_HS_COMPUTING_ISNS: OK\n- PPVIN_S5_HS_GPU_ISNS: OK\n- PPVIN_S5_HS_OTHER_ISNS: OK\n- PPDCIN_G3H: OK\n- PP3V42_G3H: OK\n- PPVRTC_G3H: OK\n- PP5V_S5: OK\n(PP5V_S3 is not there, however thats probably because its not in a S3 state)\n(PP5V_S0 is not there, however thats probably because its not in a S0 state)\n- PP3V3_S4: OK\n- PP3V3_S5: OK\n(PP3V3_S3 is not there)\n(PP3V3_S0 is not there, but it shows up with ~0.07V on it, can probably be ignored)\n\nI know it can take power from the charger and I know the rails are being created, however why doesn't it charge or want to boot up running Charger only? Is this possibility a BGA issue (Like the SMC not properly registering a charger) or am I just missing something?\n\nThanks in advance"}
{"post_id":6708,"thread_id":6703,"title":"[SOLVED]820-2915 No charging doesn't boot from charger, However starts with battery inserted","user_id":2,"username":"dukefawks","post_date":"2016-09-14 13:24:51","message":"Is the charger an ORIGINAL 85W?"}
{"post_id":6712,"thread_id":6703,"title":"[SOLVED]820-2915 No charging doesn't boot from charger, However starts with battery inserted","user_id":289,"username":"smiba","post_date":"2016-09-14 13:40:44","message":"I thought it was an 85W charger but it seems I've been using a 60W the whole time! I'm not sure where my 85W magsafe charger went then, A new one should be in my mail in a few days.\n\nI'll test it again with a 85W charger and report back, sorry for the inconvenience"}
{"post_id":6713,"thread_id":6703,"title":"[SOLVED]820-2915 No charging doesn't boot from charger, However starts with battery inserted","user_id":2,"username":"dukefawks","post_date":"2016-09-14 13:42:11","message":"The only charger on your desk should be an 85W, no need for anything else."}
{"post_id":7128,"thread_id":6703,"title":"[SOLVED]820-2915 No charging doesn't boot from charger, However starts with battery inserted","user_id":289,"username":"smiba","post_date":"2016-09-22 13:05:33","message":"The 60W charger was indeed the issue, tested it with a 85W charger and it booted up without any issues.\n\nI recently rearranged my whole desk but for some reason I managed to swap my 85W charger with a 60W charger I had laying around, stupid mistake.\nMy bad for wasting your time and thanks a lot for the reply, I wouldn't have suspected the charger at all since I just finished a repair with it before this one, but that obviously was a less demanding 13\" macbook. :o\n\nEDIT: The motherboard stopped working after a little while and often wouldn't want to boot again. I replaced the DC inboard with a known working part and it now works without any issues."}
