[
    {
        "post_id":86199,
        "thread_id":62326,
        "title":"820-01598 missing PP3v3_G3H_RTC",
        "user_id":32299,
        "username":"posarah",
        "post_date":"2022-02-12 00:24:53",
        "message":"Hi all,\n\njust wanted to get some assistance on another 820-01598 I bought last week. Boards spotless no liquid damage everything looks pristine. Boards stuck at 5v 0.0180A pretty consistently on both ports. Battery removed, don’t have a known good as this did not come with one and my ones fully depleted and quite old. PPbus at the fuse is 12.25v steady not fluctuating. Removed the fuse and checked on both sides for a short and got .4 on both sides or millions of ohms on both sides. How fussy should I be on the pPbus value? I believe it should be 12.5v but aren’t sure what the tolerance of that is.\n\nI did notice the TPS62180 looked a bit discoloured and it was getting slightly warm so I took it off. Balls on the bottom row look really dark like they’ve been carrying way too much current and there a bit smaller than the others. Checked diode mode on all its pins and everything seems normal, nothing below .4 other than ground obviously. We are getting Vin on all the pins, but the bottom line directly underneath the 4 vin pins in the schematic is missing. Sorry don’t have the schematic with me so can’t give it it’s correct name.\n\nAre the TPS62180 common failures? I know the tps die quite frequently on the a1466s.\n\nthanks."
    },
    {
        "post_id":86200,
        "thread_id":62326,
        "title":"820-01598 missing PP3v3_G3H_RTC",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-02-12 01:45:24",
        "message":"Incorrect PPBUS_G3H is caused because T2 doesn't run correctly.\nDid you get voltage at C6912, before removing U6903?\nIf not, replace it and come back with new readings.\n\nPPBUS_G3H should be 12.6V in good working board; without battery connected."
    },
    {
        "post_id":86210,
        "thread_id":62326,
        "title":"820-01598 missing PP3v3_G3H_RTC",
        "user_id":32299,
        "username":"posarah",
        "post_date":"2022-02-12 05:21:52",
        "message":"Thanks for the clarification on pPbus. I was worried about that, T2 likely being bad. No voltage at c6912 was not present. \n\nBTW P3v3g3hrtc_ss was the line I was referring to in my above post where I mentioned I didn’t have the schematic with me so I couldn’t post the correct name. That’s not required is it for the TPS to do it’s job? I believe chgr_en_mvr_r is the enable line for the tps is that correct? That was also present (steady 5v ) before removing the tps and just re measured and still is. So it definitely does look like the TPS is bad. Both enable and Vin are present. PPBUS being the wrong voltage does worry me though, the tps should not effect that should it?\n\nI’ve ordered some replacement TPS off Ali express since everyone else has no stock but they won’t be here till mid March apparently. I wish someone in Australia would stock these things, it’s so painful having to wait a month to see if this solves your issue. The previous 820-01598 I had I ended up no fixing and donated it to a local shop who also couldn’t fix it, they said there 99% sure the T2 is dead so they used it as parts so I don’t have any donors to steal it off. Only donors I have are a1466s."
    },
    {
        "post_id":86217,
        "thread_id":62326,
        "title":"820-01598 missing PP3v3_G3H_RTC",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-02-12 09:46:22",
        "message":"If you have enable and VIN, be sure C6903 is good (as traces too); is required for soft start.\nAlso check the 4 resistors from the voltage divider, R6910-13."
    },
    {
        "post_id":87000,
        "thread_id":62326,
        "title":"820-01598 missing PP3v3_G3H_RTC",
        "user_id":32299,
        "username":"posarah",
        "post_date":"2022-03-06 23:14:11",
        "message":"Sorry for the extended delay my tps took forever to arrive. I’ve confirmed the surrounding components are fine and replaced the tps. What voltage should PPvin_g3h_p3v3g3hrtc_r be? I’m getting 12.26 once connecting the charger than dips to zero as the board stops drawing current."
    },
    {
        "post_id":87001,
        "thread_id":62326,
        "title":"820-01598 missing PP3v3_G3H_RTC",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-03-07 00:53:15",
        "message":"That voltage comes from PPBUS_G3H.\nWhat is C6912 voltage, when PPBUS_G3H appears?\n\nPower cycling may be caused by short in some secondary supply; check on all big coils."
    },
    {
        "post_id":87016,
        "thread_id":62326,
        "title":"820-01598 missing PP3v3_G3H_RTC",
        "user_id":32299,
        "username":"posarah",
        "post_date":"2022-03-07 17:35:25",
        "message":"Before finishing up yesterday I decided to take a closer look at the isl. I noticed once I sprayed a little ipa over it there seemed to be a heartbeat coming from it. I removed it and found the CHGR_CSO_P pad 4 had been burned away leaving a slight crater.\n\n I replaced the pad with the relife pad repair kits and soldered the trace to pin 2 of c7020. Reinstalled a new isl and now c7033 and c7022 pins 1 are reading continuity between each other. Is that normal? Looking at the chip at the edge of the desk the balls don’t look joined, and I’ve slid c7022 so it’s no longer on pin 1 but there still reading joined."
    },
    {
        "post_id":87017,
        "thread_id":62326,
        "title":"820-01598 missing PP3v3_G3H_RTC",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-03-07 17:44:05",
        "message":"If you look at schematic, between C7022\/33 is just 1 ohm resistor (R7022).\nSo the \"short\" reading is normal."
    },
    {
        "post_id":87019,
        "thread_id":62326,
        "title":"820-01598 missing PP3v3_G3H_RTC",
        "user_id":32299,
        "username":"posarah",
        "post_date":"2022-03-07 20:31:54",
        "message":"Fair enough thanks. I’m getting 3.42v at c6912."
    },
    {
        "post_id":87020,
        "thread_id":62326,
        "title":"820-01598 missing PP3v3_G3H_RTC",
        "user_id":32299,
        "username":"posarah",
        "post_date":"2022-03-07 20:45:30",
        "message":"Ppvin_g3h_p3v3g3hrtc_r at c6906 is fluctuating a lot between 12v, 9v, 11v constantly till it shuts down. Nothing reads short though, every component on that line reads .391 diode mode. Is it worth replacing the tps again?"
    },
    {
        "post_id":87025,
        "thread_id":62326,
        "title":"820-01598 missing PP3v3_G3H_RTC",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-03-08 01:11:40",
        "message":"Looks like PPBUS_G3H is not stable.\nRemove F7000 and check if get steady voltage at C7050."
    },
    {
        "post_id":87199,
        "thread_id":62326,
        "title":"820-01598 missing PP3v3_G3H_RTC",
        "user_id":32299,
        "username":"posarah",
        "post_date":"2022-03-10 20:07:03",
        "message":"Removed F7000 and I have a steady 12.26V @ C7050. Boards no longer shutting off either, fluctuates between 0.0109A and 0.0090A but never completely shuts off. What should the resistance to ground be for PP3V3_G3H? I'm getting 38 ohm or 0.025 for C7612. There must be a short with the internal layers, I've removed every component which has a line to PP3V3_G3H and ground and I'm still getting the above readings for diode\/resistance for PP3v3_G3H."
    },
    {
        "post_id":87205,
        "thread_id":62326,
        "title":"820-01598 missing PP3v3_G3H_RTC",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-03-11 01:56:27",
        "message":"Lift L7690 one side and see where the low value remains."
    },
    {
        "post_id":87294,
        "thread_id":62326,
        "title":"820-01598 missing PP3v3_G3H_RTC",
        "user_id":32299,
        "username":"posarah",
        "post_date":"2022-03-12 22:09:26",
        "message":"Lifted and the low value remained on 3V3_G3H. 3V3G3H_ VSW is 0.416\n."
    },
    {
        "post_id":87296,
        "thread_id":62326,
        "title":"820-01598 missing PP3v3_G3H_RTC",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-03-13 00:44:45",
        "message":"There are many components connetced to 3V3_G3H line.\nYou don't have too low value to ground and voltage injection can only help if you use thermal camera.\nMay have luck and some chip gets few degrees more than the rest, in time.\n\nBe aware, components after R5920 get in direct contact with 3V3_G3H too; unless you think 10 miliohm is \"big\" value."
    },
    {
        "post_id":87301,
        "thread_id":62326,
        "title":"820-01598 missing PP3v3_G3H_RTC",
        "user_id":32299,
        "username":"posarah",
        "post_date":"2022-03-13 03:08:18",
        "message":"All the caps and chips on 3v3G3H have been removed, only things which are still in place are resistors as they do not have a connection to ground apart from the current sense resistor which does and was removed. I did try voltage injection but only with IPA, haven't bought a thermal cam yet. I was going to get a HTI 301 last year as they were on sale from 1100 to 600 but the day I went to buy it the sale ended so I've been waiting for them, or the seek compact pro to go on sale again."
    },
    {
        "post_id":87306,
        "thread_id":62326,
        "title":"820-01598 missing PP3v3_G3H_RTC",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-03-13 05:31:39",
        "message":"You don't need to spend so much money for IR cam.\nUTi260B is good enough (256x192) and much cheaper."
    },
    {
        "post_id":87339,
        "thread_id":62326,
        "title":"820-01598 missing PP3v3_G3H_RTC",
        "user_id":32299,
        "username":"posarah",
        "post_date":"2022-03-14 02:39:59",
        "message":"Ok thanks I’ll take a look."
    }
]