[
    {
        "post_id":47942,
        "thread_id":47942,
        "title":"iMac 21,5\" late 2012 (EMC 2544) video issue",
        "user_id":3340,
        "username":"Dindojul",
        "post_date":"2019-03-28 23:32:15",
        "message":"Hello,\n\nsorry about my poor english, I'm French!\n\nSoso, I need help on an iMac 21,5\" late 2012 (EMC 2544).\n\nI open it to change the faulty hard-drive by a SSD.\nAfter installing the system end before stuck the screen back,\nI just switch off and restart to check if everything start fine.\nThe SSD has disappeared!\nA little bit too quicky, I just reopened it to check what's wrong.\nThe SSD was faulty!\nI replaced it and everything works fine, except the display which remains totally black (not a backlight issue).\n\nAfter different tests, I found that there's a failed pin on the display LVD plug.\nSo here's my question:\nwhat can I check on the logic board?\n\nI plug my faulty LVD on another iMac (Late 2013) who works previously fine, the this iMac got the same symptom (no more internal display, independently of which LVD I plug)\n\nActually, I got signal only on external display.\n\nWhen I plug the AC cord the iMac the fans go immediately full and slow down after start.\nNext everything works fine, except I didn't have any signal on the internal dispaly.\n\nOn the late 2013 iMac, if I run Apple Hardware Test, I obtain these errors:\nSMC = PFM006 \/ Display = VFD001\n\nThank you for your help!\n\nSincerely,\n\nJulien Favier"
    },
    {
        "post_id":47945,
        "thread_id":47942,
        "title":"iMac 21,5\" late 2012 (EMC 2544) video issue",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-03-29 02:46:54",
        "message":"Post 820-xxxx code for the logic board and tell us which pin of video cable was failing.\nWhy did you plug that video cable on other machine, once you've seen it bad?\nIf is the output pin for backlight, you could fried LCD video output on both machines now; hope is not the case..."
    },
    {
        "post_id":47950,
        "thread_id":47942,
        "title":"iMac 21,5\" late 2012 (EMC 2544) video issue",
        "user_id":3340,
        "username":"Dindojul",
        "post_date":"2019-03-29 07:46:06",
        "message":"The logic board is a 820-3302-A.\nI didn't seen the video cable was bad before I plugged it on another machine...\n\nIt's the first pin on the right (on the picture) which is bad.\n\n[ATTACH alt=\"P1080118.JPG\" type=\"full\"]47951._xfImport[\/ATTACH]"
    },
    {
        "post_id":47953,
        "thread_id":47942,
        "title":"iMac 21,5\" late 2012 (EMC 2544) video issue",
        "user_id":36,
        "username":"aprendiz",
        "post_date":"2019-03-29 11:07:33",
        "message":"that is the 12V for LCD, this could be a bad L9100 if you are lucky, replace the cable of course..."
    },
    {
        "post_id":47958,
        "thread_id":47942,
        "title":"iMac 21,5\" late 2012 (EMC 2544) video issue",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-03-29 13:03:02",
        "message":"Probably fried the coil on both machines, because that pin did short to ground when was inserted to the MLB..."
    }
]