[
    {
        "post_id":40924,
        "thread_id":40924,
        "title":"820-00165 no backlight",
        "user_id":623,
        "username":"MaxFix",
        "post_date":"2018-10-19 04:25:01",
        "message":"Hello all,\n\nWater Damaged.\nCleaned.\n8.5V\nFB pad is gone (see the picture) and I suppose that is the problem. Question is how do I throw a jumper? From D7701 pin 2 to pin 5 on U7701? \nXW7720 is not on the board.\n\nThanks,\nMax\n\n[ATTACH type=\"full\" width=\"60%\"]40926._xfImport[\/ATTACH]"
    },
    {
        "post_id":40927,
        "thread_id":40924,
        "title":"820-00165 no backlight",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-10-19 06:52:59",
        "message":"Sometime is still possible to solder the central point from XW7720.\nScratch a bit and use a fine tip solder.\nIf not possible, use the two test point from the other side.\nSearch Louis channel, he has a good video about how to do it.\n\nYou must place the tiny wire directly under U7701, on the place of FB pad..."
    },
    {
        "post_id":40929,
        "thread_id":40924,
        "title":"820-00165 no backlight",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2018-10-19 07:12:39",
        "message":"If you can, you run a wire from that little nub of the corroded test point to the striped side of the diode. Sometimes the nub is completely gone, and you simply have to run a wire from the A5 ball to the diode which is no fun. See if you can solder to the nub. I also 100% recommend replacing the driver anyways as the feedback trace dying likely screwed with the driver as well."
    },
    {
        "post_id":40968,
        "thread_id":40924,
        "title":"820-00165 no backlight",
        "user_id":623,
        "username":"MaxFix",
        "post_date":"2018-10-20 04:16:55",
        "message":"No Title\n\nThanks for your advice guys. Test point is completely gone so i've decided to run a wire from diode to A5 (see pictures). switched it on and it burned my led driver which I replaced first thing before fixing fb line because I thought it was the problem originally. It was my last led driver. I have order some more. Waiting to receive and test again. Hopefully it will work. Will post results next week."
    },
    {
        "post_id":40973,
        "thread_id":40924,
        "title":"820-00165 no backlight",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-10-20 05:27:34",
        "message":"You didn't consider the help ;(\nI told you search Louis channel; he posted one video where show how to do that very easy.\nNo need to run wire between board sides..."
    },
    {
        "post_id":40974,
        "thread_id":40924,
        "title":"820-00165 no backlight",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-10-20 05:33:18",
        "message":"No Title\n\nIn case still have doubts, or no time to search.\nHowever, I recommend you find that video."
    },
    {
        "post_id":40977,
        "thread_id":40924,
        "title":"820-00165 no backlight",
        "user_id":623,
        "username":"MaxFix",
        "post_date":"2018-10-20 06:41:37",
        "message":"Hi informaticos. Sorry i didnt understand your idea first and i couldnt find the right video among 20 other backlight repairs videos on Louis channel. It is actually super simple.\nI will try your solution next week when new led driver arrives!"
    },
    {
        "post_id":40978,
        "thread_id":40924,
        "title":"820-00165 no backlight",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-10-20 06:53:44",
        "message":"Confirm with the boardview that is the correct test point.\nYour picture shows a small area only.\nYou have two test point there for use..."
    },
    {
        "post_id":41085,
        "thread_id":40924,
        "title":"820-00165 no backlight",
        "user_id":623,
        "username":"MaxFix",
        "post_date":"2018-10-23 02:48:07",
        "message":"Yes, worked like a charm. Thanks for your help! I wonder why it failed first time when I threw a jumper to the other side of the board. In theory it should have worked, its the same line?"
    }
]