{"post_id":33152,"thread_id":33152,"title":"Replace GPU on MBP: Compatibility questions on upgrading the GPU and VRAM","user_id":1009,"username":"truman","post_date":"2018-04-01 22:48:33","message":"[SIZE=16px][FONT=tahoma]I have a sad pile up of 15in + 17in MacBook Pros, 2010, 2011 and some 2012s with GPU\/VRAM issues.\n\nCAN GPUs and VRAM be upgraded?\n\n[COLOR=#B22222]Will the lead (Pb) solder improve the reliability over \"lead free\" ?[\/COLOR]\n[I](Or is there some other reason as to why GPUs started going bad so often?)[\/I]\n\n[COLOR=#B22222]Are there any ways to distinguish between a bad GPU vs BGA balls connecting the GPU?[\/COLOR]\n[COLOR=#B22222]Is it better to replace the GPU irrespectively?\nOr is the issue primarily the BGA connection, and not the GPU itself?\nShould the VRAM be replaced by default?\nCan VRAM be upgraded?[\/COLOR]\nWe've also had symptoms that're [B]identical[\/B] to a bad GPU ... which turned out to be the VRAM!\n\n\nCan the 15in 2010 i5 use more than 256MB VRAM?\nCan the 15in 2010 i5 use faster VRAM than GDDR3?\nCan the 15in 2010 i7 use more than 512MB VRAM?\nCan the 15in 2010 i7 use faster VRAM than GDDR3?\nHas anyone tried GDDR5 or larger amounts of VRAM on this or other Unibody MBP ? [\/FONT][\/SIZE]\n\n[SIZE=16px][FONT=tahoma]Can the 15in Early 2011 i7 2.0 GHz use more than 256MB VRAM?\nCan the 15in Early 2011 i7 2.0 GHz use the 6770M GPU ?[\/FONT][\/SIZE]\n[SIZE=16px][FONT=tahoma]Can I use the 6770M GPU in ALL 2011 MBP when we replace the GPU?\n\nCan the 15in Mid 2012 i7 2.3 GHz use more than 512MB VRAM?\nCan the 15in Mid 2012 i7 2.3 GHz use the 750M ?[\/FONT][\/SIZE]\n\n[SIZE=16px][FONT=tahoma]Can the 2009 or 2010 be upgraded to USB 3.0 ? or is the controller on the Southbridge or something equally impossible to replace?\n\nTHANK YOU to everyone who helps make progress in solving these questions; I know you earned your knowledge the hard way. I get that the 'data cost' would be many many hours to acquire what anyone contributing here has already spent.\n\nI am truly grateful.[\/FONT][\/SIZE]"}
{"post_id":33191,"thread_id":33152,"title":"Replace GPU on MBP: Compatibility questions on upgrading the GPU and VRAM","user_id":2,"username":"dukefawks","post_date":"2018-04-03 14:28:19","message":"2010 models: usually just a bad C9560. Samsung VRAM is sometimes bad. Also MUX issues are common with \"analog\" distortion on LCD but no crashing and locking up.\n\n2011 models: Good luck finding real NEW GPUs, let me know if you can find them. Don't even think about upgrading it is useless and just another risk factor. VRAM on these is never bad, if any issue a reflow\/reball should fix it. Also these have issues with vias in the board, about 10% of the boards have internal problems like that.\n\n2012 models: GPU issues on these are not the GPU and not the VRAM, I think the issue is in the board vias like the 2011.\n\nAs you see it is just a complete cluster fuck."}
