{"post_id":64617,"thread_id":59958,"title":"820-00281 CD3215 madness","user_id":5210,"username":"KC Micro Tronix","post_date":"2020-09-03 14:20:41","message":"No H2O on this board.\n\nWhen testing the usb power would cycle on \/ off\nI discovered one of the CD3215's was toast as a small hole was blown in it and it showed up quickly on thermal.   Replaced it and it stopped the bounce but PP3v42 was a little low and the CD3215's were not talking to the charger and switching it to18v.   Current draw was 0.08A at 5v.  Thermal quickly identified the other CD3215 on the other side was also defective.   Regardless of port used it was the one sucking PP3v42 down slightly to 2.9-3.0v .   Replaced it and it and PP3V42 is now perfect.  Current draw is 0.02 it just sits at 5V and does not switch to 18v.   The CD3215C00's were replaced with the exact same part no the B03 versions.\n\nBoth defective CD3215's were on the same side of the board.   Should I just shotgun the ones on the other side?\n\nNo shorts on the power rails.  CPU \/ PCH are not shorted.\n\nIt has been about 6 months since I worked on these so I am just being a little lazy and looking for some guidance.\n\n\nThanks\nRandall"}
{"post_id":64619,"thread_id":59958,"title":"820-00281 CD3215 madness","user_id":515,"username":"SMMRepair","post_date":"2020-09-03 14:46:25","message":"In my experience, when a CD3215 has a hole in it, the CPU\/PCH is toast. I've had 3 or 4 boards that had the CD3125's shorted so badly they burned a hole into the chip itself and fused the ball to the pad below it (I believe all shorted @3v3_g3h), and in all 3 cases, I resolved the short and CPU was killed. Look very hard at the CPU\/PCH chipset; sometimes you can see the short\/damage on the actual face\/resin area. Looks like a tiny crack\/brown spot...almost impossible to see without a microscope of course. Usually accompanied by a weird diode reading--i.e. .118 or similar. You'll sometimes notice the voltage is low and weird too, like 1.27v (so not STG)."}
{"post_id":64625,"thread_id":59958,"title":"820-00281 CD3215 madness","user_id":682,"username":"2informaticos","post_date":"2020-09-03 17:32:28","message":"CD3215 chips receive VBUS directly; and is 20V when working.\nDepending of the way it gets burnt, input voltage can pass through (ms is sufficient) and sensitive chips from the board can be damaged; especially PCH\/CPU and SMC.\n\nYou should check at least if all CD3215 chips generate 1V1_LDO."}
{"post_id":64648,"thread_id":59958,"title":"820-00281 CD3215 madness","user_id":5210,"username":"KC Micro Tronix","post_date":"2020-09-04 12:53:39","message":"None of the CD3215's are producing 1V1_LDO\n\nI tested the CPU and PCH rails for shorts and did not find any as stated before."}
{"post_id":64649,"thread_id":59958,"title":"820-00281 CD3215 madness","user_id":682,"username":"2informaticos","post_date":"2020-09-04 15:10:36","message":"1V1 LDO must appear only on the CD3215 where the charger is connected.\nBe sure to check that properly.\nCompare diode mode readings for LDO outputs on all CD3215 chips.\nYou should have problems on USB-C areas, if cannot get 1V1 LDO.\n\nBTW, no short on PCH\/CPU rails cannot assure you the chips are good!"}
{"post_id":64683,"thread_id":59958,"title":"820-00281 CD3215 madness","user_id":515,"username":"SMMRepair","post_date":"2020-09-05 10:16:11","message":"\"BTW, no short on PCH\/CPU rails cannot assure you the chips are good!\"\n\nExactly! In fact, many times it WON'T show a short because it's not a total STG! Bet you have a dead CPU in this case."}
{"post_id":64803,"thread_id":59958,"title":"820-00281 CD3215 madness","user_id":5210,"username":"KC Micro Tronix","post_date":"2020-09-08 10:29:44","message":"I hear you that the odds are low but I want to use this to learn on.\n\nThanks 2informaticos,  I was measuring the 1v1 improperly.  The 1v1 signal is present on the side that was not damaged.   On the side I replaced the CD3215's neither one will show 1v1_LDO.  Diode checking the 1v8 and 3v3 shows .5v normal readings.   I compared them with the non damaged side. \n\nSo.  Plugging into the non damaged side I get the 1v1 LDO signal on both CD3215's but the machine will still not swith to the 18v.   On the damaged side where both CD3215's were replaced I do not get 1v1 LDO but the diode readings are the same as the non damaged side and appear normal.  Both of the CD3215's on the damaged side were replaced."}
{"post_id":64805,"thread_id":59958,"title":"820-00281 CD3215 madness","user_id":682,"username":"2informaticos","post_date":"2020-09-08 11:08:26","message":"There is a \"chance\" to got fake CD3215 pair chips..."}
{"post_id":64885,"thread_id":59958,"title":"820-00281 CD3215 madness","user_id":5210,"username":"KC Micro Tronix","post_date":"2020-09-09 10:08:24","message":"how can I tell"}
{"post_id":64886,"thread_id":59958,"title":"820-00281 CD3215 madness","user_id":682,"username":"2informaticos","post_date":"2020-09-09 10:25:50","message":"If you have a board with dead CPU, or other \"letal\" problem, but gets 20V on USB-C ports, do not scrap it.\nUse it to test CD3215 chips.\nThese chips can be reballed in 10-20 min with solder paste..."}
{"post_id":64963,"thread_id":59958,"title":"820-00281 CD3215 madness","user_id":5210,"username":"KC Micro Tronix","post_date":"2020-09-10 13:07:48","message":"I harvested CD3215's from boards.  Reballed them and installed.\nStill no 1v1 LDO"}
{"post_id":64964,"thread_id":59958,"title":"820-00281 CD3215 madness","user_id":515,"username":"SMMRepair","post_date":"2020-09-10 13:57:11","message":"dead CPU"}
{"post_id":65028,"thread_id":59958,"title":"820-00281 CD3215 madness","user_id":5210,"username":"KC Micro Tronix","post_date":"2020-09-11 11:53:20","message":"How is the 1V1 LDO enabled?  What is the process?"}
{"post_id":65035,"thread_id":59958,"title":"820-00281 CD3215 madness","user_id":515,"username":"SMMRepair","post_date":"2020-09-11 14:07:34","message":"1v1_LDO is via CD3215 and charger, and just means your CD3215 is working fine \"to that point\" and communicating with charger. It rules out your CD3215 being \"completely\" bad and not even talking to charger. You check for LDO first because without it, you won't have anything beyond that. It's like confirming your car has gas, but doesn't explain why the car won't crank. Have to check beyond gas at that point."}
