{"post_id":17566,"thread_id":17566,"title":"820-3437-B only turnes on if you hold the power button","user_id":499,"username":"andrew boren","post_date":"2017-03-30 11:14:39","message":"if you try to turn it on normally the fan just spins for one second. if you hold the power button for about 5-6 seconds it turns on and runs normally. everything functions and i did an apple diag test and it passes. if you restart the machine it restarts normally. but if you shut down it wont turn on unless you hold the power button for 5-6 seconds again. this is with and without a battery. i assume this is not acting correctly because it wont turn on by itself. no battery and plugged in to power it wont auto start"}
{"post_id":17567,"thread_id":17566,"title":"820-3437-B only turnes on if you hold the power button","user_id":36,"username":"aprendiz","post_date":"2017-03-30 11:39:29","message":"Remove trackpad flex and try again without battery"}
{"post_id":17568,"thread_id":17566,"title":"820-3437-B only turnes on if you hold the power button","user_id":499,"username":"andrew boren","post_date":"2017-03-30 11:55:06","message":"already tried that, and just tried it again, still same just turns the fan on for one second"}
{"post_id":17570,"thread_id":17566,"title":"820-3437-B only turnes on if you hold the power button","user_id":36,"username":"aprendiz","post_date":"2017-03-30 12:00:36","message":"This board should turn on and off 3 times after remove battery, did you let it 1 min to do the process?? inspect for liquid damage the power board and flex and the logic board..."}
{"post_id":17572,"thread_id":17566,"title":"820-3437-B only turnes on if you hold the power button","user_id":499,"username":"andrew boren","post_date":"2017-03-30 12:25:32","message":"tried with a known good power board and cable. and already ran this threw water damage treatment. as this was water damaged, forgot to mention that"}
{"post_id":17599,"thread_id":17566,"title":"820-3437-B only turnes on if you hold the power button","user_id":2,"username":"dukefawks","post_date":"2017-03-30 16:44:06","message":"Check sense resistor circuits of ISL6259, resistance between pins 17\/18, 27\/28"}
{"post_id":17657,"thread_id":17566,"title":"820-3437-B only turnes on if you hold the power button","user_id":499,"username":"andrew boren","post_date":"2017-03-31 15:12:48","message":"there was a break between r7151 and c7150 and the probe point 790 so i ran a jumper between all 3 points and it started to work. can you explain how it was still able to be bypassed by holding down the power button? and how it passed apple hardware diag? im glad you had an idea where to look and im grateful for the help but i would like to learn how you came to the answer to check current  between the pins for a weird power issue like this one."}
{"post_id":17683,"thread_id":17566,"title":"820-3437-B only turnes on if you hold the power button","user_id":2,"username":"dukefawks","post_date":"2017-04-01 17:46:33","message":"It bypasses the SMC detecting an over current through AMON or BMON lines."}
