{"post_id":30912,"thread_id":30912,"title":"820-3115-B Resets if you unplug charger or measure voltage on SMC Reset L","user_id":512,"username":"BCConnection","post_date":"2018-01-31 16:08:14","message":"board had liquid damage along top edge effecting Sys one wire system. Replaced all bad components, replaced U6901, U5010, SMC, SMC Reset 100K R5000 Resistor, and pulled R7000 to see if U7000 was resetting it somehow.\n\nIm kind of lost, the voltage when I meter the line is 3.4-3.42v but it may be dipping when I first stick my probe to it. It seems this line is pulled up to 3.42 at the R5000 resistor but I have tested and replaced this and no change.\nThe computer will boot and charge fine. When you plug in the charger the light goes green to orange and charges but when you unplug the charger it will reset the system like you just pulled power and then reconnected it instantly. Kind of lost on how this is happening."}
{"post_id":30917,"thread_id":30912,"title":"820-3115-B Resets if you unplug charger or measure voltage on SMC Reset L","user_id":2,"username":"dukefawks","post_date":"2018-01-31 17:19:30","message":"It is normal that if you touch the reset line it will glitch so nothing to worry there. \n\nSo the problem is that the machine shuts down if you unplug the charger? Does it run off the battery alone?"}
{"post_id":30918,"thread_id":30912,"title":"820-3115-B Resets if you unplug charger or measure voltage on SMC Reset L","user_id":512,"username":"BCConnection","post_date":"2018-01-31 17:37:07","message":"Yes it will run off battery alone and it will also run on charger only. If I plug in the charger while on battery only, it will start to charge the battery but if I unplug it the system will shut off and automatically reboot. Chimes again without pressing anything"}
{"post_id":30919,"thread_id":30912,"title":"820-3115-B Resets if you unplug charger or measure voltage on SMC Reset L","user_id":512,"username":"BCConnection","post_date":"2018-01-31 17:40:25","message":"If I plug in the charger with battery connected it will go green to orange and does not auto boot unless directly after battery reconnect which seems normal. Power button functions properly on keyboard and it does this even when the keyboard is unplugged."}
{"post_id":30923,"thread_id":30912,"title":"820-3115-B Resets if you unplug charger or measure voltage on SMC Reset L","user_id":512,"username":"BCConnection","post_date":"2018-01-31 17:49:23","message":"Well now its not doing it. i put it back in the frame to test a few more things and its working now.. It wont reboot like it was doing when I unplug the charger."}
{"post_id":30925,"thread_id":30912,"title":"820-3115-B Resets if you unplug charger or measure voltage on SMC Reset L","user_id":2,"username":"dukefawks","post_date":"2018-01-31 18:35:46","message":"Hmm, I have no idea what is going on. If it seems working now give it a good burn in to see if issues return. Possibly the resistor and diode the feed 3V42 when on battery that are flaky? R6905 D6990"}
{"post_id":30928,"thread_id":30912,"title":"820-3115-B Resets if you unplug charger or measure voltage on SMC Reset L","user_id":512,"username":"BCConnection","post_date":"2018-01-31 19:13:16","message":"Ill check them. Thanks Duke"}
