[
    {
        "post_id":91181,
        "thread_id":62906,
        "title":"820-3302 2012 iMac no power",
        "user_id":32178,
        "username":"prodigy83",
        "post_date":"2022-07-18 12:37:14",
        "message":"This iMac was powering on at first but experiencing the fan running at full speed, even when shut off. I would unplug the power cable, then plug back in without turning the iMac back on and the fan would spin at full speed again. The client took the iMac home over the weekend, but it powered off on her, and now there is no power.\nHere is what I found. Power supply is good (had known good power supply I swapped). \n\nBack to the motherboard:\nI used a thermal camera and found U7100 appeared to be shorting, so I removed this chip and still had shorts on the following pins:\n4,3,21,20,48,46,42,32.\nBecause where these appear to go, REG_CPUCORE_VSEN being one, does this mean the CPU is fried?\nThank you!"
    },
    {
        "post_id":91183,
        "thread_id":62906,
        "title":"820-3302 2012 iMac no power",
        "user_id":32178,
        "username":"prodigy83",
        "post_date":"2022-07-18 13:53:17",
        "message":"Update, I did not realize the CPU was removable but when I took the cpu out, the short is gone, but I tried sticking in another LGA1155 intel processor I had in stock, and the short returned with this one too. I am thinking the processor is just completing the circuit, but I have no idea where to go from here."
    },
    {
        "post_id":91185,
        "thread_id":62906,
        "title":"820-3302 2012 iMac no power",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-07-18 13:59:58",
        "message":"Ivy Bridge CPU has very los resistance on its core; usually 1-3 ohm, depending of type (i7-i3).\n\nDid you remove CMOS coil?\nAny LED comes on?\nQ7870 and Q7950 are the first suspects."
    },
    {
        "post_id":91189,
        "thread_id":62906,
        "title":"820-3302 2012 iMac no power",
        "user_id":32178,
        "username":"prodigy83",
        "post_date":"2022-07-18 15:10:55",
        "message":"No shorts on Q7870 or Q7950.\nOnly 1 LED light comes on (the one at the bottom).\nI did remove the CMOS battery but not sure which one is the COIL?\nI do have a short on Q8961 pins 7 and 8. When I search this in the schematic though, it finds nothing. I am seeing this using the boardview."
    },
    {
        "post_id":91190,
        "thread_id":62906,
        "title":"820-3302 2012 iMac no power",
        "user_id":32178,
        "username":"prodigy83",
        "post_date":"2022-07-18 15:21:15",
        "message":"U8000 keeps lighting up when I inject voltage in to C8962 pin 1. I keep finding shorts that correspond to U8000.\nR8910 pin 2 also has a short."
    },
    {
        "post_id":91191,
        "thread_id":62906,
        "title":"820-3302 2012 iMac no power",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-07-18 15:35:36",
        "message":"Sorry about \"coil\"; read \"cell\" instead.\n\nIf LED1 stays on, Q7870 is good.\nNobody said to check for short on it, nor at Q7950.\nThese MOSFETs suffer by leakage usually.\nTrigger SMC_ONOFF_L and check for pulse at 12V_S0_FET.\n\n\"I do have a short on Q8961 pins 7 and 8.\"\nMaybe, but GPU core has also low resistance to ground; compare with similar board."
    }
]