{"post_id":56604,"thread_id":56604,"title":"820-3330 chimes but no image","user_id":1744,"username":"PJs","post_date":"2020-02-10 05:35:27","message":"Cannot find any liquid damage, it chimes, caps lock working, nothing on screen (not even blink of image), nothing on external with known good SSD. Just once I've seen a short blink of white screen (with backlight) during chime - that's why I did not trash this board yet.\n\nWhen it came to me, LVDS (J9000) was a little bit damaged around LED RETURN pins - some of them were most likely shorted. Some screws were missing, but otherwise the board looks clean, no oxidation, no signs of previous repair attempts, no flux anywhere before I touched it. I tried different LCD assembly, no success.\n\nPPBUS_G3H 12.54V\nPP3V42_G3H 3.42V\nPP1V2_S0 1.2V\nPP1V05_S0GPU 1.04V\nPP1V8_S0GPU 1.79V\nPP3V3_S0GPU 3.32V\nPPVCORE_GPU 0.90V\n\nLCD_PWR_EN 0.00V (not shorted to GND, but not even pulsing after power on)\nSMC_LID 3.1V\n\nGPU_RESET_R_L [U]0.00V[\/U]\nEG_RESET_L [U]0.00V[\/U]\nThese two should be high I think?\n\nAll measured with genuine 85W MagSafe, only powerboard and LCD connected.\n\nSo far I reballed U9600, reflowed U8900 and changed J9000, but it's still the same."}
{"post_id":56617,"thread_id":56604,"title":"820-3330 chimes but no image","user_id":682,"username":"2informaticos","post_date":"2020-02-10 09:15:56","message":"RESOLDER U9800 with leaded, do NOT only reflow.\n\nMentioned reset signals are good; look at _L termination..."}
{"post_id":56620,"thread_id":56604,"title":"820-3330 chimes but no image","user_id":1744,"username":"PJs","post_date":"2020-02-10 10:41:36","message":"OK, I resoldered U8900 with leaded solder, still no image. After that I changed it completely and still nothing... I believe U8900 is OK as I get GPU Vcore. If you meant U9600 (GMUX), I reballed it with leaded balls, there was no oxidation under it or anything obviously wrong."}
{"post_id":56625,"thread_id":56604,"title":"820-3330 chimes but no image","user_id":682,"username":"2informaticos","post_date":"2020-02-10 13:36:01","message":"You can find on Internet a way to disable GPU on this board; never tried it..."}
{"post_id":56669,"thread_id":56604,"title":"820-3330 chimes but no image","user_id":1744,"username":"PJs","post_date":"2020-02-11 13:57:57","message":"No other tips?\n\nI changed U9600 once again for a tested one and still no success.\n\nBut today I saw the short white screen once again while testing - however it immediately cuts off during chime sound, whole board turned off and after disconnecting\/reconnecting charger it had fluctuating PPBUS_G3H (4V - 12.55V) and did not want to turn on again. Another try gave me short power cycling with fan spins and still fluctuating PPBUS_G3H. Finally on 3rd or 4th try it started \"working\" like before (no image, but PPBUS_G3H stable and no cycling)"}
{"post_id":56678,"thread_id":56604,"title":"820-3330 chimes but no image","user_id":682,"username":"2informaticos","post_date":"2020-02-11 18:02:20","message":"Random fluctuation of PPBUS_G3H is very strange and should be related with U7000 are, more than GPU, or a secondary power supply.\nWhen this happen, test with battery connected and see if something change.\nMissing external video at same time could mean GPU issue, or bad GMUX.\n\nDo more tests with both internal external video outputs connected.\nSee if you get something on external at same time with white screen on internal LCD.\nBTW, it was pure white, or classic Apple white-grey?"}
{"post_id":56713,"thread_id":56604,"title":"820-3330 chimes but no image","user_id":1744,"username":"PJs","post_date":"2020-02-13 04:33:38","message":"I got this one running by heating up the PCH U1800 with hot air. Heating up the other side of the board also works. When I heat it up somewhere over 150?C and let it cool for a moment, it turns on and works flawlessly for a few minutes. Then it shuts off and PPBUS_G3H is fluctuating again. PP1V05_SUS and sometimes PP3V3_SUS are also fluctuating in this \"non working mode\", but they are not shorted. I inspected U2600 clock chip once again and changed it just to be sure (Y2605 also), but I did not solve anything. U7000 area looks pristine, everything measured OK on CSI\/CSO lines. Changed U7000, still not working (and it did not start working after heating up that area, unlike U1800). There is no obvious oxidation or anything wrong around U1800. I removed the silicone edges and gave it a \"flux cleaning\" with 170?C, but it died again after few minutes."}
{"post_id":56715,"thread_id":56604,"title":"820-3330 chimes but no image","user_id":682,"username":"2informaticos","post_date":"2020-02-13 04:39:32","message":"Reball PCH at least.\nYou may need to change it.\nOnce removed, inspect all the traces and pads."}
