{"post_id":25633,"thread_id":25633,"title":"[SOLVED]820-3787 No image","user_id":461,"username":"Gurmon","post_date":"2017-09-20 04:29:52","message":"This boardis trolling me nicely.\n\nI doint know history of the board, its come from a long line of have a go repair shops. However thge board looked intact and not to dicked about with.\n\nAt first, there was no chime. But ALL the power rails.\n\nI reflashed the bios, still no chime.\n\nI then replaced the SMC, Now i get a chime. usb mouse illuminates, and I can PRAM reset. Still no image on external or internal screens.\n\nI have 0.9V on GPUvcore, and all other power rails are within spec.\n\nIm not sure what else to try.\n\nAny hints, i know this one is going to suck."}
{"post_id":25641,"thread_id":25633,"title":"[SOLVED]820-3787 No image","user_id":2,"username":"dukefawks","post_date":"2017-09-20 06:35:02","message":"External video present? Known good LCD? Inspect cable and connector."}
{"post_id":25652,"thread_id":25633,"title":"[SOLVED]820-3787 No image","user_id":461,"username":"Gurmon","post_date":"2017-09-20 07:53:54","message":"Hey Duke,\n\nLCD is good, All cables look perfect, and nothing on internal or external.\n\nMux Area looks perfect.\n\nShould I reball U9600 before starting to messaboutwith GPU swaps ?"}
{"post_id":25662,"thread_id":25633,"title":"[SOLVED]820-3787 No image","user_id":2,"username":"dukefawks","post_date":"2017-09-20 08:49:19","message":"No you don't just reball anything without diagnosis.....\n\nUsed the correct SMC from identical board? SMC_LID high?"}
{"post_id":25818,"thread_id":25633,"title":"[SOLVED]820-3787 No image","user_id":461,"username":"Gurmon","post_date":"2017-09-23 04:23:20","message":"Mark this as solved.\n\nReplacement SMC came from usual donor board, however looks like someone already swapped it. So correct SMC from used and we have image.\n\nGive away was it would only chime on power adapter, no chime when powered via battery. This prompted another go for SMC change."}
