[
    {
        "post_id":80530,
        "thread_id":61756,
        "title":"820-02020 M1 A2338 Power cycling",
        "user_id":29570,
        "username":"Kgrou",
        "post_date":"2021-09-23 13:44:45",
        "message":"Hello,\n\nI received a board from a new m1 mbp that had some liquid spill on it, pp3V3_S2 was shorted because of UL000 that was dead, after removing it the board do the chime, but has no display or caps lock, but trackpads clics, I cannot find another UL000 (wifi\/bt module) because I cannot find any donor board or chip, but I don't think that the board need that chip to boot.\nWhen plugged to an external display, we can actually see the apple logo, the machine will go to 10% of the progress bar and then shut down.\nSENSOR_PWR_EN is power cycling every 10-20s, and that is making all the current sense cycling too... I'm suspicious about u8100 being bad but that would be data gone, can something make u8100 cycle ?\nCPU\/GPU are getting hot and cold (cycle).\nDFU mode is impossible because the board is cycling.\nWhere should I start from there ?"
    },
    {
        "post_id":80535,
        "thread_id":61756,
        "title":"820-02020 M1 A2338 Power cycling",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-09-23 17:11:08",
        "message":"\"DFU mode is impossible because the board is cycling.\"\nDid you try it, or just supposed that?\n\nCan you access boot menu, or Internet Recovery?"
    },
    {
        "post_id":80543,
        "thread_id":61756,
        "title":"820-02020 M1 A2338 Power cycling",
        "user_id":29570,
        "username":"Kgrou",
        "post_date":"2021-09-23 22:21:51",
        "message":"I tried with the force dfu button, i can see the mbp in apple configurator 2 for 2s and then it reboots.\nNo acces to any boot menu because it reboot before, but the machine can start the process to the recovery boot, but will shut down after few seconds."
    },
    {
        "post_id":80546,
        "thread_id":61756,
        "title":"820-02020 M1 A2338 Power cycling",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-09-24 01:07:23",
        "message":"Did you maintain Force DFU button pressed?"
    },
    {
        "post_id":80560,
        "thread_id":61756,
        "title":"820-02020 M1 A2338 Power cycling",
        "user_id":29570,
        "username":"Kgrou",
        "post_date":"2021-09-24 03:55:32",
        "message":"i tried both : to maintain and without maintaining as explained in logi wiki\nBoth will show the machine in ac2 only for 2s"
    },
    {
        "post_id":80639,
        "thread_id":61756,
        "title":"820-02020 M1 A2338 Power cycling",
        "user_id":29570,
        "username":"Kgrou",
        "post_date":"2021-09-26 05:52:29",
        "message":"Any idea of what can cause u8100 to cycle ?"
    },
    {
        "post_id":80643,
        "thread_id":61756,
        "title":"820-02020 M1 A2338 Power cycling",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-09-26 07:11:33",
        "message":"PPBUS_AON steady voltage?\nBoard boots, but missing UL000 can cause the restart.\n\nThis board is probably waste of time..."
    },
    {
        "post_id":80648,
        "thread_id":61756,
        "title":"820-02020 M1 A2338 Power cycling",
        "user_id":29570,
        "username":"Kgrou",
        "post_date":"2021-09-26 09:04:25",
        "message":"Yes PPBUS_AON is stable. \nBoard is taking 20V and around 0.45 amps then drops to 0.12 amps.\nI noticed smth strange, sometimes the board will stay at 5V, unplugging and plugging back will make it go to 20V.\n\nIt may be UL000, if no one is having a solution i’m just going to wait until a donor board is available (hoping that UL000 isnt linked with U8100…)."
    },
    {
        "post_id":85991,
        "thread_id":61756,
        "title":"820-02020 M1 A2338 Power cycling",
        "user_id":28201,
        "username":"Mortentoft",
        "post_date":"2022-02-05 01:06:04",
        "message":"Hi’ i’ve had a similar issue with cycling amperage. I have found it only by thermalcam. There was no signs at all and because of that my thermalcamera helped me a lot:-). My PP3v3_S2-WLBT_ISNS was short on CL053 (underfilled area). ISO did not do it because the temp on damage was low (cycling). Do you have possibilities to use a Thermal camera?"
    }
]