{"post_id":2464,"thread_id":2464,"title":"[SOLVED] 820-2936 Backlight and sleep problem","user_id":67,"username":"bighead","post_date":"2016-05-09 15:43:02","message":"Hello,\n\nThis was a liquid damaged unit. I changed LP8550 and LCD connector.\nNow I have backlight. Only problem when I set the brightness it's not smooth, it's not continues.\nIt's \"flashing\" laggy when I set the brightness. I didn't really have this problem before.\n\nOnly blacklight problem I had it was no backlight, or I could see the leds at the bottom of the LCD.\nChanging the backlight sense resistors always solved that, but this is different now.\n\nThe second problem is that when it goes to sleep mode, it won't come back, if I press any button on keyboard.\nIt just comes back if I press the power button. I have PP3V3_S4. \n\nThank you."}
{"post_id":2470,"thread_id":2464,"title":"[SOLVED] 820-2936 Backlight and sleep problem","user_id":2,"username":"dukefawks","post_date":"2016-05-10 03:21:44","message":"First run ASD, this could be sensor issue or ME issue too."}
{"post_id":2503,"thread_id":2464,"title":"[SOLVED] 820-2936 Backlight and sleep problem","user_id":1,"username":"larossmann","post_date":"2016-05-11 09:31:47","message":"Please provide short video clip of what this looks like when setting brightness."}
{"post_id":2612,"thread_id":2464,"title":"[SOLVED] 820-2936 Backlight and sleep problem","user_id":67,"username":"bighead","post_date":"2016-05-15 09:32:45","message":"ASD test passed(100 test). No sensor issues. I cleaned the ME region anyway, but it didn't solve anything.\nI checked the sleep signals and it was weird. I was hoping it's not the PCH. I changed SMC and the sleep problem was resolved.\nI changed the LED driver(it came from digikey) from another board and that solve the backlight problem.\nI tried to make a video, but I can't really see the backlight problem on the video.\n\nThe macbook runs ok now, little bit hot but it's working.\n\nSolved.\n\nThank you!"}
{"post_id":2616,"thread_id":2464,"title":"[SOLVED] 820-2936 Backlight and sleep problem","user_id":1,"username":"larossmann","post_date":"2016-05-15 12:40:10","message":"We were using the same board at PBRS for LED driver soldering for three months. At the end it looked like a seizure. LED driver can cause this! issues with fset\/iset\/fltr\/etc.  Glad to see it's solved though."}
