[
    {
        "post_id":21048,
        "thread_id":21048,
        "title":"[SOLVED]820-4924 - No backlight, EDP_BKLT_EN Missing, SMC_LID High",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-05-30 09:33:29",
        "message":"Macbook came in water damaged after from what I remember a smoothie fell over it.\nGood luck for us is that a smoothie is pretty thick so it didn't get far inside of the laptop other then some ports which could be cleaned out easy.\n\nAlso I was the first one to open up this laptop, which is a nice change for once. No other failed\/shitty repairs have been attempted.\n\nThe device does POST and shows the Folder Question mark icon because the SSD is not plugged in.\nHowever there is no backlight\n\nEDP_BKLT_EN is 0V and is not directly shorted to ground\nLCD_PSR_EN is 0V\nSMC_LID is 3.3V\n\nThe display connector area had some smoothie goop on it, but no corrosion was left and it looks close to new. (The water detection sticker was only partially red)\nThe water detection sticker next to the fan connector on the top side of the board is fully white. Also no signs of any fluids can be detected around the CPU.\n\nThere is no corrosion around U8330, U7700 or the CPU\n\nRemoving R7742 to disconnect BKLT_EN from the driver did not bring EDP_BKLT_EN high.\n\nWhere to look? I assume something got a hit but I can't really figure out what part\nIt looks an awful lot like a SMC or CPU\/PCH issue, which would suck.\n\nThanks again for everyones help"
    },
    {
        "post_id":21065,
        "thread_id":21048,
        "title":"[SOLVED]820-4924 - No backlight, EDP_BKLT_EN Missing, SMC_LID High",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-05-30 16:47:29",
        "message":"LCD assembly would be a good suspect here first."
    },
    {
        "post_id":21246,
        "thread_id":21048,
        "title":"[SOLVED]820-4924 - No backlight, EDP_BKLT_EN Missing, SMC_LID High",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-06-03 05:23:59",
        "message":"Sorry it took a while, but I found a LCD assembly that works on a different Macbook Pro of the same model.\nStill no backlight on this board though, so the issue is probably somewhere else\n\nAny idea?"
    },
    {
        "post_id":21249,
        "thread_id":21048,
        "title":"[SOLVED]820-4924 - No backlight, EDP_BKLT_EN Missing, SMC_LID High",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2017-06-03 10:34:35",
        "message":"I've had many decent looking LCD connectors that had crap inside of them on these machines. I'd start with replacing the connector since it is your only working hint. Remember the LCD talks to the LED driver here to set brightness\/turning on."
    },
    {
        "post_id":21267,
        "thread_id":21048,
        "title":"[SOLVED]820-4924 - No backlight, EDP_BKLT_EN Missing, SMC_LID High",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-06-04 03:13:39",
        "message":"Diode mode on R7750\/51 and check continuity of these lines to the LCD connector."
    },
    {
        "post_id":22530,
        "thread_id":21048,
        "title":"[SOLVED]820-4924 - No backlight, EDP_BKLT_EN Missing, SMC_LID High",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-07-04 08:46:55",
        "message":"I decided to give it another try, and surprisingly enough BKLT_EN is actually there this time! Maybe the connector wasn't in correctly the last time, maybe the cleaning helped or re-soldering the connector, not sure if we will ever know.\nPoint being its there, so the chip should turn on!\n\nHowever there is still 0V on LCDBKLT, funny enough the Keyboard backlight is getting its 5V.\n\nThere is no short on LCDBKLT\nR7702 is not being pulled to ground by the IC, so no current is going through Q7700. Also R7701 and R7702 are within their allowed resistance values\nI2C seems to work, its there. Communication seems to be happening. I checked and booting in the OS shows me the backlight is set to full (So its not disabled by software)\n\nAlready replaced U7700 from a donor and nothing changed, exact same behaviour.\nPads and surrounding area look brand new, no corrosion or discolouration.\n\nI feel like I'm over looking something, any ideas?"
    },
    {
        "post_id":22548,
        "thread_id":21048,
        "title":"[SOLVED]820-4924 - No backlight, EDP_BKLT_EN Missing, SMC_LID High",
        "user_id":468,
        "username":"ALB-Repairs",
        "post_date":"2017-07-04 13:54:45",
        "message":"when you say you tried a display from the same model, was it a 2015 (4924?) \nA 2013 model screen will not give backlight on 820-4924's"
    },
    {
        "post_id":22555,
        "thread_id":21048,
        "title":"[SOLVED]820-4924 - No backlight, EDP_BKLT_EN Missing, SMC_LID High",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-07-04 14:42:15",
        "message":"Hmm, I'm not too sure. I haven't written down the screen I tried it with in the log\n\nI think it was from a Mid-2014, I don't have any 2015 display's to check it with sadly. High chance the display is the issue? Because if its really needed I may just buy the part and keep it as stock for later"
    },
    {
        "post_id":22560,
        "thread_id":21048,
        "title":"[SOLVED]820-4924 - No backlight, EDP_BKLT_EN Missing, SMC_LID High",
        "user_id":468,
        "username":"ALB-Repairs",
        "post_date":"2017-07-04 14:50:19",
        "message":"Yes, 2013-14 are compatible, 2015 will not backlight with a 2013-14 screen. though you will have the 5v LCD enable, and i belive a display (but youll have to shine a torch through the back of the apple logo to see)\nBuy a 2015 assembly, youll need one for testing anyway. Im fairly certain with what youve said you may well have a working board."
    },
    {
        "post_id":22575,
        "thread_id":21048,
        "title":"[SOLVED]820-4924 - No backlight, EDP_BKLT_EN Missing, SMC_LID High",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-07-04 16:09:10",
        "message":"I'll see if I can get my hands on a display assembly, I'll let you know!\n\nThanks"
    },
    {
        "post_id":23872,
        "thread_id":21048,
        "title":"[SOLVED]820-4924 - No backlight, EDP_BKLT_EN Missing, SMC_LID High",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-08-06 03:24:12",
        "message":"Just want to confirm that a replacement display assembly did indeed fix the issue! Backlight is working :)\n\nThanks [USER=\"468\"]ALB-Repairs[\/USER]"
    },
    {
        "post_id":27513,
        "thread_id":21048,
        "title":"[SOLVED]820-4924 - No backlight, EDP_BKLT_EN Missing, SMC_LID High",
        "user_id":557,
        "username":"MDY",
        "post_date":"2017-10-30 05:32:12",
        "message":"[QUOTE=\"ALB-Repairs, post: 22560\"]\nBuy a 2015 assembly, youll need one for testing anyway. [\/QUOTE]\n\nYou can test retina board 820-4924 with retina 2013 screen. Yes it works!!! You need to boot from usb or ssd and you will not see how the OS X load, but after 1 minute you will see the desktop. So retina 2013 screen is OK to test 2015 models!"
    }
]