{"post_id":6385,"thread_id":6385,"title":"[SOLVED]820-3476 Backlight Troubleshooting","user_id":110,"username":"MOberdick","post_date":"2016-09-05 10:10:47","message":"So I have a 820-3476 board I bought off of eBay with no backlight and its been kinda throwing me for a loop for a little while now. The backlight circuit looks slightly different than previous models with the 1st transistor (at the bottom of the first voltage divider) being integrated with the U7700? At least thats what it looks like... Anyways, the area looked pretty messed up so I went ahead and replaced U7700, both R7731 and R7732 on the feedback trace, and the D7710 diode (all visually looked like crap). Still no backlight. I do have 3.3v on the enable pin of U7700 however Q7700 isn't opening because there is 12.56v on pin 4, and also 12.46v on pin 3 (too much) which is why I'm assuming the backlight isn't kicking on. I've confirmed the resistance on both resistors for the first voltage divider and they're giving proper readings.. what am I overlooking?? I'm leaning towards my doner board had a bad U7700 chip that I grabbed.. Ideas?"}
{"post_id":6392,"thread_id":6385,"title":"[SOLVED]820-3476 Backlight Troubleshooting","user_id":2,"username":"dukefawks","post_date":"2016-09-05 14:45:50","message":"Are you sure there is an image on the LCD, check with a flashlight. If that is ok check pin 15 and 16 of U7700 for continuity to LCD connector."}
{"post_id":6394,"thread_id":6385,"title":"[SOLVED]820-3476 Backlight Troubleshooting","user_id":110,"username":"MOberdick","post_date":"2016-09-05 15:47:10","message":"Yes I do see the apple logo each time I'm testing it. Very hard angle to test for continuity lol but yes, multimeter did in fact beep between pins 15\/16 of the chip and 3\/4 of the LCD connector."}
{"post_id":6396,"thread_id":6385,"title":"[SOLVED]820-3476 Backlight Troubleshooting","user_id":2,"username":"dukefawks","post_date":"2016-09-05 18:40:52","message":"It's time to check all resistors and traces. First suspects would be:\npin 9 and 10, there should be 0 ohm between if traces are ok\n5V to pin 5 and 18\ntrace between D7710 and R7731\nAnd all the rest if that is ok......"}
{"post_id":6413,"thread_id":6385,"title":"[SOLVED]820-3476 Backlight Troubleshooting","user_id":110,"username":"MOberdick","post_date":"2016-09-06 08:37:17","message":"Well I did have to repair the trace between D7710 and R7731... but there's also a 2nd problem being that R7732 has continuity to ground on both sides.. Don't have another doner of this model board but I can probably find another resistor if needed.. Or would the chip be shorting it to ground?"}
{"post_id":6424,"thread_id":6385,"title":"[SOLVED]820-3476 Backlight Troubleshooting","user_id":2,"username":"dukefawks","post_date":"2016-09-06 17:48:44","message":"I'd first remove R7732 and check again. If still short it could be short between pin 21 and 22 on U7700, or a dead U7700 or even a short in the board."}
{"post_id":6444,"thread_id":6385,"title":"[SOLVED]820-3476 Backlight Troubleshooting","user_id":110,"username":"MOberdick","post_date":"2016-09-07 10:18:39","message":"With removal of R7732 there is still a short on both pins.. Just gonna order a new U7700 and try it out next week."}
{"post_id":6452,"thread_id":6385,"title":"[SOLVED]820-3476 Backlight Troubleshooting","user_id":2,"username":"dukefawks","post_date":"2016-09-07 12:58:36","message":"Remove U7700, there could be a short in the board!"}
{"post_id":6781,"thread_id":6385,"title":"[SOLVED]820-3476 Backlight Troubleshooting","user_id":110,"username":"MOberdick","post_date":"2016-09-15 15:01:40","message":"Just to post a final update. Another new display driver chip fixed the issue!"}
