[
    {
        "post_id":78936,
        "thread_id":61581,
        "title":"820-0840 5v 0.1A power bounce 1 sec.. ( Works with battery BMS disconnected. )",
        "user_id":5210,
        "username":"KC Micro Tronix",
        "post_date":"2021-08-17 15:00:38",
        "message":"This is strange......\nMachine will show 5v on the USBC meter and read 0.01A for a second and reset.\n\nWhen I disconnect the BMS the unit powers up and works! ( J6951 )\nWith the battery BMS connected it just bounces and resets.  ( I have changed the battery using a tester and get the same result! )\n\nI diode checked SMBUS_SMC_5_G3H_SDL \/ SCA and both are normal\nI checked SYS_DETECT_L it also appeared normal\n\nHistory on this system.\nIt was serviced by another technician for screen replacement.   They changed the screen and this was the result.   The original screen is back on and does function with the same defect it had before ( lines across the bottom of the screen ) and works normally if the BMS is disconnected.\n\nSMC?  What the heck?"
    },
    {
        "post_id":78950,
        "thread_id":61581,
        "title":"820-0840 5v 0.1A power bounce 1 sec.. ( Works with battery BMS disconnected. )",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-08-18 03:47:39",
        "message":"Post PPBUS_G3H exact voltage, w\/ and w\/o battery connected.\nDid you find correct communication signals with o-scope on battery bus?\nSYS_DETEDT_L stays low?\n\nSo the same board stays on (bad LCD image) with original screen assembly?\nBut the board doesn't turn on with new screen?\n\nBTW, BMS is inside the battery; if you think about Battery Management System."
    },
    {
        "post_id":79001,
        "thread_id":61581,
        "title":"820-0840 5v 0.1A power bounce 1 sec.. ( Works with battery BMS disconnected. )",
        "user_id":5210,
        "username":"KC Micro Tronix",
        "post_date":"2021-08-19 09:46:58",
        "message":"The Battery was replaced temporally with a new one and the board had the same fault.   If the BMS ribbon is connected it will not post.\nThe fault is the same regardless if the screen is attached or not."
    },
    {
        "post_id":79005,
        "thread_id":61581,
        "title":"820-0840 5v 0.1A power bounce 1 sec.. ( Works with battery BMS disconnected. )",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-08-19 10:55:48",
        "message":"Actually, machine boots with battery connected, but then gets only lines on internal screen?\n\nWhat happens if you connect battery data cable, without battery power connector?"
    }
]