{"post_id":21895,"thread_id":21895,"title":"820-2914 LCD Backlight problem","user_id":167,"username":"macfix","post_date":"2017-06-19 02:20:35","message":"Hello Everyboady\n\n\nWorking on 820-2914 with no backlight problem. Some one worked on this board before us and connected PBUS_S0_LCDBKLT_EN_DIV to direct ground so when machine turn on direct start LCD backlight and when sleep computer LCD backlight not turning off. ( but machine working normally) \n\nI checked enable signal its 1.1V its too low. removed q9807 and R9840 its same value. This signal comes from u9600 but i want to ask , can i create fake Backlight enable signal for turn backlight on when machine working normal and turn off when computer sleep?"}
{"post_id":21900,"thread_id":21895,"title":"820-2914 LCD Backlight problem","user_id":1,"username":"larossmann","post_date":"2017-06-19 06:43:27","message":"The first thing to do is ensure that SMC_LID is its proper 3.3-.3.4v. As low as 2.9-3.0v and I have had backlight issues before, which is odd, as the manual states 0.5v as the [I]\"lid closed\"[\/I] point. Oddly enough - 2.9v on SMC_LID will[I]NOT [\/I]put the machine to sleep, but it has turned off the backlight for me. I could be wrong as from memory, even when SMC_LID was artificially low, I had 19-22v on backlight output, implying that Q9706\/Q7706 was opening.\n\nOnce that's done and we've confirmed the sad truth that the mux is probably bad, you could tie LCD_BKLT_EN to PP3V3_S0 with a 10k resistor inbetween. This way it would only be on when the machine is in an S0 state; in an S3 state PP3V3_S0 will not be present so no more sleeping LCD backlight.\n\nBKL_PWM will go low when the display backlight is supposed to turn off. The proper fix for this would be replacing the mux but considering the work involved in doing this, and that the GPU will die in two months anyway, the ghetto fix may be the worthwhile one."}
{"post_id":21936,"thread_id":21895,"title":"820-2914 LCD Backlight problem","user_id":2,"username":"dukefawks","post_date":"2017-06-19 17:30:43","message":"You would connect it to LCD_EN, backlight turns in when LCD is on."}
