{"post_id":71188,"thread_id":60728,"title":"A1466 Early 2015 820-00165-A board problem","user_id":29628,"username":"Askaleto","post_date":"2021-02-05 10:07:53","message":"Hello Macbook repair experts. \nFirst of all, I have virtually no experience with repiring macbooks and this is my first one with faulty logic board. I do have limited experience with repairing PC laptops.\nI watched many youtube videos from Louis Rossmann channel, so the concepts are clear to me.\n\nSo, I have on my desk Macbook Air A1466 EMC2925, Early 2015 with faulty motherboard. The customer said that it was working fine until it failed to update from Catalina to Big Sur. When plugged charger laptop starts with very loud fan noise but no chime and no POST and image. So it is \"braindead\".\n\nWhen I opened laptop, I noticed that the board is very clean with tiny trace of corrosion (green) on one place on the board and what I noticed immediately is that there was some kind of previous repair attempt. The load switch U8030 was desoldered and removed from the board. After visual inspection I cannot determine if something else is removed but it seems not.\n\nFirst of all, is it possible Macbook Air to work without U8030? \n\nLogic board is removed from teh laptop and it is conencted only with I\/O board (because of charger). When charger is conencted to the board there is a green light which soon becomes orange and fan starts working at full speed. That is basically all.\n\nI have performed some measurements on the board and this is what I have:\nPPBUS_G3H = 8.56V\nPP3V425_G3H = 3.42 V (also indication on the charger).\n[B]PP3V3_S0 = 0.54V[\/B] ->this is problem\nPP3V3S0_EN =  3.23V (there is enable on U830, but the chip is removed in previous repair).\nPP5V_S0 = 5.12V\nPP3V3_S4 = 3.32V\nPP3V3_S5 = 3.32V\nPP3V3_SUS = 3.32V\nPP3V3_S4_FET_R = 3.32V\nPM_SLP_S3_L = 3.31V\nPM_SLP_S4_L = 3.32V\n\nOn coils L7310 and L7320 I measure 0.0V, but I could swear I saw once 1.7 V (after many charger plugging\/replugging)\n\nThis problem reminded me to the one described here: [URL]https:\/\/boards.rossmanngroup.com\/threads\/solved-macbook-air-820-3437-b-power-issue-on-pp3v3_s0-or-something-else.26755\/[\/URL]\n\nThe corrosion (green color) was around C1930 and this caps is not present on the board. There is a resistor R on which R1931, on which I measure 10.8 kohm and 1.05V\n\nI have also measuren on C7711 (line PP3V3_S0) toward ground in diode mode and reading is 387, which means there is no short to ground on PP3V3_S0.\n\nCurrently I don't have spare U8030, and I wonder could I short (bridge) input and output pins on the board in order to send PP3V3_S5 to PP3V3_S0_FET_R?\n\nI have found on some other forums that when PP3V3_S0 was missing that troubleshoot procedure also removed U0830, but don't understand exactly why.\n\nRight now, I have 0.54V (stable) on PP3V3_S0 line. All measurements are very stable (or my multimeter is very slow to react to sudden changes if any).\n\nI I hope you'll be able to help me."}
{"post_id":71190,"thread_id":60728,"title":"A1466 Early 2015 820-00165-A board problem","user_id":1057,"username":"piernov","post_date":"2021-02-05 10:43:43","message":"Buy donor board and replace missing\/corroded parts.\nOf course it doesn't match with the history of dying after macOS upgrade (which would rather be corrupt SPI ROM for example), so either customer isn't telling the truth or you don't have the original board of that MacBook in front of you."}
{"post_id":71194,"thread_id":60728,"title":"A1466 Early 2015 820-00165-A board problem","user_id":29628,"username":"Askaleto","post_date":"2021-02-05 10:59:28","message":"Hello piernov and thank you for your reply. Yes, I concluded the same regarding the history. As for corroded parts, there is a trace of teh corrosion only on place of C1930. This cap is no longer on the board and I don't think it is necessary to find a replacement cap. I do have PP1V05 and it is stable 1.05V. This cap is filter on PP3V3_S5. So the board should work without that cap. But I wonder about U8030 chip?\n\nSo, the board cannot work without U8030, is that right conclusion?"}
{"post_id":71196,"thread_id":60728,"title":"A1466 Early 2015 820-00165-A board problem","user_id":1057,"username":"piernov","post_date":"2021-02-05 11:05:12","message":"Always replace corroded components and don't leave them off, this is the basis of quality work. The machine can work even if certain caps are missing (and sometimes even other components), but it doesn't apply to all of them, and the machine can get unstable if it's missing caps."}
{"post_id":71197,"thread_id":60728,"title":"A1466 Early 2015 820-00165-A board problem","user_id":29628,"username":"Askaleto","post_date":"2021-02-05 11:09:07","message":"Ok, but right now for the purpose of testing and ruther troubleshooting, is it safe to short  PP3V3_S5 to PP3V3_S0_FET_R on the place of missing U8030, just to see what is further behavior?"}
{"post_id":71204,"thread_id":60728,"title":"A1466 Early 2015 820-00165-A board problem","user_id":29628,"username":"Askaleto","post_date":"2021-02-05 13:23:52","message":"In addition to previously described, I have noticed that voltage on C6950\/6951 which is PPVBAT_G3H_CONN oscillates. No battery is connected, the board with I\/O board is on the desk. I measure 8.56 then it goes down to zero and then back to 8.56 and so on. But voltage on F7140 (PPBUS_G3H) is stable 8.56 V. Not sure if that is significant in any way."}
{"post_id":71221,"thread_id":60728,"title":"A1466 Early 2015 820-00165-A board problem","user_id":682,"username":"2informaticos","post_date":"2021-02-05 17:04:00","message":"Do not check battery connector pins, if there is not battery present.\nPPBUS_G3H is correct, do not waste time in U7100 area.\n\nU8030 is critical, place it back!\nYou can try bypassing it, but SMC can detect overload and stops the board; may need to start in SMC bypass mode, only for test."}
{"post_id":71253,"thread_id":60728,"title":"A1466 Early 2015 820-00165-A board problem","user_id":29628,"username":"Askaleto","post_date":"2021-02-06 06:31:47","message":"Hello 2informaticos, \nI have order a donor board and will try to replace the U8030. It will take a couple of days."}
{"post_id":71312,"thread_id":60728,"title":"A1466 Early 2015 820-00165-A board problem","user_id":29628,"username":"Askaleto","post_date":"2021-02-07 13:58:18","message":"Since U8030 is a load switch TPS22924C with the following characteristics: current = 2A Max, Ron = 25.8 mOhm at 2.5V and it will take more than a week to be delivered, I was thinking to use an alternative one with (what it seems to me) better characteristics. I think I can use  FDS6676AS N channel MOSFET. This chip is significantly bigger than original, but there is more than plenty space on the board. I was thinking I can make something like shown in the attached picture. Someone may consider this doggy, but it could work.\n\nPlease tell me what you think."}
{"post_id":71313,"thread_id":60728,"title":"A1466 Early 2015 820-00165-A board problem","user_id":682,"username":"2informaticos","post_date":"2021-02-07 16:03:12","message":"Did you think what Vgs voltage requires that N-channel MOSFET to open???"}
{"post_id":71322,"thread_id":60728,"title":"A1466 Early 2015 820-00165-A board problem","user_id":29628,"username":"Askaleto","post_date":"2021-02-08 00:00:09","message":"At first glance, I rejected this idea, because I need to have MOSFET ON at 2.8 V( 3.23V-054V). But I saw that typical treshold voltage is 1.5 V and max 3 V for this MOSFET, so I made little experiment on a desk and it opens on about 2.7V, which is really at the edge. Probably, this will sometime works and sometimes doesn't depending of the temperature. But since I have a few PC notebook boards, I found one more type used and that is  AON7408 30V N-Channel MOSFET . This is also on the edge, but on the schematics I found that this creates 1.2 V. Perhaps, I'm interpreting something wrong, but that is why I'm asking before actual testing. Like Louis said in one of his youtbe videos \"Never be afraid to show to others how dumb you are\" :)"}
{"post_id":71327,"thread_id":60728,"title":"A1466 Early 2015 820-00165-A board problem","user_id":682,"username":"2informaticos","post_date":"2021-02-08 03:31:16","message":"Get correct chip replacment and stop to waste your time.\nA power MOSFET requires 5-10V for Vgs to work properly.\nLower voltage will mean higher internal resistamce and can be fried."}
{"post_id":71334,"thread_id":60728,"title":"A1466 Early 2015 820-00165-A board problem","user_id":1057,"username":"piernov","post_date":"2021-02-08 05:52:22","message":"You need to have at least some electronics knowledge to be able to fix a device as complex as a Mac logic board.\nAs the name says, Vgs is voltage between gate and source. If you have 3.3V with respect to ground on source, it means you need 3.3V + Vgs on the gate with respect to ground. Also an ideal MOSFET doesn't exist, the on-state resistance progressively increases when Vgs decreases (ie. low Vgs = higher losses = higher power dissipation).\n\nPlease stop messing with customer's boards worth $300. Additionally performing low-quality repairs is the perfect way to discredit the whole third-party repair industry. If you watched a lot of Louis Rossmann videos, these concepts should be clear as well."}
{"post_id":71337,"thread_id":60728,"title":"A1466 Early 2015 820-00165-A board problem","user_id":29628,"username":"Askaleto","post_date":"2021-02-08 06:32:41","message":"Hello,\n\ndonor board arrives next Monday. In the meantime I thought to try to find an alternative solution. Never repair Mac before and I have a lot of PC laptop boards. \nI'm not messing with anything except maybe MS Paint. Everything that came to my mind I asked here first.  \nThis alternative idea was more likely Sorin's approach :)\n\nAnyway, next Monday, I'll know more. I have found almost identically problem here on the forum (link pasted in the first post), but the solution is not clear. I don't know what it means that Jtag connector was source of the problem."}
{"post_id":71338,"thread_id":60728,"title":"A1466 Early 2015 820-00165-A board problem","user_id":682,"username":"2informaticos","post_date":"2021-02-08 07:26:33","message":"Corrosion underneath J6100 can block correct communication between PCH and BIOS chip (U6100).\nYou must replace missing components first."}
{"post_id":71590,"thread_id":60728,"title":"A1466 Early 2015 820-00165-A board problem","user_id":29628,"username":"Askaleto","post_date":"2021-02-12 16:46:38","message":"Ok guys, here is the update. The donor board arrived faster than I expected. I have removed TPS22924 load switch from the donor board and I managed to solder it on the faulty board. This was no easy, since my hot air rework station is not exactly state of the art and the chip is 1.4 mm x 0.9 mm. At one point, I even consider to give up. Eventually, it was soldered successfully, and after that I had PPV3V3_S0 and ALL_PWR_GOOD. The vcore voltage on the coils phase 1 and phase 2 were 1.25V. I have connected everything and the MacBook Air booted up very nicely. Everything seems to be fine. I have played with the laptop for about an hour and after next power on fan was running at full speed, but computer booted normally and I could work without any problems. I have tried to reset SMC but that didn't solve the problem. I have installed Macs FAN control and all temperatures were OK, when I put fan speed on auto based on sensor based, rpms went significally down. I even type this post from this MacBook Air. Max temperature is Intel GPU 40 degrees C. So it seems that this is not a hardware problem as I thought at first place, but I know that I need some special diagnostic software to read all sensors.\n\nSo my next question, before concluding this job is could be this possible still a sensor issue. If some sensor  is bad (for example plan rest sensor), would it fan still run full sped even Macs fan control app is installed?\n\nThank you."}
{"post_id":71592,"thread_id":60728,"title":"A1466 Early 2015 820-00165-A board problem","user_id":682,"username":"2informaticos","post_date":"2021-02-12 17:09:41","message":"Possibly ALS problem.\nDisconnect webcam and test again.\nYou should also test another trackpad flex\/board; clean first the contacts of the flex."}
{"post_id":71599,"thread_id":60728,"title":"A1466 Early 2015 820-00165-A board problem","user_id":29628,"username":"Askaleto","post_date":"2021-02-13 00:09:04","message":"Hello 2informaticos, is ALS ambient light sensor or something else?\nIs there any way I can read sensors data or test it myself. I've seen this can be done in ASD, but I'm not sure how exactly."}
{"post_id":71604,"thread_id":60728,"title":"A1466 Early 2015 820-00165-A board problem","user_id":682,"username":"2informaticos","post_date":"2021-02-13 03:51:27","message":"No ASD available, since 2015.\nALS is embedded into camera circuitry; disconnect and test."}
{"post_id":71609,"thread_id":60728,"title":"A1466 Early 2015 820-00165-A board problem","user_id":29628,"username":"Askaleto","post_date":"2021-02-13 04:23:26","message":"Ok, I have removed the the connector from the web cam and everything is the same. I also brushed the contacts of the flex cable for trackpad with alcohol a bit and that didn't help either.\nYesterday, everything was working fine for about and hour or two, then fan suddenly increased the speed. Webcam, trackpad and everything else seem to work just fine.\nI don't have another trackpad to test, MacBooks here are very rare. Interesting, when laptop is first powered ON fan is not at full speed until loading Mac OS Big Sur approximately at half progress bar. Then it starts full speed. Also, when I choose restart, it immediately goes full speed during laptop restart.\n\nIs there any way I can read the data from sensors to know if this is a failed sensor?"}
{"post_id":71613,"thread_id":60728,"title":"A1466 Early 2015 820-00165-A board problem","user_id":682,"username":"2informaticos","post_date":"2021-02-13 05:28:50","message":"You can read sensors with HWMonitor.\nHowever trackpad failure can affects the results; need to replace for test."}
{"post_id":71614,"thread_id":60728,"title":"A1466 Early 2015 820-00165-A board problem","user_id":29628,"username":"Askaleto","post_date":"2021-02-13 06:20:23","message":"Thank you for the reply. The screenshot of HWMonitor is attached. There are problems with palmrest and airport(?) sensors. However since I don't have spare trackpad, I can only try to pull out ?plug in the flex cablegram the trackpad again. It seems there are no more options. Is that so?\n\nIs sensor attached on the trackpad or on the cable. Trackpad works without any problems."}
{"post_id":71622,"thread_id":60728,"title":"A1466 Early 2015 820-00165-A board problem","user_id":682,"username":"2informaticos","post_date":"2021-02-13 10:13:51","message":"Palm rest temp sensor is on the trackpad board.\nFan goes to full spin, if SMC cannot talk with that sensor.\nYou cannot test disconnecting trackpad cable."}
{"post_id":71624,"thread_id":60728,"title":"A1466 Early 2015 820-00165-A board problem","user_id":29628,"username":"Askaleto","post_date":"2021-02-13 10:33:34","message":"Hello 2informaticos and thank you for your explanations. I am a bit confused, because there are some other other sensors showing high temperatures such as airport and memory modules, which should not be connected and have something in common.\nAnyway, I have explained to the customer that laptop is in good working condition now, very responsive and fast. He's happy to have access to his data again and can use the laptop again. He'll take his laptop on Monday.\n\nAs far as I'm concerned, I'll need to dig a bit further to understand what else I need to order if he decide to solve these issues later.\nSo far, it is certain that a new trackpad with flex cable needs to be ordered. Should I also order I\/O board with charging, headphones  and USB port?\n\nThis was my first actual experience repairing MacBooks and so far, it seems a successful one. The small cables and miniature connectors are very tricky and one can easily damage something because of lack of space nearby, especially in fan area. This is much better designed at PC laptops (at least from repairman's point of view)."}
{"post_id":71632,"thread_id":60728,"title":"A1466 Early 2015 820-00165-A board problem","user_id":682,"username":"2informaticos","post_date":"2021-02-13 11:41:18","message":"More sensors are connected on the same bus.\nIf one fails, SMC gets confused and reports various erroneous values."}
