[
    {
        "post_id":88903,
        "thread_id":62640,
        "title":"820-3787 White or Gray Screen, does chime, no Apple Symbol",
        "user_id":32178,
        "username":"prodigy83",
        "post_date":"2022-04-27 13:49:09",
        "message":"Motherboard does not appear to have any liquid damage, client had the computer put away in a closet for 2 years because the blank screen was all he got. \nI did replace the L8300 because it caught on fire when I was doing testing. I gave it a new LVDS cable, gave it a new J8300 connector. I verified the LVDS cable was making contact on both sides. I actually did have it working briefly, but when I went to put the computer back together, it went back to the same thing, so it is intermittent. I was also able to get an external screen working via DisplayPort. As of right now though, I only hear it chime, and the USB mouse is not lighting up. I noticed from thermal camera at one point U2800 was getting pretty hot, but it all seems to be working. I am thinking a GMUX issue? Right now the external screen via Displayport is no longer working (maybe the intermittent issue?).\nHere are some troubleshooting points I found interesting:\nQ7706 pins 3 and 4 have 12V, but nothing for pins 6\/5\/1\/2.\nQ9690 pin 1 is 3.3V, pin 3 is nothing.\nI tried heating up U9600 but no changes. \nI can see the GPU and CPU does heat up when plugged in from thermal camera. Magsafe does show Green to amber. SMC and PRAM resets did work with onboard keyboard, but seemed very slow at responding to the SMC reset each time. \nR8318, around this area looks a little dirty, but nothing stood out visually. \nWhere do I go from here? Thank you!"
    },
    {
        "post_id":88904,
        "thread_id":62640,
        "title":"820-3787 White or Gray Screen, does chime, no Apple Symbol",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-04-27 15:40:58",
        "message":"Check SMC_LID signal.\n\nIf LCD stays pure white, 3V not going to TFT matrix; did you try another (compatible) internal LCD ?"
    }
]