{"post_id":91194,"thread_id":62910,"title":"Testing USB-C boards on bench","user_id":2508,"username":"No-Clean","post_date":"2022-07-18 23:59:02","message":"I know the forum is not for this type of questions, but with the older non USB-C model boards I could test USB activity and, image, backlight etc with just power, now with this new boards I cant, as far as I can tell the battery needs to be connected and good in order for the board to boot and show for example USB activity.\n\nWhat is the best fastest way to test this boards when you already get 20V on charger? \n\nCan I use a know good battery that has the same flex connector for all of them to test or what is the best way to go so I dont have to put them in the case back again each time I have to test them?\n\nPlease advice and thanks in advanced."}
{"post_id":91197,"thread_id":62910,"title":"Testing USB-C boards on bench","user_id":682,"username":"2informaticos","post_date":"2022-07-19 02:36:16","message":"When you get in hands an working machine, check if correctly boots on charger alone (no battery).\nThis let you know in future repairs you can go ahead without good battery connected.\nHowever, be aware that we have mentions about boards which sometime booted w\/o battery and sometime not; for the same board model.\n\nWhen you are not sure about USB activity, or video, check CPU core voltage after 10-15s; usually should note about half volt drop from initial voltage.\nYou can write down the behavior of the working boards; for comparison reason.\n\nAlso good to test known good working board if boots with test battery connected out of case; try to get good contact on the power line.\nTesting with different batteries allows you to make a compatibility list."}
{"post_id":91233,"thread_id":62910,"title":"Testing USB-C boards on bench","user_id":2508,"username":"No-Clean","post_date":"2022-07-19 15:58:59","message":"Thanks, there seems to be 2-3 different batteries, I have now made some test ones I can have handy and I will start to note what models start with and without batteries."}
