{"post_id":3472,"thread_id":3472,"title":"820-3588 - No internal DP recognized","user_id":212,"username":"Mellerv89","post_date":"2016-06-10 16:37:54","message":"The internal display of concerned iMac is not being recognized in OSX and doesn't turn on. With an external display connected everything works fine.\n\nUnfortunately I have not managed to find any boardview files for this specific model - thus debugging it is quite painful.\n\nDiagnostic LED 4 does not turn on - when powering on the device and attaching my multimeter to port 1 of U4450 the LED does turn on - have not attempted this with the screen enabled as thats not a fix of any kind. This seems to indicate that VIDEO_ON is somehow not being set to high properly, causing the screen not to toggle itself on.\n\nSome relevant measurements:\n\n[B]Display connector - J4400 measured[\/B]\n1 12,14\n2 12,14\n3 12,14\n4 12,14\n5 12,14\n6 12,14\n7 gnd\n8 gnd\n9 gnd\n10 gnd\n11 gnd\n12 gnd\n13 2,1\n14 2,1\n15 1,537\n16 1,54\n17 0,719\n18 0,532\n19 gnd\n20 0,128\n21 0,756\n22 gnd\n23 missing\n24 missing\n25 gnd\n26 missing\n27 missing\n28 gnd\n29 0,76\n30 0,537\n\n[B]U4450 measured[\/B] ([URL]http:\/\/www.nxp.com\/documents\/data_sheet\/74AUP2G14.pdf[\/URL])\n1 0,765\n2 gnd\n3 3\n4 Short to GND when iMac is powered on\n5 3,3\n6 3,3\n\nI presume that pin 4 is not supposed to short to ground when power is enabled - the short is not present when board is off. Could this be due to this chip or the active backlighting circuitry (mainly a transistor of some kind and a MOSFET).\n\nI think I need to replace U4450 or Q8101. I have a U4450 component available, but don't want to risk blowing it to pieces if the attached circuitry might be able to destroy it... I have not yet been able to locate Q8101..\n\nThanks for your help already!"}
{"post_id":3478,"thread_id":3472,"title":"820-3588 - No internal DP recognized","user_id":2,"username":"dukefawks","post_date":"2016-06-11 05:16:08","message":"Did this \"just\" happen or was the LCD removed\/replaced and then it happened?"}
{"post_id":3480,"thread_id":3472,"title":"820-3588 - No internal DP recognized","user_id":212,"username":"Mellerv89","post_date":"2016-06-11 05:48:32","message":"Just happened. The iMac is never disassembled or repaired before."}
