{"post_id":73669,"thread_id":60986,"title":"820-2828-A","user_id":24760,"username":"2click","post_date":"2021-03-29 15:55:19","message":"Hi, this is the first iMac that I get to repair so I don´t really know where to start. It powers on but sometimes it shows image on the screen, replaced the EG card with a working known one and it didn´t show image, the I have 2 leds on on the board, the last 2 doesn´t turn on. Where should I start? thank you!"}
{"post_id":73670,"thread_id":60986,"title":"820-2828-A","user_id":682,"username":"2informaticos","post_date":"2021-03-29 17:14:20","message":"Tell us which coils get voltage.\n\nAny history available?\nDid you try known good power supply?"}
{"post_id":73672,"thread_id":60986,"title":"820-2828-A","user_id":24760,"username":"2click","post_date":"2021-03-29 17:18:07","message":"Hi the board turns on fine, it chimes and loads system, so far I´ve tried another powersupply another inverter card and another lcd with the same result, when I turn it on it chimes but I have no image on the screen... When I tried a known good video card it showed image and booted to the login screen, but I turned it off. The next time I turned it on, it didn´t show image. What should I check first?"}
{"post_id":73679,"thread_id":60986,"title":"820-2828-A","user_id":682,"username":"2informaticos","post_date":"2021-03-29 18:19:06","message":"So original graphics card never gets image?\nDid you check external video, when no internal image?"}
{"post_id":73700,"thread_id":60986,"title":"820-2828-A","user_id":24760,"username":"2click","post_date":"2021-03-30 10:51:53","message":"Yes I´ve checked that, right now I get no image at all nor internal or external... only 3 of the 2 leds ON, is that a problem with the comunication between LCD or  GPU to the mother board? Please help me figure this out... I have 3 imacs experiencing the same fault... When it turned on, we used it and when we were watching videos on youtube, the image went off, but we could still hear the audio... thats why I know the computer works..."}
{"post_id":73704,"thread_id":60986,"title":"820-2828-A","user_id":682,"username":"2informaticos","post_date":"2021-03-30 12:48:40","message":"Test with both internal LCD and external monitor connected.\nIf video fails on external monitor at same time, there is a GPU related problem."}
