{"post_id":31323,"thread_id":31323,"title":"How to test a mosfet?","user_id":386,"username":"wirelessplanet","post_date":"2018-02-10 14:39:53","message":"I know its iPhone, but was having issues with an iPhone graphics and I think one of the mosfets is bad on the PP_GPU line.  Was wondering how do you test to see if one of the mosfet's are bad."}
{"post_id":31324,"thread_id":31323,"title":"How to test a mosfet?","user_id":1269,"username":"EJS","post_date":"2018-02-10 16:40:47","message":"What makes you think the FET is bad? What type of graphics issues are you having, have you looked up the part number of the component to determine what type of mosfet you're trying to test?"}
{"post_id":31326,"thread_id":31323,"title":"How to test a mosfet?","user_id":386,"username":"wirelessplanet","post_date":"2018-02-10 17:28:41","message":"[URL=\"https:\/\/www.dropbox.com\/s\/gbnj8ckqvcc1qcv\/20180210_114338.mp4?dl=0\"]https:\/\/www.dropbox.com\/s\/gbnj8ckqvc...14338.mp4?dl=0[\/URL]\n\n\n\n\nThis iphone 6s was a massacre. Corrosion was everywhere. I had to fix vcc main, vcc bat, tigris and trisar and replace the backlight line . Finally got the phone to stay turned on without a heat short. But I've never experienced this. Boots up with apple logo, but random dots everywhere on the screen and does not go past that. Board doesn't heat up anywhere either. I checked the pp_gpu on resistant mode and tested the line and compared to working board. Nothing seemed off. I was thinking that maybe of the mosfets are bad because they are the data lines and its not sending\/receiving the proper data from gpu."}
{"post_id":31336,"thread_id":31323,"title":"How to test a mosfet?","user_id":2,"username":"dukefawks","post_date":"2018-02-10 19:12:38","message":"I doubt the FETs are bad when the voltage is correct. It is possible but highly unlikely. Pretty much unable to test in-circuit as the gates will discharge when they are connected to something. Just replace if you want to be sure, but probably not your issue."}
{"post_id":31340,"thread_id":31323,"title":"How to test a mosfet?","user_id":386,"username":"wirelessplanet","post_date":"2018-02-10 19:17:13","message":"do you think it could be anything else?  Only thing that is left that i could think of is to reball cpu, but i really don't wanna do that"}
{"post_id":31344,"thread_id":31323,"title":"How to test a mosfet?","user_id":2,"username":"dukefawks","post_date":"2018-02-10 19:22:09","message":"CPU reball would only make sense if you used heat around it and fucked it up. Corrosion can never get under it. It could be absolutely anything, corroded trace\/via\/crap under some chip.\n\nIt does kind of look like power glitches, you can try and inject external voltage to see if that would smooth out the glitching power rail. But it could be any power rail really, not just GPU, could just as well be RAM or CPU power."}
{"post_id":31346,"thread_id":31323,"title":"How to test a mosfet?","user_id":386,"username":"wirelessplanet","post_date":"2018-02-10 19:44:42","message":"no i would never put heat on cpu.  its been under ultrasonic like 5-6 times (cleaning off flux).  ill recheck the power lines again.  thanks for the help as usual duke :)"}
