[
    {
        "post_id":28700,
        "thread_id":28700,
        "title":"formatting hdd or ssd before install",
        "user_id":1101,
        "username":"ielectron",
        "post_date":"2017-11-30 15:28:58",
        "message":"recently i noticed that when i replace a hdd in a a1278 for ex. the osx installer wont see the new hdd (same if im using usb installer or internet recovery) but if i format it to whatever, like ntfs, than it will see that, and i can format it , than install osx.\nAlso, today there was a 11 incher Air, with - probably -  updated 512gb SSD, and it was booting fine, but wanted to reinstall it anyway, and 10.11 or 10.13 usb installer did not see the SSD, than i booted with a portable windows in an ext. usb enclosure, that saw it, formatted to ntfs, than osx installer saw it and formatted it properly. What is going with that?"
    },
    {
        "post_id":28703,
        "thread_id":28700,
        "title":"formatting hdd or ssd before install",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-11-30 16:57:25",
        "message":"You always should use DiskUtility first to erase a drive and make a GUID partition. If you boot the installer you can start DiskUtility from the Utilities drop down menu."
    },
    {
        "post_id":28733,
        "thread_id":28700,
        "title":"formatting hdd or ssd before install",
        "user_id":1101,
        "username":"ielectron",
        "post_date":"2017-12-01 06:52:44",
        "message":"i know that, i mean the disk utility , after i boot from usb installer, wont see the hdd at all, i cant format it, but than i take out the hdd, format it in windows as ntfs, than usb installer again, disk utility, and now i can see the hdd and format it."
    },
    {
        "post_id":28742,
        "thread_id":28700,
        "title":"formatting hdd or ssd before install",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-12-01 07:48:32",
        "message":"I have never seen that issue."
    },
    {
        "post_id":28753,
        "thread_id":28700,
        "title":"formatting hdd or ssd before install",
        "user_id":145,
        "username":"Sykulski",
        "post_date":"2017-12-01 09:20:44",
        "message":"I have seen it when booting from a 10.13 bootable USB install media. I just erase the disk from a Terminal window with the diskutil eraseDisk command. After that it shows up in Disk Utility. Maybe the issue is fixed in the 10.13.1 USB install media but I didn't bother to check it out yet. I never experienced it in other installers than 10.13"
    },
    {
        "post_id":28759,
        "thread_id":28700,
        "title":"formatting hdd or ssd before install",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-12-01 11:32:27",
        "message":"Installing any OS 10.8 and up from USB is pretty much a hack and not officially supported so expect weird bugs like this."
    },
    {
        "post_id":28768,
        "thread_id":28700,
        "title":"formatting hdd or ssd before install",
        "user_id":145,
        "username":"Sykulski",
        "post_date":"2017-12-01 11:52:12",
        "message":"Actually Apple got a support site for creating bootable install media. It can be created directly from the MacOS install file since Mavericks by using the “createinstallmedia” command from Terminal. \n\nIt’s described in Apple support article HT201372 ([URL]https:\/\/support.apple.com\/en-us\/HT201372[\/URL])"
    },
    {
        "post_id":28800,
        "thread_id":28700,
        "title":"formatting hdd or ssd before install",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-12-02 07:29:19",
        "message":"Can confirm that diskutil is the way to go, the new Disk Utility application sucks majorly and fails at 75% of the things I want to do. Even on my own macbook I have to use it every now and then to manage partitions"
    }
]