[
    {
        "post_id":92835,
        "thread_id":63116,
        "title":"A1932 820-01521 - Powers\/Boots from rear (XB) port but cycles from front port (XA)",
        "user_id":34271,
        "username":"crumblenaut",
        "post_date":"2022-09-23 19:56:58",
        "message":"System reportedly just quit on the user one day and wouldn't turn back on.  No signs of liquid exposure.\n\nThis board has been picked up and put down over the course of a few weeks now.  At this point I honestly am not sure what I did to it - there was CD3215 reflowing and touchups, etc involved. - but the last thing that I did was remove and reball the top (XB \/ master) CD3215.  Before that the system was sitting at 5v \/ 0.24A from all ports.  This last reball was in response to the top port only receiving any power in one orientation, which was an issue I later realized may have only been due to a faulty \"new\" USB-C portset.  :|  \n\nAmateur hour over here like woah.  \n\nAnyway, right now where I'm at is that the system will power and boot all the way into the OS from the top port, but the bottom port is cycling.\n\nNothing else looks out of place, so... just replace the bottom CD3215 now too or is there some TBT ROM stuff I should be looking into?\n\nAlso what lines of communication are used for the slave CD3215 to talk to the TBT ROM through the master CD3215?  I'd love to know.\n\nThank you!"
    },
    {
        "post_id":92840,
        "thread_id":63116,
        "title":"A1932 820-01521 - Powers\/Boots from rear (XB) port but cycles from front port (XA)",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-09-24 01:52:51",
        "message":"Rear port (U3200) boots first, being directly connected to TBT ROM.\nThen share the info to front port (U3100) through UPC_XA_UART_TX\/RX lines.\n\nCompare diode mode readings around Q\/U3100 with the other channel.\nYou can try changing Q3100 first."
    },
    {
        "post_id":93058,
        "thread_id":63116,
        "title":"A1932 820-01521 - Powers\/Boots from rear (XB) port but cycles from front port (XA)",
        "user_id":34271,
        "username":"crumblenaut",
        "post_date":"2022-10-05 16:58:01",
        "message":"REPORTING BACK!\n\nYeah, obviously it was the U3100 CD3215.  \n\nU3200 was fully functional. U3100 was the problem CD3215 all along and the replacement I installed originally must have just been bad. \n\nThe new CD3215s showed up and everything was 100% golden after the first replacement attempt.\n\nThank you!"
    }
]