{"post_id":11253,"thread_id":11253,"title":"[SOLVED]Safe to transfer original BIOS chip from old board to new board without serial?","user_id":289,"username":"smiba","post_date":"2016-12-13 18:09:02","message":"[PLAIN][SOLVED]Safe to transfer original BIOS chip from old board to new board without serial?[\/PLAIN]\n\nWhat is the preferred way of doing this? Moving it from the old board or getting the chip from the new board into a SPI rom programmer and program the serial number in?\n\nThe only difference between the two boards is that the original one has 4GB of ram and the replacement has 8GB.\n\nIf I'm not mistaken, moving U6100 over should work just fine, correctly?"}
{"post_id":11259,"thread_id":11253,"title":"[SOLVED]Safe to transfer original BIOS chip from old board to new board without serial?","user_id":2,"username":"dukefawks","post_date":"2016-12-13 20:12:07","message":"No the ME region is unique to the PCH. Why are you doing this?"}
{"post_id":11306,"thread_id":11253,"title":"[SOLVED]Safe to transfer original BIOS chip from old board to new board without serial?","user_id":289,"username":"smiba","post_date":"2016-12-14 16:25:27","message":"The customer needed his motherboard replaced as water+fake charger blew up a MOSFET which created an ugly hole in the board (combined with some other beyond messed up parts)\n\nI had the expectation the seller would've sold the board ready to be used, but sadly it seems like they did not properly configure the rom. Shipping back to China is expensive from the Netherlands so I'm just making the best out of it right now.\n\nThe MacBook air boots with it, but I obviously can't give it back to the customer in this state. It's not the quality I want to give back\n\nAnyways, It should be possible to write a serial with a ROM programmer right? If possible, how do I clean the ME region just to make sure they did not screw up anything of it?"}
{"post_id":11308,"thread_id":11253,"title":"[SOLVED]Safe to transfer original BIOS chip from old board to new board without serial?","user_id":2,"username":"dukefawks","post_date":"2016-12-14 16:39:52","message":"What is the issue? There is nothing to configure but the serial number and default language used. Both don't affect operation when booted in OSX. \nIf you really want this fixed upload both ROMs here so I can swap the necessary parts over."}
{"post_id":11355,"thread_id":11253,"title":"[SOLVED]Safe to transfer original BIOS chip from old board to new board without serial?","user_id":289,"username":"smiba","post_date":"2016-12-15 14:39:52","message":"As far as I'm aware not having a serial number prevents the macbook from booting into Diagnostic Mode and activating with some services like iMessage.\nI have never actually replaced a macbook motherboard so I assumed it would be similar to replacing a [Generic brand here] laptop motherboard, sadly I was mistaken.\n\nI ordered a header so I can connect the SPI chip to a ROM editor and it should arrive in probably a week, I'll post here again when I copied the firmware from both laptop's.\nThanks a lot for your help so far, much appreciated."}
{"post_id":11358,"thread_id":11253,"title":"[SOLVED]Safe to transfer original BIOS chip from old board to new board without serial?","user_id":2,"username":"dukefawks","post_date":"2016-12-15 14:45:45","message":"You could find the \"blankboardserializer\" I have never used it, but that is the tool to write the serial# to a board that has never had one set. It is not possible to change the serial# once it has been set."}
{"post_id":11395,"thread_id":11253,"title":"[SOLVED]Safe to transfer original BIOS chip from old board to new board without serial?","user_id":289,"username":"smiba","post_date":"2016-12-15 18:02:29","message":"I just tried various versions but it woudn't boot past a black screen with a \"_\" in there, the same USB worked properly with my (a bit older) macbook pro so its written correctly to the Drive.\n\nI'll wait for the header then. Does the rom contain any personal information? In that case it might be smarter to PM them to you"}
{"post_id":11402,"thread_id":11253,"title":"[SOLVED]Safe to transfer original BIOS chip from old board to new board without serial?","user_id":2,"username":"dukefawks","post_date":"2016-12-15 21:45:07","message":"Sent me a link in PM."}
{"post_id":13704,"thread_id":11253,"title":"[SOLVED]Safe to transfer original BIOS chip from old board to new board without serial?","user_id":289,"username":"smiba","post_date":"2017-01-26 16:39:04","message":"Topic can be closed\n\nOther then memory configuration the boards were identical, I replaced the ME region of the rom with a clean one and flashed it onto the new board.\n\nThe mac booted without any issues and with the correct serial number.\n\nThanks!"}
