{"post_id":6261,"thread_id":6261,"title":"[SOLVED]MacBook Pro 820-4924-08 No fan spin - Green\/Orange light present","user_id":400,"username":"nik1981","post_date":"2016-09-01 09:54:47","message":"This is my first post so go easy.\nMy guy that does these repairs fucked off to another company for more money so I'm trying to teach myself the ropes.\n\nI have a MBP early 2015 A1502. Came in with water damage but working apart from a few keys.\n\nNo obvious signs on the board so just swapped the faulty keyboard. After fitting the board back to check if the new keyboard is okay, I get no fan spin or anything.\n\nIve checked a few rails with my limited knowledge and get the following\n\nPPBUS_G3H 12.57v\nPPDCIN_G3H 16.6v\nPP3V42_G3H 3.41v\nPP5v_S5   5v\n​PP5v_S3  0v\n​PP5v_S0  0v\nPP3V3_S5  3.3v\n\nNot sure if I've missed a rail to check but the PPBUS_G3H @ 12.57v when it should be 8.6v doesn't look good. And the DCIN @ 16.6v is a bit low.\n\nAny ideas?\n\nSorry for the noob first post if its missing obvious stuff."}
{"post_id":6268,"thread_id":6261,"title":"[SOLVED]MacBook Pro 820-4924-08 No fan spin - Green\/Orange light present","user_id":2,"username":"dukefawks","post_date":"2016-09-01 13:11:52","message":"Inspect the board for corrosion first. Common area for these is around the SPI ROM and clock chip."}
{"post_id":6273,"thread_id":6261,"title":"[SOLVED]MacBook Pro 820-4924-08 No fan spin - Green\/Orange light present","user_id":392,"username":"fixmyapple.in","post_date":"2016-09-01 13:30:47","message":"its my first reply to anyone here \n\nas you told only few keys were not working \nmeans motherboard was fine booting up , only the keyboard was faulty \n\nif yes \n\ni feel there could be 2 reasons of motherboard going BAD ! \n\ncheck for water sign all over the board , check if any rasistance have turned black also \n\nanother common mistake my enginner also do while replacing the hardware ,  they miss handle the board , the delicate compoments gets broken \n\nMAINLY those which have glass apperance , they mosly transfer voltages as per motherboard stage , even if they have a little crack they are not working properly ( such as U8000 - there might me 6-7 on this board ) \n\nsorry soo many typing errors !!"}
{"post_id":6278,"thread_id":6261,"title":"[SOLVED]MacBook Pro 820-4924-08 No fan spin - Green\/Orange light present","user_id":400,"username":"nik1981","post_date":"2016-09-01 14:27:16","message":"Thank you for the advice. \n\nThere shouldn't be any physical damage to the board while its out the laptop because it's just placed at the back of the bench out the way, and I did it myself.\nI'll recheck for any corrosion tomorrow, then maybe give it an acid brush and a rinse with Iso around the areas you mentioned Duke.\n\nI suspect the fact the board was moved has caused whatever little damage or corrosion existed to show its face."}
{"post_id":6306,"thread_id":6261,"title":"[SOLVED]MacBook Pro 820-4924-08 No fan spin - Green\/Orange light present","user_id":400,"username":"nik1981","post_date":"2016-09-02 04:49:50","message":"No Title\n\nOkay, so I looked around U6100 and U6101 SPI and couldn't see anything obvious signs of corrosion ( see pic ) \n\nSo I acid brushed the area and then brushed and bathed the whole board in Iso, then gave it a blast with the air line and heated. \n\nPlugged it back in and got PPBUS_G3H and the S0 states, checked the CPU and it was pretty warm but still no fans. So connected up a screen and it fired up.\n\nThe fan doesn't come on when the DC is plugged in, or when the machine is first turned on like others, but it does spin up once it gets warm so I'm assuming this is normal for this board."}
{"post_id":6308,"thread_id":6261,"title":"[SOLVED]MacBook Pro 820-4924-08 No fan spin - Green\/Orange light present","user_id":400,"username":"nik1981","post_date":"2016-09-02 04:50:57","message":"Thank you for the advice Duke"}
{"post_id":6309,"thread_id":6261,"title":"[SOLVED]MacBook Pro 820-4924-08 No fan spin - Green\/Orange light present","user_id":2,"username":"dukefawks","post_date":"2016-09-02 05:55:44","message":"Fan does not spin up until warm on these newer models. So I guess we can call this one fixed."}
{"post_id":44421,"thread_id":6261,"title":"[SOLVED]MacBook Pro 820-4924-08 No fan spin - Green\/Orange light present","user_id":2198,"username":"Mario Yiannakou","post_date":"2019-01-06 15:02:24","message":"Hi\nWhen you say \"heated\" what do you mean? Did you heat the whole board or just that area? How did you heat? Did you reflow? Thanks in advance as I having the same problem with the same board."}
