{"post_id":75556,"thread_id":61206,"title":"820-01521 20v 0A","user_id":3199,"username":"JdYoda","post_date":"2021-05-19 01:24:01","message":"Hi, got this mac a1932 for repair. Board looks clean, never been repaired before, no corrosion or traces of liquid damage\n\nBare board with no battery stays at 5v 0.09-0.1 amps\nWhen battery connected  - switching to 20 volts, 0 amps\n\nDidn't find any short on board.\nF6700 was blown, changed with new one\nL7030 had a small crack, also changed\nU7000, Q7030, Q7040 changed\n\n\nPPBUS_G3H 12.2\nPP3V3_G3H 3.3\nPP3V3_G3H_RTC 3.3\nPP3V3_G3S - 0\nP3V3G3S_EN - 0\n\nEnable signal for PP3V3_G3S comes from U7800, replaced it with a new chip, no changes\nThere should be some power lines created before PP3V3_G3S to make U7800 start work and send out enable signal?\n\nMac can be recognized in DFU state, reviving or restoring device ends up with an error.\n\nAny ideas guys?"}
{"post_id":75557,"thread_id":61206,"title":"820-01521 20v 0A","user_id":682,"username":"2informaticos","post_date":"2021-05-19 02:35:31","message":"What error do you get on DFU?\nRemove small audio board and check for liquid sign on its both sides."}
{"post_id":75594,"thread_id":61206,"title":"820-01521 20v 0A","user_id":3199,"username":"JdYoda","post_date":"2021-05-20 03:21:33","message":"AMRestoreErrorDomain, Error 6 - Failed to handle message type StatusMsg (Operation failed)\n\nAnd i noticed that board is always in DFU mode. As soon as i plug in cable from one mac to another - it shoes up DFU mode"}
{"post_id":75595,"thread_id":61206,"title":"820-01521 20v 0A","user_id":682,"username":"2informaticos","post_date":"2021-05-20 03:27:39","message":"Looks like T2 problem.\nBoard shouldn't go to DFU on its own; unless SOC_FORCE_DFU signal is hardware forced."}
{"post_id":75621,"thread_id":61206,"title":"820-01521 20v 0A","user_id":3199,"username":"JdYoda","post_date":"2021-05-20 22:01:12","message":"Is it possible to install T2 from donor board and restore firmware? Or reball it? Never tryed to fix T2..."}
{"post_id":75649,"thread_id":61206,"title":"820-01521 20v 0A","user_id":682,"username":"2informaticos","post_date":"2021-05-21 17:11:14","message":"You can experiment few things, if have time.\nFirst step, replace T2 and check what happens in DFU.\nIf no good, replace SOC ROM too.\nAlso NANDs chip may need to be replaced.\nBe aware, all these MUST be from the same board."}
{"post_id":75657,"thread_id":61206,"title":"820-01521 20v 0A","user_id":3199,"username":"JdYoda","post_date":"2021-05-21 22:06:53","message":"Oh, i thought i can use any T2 chip...Don't have the same donor board at the moment. Ok, anyway thank for helping!"}
{"post_id":75664,"thread_id":61206,"title":"820-01521 20v 0A","user_id":682,"username":"2informaticos","post_date":"2021-05-22 04:13:21","message":"If changing only T2 chip is not sufficient, means it requires some specific data stored in ITS SOC ROM and ITS NAND chips.\nYou can try with any T2, but if need to replace all these chips, there could also be some data corresponding to a particular board model."}
