{"post_id":4338,"thread_id":4338,"title":"820-3476 Liquid damage does not power on","user_id":67,"username":"bighead","post_date":"2016-07-07 22:50:05","message":"Hi,\n\nI'm trying to fix a liquid damaged 820-3476 board.\nAfter the cleaning I got green and orange light on the charger.\n\nU7200 was correded. I changed it. \nThe board still does not start. The fan does not spin up.\n\nI have:\nPP3V3_S5\nPPBUS_G3H 12.56V\nPP3V3_SUS\nPP1V05_SUS\nPPVRTC_G3H\nPCH_CLK32K\nRSMRST at 3.1V\n\nPP5V_S4 - comes on for a sec\nY5110 oscillates - for a sec. I changed the SMC I thought that's the problem. It wasn't. It does the exact same thing.\n\nWhen first I connect the adapter I can measure all the voltages for a sec.\nSo I have CPU VCORE. PP3V3_S0 etc. I got something on every power rail for a sec, but the fan doesn't spin up at all.\nI have to reconnect the power adapter every time, if I want to measure those power rails.\n\nAny thoughts?\n\nThank you!"}
{"post_id":4341,"thread_id":4338,"title":"820-3476 Liquid damage does not power on","user_id":2,"username":"dukefawks","post_date":"2016-07-08 00:44:35","message":"Voltage on Y1905 when it tries to power on? Is CPU Vcore coming high for a fraction too?"}
{"post_id":4565,"thread_id":4338,"title":"820-3476 Liquid damage does not power on","user_id":67,"username":"bighead","post_date":"2016-07-17 18:16:34","message":"Yes, The CPU VCORE comes high for a sec. Well, hard to tell what the voltage is on Y1905. I got a very weird wave on the scope.\nMultimeter jumps up around 1V for a sec. Hard to tell. I changed Y1905 and U1900 same thing. \n\nI've one more exact same board almost with the same problem, but that one tries to turn on-off (fan does not spin). I just can see on the CPU VCORE it jumps up and down for a sec."}
{"post_id":4569,"thread_id":4338,"title":"820-3476 Liquid damage does not power on","user_id":2,"username":"dukefawks","post_date":"2016-07-17 21:46:41","message":"Check all resistors that are in series with the SPI ROM data lines."}
