{"post_id":33402,"thread_id":33402,"title":"A1104 (Vinage Powerbook G4 12\") - Keyboard interchangeable between 15\/17' models?","user_id":289,"username":"smiba","post_date":"2018-04-07 14:32:43","message":"A1104 (Vinage Powerbook G4 12\") - Keyboard interchangeable between 15\/17' models?\n\nHey everyone\n\nBefore you laugh; I just want to bring this device back to its old glory because I loved the design. Its a hobby project and not for my business, but this felt like the most knowledgeable place to ask\n\nI can't seem to find any A1104 keyboards anymore, but those of 15\" Powerbook G4's are widely available online. Some posts online say they are interchangeable between models but I can't find any solid confirmation of this\n\nAnyone who can either confirm or refute this claim?\nThanks!"}
{"post_id":33403,"thread_id":33402,"title":"A1104 (Vinage Powerbook G4 12\") - Keyboard interchangeable between 15\/17' models?","user_id":235,"username":"MUUK","post_date":"2018-04-07 15:27:27","message":"Hiya,\n\n12\" is a different keyboard.\n\nThe 15\" \/17\" ones have a much shorter cable as they plugged into a little daughter board with the power button etc, before a smaller connector went to the motherboard. Also 15\/17\" cable comes out the bottom rather than at the side.\n\nThere is a site in the UK that has these keyboards:  [url]https:\/\/www.thebookyard.com\/product.php?cPath=31_51_196&products_id=1999[\/url]\n\nGreat machine in its day, always hated the trouble required to change the hard drive though! or even worse the bloody optical drive."}
{"post_id":33407,"thread_id":33402,"title":"A1104 (Vinage Powerbook G4 12\") - Keyboard interchangeable between 15\/17' models?","user_id":289,"username":"smiba","post_date":"2018-04-07 17:44:41","message":"I ordered one, Thanks!\n\nWhile we're at it, any tips for restoring the battery? Right now it shows 16-big integer maximum capacity (65,535 mAh lol, yeah sure) and the battery life is just bad overall.\nThere are enough replacements still out there but they're all ugly and plastic, any way to buy one of those and transplant the circuit and Li-ion cells over to the original battery so it keeps its nice aluminium outside? (I mean I love the look so keeping it elegant is important in this useless hobby of mine) Or is this a case of \"You're on your own\" and \"Why would you go through the effort\" haha\n\nThank you"}
{"post_id":33421,"thread_id":33402,"title":"A1104 (Vinage Powerbook G4 12\") - Keyboard interchangeable between 15\/17' models?","user_id":235,"username":"MUUK","post_date":"2018-04-08 11:06:30","message":"Hiya,\n\nI think that the aluminium top part should come off albeit with some difficulty, i remember having to glue one back on for someone some years ago. My experience of third party ones out there now is that they are pretty damn poor (most been sitting on a shelf for years). The newertech ones (if you can find one - maybe [url]www.macsales.com[\/url]) are good and that would be the one i would think would have half a chance of being decent. I sell a number of their ones for older MBP's and they have been good so far."}
