{"post_id":34891,"thread_id":34891,"title":"820-00165 Green\/Orange without battery, No liquid Damage","user_id":1309,"username":"Inwerp","post_date":"2018-05-17 09:18:14","message":"Hello everyone\nCharger light works normal without battery. With battery attached it stays green. \nSMC Reset changes light like it supposed to. \n\nEnergy consumption: 0.04 amps\nS5 rail present, SMC_BC_ACOK high\nS5_PWRGD High\nPP3V3_SUS present \ns4 rail is as dead as Steve Jobs. \n\ni do not really understand how S4_PWR_EN is generated\nin schematics it goes from U8170 NOSTUFF AND chip, AB is PM_SLP_S5_L(0V) SMC_S4_WAKESRC_EN(0v), both are low.\nI have already desoldered bios chip and tested if i can read it. re-programmed it with \"clear me\" bios, nothing really changed. \nNow i'm trying to test clock signals to BIOS chip with a cheap Oscilloscope, but i do not really know if 20mhz is good enough for this purpose. \n\n\n\nPlease don´t tell me SMC is dead - i have a greenlight and SMC Reset indication. :)"}
{"post_id":34892,"thread_id":34891,"title":"820-00165 Green\/Orange without battery, No liquid Damage","user_id":1524,"username":"Paul Daniels","post_date":"2018-05-17 09:20:59","message":"Genuine magsafe 2 brick?"}
{"post_id":34894,"thread_id":34891,"title":"820-00165 Green\/Orange without battery, No liquid Damage","user_id":1309,"username":"Inwerp","post_date":"2018-05-17 10:20:58","message":"well, genuine 19V with \"60-watt\" chip :)\nof course, i have a genuine brick too, but i don´t believe it could get S5_PGOOD if something was wrong in this area."}
{"post_id":34895,"thread_id":34891,"title":"820-00165 Green\/Orange without battery, No liquid Damage","user_id":1524,"username":"Paul Daniels","post_date":"2018-05-17 10:25:47","message":"No problem. Only thought I'd ask out of an abundance of caution."}
{"post_id":34899,"thread_id":34891,"title":"820-00165 Green\/Orange without battery, No liquid Damage","user_id":1309,"username":"Inwerp","post_date":"2018-05-17 13:46:28","message":"so it looks like this model has some weird relationships with the battery - i have found several posts on Russian forums, people claim that it does not autostart with no battery attached. This also means that if the battery died (overdischarged, for example), we will have this strange behavior. I guess Lous has rage-broken such board in some of his videos, thinking it is the CPU. \ncan someone confirm if 00165 starts without the battery?"}
{"post_id":34909,"thread_id":34891,"title":"820-00165 Green\/Orange without battery, No liquid Damage","user_id":2,"username":"dukefawks","post_date":"2018-05-17 18:38:52","message":"For me they always do, but I have read that for some they don't. So to rule this out get a known good battery that has a charge."}
{"post_id":34933,"thread_id":34891,"title":"820-00165 Green\/Orange without battery, No liquid Damage","user_id":1309,"username":"Inwerp","post_date":"2018-05-18 10:49:46","message":"small update.\nbattery change made no progress. charging works as normal (forget this \"green light\" thing, it was simply full, shame to me)\njust after SMC \"deep\" reset, it's kind of starts with full fan and 0 on P1V05S0 and PPVCC_S0_CPU.\n\ncan someone share 100% working \"clear me\" bios for 820-00165(besides one on vinafix.com)?\nalso, i guess it#s better to replace MX25L64, would appreciate confirmed compatible chip."}
{"post_id":34950,"thread_id":34891,"title":"820-00165 Green\/Orange without battery, No liquid Damage","user_id":2,"username":"dukefawks","post_date":"2018-05-18 15:23:56","message":"Why are you messing with U6100 now? I doubt that will be the issue if Vcore is not even there. You can just try any 00165 dump for testing first."}
{"post_id":34975,"thread_id":34891,"title":"820-00165 Green\/Orange without battery, No liquid Damage","user_id":1309,"username":"Inwerp","post_date":"2018-05-19 01:37:08","message":"well, from my PC laptop experience i know that unreadable\/corrupt bios may be the cause for dead Vcore\/permanent S5 or even no charging light on some Compal platforms.\nfirst thing i did with this board is i tested all rails and mosfets for shorts. this board has zero hints.\n\n\nso is that possible that SMC override starts brain dead board and Vcore absence shows that CPU does not answer to its controller to set Vcore voltage?\ni mean, sorry for such a stupid question, but what exactly is being overridden?\ni'm getting really close to write \"dead cpu \" on this board :confused:"}
{"post_id":34979,"thread_id":34891,"title":"820-00165 Green\/Orange without battery, No liquid Damage","user_id":2,"username":"dukefawks","post_date":"2018-05-19 02:20:41","message":"It is possible that the BIOS is corrupt, but unlikely. Just try another 00165 dump and see if it works. IF that solves the issue we can deal with ME region and serial numbers."}
