[
    {
        "post_id":89152,
        "thread_id":62669,
        "title":"820-00840-A - No Display - Liquid damage",
        "user_id":35752,
        "username":"Anterweb",
        "post_date":"2022-05-07 14:05:09",
        "message":"Got this one in today a1708  820-00840-A .\n\nI was told it stopped working after a drink was spilled on it. \n\nNever been opened before so I'm the first person to ever crack this open. \n\nA few small signs of liquid ingress ( Coke, coffee or something brown and sticky ) around the wifi card and just behind the usb-c ports .\n\nMust have been recent as it all cleaned up real easy and is now spotless and also bottom of the board whole logic board now looks like new! \n\nIt draws a solid 20v and normal amps with the battery connected and disconnected.\n\non power on I get fan spin and trackpad click and also feel the CPU getting warm but no boot sound and no display on screen or external monitor whatsoever, \n\nI popped a usb stick into both ports and it lights up and flickers briefly  ( I presume this is how we test for usb activity? )\n\nadvice on where to go from here much appreciated."
    },
    {
        "post_id":89153,
        "thread_id":62669,
        "title":"820-00840-A - No Display - Liquid damage",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-05-07 14:57:30",
        "message":"Connect USB macOS and see if flashes constantly, like loading OS.\nAlso try PRAM reset and check if chime comes on.\nWhat is the CPU core voltage (L7210) after 10-15s?"
    },
    {
        "post_id":89156,
        "thread_id":62669,
        "title":"820-00840-A - No Display - Liquid damage",
        "user_id":35752,
        "username":"Anterweb",
        "post_date":"2022-05-07 17:04:18",
        "message":"USB Tested with drive with os on, Solid light on drive no flashing or activity, \n\nTried resetting PRAM a few times to be sure  (no chime ), and weirdly one time when I had the external HD with the OS connected it actually got a backlight and grey screen light up!!!! ( A sign of life! )  I presumed it was sorted. so disconnected external drive and put back internal SSD, same thing no display, Tried again to remove SSD and do PRAM - multiple times and connected external HD  to try to reproduce the screen coming on again  but I couldn't .. still dead \/ no display,.\n\nChecked CPU core at L7210  = 0.65v\n\nI also tried dropping the logic board into a known good donor machine with working screen & keyboard, battery and trackpad, exact same behaviour"
    },
    {
        "post_id":89160,
        "thread_id":62669,
        "title":"820-00840-A - No Display - Liquid damage",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-05-08 03:48:12",
        "message":"CPU gets correct voltae, so board boots, but gets stuck somehow.\nPossibly iGPU problem..."
    },
    {
        "post_id":89161,
        "thread_id":62669,
        "title":"820-00840-A - No Display - Liquid damage",
        "user_id":35752,
        "username":"Anterweb",
        "post_date":"2022-05-08 04:41:37",
        "message":"Anyway of being sure or figuring out where it's getting stuck, Where can I go from here? \n\nIs it worth reflowing the GPU? \n\nI do have a good donor board for this Sat on the bench"
    },
    {
        "post_id":89163,
        "thread_id":62669,
        "title":"820-00840-A - No Display - Liquid damage",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-05-08 04:58:50",
        "message":"There is no dedicated GPU.\niGPU is part of CPU.\nYou can try to heat, but Intel is not known for such reaction...\n\nJust in case, try first known good BIOS dump."
    },
    {
        "post_id":89165,
        "thread_id":62669,
        "title":"820-00840-A - No Display - Liquid damage",
        "user_id":35752,
        "username":"Anterweb",
        "post_date":"2022-05-08 08:11:51",
        "message":"I have a brand new bios chip for this logic (weirdly it's the exact same model board as the last one you helped me with) but before I tool up and swap these bios chips I just thought I'd ask is it common for a bios to be affected by water damage, I've never before thought to try a new bios from a liquid damaged board? \n\nAlso I've just noticed with this one I get zero fan spin when turning on unless the trackpad is disconnected then it just blows gradually upto full spin, also l get no caps lock light at all, could this indicate anything else I could look into? \n\nThanks in advance for the help"
    },
    {
        "post_id":89166,
        "thread_id":62669,
        "title":"820-00840-A - No Display - Liquid damage",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-05-08 09:29:47",
        "message":"Fan goes high shortly after power on, if no trackpad connected.\nSMC expects some temp sensors included into trackpad board.\n\nSometime BIOS corruption can happen after liquid spill."
    },
    {
        "post_id":89167,
        "thread_id":62669,
        "title":"820-00840-A - No Display - Liquid damage",
        "user_id":35752,
        "username":"Anterweb",
        "post_date":"2022-05-08 14:32:04",
        "message":"So I swapped the bios chip, sadly same result, same behaviour no display to internal or external display :(\n\nIs there anything I can try to get this back to life?\n\n👃"
    },
    {
        "post_id":89168,
        "thread_id":62669,
        "title":"820-00840-A - No Display - Liquid damage",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-05-08 14:46:42",
        "message":"Possibly leakage occured from high voltage to CPU data lines.\nBacklight circuitry is just between wireless and USB-C area.\nWe talk about 45V on backlight output..."
    },
    {
        "post_id":89169,
        "thread_id":62669,
        "title":"820-00840-A - No Display - Liquid damage",
        "user_id":35752,
        "username":"Anterweb",
        "post_date":"2022-05-08 14:56:30",
        "message":"Is that a fancy way of saying it's fucked, give up?"
    },
    {
        "post_id":89170,
        "thread_id":62669,
        "title":"820-00840-A - No Display - Liquid damage",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-05-08 15:36:33",
        "message":"More or less...\nIf you can't detect any corroded resistor\/capacitor, or affected trace, is waste of time."
    }
]