{"post_id":2930,"thread_id":2930,"title":"820-3330-B short on ppvcore_s0_cpu","user_id":87,"username":"Tim Cook","post_date":"2016-05-22 21:34:22","message":"First post here, new to component level repair so feel free to dumb any answers down ;)\nThis machine has had some work done, not sure what but previously only working on external display. I found liquid damage around the U8000 (looked like coffee, but maybe was flux) But I also found L9011 had been torn off the board, so replaced it and got an image on the internal. Cleaned the board and felt great as it all worked fine for a few hours, next day would not post. I found ppbus_g3h, pp3v42_g3h, pp3v3_s5 all seem good but now has a dead short on ppvcore_s0_cpu. No fan spin. Now I'm not sure what the best way to proceed is but hoping to learn (or move on if this is too stuffed)."}
{"post_id":2931,"thread_id":2930,"title":"820-3330-B short on ppvcore_s0_cpu","user_id":1,"username":"larossmann","post_date":"2016-05-22 21:57:47","message":"there is no such thing as a dead short on cpu vcore\n\ni am going to use approximate numbers here to get a point across. go to any ohms law calculator. put in 47 watts because this is what a mobile quad core cpu uses approximately, then put in 1 volt because that is approximately what mobile cpus use... what resistance does it give you? to get 47 watts at 1 volt, what resistance do you see?\n\nexactly!!! very low one.\n\nlow voltage lines designed to deliver high current are not \"shorted to ground\" because the multimeter beeps.\n\nanyway, let's describe the history of the board.\n\n1) someone ripped off L9011\n2) when it had no image, instead of fixing L9011 they torched the GPU\n3) this skullfucked the board\n\nLet's start with the basics. Is PM_SLP_S4_L present when you hit power?"}
{"post_id":2936,"thread_id":2930,"title":"820-3330-B short on ppvcore_s0_cpu","user_id":87,"username":"Tim Cook","post_date":"2016-05-23 01:51:19","message":"Thanks Louis, okay obviously I'm missing some of the basics here. So my diode mode measurement shows a voltage drop of 0V because cpu vcore has such low voltage and resistance.\n\nI think your three steps to a skullfucked board maybe correct.\n\nNo PM_SLP_S4_L when I hit power.\n\nDead GPU?"}
{"post_id":2937,"thread_id":2930,"title":"820-3330-B short on ppvcore_s0_cpu","user_id":161,"username":"Vinny","post_date":"2016-05-23 04:39:28","message":"[QUOTE=\"Tim Cook, post: 2936\"]Thanks Louis, okay obviously I'm missing some of the basics here. So my diode mode measurement shows a voltage drop of 0V because cpu vcore has such low voltage and resistance.\n\nI think your three steps to a skullfucked board maybe correct.\n\nNo PM_SLP_S4_L when I hit power.\n\nDead GPU?\n[\/QUOTE]\n\nPM_SLP_S4_L comes from...?"}
{"post_id":2939,"thread_id":2930,"title":"820-3330-B short on ppvcore_s0_cpu","user_id":87,"username":"Tim Cook","post_date":"2016-05-23 07:00:23","message":"PM_SLP_S4_L comes from PCH"}
