{"post_id":52883,"thread_id":52883,"title":"820-3662 wont boot, freezing","user_id":1101,"username":"ielectron","post_date":"2019-10-03 05:02:45","message":"no water damage, when it came in it would try to boot but the lines unde the apple logo stuck at 10%, i read here that the typical issue is the cpu voltage control chips, so i ordered them from mouser FDMF6708N, so they are brand new, all 3 replaced, checked them 5 times, the soldering is good for sure, its hard to solder those chips they need loads of heat, but checked undermicroscope they are soldered well, and its doing the same thing, from ssd, or in the boot menu, it is freezing about 30 sec after it powers on, \n\nis there anything to do with that board? the previous cpu power controller might damaged the cpu?  the cpu glue around the core look ok, not brown color which would indicate overheating inside the cpu"}
{"post_id":52889,"thread_id":52883,"title":"820-3662 wont boot, freezing","user_id":682,"username":"2informaticos","post_date":"2019-10-03 06:32:57","message":"Did you try clean ME region?"}
{"post_id":52905,"thread_id":52883,"title":"820-3662 wont boot, freezing","user_id":1153,"username":"JohnB8812","post_date":"2019-10-03 09:07:54","message":"Possibly but hard to say. Ruled out any kind of housing issue or SSD issue? I\/O Board\/Cable, battery, trackpad, etc can cause this. If yes, clean ME region would be a good place to start. Any history liquid drop etc?"}
{"post_id":53209,"thread_id":52883,"title":"820-3662 wont boot, freezing","user_id":1101,"username":"ielectron","post_date":"2019-10-10 07:38:15","message":"after cleaning the ME region, and even program a new bios, still was freezing, everything disconnected, even booting from usb, same, but one thing was still on the board, the wifi card, and guess what that was causiing the freezing, the cpu get really hot during the boot process and it remained hot after it frooze, with new wifi card works fine"}
{"post_id":53223,"thread_id":52883,"title":"820-3662 wont boot, freezing","user_id":1153,"username":"JohnB8812","post_date":"2019-10-10 13:36:25","message":"Sometimes it's like that lol"}
