{"post_id":31339,"thread_id":31339,"title":"820-3435 - Stuck on EFI part of boot with OSX - Boots Linux and Windows just fine","user_id":289,"username":"smiba","post_date":"2018-02-10 19:16:48","message":"EDIT: If you want to help, read page 2. Lots of additional information :)\n\nNo water damage and the board looks clean\n\nThis macbook will not boot from internet recovery, SSD or external drive. All get stuck on the apple logo and when booted with Command+V it never actually leaves the EFI part of the bootup.\n\nI've already replaced the ME region, and that allowed me to at least boot other systems (They would just get stuck between the transition of the BIOS), however it still doesn't boot OSX!!\n\nUbuntu runs 100% fine after a clean ME region and has been installed to and booted from the SSD. Windows CD boots as well\nOSX 10.9.2 CD doesn't work and Internet Recovery doesn't either.\n\nWhat could this be? Any idea?\nI was thinking maybe a bad BIOS"}
{"post_id":31342,"thread_id":31339,"title":"820-3435 - Stuck on EFI part of boot with OSX - Boots Linux and Windows just fine","user_id":2,"username":"dukefawks","post_date":"2018-02-10 19:19:01","message":"Where did you get the ME, sounds an awful lot like a bad ME to me. Upload original BIOS."}
{"post_id":31345,"thread_id":31339,"title":"820-3435 - Stuck on EFI part of boot with OSX - Boots Linux and Windows just fine","user_id":289,"username":"smiba","post_date":"2018-02-10 19:33:42","message":"I got the clean ME from here: [url]https:\/\/www.win-raid.com\/t596f39-Intel-Management-Engine-Drivers-Firmware-amp-System-Tools.html[\/url]\n(1.5MB 9.5)\n\nCopy of the original SPI ROM and Modified one: [url]https:\/\/owncloud.bartstuff.eu\/index.php\/s\/fk4taJrLmMp5Ise[\/url]"}
{"post_id":31352,"thread_id":31339,"title":"820-3435 - Stuck on EFI part of boot with OSX - Boots Linux and Windows just fine","user_id":2,"username":"dukefawks","post_date":"2018-02-10 21:50:23","message":"That is not how you clean the ME. You just used an ME with all the default settings, you have to transfer over all the Apple custom settings with FITC.\nHere is the original with an original Apple clean ME region:\n[URL=\"https:\/\/drive.google.com\/open?id=19xT1JFfr22lKxqbgRt_M3u7E2CfLop4P\"]https:\/\/drive.google.com\/open?id=19x..._M3u7E2CfLop4P[\/URL]"}
{"post_id":31371,"thread_id":31339,"title":"820-3435 - Stuck on EFI part of boot with OSX - Boots Linux and Windows just fine","user_id":289,"username":"smiba","post_date":"2018-02-11 05:06:57","message":"Thanks duke, I had no idea. I guess thats what you get for following shady tutorials online!\n\nThe device still doesn't work though, same symptoms.\n\nPressing Command+V Gives you the whole efiboot log all up until it hits \"root device uuid is:\", which if I remember correctly is the last line it usually gives"}
{"post_id":31382,"thread_id":31339,"title":"820-3435 - Stuck on EFI part of boot with OSX - Boots Linux and Windows just fine","user_id":2,"username":"dukefawks","post_date":"2018-02-11 08:51:12","message":"Here is a complete 3437 BIOS with clean ME, see if that works.\n[url]https:\/\/drive.google.com\/open?id=1NA-DUm0E7nS7OGRIBguOG-yDO5q2GnrJ[\/url]"}
{"post_id":31395,"thread_id":31339,"title":"820-3435 - Stuck on EFI part of boot with OSX - Boots Linux and Windows just fine","user_id":289,"username":"smiba","post_date":"2018-02-11 13:37:33","message":"Still having the same issues, sadly.\n\nAn apple authorized store diagnosed it as \"Bad CPU\", not sure if that could be the case? I mean it boots Ubuntu just fine with web browsing and all drivers are working as expected so I doubt it"}
{"post_id":31396,"thread_id":31339,"title":"820-3435 - Stuck on EFI part of boot with OSX - Boots Linux and Windows just fine","user_id":2,"username":"dukefawks","post_date":"2018-02-11 13:41:45","message":"Will it boot EFI version of ASD?"}
{"post_id":31397,"thread_id":31339,"title":"820-3435 - Stuck on EFI part of boot with OSX - Boots Linux and Windows just fine","user_id":289,"username":"smiba","post_date":"2018-02-11 13:51:13","message":"Yes, 3S156 ASD EFI boots and passes with no errors reported"}
{"post_id":31399,"thread_id":31339,"title":"820-3435 - Stuck on EFI part of boot with OSX - Boots Linux and Windows just fine","user_id":2,"username":"dukefawks","post_date":"2018-02-11 14:14:49","message":"I have no other ideas and anything it could probably be will suck. Maybe a few verbose mode logs can shed some light as to where it hangs.\n\nI assume you have disconnected everything not needed for boot including a test LCD"}
{"post_id":31401,"thread_id":31339,"title":"820-3435 - Stuck on EFI part of boot with OSX - Boots Linux and Windows just fine","user_id":289,"username":"smiba","post_date":"2018-02-11 14:28:45","message":"What kind of verbose logs are you thinking about?\n\nHere I have:\n- Booting from a USB CD\n- Booting from a USB OS ASD 3S156\n- Booted Ubuntu installed on the local SSD (Same for booting a live CD by the way)\n\nEDIT:\n\nUbuntu kernel log (dmesg): [URL]https:\/\/pastebin.com\/udWY2JNk[\/URL]\n\nI might just take another good look at the motherboard, but it all just doesn't make a lot of sense...\n\nEDIT: Took another look and other then some solder balls around C1031 the board looks amazing. The solder balls were still in the flux of the capacitor and does look like it was like this from the factory. (I can't find any heat marks on the components)"}
{"post_id":31410,"thread_id":31339,"title":"820-3435 - Stuck on EFI part of boot with OSX - Boots Linux and Windows just fine","user_id":2,"username":"dukefawks","post_date":"2018-02-11 17:32:36","message":"Oh verbose mode already hangs that early in the boot process? Is everything disconnected including the LCD?"}
{"post_id":31412,"thread_id":31339,"title":"820-3435 - Stuck on EFI part of boot with OSX - Boots Linux and Windows just fine","user_id":289,"username":"smiba","post_date":"2018-02-11 17:35:59","message":"I've tried with everything disconnected other then:\n\n- LCD\n- Trackpad\/Keyboard\n- Battery\n- Magsafe (Not the ext. cable, only the 5 pin power)\n\nI'll see if anything changes with the LCD disconnected tomorrow. I assume I can verify it by using HDMI?"}
{"post_id":31415,"thread_id":31339,"title":"820-3435 - Stuck on EFI part of boot with OSX - Boots Linux and Windows just fine","user_id":2,"username":"dukefawks","post_date":"2018-02-11 17:38:49","message":"battery and trackpad are not needed for boot. Disconnect everything including the original LCD. Use other LCD the see if verbose still hangs."}
{"post_id":31416,"thread_id":31339,"title":"820-3435 - Stuck on EFI part of boot with OSX - Boots Linux and Windows just fine","user_id":289,"username":"smiba","post_date":"2018-02-11 17:47:22","message":"I don't have any 11\" LCDs around, will a 13\" macbook air 2011 LCD be sufficient?"}
{"post_id":31419,"thread_id":31339,"title":"820-3435 - Stuck on EFI part of boot with OSX - Boots Linux and Windows just fine","user_id":2,"username":"dukefawks","post_date":"2018-02-11 20:28:54","message":"Yeah 13\" works just fine."}
{"post_id":40306,"thread_id":31339,"title":"820-3435 - Stuck on EFI part of boot with OSX - Boots Linux and Windows just fine","user_id":289,"username":"smiba","post_date":"2018-10-05 18:38:59","message":"Sorry for bumping such an old topic of mine, but I actually do still have this device around and never managed to solve this issue!\n\nTried a different display assembly as well but it still gets stuck after \"Root device uuid is(...)\", same for when trying without trackpad and battery connected\n\nShort summery of findings:\n- Does always boot Ubuntu live CD or Ubuntu installed on the local SSD\n- Does \/usually\/ boot the OS 10.9 install CD (From USB), but sometimes this also gets stuck at the \"Root device uuid is\" part. Gets resolved by just letting the device chill for a few minutes while its off or after a couple of tries it suddenly works again.\n- It never boots an installed version of OS X, after the installer finishes and reboots it gets stuck, same for ASD OS.\n- Internet Recovery gets stuck after downloading its files from the internet (The transition from being in EFI to booting the just downloaded files)\n- EFI ESD Passes & Apple Diagnostic test Passes\n\nDevice does not appear to be water damaged, looks like new and not a single piece of corrosion can be found. All water indicators are still white as well and the motherboard looks barely used\n\nAny other ideas? Its so annoying not able to repair this device. So close, yet so far!"}
{"post_id":40320,"thread_id":31339,"title":"820-3435 - Stuck on EFI part of boot with OSX - Boots Linux and Windows just fine","user_id":289,"username":"smiba","post_date":"2018-10-06 05:21:36","message":"Update: After a lot of trying, for some reason, it decided to boot. I opened up the App store and downloaded the OS X 10.14 installer in the hope it would install it and with that update the ROM (It is not running the latest version because its unable to boot or see APFS volumes in the boot loader)\n\nFirst reboot for the 10.9 Combined update went fine, second reboot for the 10.14 Installer didn't and its back stuck again in the boot.efi loader. The 10.14 boot.efi is more verbose though! No idea if this gives us some more information:\n\n[ATTACH alt=\"Click image for larger version  Name:\tIMG_20181006_114523.jpg Views:\t1 Size:\t284.1 KB ID:\t40321\"]40321._xfImport[\/ATTACH]\nThe device gets stuck after \"End RandomSeed\" and never shows it Ended \"FinalizeBootStruct\", which makes me think it gets stuck in that routine?\n\nI've also attached a system.log from when it decided to successfully boot all of the sudden.\n\nAny idea? Honestly anything at this point is welcome, I wouldn't even mind if the solution was to use a different boot loader then Apple's boot.efi"}
{"post_id":40332,"thread_id":31339,"title":"820-3435 - Stuck on EFI part of boot with OSX - Boots Linux and Windows just fine","user_id":289,"username":"smiba","post_date":"2018-10-06 11:28:01","message":"Wrote a new clean ME region (v9.5 Slim) and transferred the firmware configuration over with flash image tool, diagnostic test and everything passes but still no way out of boot.efi\n\nHonestly can't be an ME issue after having both duke and me made a clean me rom. Does anyone have a tutorial or explanation to me where to get the 820-3435 BIOS Area and how to replace the serial numbers and update the checksums? I know this needs to be done to do a proper move but I have never find someone who could explain it to me.\nIf no one is able to tell me I'll just try it with the information I know and hope I do it correctly. \n\nThe BIOS area in my ROM compared to a 820-3435 rom dump I found online is majorly different so it could be interesting."}
{"post_id":40334,"thread_id":31339,"title":"820-3435 - Stuck on EFI part of boot with OSX - Boots Linux and Windows just fine","user_id":682,"username":"2informaticos","post_date":"2018-10-06 12:25:20","message":"You must replace all Fsys area, not only serial.\nIt starts with Fsys string and terminate just before $SVS string...\n\nDid you try to clean original ME with Medusa 2?"}
{"post_id":40336,"thread_id":31339,"title":"820-3435 - Stuck on EFI part of boot with OSX - Boots Linux and Windows just fine","user_id":289,"username":"smiba","post_date":"2018-10-06 12:46:02","message":"I don't have the Medusa 2 tool sadly, I've thought about purchasing one but I'm too busy with other work and life events to actively accept new repairs at the moment which makes it an expensive investment when I might only use it once. (If you have one, could you possibly clean the firmware.bin for me? Although honestly I doubt ME is the issue at the moment)\n\nIntel's Image flash tool extracts the whole BIOS area which is 6.5MB big, this file contains the Fsys string and two $SVS strings.\nWhere would I need to edit the checksum values? Although honestly I might not care too much about the checksum because the >= OS X 10.12 installers will need to update this anyways so the bios supports APFS. (Which would presumably correct the checksum value?)\n\nEDIT: Replaced the BIOS with one from a online dump, got upped from B21 firmware to B22, a few months newer. Same issue however"}
{"post_id":40338,"thread_id":31339,"title":"820-3435 - Stuck on EFI part of boot with OSX - Boots Linux and Windows just fine","user_id":682,"username":"2informaticos","post_date":"2018-10-06 14:11:15","message":"I have no idea what happens.\nHad something similar with 820-00165 past year.\nThere was problem with ME region, reported as chipset error even by ASD; which finishes witoutout any other error.\nI tried lot of dumps, cleaning ME, but no way.\nNone of many Internet tutorials reffered to such error helped me.\nMachine always stuck on progress bar, 70-80%.\nHowever, it correctly booted into Linux WiFiSlax...\nProbably some internal issue of PCH."}
{"post_id":40340,"thread_id":31339,"title":"820-3435 - Stuck on EFI part of boot with OSX - Boots Linux and Windows just fine","user_id":289,"username":"smiba","post_date":"2018-10-06 14:23:26","message":"The weirdest is that it doesn't even have a loading bar, it never progresses out of boot.efi into the actual mach_kernel booting OS X. \n\nAll linux and Windows distros work 100% ok but the OS X bootloader just does some weird stuff.\nI wonder if it tries to access a device or read out a value that just ends up not like its expecting causing it to freeze, debugging actual CPUs however is harder then debugging them virtualised :)\n\nDo you have any idea if the PCH also has a updatable firmware which might mismatch with the BIOS? I'll keep on digging for now but by the looks of it its a dead end"}
{"post_id":40369,"thread_id":31339,"title":"820-3435 - Stuck on EFI part of boot with OSX - Boots Linux and Windows just fine","user_id":289,"username":"smiba","post_date":"2018-10-07 14:14:03","message":"Well I gave up, tried bootroms as far down as B03 and as high as B22 and none of them resolve this issue\n(B03 actually breaks booting from my USB CD-Drive as well but thats probably unrelated as its just really old (2013)).\n\nTried different ways of importing the ME area as well and all the same results (except the one I tried that was known not clean and not from this machine and that \/actually\/ did show ME issues. But that was just to see what would happen if we had a broken ME area)\n\nCurrently have Windows installed and everything is working as expected, no crashes (been through 200 updates so far to be installed) and sleep \/ hybernate both work. This is with the B21 bootrom that was originally in this BIOS (So checksum matches) and with a clean ME area I created.\n\nIf anyone ever figures it out, let me know. But since this device works just fine as a Windows machine I don't think its worth replacing its motherboard"}
{"post_id":40410,"thread_id":31339,"title":"820-3435 - Stuck on EFI part of boot with OSX - Boots Linux and Windows just fine","user_id":289,"username":"smiba","post_date":"2018-10-09 10:57:11","message":"Actually, I do have something new.\n\nI decided to boot into OS ASD for the heck of it after coming home and to my surprise it actually booted!\nIt passes ASD, except that all thunderbolt tests fail.\n(66004 Thunderbolt driver returned error & 12114 Cannot find the PCIe capabilities register)\n\nIs this a known issue with the 3S156 ASD?\n\n[ATTACH alt=\"Click image for larger version  Name:\timage_2001.jpg Views:\t1 Size:\t945.9 KB ID:\t40413\"]40411._xfImport[\/ATTACH]\n\nI also had an logged issue about the NVRAM, not sure if intresting\n[ATTACH alt=\"Click image for larger version  Name:\tIMG_20181009_173408.jpg Views:\t1 Size:\t644.4 KB ID:\t40416\"]40416._xfImport[\/ATTACH]"}
{"post_id":40417,"thread_id":31339,"title":"820-3435 - Stuck on EFI part of boot with OSX - Boots Linux and Windows just fine","user_id":289,"username":"smiba","post_date":"2018-10-09 12:31:39","message":"Alright so after installing OS X 10.12 alongside windows (because I knew for sure it was going to fail at some point again) it didn't want to boot into OS X anymore and got stuck.\nI let the device cool down for one hour and booted it back up again, which to my surprise allowed it to boot into OS X!\n\nIt is starting to look like a heat \/ time related issue, if I leave the device alone for a while it will actually go past the OS X bootloader, any idea what might be causing this? Where to start looking.\nIts so weird because even through it doesn't boot OS X, its more then fine booting Windows....."}
{"post_id":40494,"thread_id":31339,"title":"820-3435 - Stuck on EFI part of boot with OSX - Boots Linux and Windows just fine","user_id":289,"username":"smiba","post_date":"2018-10-10 13:41:14","message":"I'm just fixing this because its a device I own and honestly I've yet to find a complete dead end.\n\nThunderbolt is broken on this device, it does not even detect the port.\nI took a screenshot on a locally booted version of OS X 10.12, plugging in any devices does not make the devices appear but they do seem receive power.\n\nThe motherboard still looks pristine and I can't find any issues visually that can cause thunderbolt issues.\nNot working thunderbolt a sign of ME or PCH issues? Would removing the T29 power IC disable thunderbolt in a way it could resolve this or would it just be a risky move that only makes the motherboard in a worse condition?  \n \n[ATTACH type=\"full\" width=\"30%\"]40495._xfImport[\/ATTACH]\n\nAnyone who is stil with me, cheers :)"}
{"post_id":40498,"thread_id":31339,"title":"820-3435 - Stuck on EFI part of boot with OSX - Boots Linux and Windows just fine","user_id":682,"username":"2informaticos","post_date":"2018-10-10 14:16:00","message":"Remove Q3080 first.\nIf doesn't help, remove U3210\/20 and finally U2800."}
{"post_id":40501,"thread_id":31339,"title":"820-3435 - Stuck on EFI part of boot with OSX - Boots Linux and Windows just fine","user_id":289,"username":"smiba","post_date":"2018-10-10 14:40:55","message":"[QUOTE=\"2informaticos, post: 40498\"]Remove Q3080 first.\nIf doesn't help, remove U3210\/20 and finally U2800.[\/QUOTE]\n\nThanks, I'll give it a try.\nWould just removing R3081 be sufficient enough? That would stop the mosfet from activating iirc. (I prefer removing SMD components, components where I have to use hot air on take a bit more time and effort)\n\nAlso possibly interesting finding: [URL]https:\/\/www.youtube.com\/watch?v=1dpfWzgz6LY[\/URL] (Recording from macbook)\nDisconnecting the power prevents most sensors from working, only the sensors directly pulled from the CPU keep working. Sensors that afaik come from the SMC won't read or only will read for a split second before dying again\n\nI don't understand what could cause all these sensors to die out without DC IN being available, maybe its just a software bug? I've never seen this happen before\n\nEDIT:\n\nAlso, to disable thunderbolt. Wouldn't it make more sense to disable PP1V05_TBTLC & PP1V05_TBTCIO & PP3V3_TBTLC? Because that would actually run the thunderbolt host without power\n(I should probably check these rails by the way, no idea if they actually have power. Might be the issue because the whole thunderbolt host is not being detected by the OS \/ System)"}
{"post_id":40504,"thread_id":31339,"title":"820-3435 - Stuck on EFI part of boot with OSX - Boots Linux and Windows just fine","user_id":682,"username":"2informaticos","post_date":"2018-10-10 15:43:36","message":"Thunderbolt chip still connected to PCH\/CPU.\nEven there is no power, a strange value from one data line could block it..."}
{"post_id":40625,"thread_id":31339,"title":"820-3435 - Stuck on EFI part of boot with OSX - Boots Linux and Windows just fine","user_id":289,"username":"smiba","post_date":"2018-10-13 09:43:45","message":"Alright I did some verification of the Thunderbolt circuit\n\nIt seems I might have been mistaken that thunderbolt power is working by thinking if my thunderbolt ethernet adapter makes the lights on my router blink its working\n\nPP15V_TBT is missing because TBT_A_HV_EN stays low, not sure if its supposed to activate on a ethernet adapter?\n\nPP1V05_TBTLC = 1.033V\nPP3V3_TBTLC = 3.32V\nPP1V05_TBTIO = 1.034V\n\nPP3V3_S4_TBTAPWR = 3.32V\n\nWhere should I start looking next? Maybe the TBT controller is having issues reading out its firmware from U2890? one or more PCI-e caps damaged? The shield around the TBT controller, does it use regular solder or an easier to remove low-melt?\n\nStill an OK idea to remove the power to all TBTLC and TBTIO? I'm deciding on removing U3210 since that should effectively disable all thunderbolt power.  (No PP3V3_S4_TBTAPWR also means the TBTLC and TBTIO will never be created)\n\nDisplay port does work by the way"}
{"post_id":41739,"thread_id":31339,"title":"820-3435 - Stuck on EFI part of boot with OSX - Boots Linux and Windows just fine","user_id":289,"username":"smiba","post_date":"2018-11-05 15:36:54","message":"Actually, I have managed to get the thunderbolt to work again a couple of times.\n\nIf you keep the device powered off for 2-4 days and boot it up it works straight away and thunderbolt hardware is actually being found: [ATTACH type=\"full\" width=\"60%\"]41740._xfImport[\/ATTACH]\n \n\nI've tested its functionality by using a thunderbolt ethernet adapter and it works without issues, as long as the controller itself can be found.\n\nPutting the device into sleep mode for a few minutes and then powering it on back from sleep again kills thunderbolt.\n\n\nAnother finding is that if you wait for ±10 seconds in the drive selection menu (Keeping Alt) pressed and then booting into the system there is a good 50% chance it actually boots into the OS.\nWhy this is I don't know but I found this to be repeatable, where just booting straight into the OS (not through the drive selection menu) gives me a poor chance of success <10%.\n\nWhat I think is that the thunderbolt controller is having issues starting up, but can actually in fact work. If its initialised properly it will keep on working until S0 power is dropped.\n\n-----\n\nAny idea where to look? I would like for thunderbolt to work but I also would like a macbook that doesn't give me a 50\/50 gamble of not booting up.\n\nAgain the board looks pristine (and not like \"used' pristine, but fresh from the factory pristine) so the only thing I could think of is reflowing the thunderbolt IC, but then the issue would also kinda change depending on the runtime of the board (Since with temperature metal\/solder ever so slightly expends \/ shrinks). The reason why I think the trick of waiting at the drive selection works is because we reach some kind of hardware timeout that gives up on initialising TB?\n\nI don't think its any of the PCIe caps or connections as that would result in the device cutting out at some point between attempts.\n\n[B]Short list of what changes behaviour[\/B]:\n\nWaiting ±10 seconds before booting up the system (drive selection menu): [B]Increases chance of successful boot[\/B]\nLeaving the device powered off for a few days: [B]Extremely increases chance of successful boot + working thunderbolt[\/B]\n\nRunning off the battery or charger: [B]Does not affect behaviour in any way[\/B]\nHaving something connected to the TB port: [B]Does not affect behaviour in any way[\/B]\nBoard temperature: [B]Does not seem to affect behaviour, but haven't managed to be 100% sure. Unlikely however as it sometimes does boot both hot and cold[\/B]\nPutting slight pressure \/ flex on the board: [B]Does not affect behaviour in any way[\/B]\nPutting clean BIOS \/ ME Area on the ROM: [B]Does not affect behaviour in any way[\/B]\nRunning in SMC Bypass: [B]Does not affect behaviour in any way[\/B]"}
{"post_id":41741,"thread_id":31339,"title":"820-3435 - Stuck on EFI part of boot with OSX - Boots Linux and Windows just fine","user_id":682,"username":"2informaticos","post_date":"2018-11-05 17:03:07","message":"I suppose you can only discard TBT if you remove from the board all its chips which have direct connection with PCH.\nMeans desolder U2800 + U3210\/20...\n\nTry first to force U3030 output TBT_PWR_ON_POC_RST_L at 0V.\nThis should disable U2800.\nMaybe need to force TBTPOCRST_MR_L too..."}
