{"post_id":33878,"thread_id":33878,"title":"820-3435-B - missing components","user_id":1466,"username":"jpadie","post_date":"2018-04-19 09:21:39","message":"further to the \"missing resistor\" of yesterday I see that there are actually a bunch of other mystery absentees. \n\nU5440 (listed as a current sensing FET - INA212), R5440, C5440  and C1924 are all missing.  Like the No Stuff resistor, all the pads are shiny (ish - nicely coated with a layer of 5 years of dust) as if there's never been anything on them; and there certainly wasn't anything on them when i got the laptop. U8030 is present.\n\nThe customer reports that between spilling wine on the laptop and taking it to apple repair people in Toulouse for a \"we'll take a look at it for €75 and then refuse to fix\", nothing was done.  I got the laptop shortly after the customer collected it from the Apple repair store.\n\nIs this a case of the schematics being for the wrong revision of the board perhaps? Or did apple actually do something and these components are missing by their hand?  Seems unlikely that they would have been blown off the board by the original short - and they'd have been in the case anyway...\n\nthanks in advance \nJustin"}
{"post_id":33881,"thread_id":33878,"title":"820-3435-B - missing components","user_id":1466,"username":"jpadie","post_date":"2018-04-19 12:03:48","message":"I've looked at some images of the boards on google and they all have these components missing.  Odd that they are denoted as critical in the schematic."}
{"post_id":33903,"thread_id":33878,"title":"820-3435-B - missing components","user_id":2,"username":"dukefawks","post_date":"2018-04-19 18:46:57","message":"There are no missing parts that is where you have to start from at this point. There are many parts \"not stuffed\" and the schematic is not always right. What is the issue with the board? Do some basic measurements like PPBUS, 3V3_S5, etc. Green\/orange light present?"}
{"post_id":33918,"thread_id":33878,"title":"820-3435-B - missing components","user_id":1466,"username":"jpadie","post_date":"2018-04-19 19:18:02","message":"Board is working now.  Spins up and boots fine. \nthe rtc chip was blown and a bunch of resistors and caps got lost with the air on too high when I replaced it.  All 0201s but I was able to replace them all with 0402 from an older mac donor board thankfully.\n\nLast problem on this board is that the backlight fuse keeps blowing. on inspection the connector is fried inside and the cable is distinctly iffy.   Not surprising as the plastic hinge is very crispy at the backlight end.  Must have been a lot of heat generated when the original short happened. \n\nSo  those are next to be replaced and then (touch wood) we're done."}
