[
    {
        "post_id":7555,
        "thread_id":7555,
        "title":"820-2915-a  NO IMAGE OR BACKLIGHT",
        "user_id":371,
        "username":"nate8organic",
        "post_date":"2016-10-02 14:00:00",
        "message":"Hey, I just got in a 15\" 820-2915 with no data or backlight. but has a good chime.  i pulled the volts of all the probes to the lcd connector but am spending to much time trying to see what volts are wrong if any.  any help in reading my results would be great! Thought it might have been the u8000 but im getting 3.4v at the lvds so i factored that out"
    },
    {
        "post_id":7559,
        "thread_id":7555,
        "title":"820-2915-a  NO IMAGE OR BACKLIGHT",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-10-02 16:05:20",
        "message":"You have 30V on the backlight pins 38,39,40 so there must be backlight and an image."
    },
    {
        "post_id":7578,
        "thread_id":7555,
        "title":"820-2915-a  NO IMAGE OR BACKLIGHT",
        "user_id":371,
        "username":"nate8organic",
        "post_date":"2016-10-03 10:24:28",
        "message":"Okay,  I still have no image so perhaps its the lvds connector? i have tried it on 3 other screens with the same results. but from screen to screen i get dif results. some screens give me a few colored lines down it.  but still no image or backlight. plugged into the external monitor i get an image.  any  thoughts here? I ran out of lvds connectors so until  those come in i cant test that theory"
    },
    {
        "post_id":7581,
        "thread_id":7555,
        "title":"820-2915-a  NO IMAGE OR BACKLIGHT",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-10-03 11:34:05",
        "message":"Does it boot into OSX on an external screen? \nIs SMC_LID high?\n30V on backlight pins must mean there is backlight. Check BKL_EN and BKL_PWM."
    },
    {
        "post_id":7606,
        "thread_id":7555,
        "title":"820-2915-a  NO IMAGE OR BACKLIGHT",
        "user_id":371,
        "username":"nate8organic",
        "post_date":"2016-10-03 12:53:00",
        "message":"It appears it does but i cannot get the main screen on the external and it seems pretty glitchy not sure if that is the hdmi port or the board.    \n\nSMC_LID is 3.1v open but is also 3.1v closed, if i understand correctly that should be dif when the lid is closed? \n\nBLK_EN IS 3.1v AND BLK_PWM IS 2.92v\n\nAlso i noticed wile i was testing probes, (its possible that i touched 2 parts together with my probe) That the screen backlight had come on but quickly turned off. (also note all screens im using to test are confirmed working)"
    },
    {
        "post_id":7617,
        "thread_id":7555,
        "title":"820-2915-a  NO IMAGE OR BACKLIGHT",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-10-03 18:44:00",
        "message":"If this does not fully boot into OSX it probably is a bad GPU. Take it to Apple for a free repair!"
    }
]