{"post_id":75535,"thread_id":61204,"title":"820-01700 No power, 20v 0.09a","user_id":7922,"username":"tcampbell34","post_date":"2021-05-17 19:31:54","message":"I got this 820-01700 board that was liquid damaged near JB500 area. I get 20v 0.09a on the charger and I have all my SLPS2R and AWAKE voltages. I do not have anything on my G3S rails. I attempted to boot it into DFU to try a T2 firmware restore but it would not go into DFU at all. After a while, I realized it is because PMU_ONOFF_L does not drop when I press the power button. I soldered a wire to PMU_ONOFF_L and was able to get the board into DFU mode by pressing the 3 buttons on the keyboard and holding the wire to ground. Unfortunately, DFU restore failed with error 4005 and the amps never moved passed 90ma. I would like to fix the power button problem first so I can try the DFU restore a few more times. Its a real pain to use a wire to trigger that signal and press the 3 buttons at the same time. There was some corrosion around U4901 so I changed it but I still have the same issue. PMU_ONOFF_R_L is 1.7v and does drop to 0 when I press the power button, but PMU_ONOFF_L is 3.3v and does not change when I press the power button. What would cause this?"}
{"post_id":75538,"thread_id":61204,"title":"820-01700 No power, 20v 0.09a","user_id":682,"username":"2informaticos","post_date":"2021-05-18 01:58:55","message":"U4901 is a level shifter; 0-1V8 to 0-3V3.\nIf PMU_ONOFF_L can be controlled manually and board has expected reaction, then should be U4901 issue; bad chip, solders, or traces."}
{"post_id":75569,"thread_id":61204,"title":"820-01700 No power, 20v 0.09a","user_id":7922,"username":"tcampbell34","post_date":"2021-05-19 10:12:59","message":"Yea you were right. The trace for PMU_ONOFF_L had no connection to pin 4 on U4901. I ran a wire to fix this and power button does work now. When I reassembled the board in the case, I connected a charged battery to it this time and now it takes 20v 0.01amps with both the battery and charger. When I pressed the power button, the fans started spinning and the internal LCD turned on with backlight only. I confirmed that I had USB activity and caps lock did light up. During this whole time, the USB meter still reads 20v 0.01 amp, so there seems to be an issue with the charger or charging circuit. Then after only like a minute of being on, the fans start spinning at high speed for 1 or 2 seconds and then it turns off completely and I am not able to get it to turn on again using the power button. I tried SMC bypass and it does not turn on still, but sometimes the fans will twitch a little, as in they move very slightly when I hold the power button down."}
{"post_id":75573,"thread_id":61204,"title":"820-01700 No power, 20v 0.09a","user_id":682,"username":"2informaticos","post_date":"2021-05-19 14:23:03","message":"Did you connect data battery cable?\nBoard switches to 20V with charger alone (without battery)?"}
{"post_id":75577,"thread_id":61204,"title":"820-01700 No power, 20v 0.09a","user_id":7922,"username":"tcampbell34","post_date":"2021-05-19 14:40:11","message":"Yes battery data cable is connected.\nBoard takes 20v 0.09a with just the charger, no battery.\nWith charger and battery, 20v 0.01. \n\nI also notice with just the charger, PPBUS is 12.3v and then with both charger and the battery connected, PPBUS is only 11.3v."}
{"post_id":75580,"thread_id":61204,"title":"820-01700 No power, 20v 0.09a","user_id":682,"username":"2informaticos","post_date":"2021-05-19 15:51:25","message":"Can you get it in DFU now?"}
{"post_id":75616,"thread_id":61204,"title":"820-01700 No power, 20v 0.09a","user_id":7922,"username":"tcampbell34","post_date":"2021-05-20 18:52:37","message":"Yea I can get it into DFU. I tried a T2 restore twice, once with the battery and once without. When I tried it without a battery connected, it takes like 10-15 minutes and then it just gives me that 4005 error and it does not turn on. When I try with the battery connected, it actually appears to successfully complete the restore process. I do not get any errors, but the board still does not turn on.  I have not been able to get it to turn on again like I did before either."}
{"post_id":75626,"thread_id":61204,"title":"820-01700 No power, 20v 0.09a","user_id":682,"username":"2informaticos","post_date":"2021-05-21 03:50:25","message":"What is the exact PPBUS_G3H voltage now, without battery connected (only charger)?"}
{"post_id":75631,"thread_id":61204,"title":"820-01700 No power, 20v 0.09a","user_id":7922,"username":"tcampbell34","post_date":"2021-05-21 12:53:15","message":"With just charger it is 12.32v"}
{"post_id":75645,"thread_id":61204,"title":"820-01700 No power, 20v 0.09a","user_id":682,"username":"2informaticos","post_date":"2021-05-21 17:00:53","message":"Wrong voltage, not controlled by T2.\nCould be U7000\/800 issue, T2, or something wrong with SCL\/SDA lines.\nCheck R5220\/21."}
{"post_id":77920,"thread_id":61204,"title":"820-01700 No power, 20v 0.09a","user_id":7922,"username":"tcampbell34","post_date":"2021-07-19 10:35:23","message":"I replaced U7000 and U7800 on this board but no change. R5220\/21 seem to be good. One thing I noticed is without the battery connected, I do not have any voltages on my SSD rails. When I connect a charged battery and a charger to it, I do get all the SSD voltages steady for about 30 seconds, and then they disappear."}
{"post_id":77924,"thread_id":61204,"title":"820-01700 No power, 20v 0.09a","user_id":682,"username":"2informaticos","post_date":"2021-07-19 12:09:09","message":"Looks like T2 problem, if PPBUS_G3H is not adjusted."}
