[
    {
        "post_id":6569,
        "thread_id":6569,
        "title":"SPI ROM Programmer Voltage Problem?",
        "user_id":135,
        "username":"bjf",
        "post_date":"2016-09-10 16:00:26",
        "message":"[COLOR=#333333][FONT=Verdana][SIZE=13px]Does anyone know if I'm supposed to have 3.3V on all 7 of the pins (except ground) on an SPI ROM programming setup? My pi doesn't put out 3.3V on all the lines and I can't remember if it ever did or if it got damaged by a bad ROM I just connected. It has no voltage on pins 2,5 and 6.[\/SIZE][\/FONT][\/COLOR]"
    },
    {
        "post_id":6570,
        "thread_id":6569,
        "title":"SPI ROM Programmer Voltage Problem?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-09-10 16:45:00",
        "message":"Who knows? Get a real programmer that is designed properly and you can't screw up. TL866 or EZP2010 are both good and cheap. \nAlso if you are messing with your 00165 ROMs make sure to keep backups and which file goes with what board. If you mess up you will have a big problem with the ME region."
    },
    {
        "post_id":6624,
        "thread_id":6569,
        "title":"SPI ROM Programmer Voltage Problem?",
        "user_id":135,
        "username":"bjf",
        "post_date":"2016-09-12 10:17:32",
        "message":"I have a TL866. Don't know how to use it though. I found a tutorial for the pi version so I went with that. It's worked well but I'm just not sure if it's always had that 3.3V on all the pins and it's damaged or it's always been that way."
    },
    {
        "post_id":6643,
        "thread_id":6569,
        "title":"SPI ROM Programmer Voltage Problem?",
        "user_id":375,
        "username":"gcain",
        "post_date":"2016-09-12 16:26:15",
        "message":"bjf; I prefer using a RasPI too for flashing chips.\n\nYou will experience problems with voltage drop if your wires are too long. They need to be less than 150mm. Also, some chips require you have pins 3 & 7 hooked up too.\n\n1: 3.3\n2: 0.4\n3: 3.3\n4:   -\n5: 0.4\n6: 0.4\n7: 3.3\n8: 3.3\n\nThat's just with the device powered up.\nHope that helps."
    },
    {
        "post_id":6644,
        "thread_id":6569,
        "title":"SPI ROM Programmer Voltage Problem?",
        "user_id":135,
        "username":"bjf",
        "post_date":"2016-09-12 16:51:21",
        "message":"Ok, thanks a lot for the pin measurements, that's what I have so I guess I'm okay. It wasn't recognizing the ROM chip and I don't think I've seen that before so I was thinking something might have failed. Must be a bad ROM chip. It got hit by a spill so it makes sense."
    },
    {
        "post_id":6647,
        "thread_id":6569,
        "title":"SPI ROM Programmer Voltage Problem?",
        "user_id":375,
        "username":"gcain",
        "post_date":"2016-09-12 17:00:04",
        "message":"Using flashrom; in some cases I have needed to specify the chip for it to read.\nEspecially with the newer chips."
    },
    {
        "post_id":6676,
        "thread_id":6569,
        "title":"SPI ROM Programmer Voltage Problem?",
        "user_id":135,
        "username":"bjf",
        "post_date":"2016-09-13 10:57:36",
        "message":"ahh, good to know. this was a 2015 Air chip so that might be what I was running into. thanks again"
    }
]