{"post_id":101909,"thread_id":64244,"title":"question about dfu restore","user_id":1870,"username":"farfan14","post_date":"2023-10-08 11:16:07","message":"i want to know if possible dfu restore by configurator without battery and housing. for exampleif  can I  do restore if i have only connected motherboard by usb to another mac and also plugged on charger?.thanks\n\ni forced to be in dfu mode by changing u4770. so dont need keyboard for dfu\n\ni am getting error 0xFAE (4014) Unexpected device state  DFU expected \"recovery\"( probably forced into DFU mode externally)\n\nthis error is with everything connected and also when i am trying to restore only motherboard connected\n\np.s problem was that ssd  circuits was shorted and i changed 4 pcs nands. tsb 4227 and tsb 4228 . programmed by jc P13. no more short. i am getting ssd voltages. 1.8v  0.9v 2.5v but can't restore. i also changed U9080\n\nall awake and slps2r voltages are there.."}
{"post_id":101910,"thread_id":64244,"title":"question about dfu restore","user_id":682,"username":"2informaticos","post_date":"2023-10-08 11:38:09","message":"You should turn off the board and force it into DFU manually.\nDon't start restore from recovery state.\n\nYou should use corresponding DFU pads..."}
{"post_id":101911,"thread_id":64244,"title":"question about dfu restore","user_id":1870,"username":"farfan14","post_date":"2023-10-08 11:42:51","message":"maybe you don't understand what i asked.sorry for my bad english. please read once again what i wrote. thanks 2 informaticos for your effort. you are great man"}
{"post_id":101912,"thread_id":64244,"title":"question about dfu restore","user_id":1870,"username":"farfan14","post_date":"2023-10-08 11:54:16","message":"for example if you will change nand on ipad\/iphone it will stuck in dfu mode and for restore battery\/power supply must be connected and dock\/port of course. no need anything else for restore. i dont know it about macbook. macbook also need battery connected or charger is enough for dfu restore .and also it need anything else to be connected or not?thanks"}
{"post_id":101913,"thread_id":64244,"title":"question about dfu restore","user_id":1870,"username":"farfan14","post_date":"2023-10-08 14:25:03","message":"finally i fixed this macbook A2159   820-01598. so reason of this problem was damaged one of the replaced nands. changed all of them second time and problem fixed.  and about my question i checked only motherboard connected with charger and its restored. so its possible to restore without anything else.its comfortable for testing purpose during repair.\n\nthanks"}
