[
    {
        "post_id":51128,
        "thread_id":51128,
        "title":"820-00923 One USB-C Connector only works \"one way\"",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2019-08-01 07:52:00",
        "message":"Working on a liquid-damaged 00923. Board had a spill to the right-hand-side, took out one CD3215 and the USB-C assembly on that side. Replaced the controller and USB-C assembly and the board\/unit is working well, with the exception of one thing: one port on the LEFT side of unit (opposite of spill, no damage to this side) only works with charger \"one way\". I've confirmed it's not the cable or the USB-C port assembly (tried 5 of each to be positive). I believe this damage\/issue was likely present prior to the spill, and have seen a few instances of the 'top left' connector having issues on other threads.\n\nI'm curious as to if this is likely an issue with the corresponding CD3215 chip? Maybe a cracked ball or something, but since it's got under-filled, would need to pull and re-ball or replace. Would hate to pull it and replace it and have that not be the culprit, so wanted to check to see if anyone else had experienced (and fixed) this. I'm fine to pull the USB-C controller, but was curious if anyone had any other ideas. Checked the input\/outputs via diode and all seems fine\/normal. No damage to board. Also, any idea how I can definitively determine which USB-C controller goes with which port on the USB-C assembly? Since the issue is only with the 'top' port (one nearest the corner), I assume it's U3100, but wasn't entirely certain.\n\nAny help appreciated!"
    },
    {
        "post_id":51134,
        "thread_id":51128,
        "title":"820-00923 One USB-C Connector only works \"one way\"",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-08-01 11:03:10",
        "message":"What voltages get on the board when connect charger on the non-working way?\n\nAbout identifying an USB-C port, check continuity between its power pins (larger on the port) and F3000\/01."
    }
]