{"post_id":39612,"thread_id":39612,"title":"820-4924 - Water damaged no keyboard backlight","user_id":296,"username":"jadao","post_date":"2018-09-16 20:18:57","message":"Water damaged, no corrosion at all, battery shot. Someone worked on it previously for data recovery. Client claims it's not powering on. I\/O cable broken at one end...\n\nkeyboard backlight on the logic board (J4915) shot\/burned.\nConnector on the keyboard backlight sheet also burned.\nkbdled_cathode2 through hole burned.\n\nPPVOUT_S0_KBDBKLT was internally shorted so I decided to make a new route because this involved only 7 caps, D7720 and feedback PPVOUT_BKLT_FB2 to u7700.\n\nI restored kbdled_cathode2 through hole connexion.\nI replaced J4915 and got these diode mode values that look good to me:\n\n0.614 on Cathode 1 on pin 1\n0.613 on Cathode 2 on pin 2\n0.590 on PPVOUT_S0_KBDBKLT pin 3 and 4\n0.00 (gnd) on pin 5, 7, 8, 9 and 10\nOL (not connected) on pin 6\n\nProblem:\nEverything is working except keyboard backlight.\nWhen I boot during the progress Apple bar, when it switches and mouse pointer appears I can see one brief flash of keyboard backlight and then no more. As if there was no feedback after the first time keyboard backlight starts. Don't know though if it is supposed to stay on.\n\nDuring this process where the kbd bklt appears briefly I catch PPVOUT_S0_KBDBKLT going from 5V to 35V and maybe more, Then it stays at 16V, witch is maybe not enough but is kind of boosting...\nBKLT_PWM_KEYB is 1.14V. When I use F6 key to higher the kbd bklt I can see on the screen the logo bar showing that it s going up. but still no backlit keyboard.\n\nI don't think it's a feedback issue, because when I disconnect it there is absolutely no boosting, PPVOUT_S0_KBDBKLT stays at 4,88V and nomore backlight kbd briefly showing up.\n\nI checked values and continuity between u7700 R7720 and R7721 (cathode 1 and 2) they measure 0 ohm, but schematics says 10.2ohms, same thing with good board I guess it's ok...\nR7747 0 ohm is also good for BKLT_PWM_KEYB.\nSCL and SDA 0 ohms resistors R7750 and R7751 are also measuring 0ohms.\n\nAny idea? I am thinking about J4915 but no way to make sure it is making contact with the backligh sheet pin connector replace u7700?"}
