{"post_id":79218,"thread_id":61609,"title":"Macbook A1502 with a non-working keyboard and trackpad","user_id":29314,"username":"syslan","post_date":"2021-08-23 17:34:26","message":"Macbook keyboard and trackpad not working in OSx\n\nA client brought me a Macbook A1502 with a non-working keyboard and trackpad, but when I decided to test them in another OSs (Linux MX and HBCD in my case) and they work perfectly.\n\nI tested them in High Sierra and Big Sur in safe mode but they didn't work.\n\nAnother thing that is happening is that the keyboard is not working on pre-boot, meaning that I can't reset the NVRAM, or even use ALT to boot into another OS, I've been using an extenral keyboard this whole time. The only key combination that is working is SHIFT+CONTROL+OPTION to reset the SMC, but I think that it's working becuse the Macbook is off, as soon as I turn it on, nothing works.\n\nYes, I've already reset the NVRAM with the external keyboard, and re-seated the keyboard flex and trackpad ribbon and still nothing."}
{"post_id":79221,"thread_id":61609,"title":"Macbook A1502 with a non-working keyboard and trackpad","user_id":682,"username":"2informaticos","post_date":"2021-08-24 03:44:27","message":"Please correct the typo; no need to repeat the post.\nYou may also post the 820-xxxx board code at same time..."}
{"post_id":79235,"thread_id":61609,"title":"Macbook A1502 with a non-working keyboard and trackpad","user_id":29314,"username":"syslan","post_date":"2021-08-24 10:17:20","message":"[QUOTE=\"2informaticos, post: 79221, member: 682\"]\nPlease correct the typo; no need to repeat the post.\nYou may also post the 820-xxxx board code at same time...\n[\/QUOTE]\nSorry about that. Did not notice it. Fixed.\n\nThe board is 820-4924a"}
{"post_id":79238,"thread_id":61609,"title":"Macbook A1502 with a non-working keyboard and trackpad","user_id":682,"username":"2informaticos","post_date":"2021-08-24 12:52:10","message":"The strange thing is the KB\/TP don't work before, nor after login; two different communications are used.\nHowever, check first TPAD_SPI resistors, R4902-04.\nPost U4910 voltages, before and after login."}
