[
    {
        "post_id":3488,
        "thread_id":3488,
        "title":"820-2915, USB supply (U4600) burned -> replaced now short on PP5V_S0, U9500 HOT!",
        "user_id":136,
        "username":"george-a",
        "post_date":"2016-06-11 14:21:44",
        "message":"Hi guys,\n\nthis one had an exploded u4600 when it arrived (it smoked while the customer was testing it) and I replaced it with new one and the short seems to be gone.\n\nnow when I turn it on the fans start and stop after 1-2 secs OR can last upto 10sec - this is when I noticed that U9500 gets REALLY hot and by measuring around I got a diode mode reading on 0,018 on PP5V_S0. Of course I have no PP1V5_GPU_REG and I measure 0V on PPVCORE_S0_AXG, too.\n\nI see PP5V_S0 is generated by Q7860, should I remove that and inject 5V with a power supply to see what gets hot? (there is also C7860 there which I may also have to remove just incase it shorts).\n\nShould I replace U9500 first? Since it gets hot maybe thats the one shorted to ground?\n\nWhere would you start?\n\nPlease advise :)\n\n\nBR,\ngeorge"
    },
    {
        "post_id":3490,
        "thread_id":3488,
        "title":"820-2915, USB supply (U4600) burned -> replaced now short on PP5V_S0, U9500 HOT!",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-06-11 15:45:11",
        "message":"Surge on 5V bus, there may be lots of damage. Start with U9500 and go from there. Usually U4800 is the first one to die, check 5V_S3 for low resistance too."
    },
    {
        "post_id":3499,
        "thread_id":3488,
        "title":"820-2915, USB supply (U4600) burned -> replaced now short on PP5V_S0, U9500 HOT!",
        "user_id":136,
        "username":"george-a",
        "post_date":"2016-06-12 02:37:00",
        "message":"ok duke I will replace U9500 today and let you know..\n\ndiode mode to ground for PP5V_S3 is 0,381 when it was close to zero before u4600 replacement. Resistance between GND and PP5V_S3 is approx. 16.3Kohm.\n\nu4800 is important for what? I see  \"IR Support\" as title in the schematic..  or you mean it could also short?\n\ngeorge"
    },
    {
        "post_id":3541,
        "thread_id":3488,
        "title":"820-2915, USB supply (U4600) burned -> replaced now short on PP5V_S0, U9500 HOT!",
        "user_id":136,
        "username":"george-a",
        "post_date":"2016-06-13 03:05:52",
        "message":"update: I removed U9500 which was getting very hot but measuring PP5V_S0 at C9501 gives 0.023 diode mode. This means the short is present elsewhere on this rail but was also somehow affecting U9500.\n\nshould I inject 5V now? You see me reluctant because I would really like to follow the correct procedure with this one without \"sudden moves\" ..."
    },
    {
        "post_id":3572,
        "thread_id":3488,
        "title":"820-2915, USB supply (U4600) burned -> replaced now short on PP5V_S0, U9500 HOT!",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-06-13 14:52:29",
        "message":"Yeah inject 5V and see what heats up, but this board will have extensive damage. Probably 50% of chips on 5V_S0 bus are dead, starting with all the ISL chips."
    }
]