{"post_id":11111,"thread_id":11111,"title":"[FUBAR}820-00165, No Green Light","user_id":515,"username":"SMMRepair","post_date":"2016-12-11 13:19:00","message":"I have an 820-00165 board that has no green light. The board had a random failure one day and stopped charging\/powering on. Board does not have a single discolored pad or spot of corrosion or any indication of liquid at all. Testing board in one of my known-good assemblies with a genuine charger, of course.\n\n- Nothing gets warm\n- No shorts detected on 3v42 or ppbus\n- ppbus_g3h is low (8.16v)\n- SMC_BC_ACOK is 3.34v at U7100\n- CHGR_ACIN is 4.36v at U7100\n- SYS_ONEWIRE is 3.42v at pin 19 of J9500\n\nPretty stumped on this one. I thought for sure there would be a short on ppbus when I saw it only measured 8.16v, but there isn't. Thought maybe U7100 was bad, but it doesn't get warm and is putting out proper SMC_BC_ACOK (CHGR_ACIN is 4.36v).\n\nAll help appreciated, duke."}
{"post_id":11112,"thread_id":11111,"title":"[FUBAR}820-00165, No Green Light","user_id":558,"username":"arghhh","post_date":"2016-12-11 14:46:39","message":"What is the voltage on smc_reset_l? What does the U5110 area look like?"}
{"post_id":11114,"thread_id":11111,"title":"[FUBAR}820-00165, No Green Light","user_id":515,"username":"SMMRepair","post_date":"2016-12-11 14:50:01","message":"U5110 looks great, all pins measure properly. SMC_RESET_L is normal (3.42v). I'm beginning to think the SMC itself may be at fault. I seem to have come across a higher-than-normal rate of SMC failure on this model board.\n\nHas anyone else experienced this?"}
{"post_id":11115,"thread_id":11111,"title":"[FUBAR}820-00165, No Green Light","user_id":558,"username":"arghhh","post_date":"2016-12-11 14:51:38","message":"Yes dead SMC. Reflow or replace."}
{"post_id":11118,"thread_id":11111,"title":"[FUBAR}820-00165, No Green Light","user_id":515,"username":"SMMRepair","post_date":"2016-12-11 15:52:26","message":"Replaced SMC and got green light, but no power\/fan. PPBUS_G3H is still 8.17v. The last 2 of these I replaced the SMC on (those 2 had 3v42 shorts that ended up being the SMC), the CPU ended up being dead. I hope that's not the case for this one, but will report back. I haven't gone through everything yet, but wanted to update that replacing SMC (not reflow--replaced with new chip since the other one was perfectly clean underneath, probably dead completely) did bring back green light.\n\nStay tuned. If anyone has anything to chime in with (common fault to check on this model board, etc), that would be great. From my experience with this board, it seems to be a colossal piece of shit compared to the 3437 boards."}
{"post_id":11119,"thread_id":11111,"title":"[FUBAR}820-00165, No Green Light","user_id":515,"username":"SMMRepair","post_date":"2016-12-11 16:19:09","message":"Found U1900 got a bit warm, replaced it and ppbus is back to 8.58v. Still no fan. The clock being shorted has me worried the CPU on this one is dead, too (that makes 3 in a row of this model for me). Will cross my fingers that PM_SLP_S5_L is there and will report back."}
{"post_id":11120,"thread_id":11111,"title":"[FUBAR}820-00165, No Green Light","user_id":515,"username":"SMMRepair","post_date":"2016-12-11 16:27:55","message":"The CPU is fucked on this one, too. Damn. Short on vrtc, removed all caps on the line, and still a short at vrtc with only CPU left to be the culprit. Oh well! Thanks guys, you can close this one."}
