{"post_id":92673,"thread_id":63096,"title":"820-3476 Keeps blowing Q7130","user_id":26621,"username":"grmacs","post_date":"2022-09-16 15:23:17","message":"This was working off battery only but wouldn't charge. Looked like something was on board that shorted Q7180 to ground pin nearby. REplaced Q7180 U7100 C7125 and DCIN Fuse. I've changed Q7130 4 times now after replacing it short will be gone on pin 1 but if I plug charger in long it will burn Q7130 fairly quickly. I've checked the traces from Q7130 and all has good traces. Tried replacing ISL at the same time as Q7130 but no luck. Any chance the coil L7130 could cause this? Seems like I've seen this before.\n\nDiode at PPBUS_G3H is .138\n\nISL voltages and resistance look ok other than 18,17,27,28 of course are low."}
{"post_id":92675,"thread_id":63096,"title":"820-3476 Keeps blowing Q7130","user_id":682,"username":"2informaticos","post_date":"2022-09-16 15:36:12","message":"Be sure about both R\/C7125 and their traces\/solders to U7100 and Q7130.\nAlso check diode mode to ground directly on the Gate pins of Q7130."}
{"post_id":92687,"thread_id":63096,"title":"820-3476 Keeps blowing Q7130","user_id":26621,"username":"grmacs","post_date":"2022-09-17 09:11:36","message":"TRaces all check out and Q7130 pin 1 is 625 and pin 6 is .465 once Q7130 is replaced and before powering board. If I power the board with magsafe only, Pin 1 will be somewhere around .03 range. Could Q7180 cause it to be burning up? I feel like that is the only major change since I started working on the board unless I shorted something unknowingly checking test points or bad solder on U7100. I say that because originally this board booted off battery and currently that would not be the case."}
{"post_id":92689,"thread_id":63096,"title":"820-3476 Keeps blowing Q7130","user_id":26621,"username":"grmacs","post_date":"2022-09-17 09:29:23","message":"I tried swapping Q7180 again prior to powering board but no luck. Diode at pin 1 Q7130 is now .15 after plugging in charger. Pin 6 is still .465"}
{"post_id":92697,"thread_id":63096,"title":"820-3476 Keeps blowing Q7130","user_id":682,"username":"2informaticos","post_date":"2022-09-17 11:46:32","message":"Why do you insist so much to check diode mode on the MOSFET Gates, after applying power?\nThis is totally irrelvant; it may come to normal values after few minutes.\nIf U7100 detects a problem, will force off corresponding Q7130 section shorting G-S pins; inside the chip, on the output driver.\nWhen in doubt, remove the MOSFET and check it outside of the board.\n\nBoard still works on battery alone?\nDid you check resistance between pins 17\/18 and 27\/28 of U7100?"}
{"post_id":92703,"thread_id":63096,"title":"820-3476 Keeps blowing Q7130","user_id":26621,"username":"grmacs","post_date":"2022-09-17 13:45:55","message":"Ahhhh ok. Got it. Board still starts with battery. \n\nYes resistance is good.\nPin 17\/18 -3.5 ohms\n27\/28 - 20.0 ohms"}
{"post_id":92704,"thread_id":63096,"title":"820-3476 Keeps blowing Q7130","user_id":682,"username":"2informaticos","post_date":"2022-09-17 15:26:30","message":"Did you check out of board if any of Q7130 removed got really burnt?"}
{"post_id":92707,"thread_id":63096,"title":"820-3476 Keeps blowing Q7130","user_id":26621,"username":"grmacs","post_date":"2022-09-17 16:58:50","message":"After checking the chips off the board it doesn't appear they did. I thought low value I was getting on pin 1 was indicative. Q7180 and DCIN fuse are only things I know for certain were broken to start with."}
{"post_id":92708,"thread_id":63096,"title":"820-3476 Keeps blowing Q7130","user_id":682,"username":"2informaticos","post_date":"2022-09-17 17:01:40","message":"OK, then no danger to connect charger and post U7100 basic voltages; pins 1, 2, 3, 9, 12, 13, 14, 15, 17, 19, 20, 27."}
{"post_id":92710,"thread_id":63096,"title":"820-3476 Keeps blowing Q7130","user_id":26621,"username":"grmacs","post_date":"2022-09-17 17:16:23","message":"1- 0\n2- 16V\n3- 4V\n9 - 0V\n12 - 3.4V\n13 - 3.2V\n14 - 3.2V\n15 - 0\n17 - 1.2V\n19 - 5.5V\n20 - 5.5V\n27 - 1.2V\n\nI've changed Q7180 and U7100 multiple times and same results. I've tested traces from Q7180 also"}
{"post_id":92711,"thread_id":63096,"title":"820-3476 Keeps blowing Q7130","user_id":682,"username":"2informaticos","post_date":"2022-09-17 18:52:12","message":"Post R7185\/86 resistance value; measured onboard, ohm scale.\nCheck their traces.\nAlso check continuity between R7120 and Q7180."}
{"post_id":92712,"thread_id":63096,"title":"820-3476 Keeps blowing Q7130","user_id":26621,"username":"grmacs","post_date":"2022-09-17 20:19:30","message":"R7180\/1\/5\/6 all measure correctly and I have checked for continuity from all points of Q7180 to the according traced points on the board."}
{"post_id":92713,"thread_id":63096,"title":"820-3476 Keeps blowing Q7130","user_id":682,"username":"2informaticos","post_date":"2022-09-17 20:36:07","message":"Can you post what I asked???\n\n\"1- 0\"\nOne of mentioned resistors, or Q7180 is bad; as MOSFET is driven on, but you don't get voltage at R7120."}
{"post_id":92724,"thread_id":63096,"title":"820-3476 Keeps blowing Q7130","user_id":26621,"username":"grmacs","post_date":"2022-09-19 13:33:14","message":"Thanks for your help. I DID figure this out. I pulled Q7180 again and under the scope when touching up those pads on the board again there was a little thin layer of pink plastic ribbon on one of the pads. I looked at the bottom of Q7180 and there is a thin layer of pink plastic that was partially damaged and shifted. So I believe when I was pulling them and placing, I used too much heat that was causing that pink layer to get partially damaged. After cleaning up the bottom of Q7180 and touching up the pads on it with some solder prior to placing it back, the board now starts every time. From now on when I change a Q7180 I will use less heat and check the bottom prior to placing it on the board! Oy what a headache."}
