{"post_id":20476,"thread_id":20476,"title":"820-3332 - Freezes on stress test, then refuses to start, works again after a while","user_id":205,"username":"dr. moast","post_date":"2017-05-18 08:39:44","message":"We have this 820-3332 here which initally arrived with a black screen during boot.\n\nResoldered U8900, now it starts once, then freezes when running GeekBench. It will not turn black or anything but just freeze and needs a forced shutdown.\nAfter that, it will always freeze while booting at around 1\/4 of the progress bar.\n\nIf we let it sit for a while, it can be booted again just to freeze again on the next GPU intensive task.\n\nWe resoldered U8900, replaced U8900, replaced the GPU twice but it will not make any difference.\n\nAny thoughts?"}
{"post_id":20505,"thread_id":20476,"title":"820-3332 - Freezes on stress test, then refuses to start, works again after a while","user_id":2,"username":"dukefawks","post_date":"2017-05-18 13:53:11","message":"Probably VRAM issue or missing\/damaged resistors around GPU\/VRAM."}
{"post_id":20540,"thread_id":20476,"title":"820-3332 - Freezes on stress test, then refuses to start, works again after a while","user_id":205,"username":"dr. moast","post_date":"2017-05-19 01:07:36","message":"Thanks duke, I will check.\n\nBut can you (or somebody) help me understand why it works again after a while? Is this behavior usually caused by a heat issue or a problem with a cap not discharging or something like that?"}
{"post_id":20570,"thread_id":20476,"title":"820-3332 - Freezes on stress test, then refuses to start, works again after a while","user_id":1,"username":"larossmann","post_date":"2017-05-19 23:43:07","message":"It can be caused by any intermittently failing part, there's no way to really pinpoint it sadly. VRAM is the next logical step after GPU."}
{"post_id":20596,"thread_id":20476,"title":"820-3332 - Freezes on stress test, then refuses to start, works again after a while","user_id":637,"username":"TCRScircuit","post_date":"2017-05-20 12:41:45","message":"It's a VRAM chip failing.... It works again after it sits because the VRAM had a chance to cool down... Kinda like how some failing graphics chips crash after rising above a certain temp... The resistance is higher in a hot chip then a cold chip so once it gets hot enough, the part of the die that is failing looses its ability to conduct electricity therefore it stops working... After it cools down, it is able to conduct electricity therefore letting it work again..."}
