[
    {
        "post_id":25230,
        "thread_id":25230,
        "title":"820-3115 power cycling and I don't know why.",
        "user_id":637,
        "username":"TCRScircuit",
        "post_date":"2017-09-11 15:38:43",
        "message":"I had a 820-3115 come in with heavy corrosion on the edge where most of the liquid will come in. Cleaned all the areas up with flux and heat and ran it through the USC. All working. Replaced quite a few corroded and burned components and all was working. There was corrosion on the CPU fets so I replaced them. Let it run for a sec.. It chimed and booted so I thought OK this is done so I put it in the slot to reassemble later. \n\nI go to reassemble it, all back together so I test it. It's power cycling now. Did a light reflow on the SMC as I know crap under it can do this. S5 rails are present but all s4 s3 and s0 rails are pulsing. PPBUS_G3H is 12.56 v as normal. The smc is NOT in reset mode. Vcore is doing nothing and ALL SYS PWR good is pulsing as well. I replaced the clock chip to be sure. U7200 was good but I though just maybe something went funny with it so I replaced it. No luck. Ran it through the cleaner one more time and still nothing. Still power cycling. Here are my findings : \n\nALL SYS - Pulsing \npp3v3_s5 present\npp3v3_s4 pulsing \npp3v3_s3 pulsing\npp5v_s5 Present\npp5v_s3 pulsing\nVcore absent w\/ no pulsing. \npm_slp_s4_L - pulsing \npm_slp_s3_l - pulsing \n\nThanks Duke or Louis in advance."
    },
    {
        "post_id":25238,
        "thread_id":25230,
        "title":"820-3115 power cycling and I don't know why.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-09-11 20:25:30",
        "message":"R7402\/03?..."
    },
    {
        "post_id":25242,
        "thread_id":25230,
        "title":"820-3115 power cycling and I don't know why.",
        "user_id":637,
        "username":"TCRScircuit",
        "post_date":"2017-09-11 21:12:42",
        "message":"Both nice and clean and at spec."
    },
    {
        "post_id":25252,
        "thread_id":25230,
        "title":"820-3115 power cycling and I don't know why.",
        "user_id":637,
        "username":"TCRScircuit",
        "post_date":"2017-09-12 10:20:09",
        "message":"Right now im thinking the CPU is dead. There was corrosion on the fets and C7523 was burned. It worked fine in inital testing but I have a feeling it was dying all along. That would explain the power cycling as of right now. This one is a thinker..."
    },
    {
        "post_id":25267,
        "thread_id":25230,
        "title":"820-3115 power cycling and I don't know why.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-09-12 16:31:27",
        "message":"Could be bad soldering on one of the CPU FETs or dead U7400 or something around that area."
    },
    {
        "post_id":25272,
        "thread_id":25230,
        "title":"820-3115 power cycling and I don't know why.",
        "user_id":637,
        "username":"TCRScircuit",
        "post_date":"2017-09-12 18:06:45",
        "message":"Im going to replace the CPU fets again and u7400 while im at it."
    },
    {
        "post_id":25273,
        "thread_id":25230,
        "title":"820-3115 power cycling and I don't know why.",
        "user_id":637,
        "username":"TCRScircuit",
        "post_date":"2017-09-12 23:19:12",
        "message":"I pulled the SMC per Chris Long's suggestion while discussing on live stream and sure enough there was crap under it. New preballed chip on the way."
    },
    {
        "post_id":25626,
        "thread_id":25230,
        "title":"820-3115 power cycling and I don't know why.",
        "user_id":637,
        "username":"TCRScircuit",
        "post_date":"2017-09-19 21:00:30",
        "message":"OK.. I have some good and bad news and need help. Replaced the SMC. Fans spin and stable in S0. Go to reassemble it. Put ram in. 1 beep and that's it. Shut it off to switch the ram AND IT POWER CYCLES AGAIN. So something is happening when I put ram in it.. Slots look fine with no damage. What could this be? Other than a dead CPU im out of ideas. I presume that the new SMC is dead now."
    },
    {
        "post_id":25637,
        "thread_id":25230,
        "title":"820-3115 power cycling and I don't know why.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-09-20 04:21:32",
        "message":"It beeped so the CPU is fine. There is corrosion somewhere, maybe under PCH or corroded resistor\/trace in the damaged area. New SMC will be fine. You are sure it is the correct one for this board?"
    },
    {
        "post_id":25702,
        "thread_id":25230,
        "title":"820-3115 power cycling and I don't know why.",
        "user_id":637,
        "username":"TCRScircuit",
        "post_date":"2017-09-20 09:06:51",
        "message":"Yes this is the correct SMC for the board. Not seeing anything as far as a damaged resistor or trace. I am going to go through and check all the SPI term resistors as liquid was in that area. I also took the edge bonding off the PCH and I am going to USC it again."
    },
    {
        "post_id":25724,
        "thread_id":25230,
        "title":"820-3115 power cycling and I don't know why.",
        "user_id":637,
        "username":"TCRScircuit",
        "post_date":"2017-09-20 18:13:43",
        "message":"Well customers deadline was today (Local shop). I ultrasonic'd it again but this time i took the edge bonding off the PCH. Looked really really good for a corroded trace or resistor. Nothing. Board looks perfect. Gave it back and am kinda glad to have this one out of my shop. Thanks for your help Duke. You can mark this one as closed."
    }
]