[
    {
        "post_id":30778,
        "thread_id":30778,
        "title":"820-2879 kernel panic",
        "user_id":1190,
        "username":"Gmorb",
        "post_date":"2018-01-27 17:51:05",
        "message":"board powers on and will only boot using a disc version of snow leopard and will then freeze on bootup after installing update. i also noticed some kernel panics is this issue solvable without doing any gpu replacements?\n\ni saw a video louis made on how he fixed it but this was for the 15 inch. does the same issue apply to 13 inch models?"
    },
    {
        "post_id":30781,
        "thread_id":30778,
        "title":"820-2879 kernel panic",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-01-27 18:58:21",
        "message":"Must use PC8500 RAM. Other common one is the tape on the airport connector is missing and the conducive foam thing on the cable is shorting out the connector pins."
    },
    {
        "post_id":30920,
        "thread_id":30778,
        "title":"820-2879 kernel panic",
        "user_id":1190,
        "username":"Gmorb",
        "post_date":"2018-01-31 15:40:45",
        "message":"after installing 8500 ram it works no more freezing but now hard drive is not detected. will do further testing.\n\nupdate:fl4501 was knocked off hdd being detected now"
    },
    {
        "post_id":30924,
        "thread_id":30778,
        "title":"820-2879 kernel panic",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-01-31 16:34:11",
        "message":"The usual bad HDD cable."
    },
    {
        "post_id":31085,
        "thread_id":30778,
        "title":"820-2879 kernel panic",
        "user_id":1190,
        "username":"Gmorb",
        "post_date":"2018-02-04 10:26:52",
        "message":"Decided to ressurect the thread because i have another same model machine with a similar issue. So the macbook works i get into an os but it will turn into a white screen or shut off randomly even with charger connected. Other times it will run flawlessly i left it playing a video overnight and it was still running in the morning. Another thing to note is that i have installed a known good hard drive too all tests passed on it. Now it shows me theres an update but it wont install it. It goes straight to a black screen. After doing multiple pram nvram resets i was able to get it going and is installing as i type this. Now i remember duke telling me having 8500s ram will fix kernel panics and random shut downs which helped me on the other mac. This one however i have tried different sets of 8500s ram and its not stable. Another thing i noticed is the magsafe green light flickers.\n\nI just noticed while having both ram slots full moving it causes the issues. Maybe its bad ram slots?\n\ncould the machine not be recieving enough power?\ndc in connector bad?\n\nany suggestions appreciated."
    },
    {
        "post_id":31086,
        "thread_id":30778,
        "title":"820-2879 kernel panic",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-02-04 11:03:38",
        "message":"Check the tape on the airport connector if it is missing the conductive pad on the cable will short out the pins. Could also be 1 bad RAM slot of course."
    },
    {
        "post_id":31172,
        "thread_id":30778,
        "title":"820-2879 kernel panic",
        "user_id":1190,
        "username":"Gmorb",
        "post_date":"2018-02-06 23:01:29",
        "message":"The airport connector is fine even without it connected it freezes. Ive concluded both ram slots are faulty because they both have the same behavior. Sometimes the machine will detect ram and run good other times it wont detect ram or machine will randomly restart. Also any movement to the macbook will cause it to stop responding and go to black screen or other color.\n\nCan anything be done to fix the issue?"
    },
    {
        "post_id":31173,
        "thread_id":30778,
        "title":"820-2879 kernel panic",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-02-06 23:19:33",
        "message":"Probably cracked traces under the MCP or RAM slot. Also common is cracked trace(s) under the CPU right next to where the board has the screw. I would say this board is trash unless you want to pull the MCP\/CPU and inspect."
    }
]