[
    {
        "post_id":23413,
        "thread_id":23413,
        "title":"820-3115 no cpu vcore",
        "user_id":383,
        "username":"roy.ruan",
        "post_date":"2017-07-24 20:05:50",
        "message":"Hi guys,\nhaving a 820-3115 board, powers on, green light and all power rails are there except CPU VCORE.\n\nthe board got liquid spilled around the SMC area and U3890. U7400 area looks totally fine.\n\nso checked : \nCPU_PWRGD =1V ALL_SYS_PWRGD = 3 V\n\nu7400:  pin 46,29,19=5v  TONA, TONB= around 1v   pin47 VR_ON=3.3V\n\nall voltages should fullfill already, not sure why there is no CPU VCORE still\n\nwe encountered case like this before and replaced U7400 and mosfets without success, so this time I didn't touch them yet. highly believe they should fine since they look absolutely good clean condition under microscope.checked around the short to ground on ALL pins, don't find any suspicious ones\n\nM I missing something?any thoughts please?\n\nthank you!"
    },
    {
        "post_id":23414,
        "thread_id":23413,
        "title":"820-3115 no cpu vcore",
        "user_id":383,
        "username":"roy.ruan",
        "post_date":"2017-07-24 20:06:40",
        "message":"And I actually replaced a new SMC already, since that's the spilled area and I doubted bad SMC or crap under it. but still the same thing after replacement"
    },
    {
        "post_id":23430,
        "thread_id":23413,
        "title":"820-3115 no cpu vcore",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-07-25 03:06:45",
        "message":"Check actual resistance of R7402\/03, not on the resistor but from PPBUS to the pin on U7400 to rule out bad traces.\nIf those are fine it could be anything, the CPU talks to U7400 to set the voltage. Could be dead PCH\/CPU, corroded trace\/resistor.....anything."
    },
    {
        "post_id":23446,
        "thread_id":23413,
        "title":"820-3115 no cpu vcore",
        "user_id":383,
        "username":"roy.ruan",
        "post_date":"2017-07-25 08:33:15",
        "message":"Checked resistors as suggested, all fine.. damn, having a feeling it's the PCH got corroded."
    },
    {
        "post_id":23466,
        "thread_id":23413,
        "title":"820-3115 no cpu vcore",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-07-25 12:12:24",
        "message":"Give it some flux and heat. Clock chip may also be suspect"
    },
    {
        "post_id":23529,
        "thread_id":23413,
        "title":"820-3115 no cpu vcore",
        "user_id":383,
        "username":"roy.ruan",
        "post_date":"2017-07-26 20:19:22",
        "message":"clock chip would cause the CPU vcore problem too?I thought the board powers on already and that would mean it's fine.\nI heated the PCH with flux...no luck , probably will try replacing the PCH and take it off and see how under it looks like"
    }
]