{"post_id":85475,"thread_id":62250,"title":"820-01958-A Liquid Damage","user_id":34273,"username":"Alex Thayer","post_date":"2022-01-24 01:15:19","message":"I've got an 820-01958-A with liquid damage around Q7065 and other parts of the board, but not under the cpu heatsink, that after addressing visibly damaged regions requests 20V and consumes about 70mA, but makes an audible clicking noise and does not power on. All major power rails are present, expect for the cpu core, which is shorted with a 0.001 diode drop to ground. I pulled L4210, 20, and 30 and observed that the CPU side is still severely shorted, while the supply is perfectly functional (and stopped clicking), and the device consumes 500mA with the coils removed. I tried injecting power into vcore, but it pulls 6A at 0.6V and maxes out my supply without anything getting warm. Is this a definitive shorted cpu, or is there anything else I should check before wrapping it up?"}
{"post_id":85477,"thread_id":62250,"title":"820-01958-A Liquid Damage","user_id":682,"username":"2informaticos","post_date":"2022-01-24 03:01:30","message":"For very low resistance, switch from diode mode to ohm scale.\nCPU core has low resistance to ground normally; its value depends by model.\nI don't have another board to compare now.\nYou should get at least 1 ohm, I suppose."}
{"post_id":85494,"thread_id":62250,"title":"820-01958-A Liquid Damage","user_id":34273,"username":"Alex Thayer","post_date":"2022-01-24 09:16:46","message":"CPU Core reads 0.0Ohms on the CPU side of the coils, and O.L. on the supply side (with the coils removed).\nSeeing as I don't see a capacitor or anything else heating up, is there anything else I should look at before concluding that the CPU is the source of the short? Is it worth getting a 20A supply just to confirm that it gets hot, or probably a waste of effort?"}
{"post_id":85495,"thread_id":62250,"title":"820-01958-A Liquid Damage","user_id":682,"username":"2informaticos","post_date":"2022-01-24 10:29:26","message":"Not worth to continue; dead CPU..."}
