{"post_id":61979,"thread_id":59618,"title":"00281 with liquid","user_id":1423,"username":"captainmac","post_date":"2020-07-07 07:36:17","message":"So I haven't applied power to this one yet, because i measured a short on ppbus. Turns out there was liquid under the mosfets for the 3 phases of CPU. So I removed those and the short disappeared. After checking resistance to ground on vcore, and removing all three CPU coils, i found that there is a 0.49 Ohms short to ground at pins 2 of all three coils.. \nthis is probably a fucked CPU? Or is there anything left to try..\n\nJust to make sure i'm not missing anything.\nData on this board is very important to the customer, so thats why i posted."}
{"post_id":62013,"thread_id":59618,"title":"00281 with liquid","user_id":682,"username":"2informaticos","post_date":"2020-07-07 17:25:45","message":"Less than 1 ohm looks bad.\nCompare with known good board, for better reference.\n\nLifeboat connector allows you to save the data using external data recovery tool..."}
{"post_id":62027,"thread_id":59618,"title":"00281 with liquid","user_id":1423,"username":"captainmac","post_date":"2020-07-08 02:39:45","message":"Yeah the other board i have in has a 1,8 ohms resistance to ground there.. o dont have the data migration tool unfortunately. do you happen to know what is required to work on the board for the tool to do its job?"}
{"post_id":62181,"thread_id":59618,"title":"00281 with liquid","user_id":1423,"username":"captainmac","post_date":"2020-07-10 03:00:40","message":"I ordered a data migration tool as i have a couple of boards in that might need them... will update when i have it."}
{"post_id":62187,"thread_id":59618,"title":"00281 with liquid","user_id":682,"username":"2informaticos","post_date":"2020-07-10 03:11:17","message":"Didn't get one to play.\nSome videos should be available on Internet..."}
{"post_id":62188,"thread_id":59618,"title":"00281 with liquid","user_id":1423,"username":"captainmac","post_date":"2020-07-10 04:02:46","message":"OK, i dont know what happened, but i ordered a tool on wednesday and i got it in this morning, two days later (from the US to Europe).. I guess FedEx has some luck as well sometimes..\n\nAnyway, without the CPU mosfets and coils on the board (because i desoldered them earlier) the drive is recognized with the datamigration tool. this thing is awesome!\nGonna charge the customer at least the amount i paid for the fucking apple device, and all's good!"}
