{"post_id":51445,"thread_id":51445,"title":"820-00923 not turning on","user_id":338,"username":"arnonabuurs","post_date":"2019-08-15 01:46:15","message":"Hello, I have a touchbar 13 inch that came in dead. Inspected the board with microscope in details, nothing to see no liquid damage or bad IC, board looks as new. I have 1.06v on PPVCC_S0_CPU that drops to 0.76v after some time, and after a while boards turn off. Mouse has activity. Missing PPVCCIO_S0_CPU and PPVCCEDRAM_S0_CPU. Anything I can check or RIP?\n\nEdit: all other voltages present upto 0.6v"}
{"post_id":51446,"thread_id":51445,"title":"820-00923 not turning on","user_id":338,"username":"arnonabuurs","post_date":"2019-08-15 01:54:55","message":"I saw a tiny solderball pop out under R7270 and R7410, if that can be a hint?\n\nEdit: another solder ball popping up from underneath U7270"}
{"post_id":51449,"thread_id":51445,"title":"820-00923 not turning on","user_id":682,"username":"2informaticos","post_date":"2019-08-15 04:21:18","message":"Machine doesn't turn on, but USB mouse has activity???\nYou meant turns on (as you get more voltages, not only S5), but doesn't work properly.\nShould be good if you check USB activity with USB OSX pendrive; flashing Link LED is the best confirmation.\n\nOther people reported to me such kind of lost balls, also on the bery clean boards, without signs of previous repair attempted.\n\nCompare diode mode to ground on L7960 with another board.\nPPVCCIO_S0_CPU is controlled by U7800 (PMIC).\nDo you get PVCCIO_EN?"}
{"post_id":51464,"thread_id":51445,"title":"820-00923 not turning on","user_id":338,"username":"arnonabuurs","post_date":"2019-08-16 01:57:51","message":"The mouse LED turned on, but actually not flashing. L7960 seems shorted, 0.059v. I only have a donorboard without CPU that reads 0.469v nothing else to compare with at hand :(. I have 3.3v on PVCCIO_EN"}
{"post_id":51465,"thread_id":51445,"title":"820-00923 not turning on","user_id":682,"username":"2informaticos","post_date":"2019-08-16 05:48:44","message":"That reading w\/o CPU is useless.\n060 doesn't seem to be short, as that is common power rail for PCH and CPU.\nCheck R7961-64 and C7963.\nYou can also change U7960.\nIf still the same, possibly bad U7800; reflow it at least."}
