{"post_id":98291,"thread_id":63785,"title":"A2337\/820-02016 No backlight","user_id":33852,"username":"DDVL","post_date":"2023-04-11 02:18:22","message":"[CENTER][TABLE]\n[TR]\n[TD][\/TD]\n[\/TR]\n[TR]\n[TD]Hello amazing geniuses, boy do i have an exciting machine with me that needs knowledge I don't posses.\n\nAlright so machine was liquid damaged top case side. The board only seemed to have liquid on the backlight decoupling caps. So shorted to ground. So I removed the caps to find a crater. Still had a short to ground on ppvout_lcdbcklt, so I injected voltage and internal short near cp601 and cp604. Then proceeded to dig the short out, lots of grinding and cutting later the short is gone. Yay! However, this was shorted lived as still no backlight. Now the confusing stuff.\n\nI have backlight output essentially 51 v on ppvout_lcdbcklt which to me seems like the lcd panel isn't being told to accept the backlight. The screen in question is fine, tested with another board.\n\nAlso don’t have keyboard backlight if that helps.\n\nI have replaced up800 no change. one thing to note i only get about 19mv on up800 pin 4, while comparing with another machine it gets 0.8v. also the i2c data lines are 5.12v\n\nLet’s solve this mystery together.\n\nI would have loved to show pictures but my old microscope gave out and the sd card failed with it. I will do my best to provide pictures going forward.[\/TD]\n[\/TR]\n[TR]\n[TD][\/TD]\n[\/TR]\n[\/TABLE][\/CENTER]"}
{"post_id":98294,"thread_id":63785,"title":"A2337\/820-02016 No backlight","user_id":682,"username":"2informaticos","post_date":"2023-04-11 03:19:12","message":"First of all, welcome to the forum.\n\nCheck continuity from K\/DP800 to pin 43\/JP600.\nPin 4\/UP800 voltage is not relevant; its voltage depends by the PWM signal achieved.\nThe actual duty cycle is very low (no load) and also DC voltage measured by voltmeter.\n\nBe sure the video cable between MLB and T-CON is good; try known good one, if possible.\n\nYou've mentioned missing KB backlight.\nIt may be caused by non working ALS; is the camera working?\nCheck LP670 and UP700 output voltages."}
{"post_id":98295,"thread_id":63785,"title":"A2337\/820-02016 No backlight","user_id":33852,"username":"DDVL","post_date":"2023-04-11 03:45:26","message":"Thank you for the warm welcome. \nRegarding k\/dp800 i used 1\/cp873 to check continuity. I assumed it would be ok as its the same line when i last checked. \nI am about 90% the t-con is good but will check with another one later. \nI also thought ALS might be an issue so i had checked lp670 and have 5 volts on both sides. \nUP 700 seems good as well. \n\nRegarding the camera not working i am unsure however when i power the screen with a different board it has backlight. Also I tried a different screen to check but no change. \n\nWhat's next? \nalso lid open voltage is 1.8"}
{"post_id":98306,"thread_id":63785,"title":"A2337\/820-02016 No backlight","user_id":682,"username":"2informaticos","post_date":"2023-04-11 10:38:41","message":"Camera and ALS are powered from the same line.\nI asked about camera, in case of missing power.\nJust check if ALS works properly.\nALS problems may be caused by MLB bad circuitry; not only by LCD assembly."}
{"post_id":98307,"thread_id":63785,"title":"A2337\/820-02016 No backlight","user_id":33852,"username":"DDVL","post_date":"2023-04-11 11:30:50","message":"How would you like me to test that? When i use the other motherboard the screen does light up. I did put the board in a different assembly but same result. I also believe als on motherboard side is at fault but have no idea what else to check. I did change the lcd cable with a known good one but the result was the same.\nI was also able to recover a picture of the damage.\nBut it seems the image is too large to add."}
{"post_id":98309,"thread_id":63785,"title":"A2337\/820-02016 No backlight","user_id":682,"username":"2informaticos","post_date":"2023-04-11 14:10:32","message":"Use external monitor, but keep internal LCD connected.\nKeyboard backlight adjust is disabled?\nShould test that keyboard with good board also (if possible).\n\nKeyboard backlight works when you connect the LCD assembly to other chassis?\n\nUpload the picture somewhere else and post only the link here.\nAre you sure didn't destroy other traces when you eliminated the short from the board?\nLost communication between JP600 and UP800 (I2C bus) can cause this problem."}
{"post_id":98310,"thread_id":63785,"title":"A2337\/820-02016 No backlight","user_id":33852,"username":"DDVL","post_date":"2023-04-11 14:59:21","message":"Ok so i haven't tried connecting to an external monitor just yet. I will do that and get back to you regarding it. \n\nI don't think i destroyed any data lines. As the short was on the decoupling capacitors. So here is the link to the picture\n\n[URL unfurl=\"true\"]https:\/\/drive.google.com\/file\/d\/1EwItWN5M7eInloR1sLkqZSnEtVg7WWzx\/view?usp=drivesdk[\/URL]"}
{"post_id":98311,"thread_id":63785,"title":"A2337\/820-02016 No backlight","user_id":33852,"username":"DDVL","post_date":"2023-04-11 15:07:26","message":"I ended up having to carve out the area there untill all the carbon was gone."}
{"post_id":98313,"thread_id":63785,"title":"A2337\/820-02016 No backlight","user_id":682,"username":"2informaticos","post_date":"2023-04-11 17:00:33","message":"I recommend you to confirm continuity from DP800 to JP600.\nYou've carved the board on the backlight output.\nAre you sure the trace is still good all the way?"}
{"post_id":98315,"thread_id":63785,"title":"A2337\/820-02016 No backlight","user_id":33852,"username":"DDVL","post_date":"2023-04-11 17:36:02","message":"Pin 43 of jp600 has continuity to cp873 which is backlight output with 51v to it."}
{"post_id":98317,"thread_id":63785,"title":"A2337\/820-02016 No backlight","user_id":682,"username":"2informaticos","post_date":"2023-04-11 18:27:42","message":"That's good.\nYou should check continuity with corresponding point on the T-CON; to discard connector problem.\n\nAlso check continuity between JP600 and RP850\/51.\nBe sure all RP850-53 are good, as traces too.\nDo the same for JP600 and UD050."}
{"post_id":98318,"thread_id":63785,"title":"A2337\/820-02016 No backlight","user_id":33852,"username":"DDVL","post_date":"2023-04-11 19:59:25","message":"Ok so ud050 pin 5 and jp600 pin 20 no continuity. \nDiode mode with red to grouund -\nRd053-2 --> 0.079\nRd053-1 --> 0.539\nRd051-2 --> 0.005\nRd051-1 -->0.281\n\nResistances - \nRd053 - 1.78k\nRd051 - 1.39k\n\nNormally i would take of ud050 check diode mode and see what happens and then if readings normal replace it. What do you suggest to do?"}
{"post_id":98321,"thread_id":63785,"title":"A2337\/820-02016 No backlight","user_id":682,"username":"2informaticos","post_date":"2023-04-12 04:16:05","message":"You should fix the trace between JP600 and UD050.\n\n\"Rd051-2 --> 0.005\"\nThat may be a big problem.\nIf UD050 is not causing such a low value, then M1 is damaged.\nI hope you've wanted to say RD052 instead...\n\n\"Rd053-2 --> 0.079\"\nThis looks also low.\nIf get that value without LCD connected, then UD050 is probably bad.\nCan you compare with good board?"}
{"post_id":98338,"thread_id":63785,"title":"A2337\/820-02016 No backlight","user_id":33852,"username":"DDVL","post_date":"2023-04-12 19:48:18","message":"Well i guess this board is done. \nRemoved ud050 \nRd053 -2 --> 1.7v without ud050\nRd053-2 --> 0.6 on a good board\n\nThe bad rd051-2 --> 0.005 even after removing ud050\nRd051-2 --> 0.369 on a good board.\n\nIs it safe to assume the board is fucked? \nI shouldn't bother with attempting to fix any traces on jp600?"}
{"post_id":98339,"thread_id":63785,"title":"A2337\/820-02016 No backlight","user_id":682,"username":"2informaticos","post_date":"2023-04-12 20:20:36","message":"The M1 can't control backlight anymore.\nYou can't bypass anything on video connector.\n\nBacklight is adjusted through I2C bus by M1.\nUD050 is a level shifter between M1 (1.25V side) and T-CON (3.3V side).\n\nUse quality flux and heat M1 in case of accumulated crap underneath.\nLook at boardview and apply heat especially on the area where this bus connects to M1."}
{"post_id":98340,"thread_id":63785,"title":"A2337\/820-02016 No backlight","user_id":33852,"username":"DDVL","post_date":"2023-04-12 21:34:26","message":"So essentially reflow the m1 ? I think i lack the tools for such a task. My hot air station is old and only goes up to 450 and take 1-2 mins to do it."}
{"post_id":98344,"thread_id":63785,"title":"A2337\/820-02016 No backlight","user_id":682,"username":"2informaticos","post_date":"2023-04-13 02:52:22","message":"You don't need to melt the balls.\nIs supposed to burn eventually accumulated crap only."}
{"post_id":98347,"thread_id":63785,"title":"A2337\/820-02016 No backlight","user_id":33852,"username":"DDVL","post_date":"2023-04-13 04:17:45","message":"Do i remove the silicon that holds the m1 in place? So essentially just heat it up to 450 mainly in the area that affects the backlight or the entire m1 chip?\n\nIf that potentially works i gotta run jumpers for the jp600 connector right?\n\nI don't know if you can tell but i am actually fairly new to fixing motherboards. The biggest bga i ever touched was a cd chip. Also i don't know what temp flux would boil at or remove crap from soder joints. So this information would be helpful."}
{"post_id":98348,"thread_id":63785,"title":"A2337\/820-02016 No backlight","user_id":682,"username":"2informaticos","post_date":"2023-04-13 05:20:10","message":"If M1 is completely surrounded with glue, there is low chance to have any crap underneath.\nI gave you this idea as last resort.\n150-200 degrees (on MLB) for 15-20s should be good enough.\nThe real settings on the hot air station depends by model, distance to MLB.\n\nIf you aare not sure what to do, may be better to leave it as is; if still can be used with external monitor.\nRecover data before any try, if needed."}
