[
    {
        "post_id":64672,
        "thread_id":59962,
        "title":"820-01700 wine damage - fan spin no boot",
        "user_id":14193,
        "username":"daniel_andrei1996",
        "post_date":"2020-09-04 19:44:12",
        "message":"Got my first Macbook Pro 16\" to fix, customer spilled wine on it.\nDamage in a few areas, mainly:\nJ4900 burned, I removed it for now to clean the board. some corrosion on small components nearby\nSlight corrosion on C9080, removed it too\nSome liquid near U7650 but no visible corrosion\nSome liquid near U7230 which is bad news, I imagine\n\nWith the battery disconnected and 96W USB-C charger the computer powers up and draws 1.9-2A at 20V. The fans spin and the CPU gets warm, but there's no picture or USB activity. Also, it seems that U1200 gets unbearably warm after 10-20 seconds, but not sure if that's normal for this model. Sometimes the laptop will make a sound when plugging in the charger, but nothing else.\n\nI have tried the DFU restore with Apple Configurator and it completes with no error (or any message, for that matter) but the laptop still won't boot.\n\nAny guidance on what I can check would be a huge help. Sorry for the plsbro question but I'm stumped on this one"
    },
    {
        "post_id":64673,
        "thread_id":59962,
        "title":"820-01700 wine damage - fan spin no boot",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-09-05 01:14:37",
        "message":"Do you note any changes on VCORE, in the first 10-20s?\nCan you access it in Target Disk mode?"
    },
    {
        "post_id":64697,
        "thread_id":59962,
        "title":"820-01700 wine damage - fan spin no boot",
        "user_id":14193,
        "username":"daniel_andrei1996",
        "post_date":"2020-09-05 12:01:39",
        "message":"Hi, thank you so much for helping.\n\nNo target disk mode, sadly. Tried powering up while pressing T but nothing shows up on screen and plugging it into other machine doesn't detect anything. Wish it did so I could get the customer's data back.\n\nBy CPU_Vcore I assume you mean PPVCC_S0_CPU, i think that's the main CPU rail as per schematic.\nThe line starts at 0V as I plug in the charger. About 20s after I plug the charger in the fans start and I measure 0.9961V. After another 20s it drops a bit to 0.9951V, then after 20s again it jumps up to 1.0067V and stays like that until I unplug the charger as the fans ramp up to max speed. All the changes are sudden jumps and other than that the voltage is rock solid, no pulses or changes that I can see on my multimeter."
    },
    {
        "post_id":64698,
        "thread_id":59962,
        "title":"820-01700 wine damage - fan spin no boot",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-09-05 12:11:50",
        "message":"CPU doesn't seem to work.\nBTW which schematic are you using?"
    },
    {
        "post_id":64701,
        "thread_id":59962,
        "title":"820-01700 wine damage - fan spin no boot",
        "user_id":14193,
        "username":"daniel_andrei1996",
        "post_date":"2020-09-05 12:22:16",
        "message":"I'm using schematic and boardview from badcaps, posted by piernov, p=978378. Hopefully that's enough to find it without me breaking any forum rules. The boardview is a bit weird looking but so far seems accurate"
    },
    {
        "post_id":64703,
        "thread_id":59962,
        "title":"820-01700 wine damage - fan spin no boot",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-09-05 12:24:57",
        "message":"I don't have badcaps account.\nGoogle Drive used normally here to pass schematics and BIOSes..."
    },
    {
        "post_id":64704,
        "thread_id":59962,
        "title":"820-01700 wine damage - fan spin no boot",
        "user_id":14193,
        "username":"daniel_andrei1996",
        "post_date":"2020-09-05 12:39:18",
        "message":"Ah, I see. Badcaps is my main source of free schematics. Anyway, here's a random google drive link : [URL]https:\/\/drive.google.com\/folderview?id=1-CjI9RpA4NR9c7jADJYV9OPB4MucWy90[\/URL]"
    },
    {
        "post_id":64709,
        "thread_id":59962,
        "title":"820-01700 wine damage - fan spin no boot",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-09-05 13:43:37",
        "message":"Any option to compare VCORE reaction with similar board?\n\nMersi pt schema!"
    },
    {
        "post_id":64712,
        "thread_id":59962,
        "title":"820-01700 wine damage - fan spin no boot",
        "user_id":14193,
        "username":"daniel_andrei1996",
        "post_date":"2020-09-05 14:48:35",
        "message":"Sadly I don't have any other T2 machines or similar to compare. Just to check are there any signals near the areas I saw liquid in that could prevent the machine from booting properly? Or is the PCH likely dead since U1200 (pch power if I read schematic right) is getting burn-your-finger hot.\n\nCu placere, desigur! M-ai ajutat deja de cateva ori, dar nu stiam ca vorbesti romana."
    },
    {
        "post_id":64713,
        "thread_id":59962,
        "title":"820-01700 wine damage - fan spin no boot",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-09-05 15:20:01",
        "message":"U1200 is the PCH.\nI do not exactly know which should be acceptable temp, but probably not such as burning fingers..."
    },
    {
        "post_id":64715,
        "thread_id":59962,
        "title":"820-01700 wine damage - fan spin no boot",
        "user_id":14193,
        "username":"daniel_andrei1996",
        "post_date":"2020-09-05 15:55:27",
        "message":"oh, of course, my mistake. not used to seeing a dedicated pch anymore. I really wish I had a working machine to compare with, would make things much much easier. it gets hot enough that holding my finger on it for 10 seconds causes pain. it's not quite as bad a a bare cpu die or a direct short, but definitely hot. Sadly I don't have a thermal cam to measure temps. PP1V05_PRIM reads 1.036v while PP1V8_S5 is bang on 1.800V and PP3V3_S5 is 3.33V, which I think is all the main PCH power supplies. Resistance to ground on PP1V05_PRIM is about 70 ohm after cooling down for a bit. If it's dead, is the PCH tied to the T2 chip or some other nonsense on these machines? Seems the chip is available on aliexpress etc."
    },
    {
        "post_id":64716,
        "thread_id":59962,
        "title":"820-01700 wine damage - fan spin no boot",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-09-05 16:52:52",
        "message":"If you change PCH, no way to clean ME region manually.\nYou should try DFU restore, hoping Apple will update ME correctly.\nMaybe entire BIOS content is replaced in the process...\n\nPCH is directly connected with T2.\nT2 integrates SMC and you can follow power on signals from T2\/SMC to PCH.\nPray that PCH didn't damage T2."
    },
    {
        "post_id":64718,
        "thread_id":59962,
        "title":"820-01700 wine damage - fan spin no boot",
        "user_id":14193,
        "username":"daniel_andrei1996",
        "post_date":"2020-09-05 17:50:23",
        "message":"like I said, laptop goes into DFU mode and I can flash the T2 (using revive option, still clinging on to hope of customer data). Laptop goes through the process and then powers up again, but still no image\/boot\/brain. Hopefully that means the T2 chip is working. It's getting late now, but I'll trace the power on signals from t2 to pch tomorrow and see what I find. thanks again"
    }
]