[
    {
        "post_id":34860,
        "thread_id":34860,
        "title":"[SOLVED]820-3787 random row of keys not working again",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2018-05-16 19:04:37",
        "message":"[URL=\"https:\/\/www.rossmanngroup.com\/boards\/forum\/board-repair-troubleshooting\/34798-solved-820-3787-random-row-of-keys-not-working\"]https:\/\/www.rossmanngroup.com\/boards...ys-not-working[\/URL]\nThis previous thread was marked as solved after I replaced the kbd connector because I thought that solved the issue.\nWhen I put the machine back together and booted the OS again that same row stopped working then after about 10 seconds it started working again and after logging in I tested all the keys to see if they all worked but the whole top row of keys weren't working and would make that horn noise when I tried adjusting the brightness or volume.\n\nAfter turning it on and off a few times I see more keys will randomly stop working such as the 'delete', - , 8, k, and other random keys.\nWhen I booted with the OS that I have on a USB stick the brightness keys worked but other random keys didn't work also.\n\nI followed some posts I saw on google about disabling mouse keys and slow keys but neither of them solved the issue.\n\nI'm not sure if this is a software or hardware issue.\n\nUpdate: I noticed the ground pin(32) on the connector was loose so I fixed it and soldered it correctly onto the board. Again I was able to login using the password which used the keys \"cvb\" but once I logged in and tested each key again that row of keys stopped working. The issue with the brightness keys is fixed. The reason they weren't working was because I wasn't holding fn key while pressing them."
    },
    {
        "post_id":34861,
        "thread_id":34860,
        "title":"[SOLVED]820-3787 random row of keys not working again",
        "user_id":36,
        "username":"aprendiz",
        "post_date":"2018-05-16 19:57:09",
        "message":"do a continuity test to U4801, maybe a via is corroded..."
    },
    {
        "post_id":34869,
        "thread_id":34860,
        "title":"[SOLVED]820-3787 random row of keys not working again",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-05-16 21:03:17",
        "message":"Crap soldering on the connector. If you solder these by hand and push down on the pins the connector will be ruined. Add solder to pads, reflow connector and then touch up the pins if needed without pushing them down.\n\nAlso do a diode mode check on all pins of course to rule out a bad trace."
    },
    {
        "post_id":35189,
        "thread_id":34860,
        "title":"[SOLVED]820-3787 random row of keys not working again",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2018-05-25 17:35:02",
        "message":"Forgot to say that after replacing the keyboard controller chip it is working fine now."
    }
]