[
    {
        "post_id":67670,
        "thread_id":60304,
        "title":"820-00923 19.63V Not Turning ON",
        "user_id":24760,
        "username":"2click",
        "post_date":"2020-11-08 20:44:14",
        "message":"Hi, I have this computer which was working fine after I replaced a blown component R7609, it worked fine for a few days (I left it on and working for around 4 days), but when I left it off for 2 days and it doesn´t turn on again. When I connect the charger to a USB C with the USB C tester it goes directly to 19.63v, las time I was checking around U7650 and PM_SLP_S5_L was low at .280mv. I replaced U7650 and it turned on again, but left it off for a day and now it is the same 19.63v and not turning on... need help on this one to make some sense out of it! I just don´t understand why when I leave it off for a day it just dies. Thanks for the help!"
    },
    {
        "post_id":67678,
        "thread_id":60304,
        "title":"820-00923 19.63V Not Turning ON",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-11-09 01:05:26",
        "message":"Replace C7609 too.\nDiode mode at L7600?"
    },
    {
        "post_id":67715,
        "thread_id":60304,
        "title":"820-00923 19.63V Not Turning ON",
        "user_id":24760,
        "username":"2click",
        "post_date":"2020-11-09 10:37:48",
        "message":"Diode mode L7600 = .423\nI changed C7609 and now when I connect the charger, it starts at 5v and then jumps to 19.63v but still no sign of it trying to turn on as I get 0 Amp of consumption.\n** I used a 0.1 uf 16v, instead of the 0.1uf 25v, because I couldn´t find any exact match on the donor boards I have. Is that ok? **"
    },
    {
        "post_id":67716,
        "thread_id":60304,
        "title":"820-00923 19.63V Not Turning ON",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-11-09 10:54:09",
        "message":"16V is good enough; the boost voltage is 10V aprox.\n\nDoes the board try to start pressing power button?\nWhich voltages do you get on the board?\nCheck power on sequence."
    },
    {
        "post_id":67723,
        "thread_id":60304,
        "title":"820-00923 19.63V Not Turning ON",
        "user_id":24760,
        "username":"2click",
        "post_date":"2020-11-09 14:03:52",
        "message":"Missing PP5V_S4, but the enable signal is not present... which comes from PM_SLP_S5_L which has a value of 0.183v"
    },
    {
        "post_id":67726,
        "thread_id":60304,
        "title":"820-00923 19.63V Not Turning ON",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-11-09 15:19:57",
        "message":"Dificil to help, if you do not reply...\n\nDo you get 3V3_S5 at least."
    },
    {
        "post_id":67911,
        "thread_id":60304,
        "title":"820-00923 19.63V Not Turning ON",
        "user_id":24760,
        "username":"2click",
        "post_date":"2020-11-14 08:37:40",
        "message":"Sorry, the thing is the computer is now working, I replaced C7609 and is turning on now, it worked fine for 2 days, I turned on today and it is doing a weird thing:\nwhen I connect the usb c charger, it goes directly to 19.6v, the amperage shows the following consumption aproximately: it starts around .500 A goes to a peak of 2.1A, then goes to 0. When consumption goes to 0 for a couple seconds I get .029 A consumption and the voltage comes down to 5v at .029 A, it makes the transition to 19.6v and around .600 A and shows the apple and starts, but when I try to get into the test user, it is slow as hell!! Any idea over this?\n\nThe voltage sequence that happens can happen 2 times before it starts, is that normal?\nRight now it seems to be stuck at the user loading bar with 19.34v and from .490 to .510 A"
    },
    {
        "post_id":67920,
        "thread_id":60304,
        "title":"820-00923 19.63V Not Turning ON",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-11-15 03:01:50",
        "message":"Did you try to boot in safe mode?\nAlso try booting USB macOS.\nNext step should be clean ME BIOS."
    },
    {
        "post_id":67921,
        "thread_id":60304,
        "title":"820-00923 19.63V Not Turning ON",
        "user_id":24760,
        "username":"2click",
        "post_date":"2020-11-15 07:37:20",
        "message":"This is driving me crazy!, I disconnected the battery to see if it had something to do it turned on fine, but a few minutes and it restarted and froze loading the user again. This morning I connected the usb c to one of the ports, it went from 5v to 19.4v but 0 A. I changed to another port and got 5v, transition to 19v and .700A and it turned on... wtf? I dont feel like returning it to the customer like this even tough that it came off. Any clues on what to check?\n\nI didn´t try safe mode, but today it loaded fine, nor the USB Macos boot.\n\nupdate: I put it to sleep by closing the lid and this morning, when I connected it to usb c, it was 19.6v and .029A, pressed the ON button and the fans whent to full speed inmediatly (consumption is still the same .029A and the battery is connected), it is turning on, but I don´t think is ready to get back to the owner, any help on this on what to check?\n\nI disconnected the battery, and connected the usb c and it is only getting 5v and 0A it is not making the transition to 19v"
    }
]