[
    {
        "post_id":79835,
        "thread_id":61677,
        "title":"820-3437 No POST, No Chime, No Video",
        "user_id":20634,
        "username":"StraightToThePoint",
        "post_date":"2021-09-04 21:11:39",
        "message":"820-3437, liquid damaged\n\nSymptoms are very strange. Board will start up, and take around 400-600 mah, then restart (normal), then take another 400-600 mah, and then go to around 700-800 and stay there.\n\nWe do have VCORE, and all other rails are present. No chime, No video (Externally or EDP), No post. When plugging in a USB HDD, the board will have USB light, and USB power, however after around 7-15 seconds, the USB light on the HDD will turn off, however the HDD itself wont! There is no blinking activity at all, due to the light turning off, and the HDD doesn't do its clicking or sound for searching through the HDD, just spin sound.\n\nIve recently discovered that on J3501 (Wifi connector) there is corrosion around pins 17-14. These pins are the USB BT pins and AP pins? What are AP pins if I may ask?\n\nIm going to remove the J3501 connector and see if any change will happen."
    },
    {
        "post_id":79836,
        "thread_id":61677,
        "title":"820-3437 No POST, No Chime, No Video",
        "user_id":20634,
        "username":"StraightToThePoint",
        "post_date":"2021-09-04 21:36:44",
        "message":"UPDATE: Let this be a bookmark for anybody that has an issue like this.\n\nThis was not a dead CPU\/PCH at ALL! Check Wifi card and USB pins before final diagnosis!\n\nBoard fully works now once J3501 was removed.\n\nEDIT: Could someone also give me an explanation on this as well? Thank you!"
    },
    {
        "post_id":79837,
        "thread_id":61677,
        "title":"820-3437 No POST, No Chime, No Video",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-09-05 02:32:36",
        "message":"AP stands from airport.\nYou should clean the connector and put it back, or use one from donor board.\n\nBoard is not fully working now.\nBluetooth is almost not used, but I doubt that a client accepts the machine without wireless connection."
    }
]