{"post_id":46913,"thread_id":46913,"title":"MacBook Pro Mid 2012 820-3115-B Throttled, slow, loud fans, heatsink problem","user_id":2508,"username":"No-Clean","post_date":"2019-03-01 22:49:34","message":"Hi all,\n\nFirst post here, Im a newbie starting up on board level repair so take it easy ;)\n\nASD fails with error code -- 255 (Check that CPU heatsink is properly attached, using product spec theta dh + 75 percent guard band.\n\nThe heatsink had some green corrosion that I was able to clean, it was not bent and no physical damage.\n\nI cleaned the CPU and put new paste that I have here but Im sure it is not the same as what that theta dh = 75. \n\nI also replaced C5702 as it had no voltage and looked pretty bad, but so far same problem.\n\nI am thinking about ordering a new heatsink, but my gut tells me that is not the problem, however Im hungry so I cannot trust my gut right now :=)\n\nThis started to happen after update."}
{"post_id":46916,"thread_id":46913,"title":"MacBook Pro Mid 2012 820-3115-B Throttled, slow, loud fans, heatsink problem","user_id":682,"username":"2informaticos","post_date":"2019-03-02 04:01:04","message":"\"This started to happen after update.\".\nDisconnect internal HDD and test it with USB OSX.\nAlso access boot menu and check if fan still high.\nIn ASD test fan runs high too?\n\nTry known good trackpad board\/flex too."}
{"post_id":46921,"thread_id":46913,"title":"MacBook Pro Mid 2012 820-3115-B Throttled, slow, loud fans, heatsink problem","user_id":2508,"username":"No-Clean","post_date":"2019-03-02 08:58:48","message":"Thanks for the tips amigo:\n\nDisconnect internal HDD and test it with USB OSX. Done, problem still there\nAlso access boot menu and check if fan still high. Done, problem still there after a few seconds\nIn ASD test fan runs high too? Yes, the problem starts after a few seconds when the Mac starting up\n\nTry known good trackpad board\/flex too. Done, problem still there\n\nAll ASD test pass fine, just the heatsink\/paste one fails"}
{"post_id":46923,"thread_id":46913,"title":"MacBook Pro Mid 2012 820-3115-B Throttled, slow, loud fans, heatsink problem","user_id":682,"username":"2informaticos","post_date":"2019-03-02 11:01:56","message":"Did you get one error only?\nSet On Error option to Continue, before start test on ASD.\nAlso unmark Memory and HDD tests..."}
{"post_id":46945,"thread_id":46913,"title":"MacBook Pro Mid 2012 820-3115-B Throttled, slow, loud fans, heatsink problem","user_id":2508,"username":"No-Clean","post_date":"2019-03-02 20:26:31","message":"I tried again the ASD test, the only error is the one mentioned before: error code -- 255 (Check that CPU heatsink is properly attached, using product spec theta dh + 75 percent guard band."}
{"post_id":46950,"thread_id":46913,"title":"MacBook Pro Mid 2012 820-3115-B Throttled, slow, loud fans, heatsink problem","user_id":682,"username":"2informaticos","post_date":"2019-03-03 04:48:17","message":"I was expecting to get full description of test failing from the beginning.\nThermal Interface: - Processor: Processor0: TIM Test 75 percent...etc.\n\nYou should have another issue there, maybe not temperature problem.\nThis error can appear in good working machines too.\nFirst try new BIOS, wirh clean ME for sure."}
{"post_id":46957,"thread_id":46913,"title":"MacBook Pro Mid 2012 820-3115-B Throttled, slow, loud fans, heatsink problem","user_id":2508,"username":"No-Clean","post_date":"2019-03-03 12:50:54","message":"The BIOS was not it, however thanks to you telling me: \"This error can appear in good working machines too.\" I started to do some more research and found that U7400 had a few corroded pins, and some of those pins interact with the CPU, I think pin # 7 and 2 have something to do with the thermal sensor, those were rusty, I removed the IC, cleaned it well and cleaned the board pads as well, re solder it and walla! problem fixed!\n\nThe one thing I wish I knew was how to test the board for this things, I guess that will come later as I am just a newbie..."}
