{"post_id":52381,"thread_id":52381,"title":"820-3332 No backlight","user_id":1464,"username":"Bouba148","post_date":"2019-09-18 04:22:35","message":"No History, Came from another store, had L9000 was missing, soldered it back: NOK\nDisplays on external HDMI screen OK\nNVRAM Reset: NOK\nHad Flux around Q7080 and R7020 area\nNo sign of WD but some few Test Points near R2655 turned slightly brown like some screws holes contours......\n\nPPBUS_S0_LCDBKLT_FUSED:  12.56V\nLCD_BKLT_EN: 0V\n\nIG_BKLT_EN = LVDS_IG_BKL_ON: 0V\nIG_LCD_PWR_EN = LVDS_IG_PANEL_PWR: 3.353V\n\nU8900 is powered properly:\nPPVIN_S0_GFXIMVP: 12.56V\nPP5V_S0_GFXIMVP: 5V"}
{"post_id":52382,"thread_id":52381,"title":"820-3332 No backlight","user_id":682,"username":"2informaticos","post_date":"2019-09-18 04:49:37","message":"Do you get image on internal LCD?\n\nIf get external video, U8900 is good for sure.\n\n\"L9000 was missing, soldered it back\"\n5V for sure at pins 28-30 of J9000?\nAlso check LCD_HPD level."}
{"post_id":52384,"thread_id":52381,"title":"820-3332 No backlight","user_id":1464,"username":"Bouba148","post_date":"2019-09-18 06:12:46","message":"It's hard to tell if I have an image on the LCD screen as the apple Logo is not transparent on this model, so when I put my torch on the apple, I even can't see the light on the screen.\nHowever I 've put the torch on the screen directly and for me there's no image on the screen.\nI had No 5V at pins 28-30 of J9000.\n\nI don't know what happened but the backlight came back for no reason.......\n\nI've reassembled the machine did few tries, it's like when the machine is upside down it's working properly but not everytime when in normal position.....\n\nAlso I've turned off the machine normally from the OS, tried to turn it back ON, it displayed the red low battery logo ( which means backlight OK ) with the fans spinning few seconds.....and this with the battery fully charged at 100%.\nThis machine is acting weird:\nI've plugged the charger and turned ON properly with the backlight OK and the battery back at 100%....then the backlight went off....\nthis machine has really a strange behaviour....."}
{"post_id":52385,"thread_id":52381,"title":"820-3332 No backlight","user_id":1464,"username":"Bouba148","post_date":"2019-09-18 06:39:48","message":"After different test I think that it's not a backlight issue but a CPU issue as I've noticed that when the backlight turns OFF I'm loosing the Image also.\nI've noticed that sometimes, when I'm trying to turn OFF the machine from the OS, the Image and backlight turns OFF but the fans stay spining and S0 state is still present, I've to press the power button or disconnect the battery to turn OFF the machine....\nSo I'll focus more on the CPU and see if I can find something........"}
{"post_id":52386,"thread_id":52381,"title":"820-3332 No backlight","user_id":1464,"username":"Bouba148","post_date":"2019-09-18 07:15:49","message":"When this issue happens during the shutdown, I told you that S0 state was present, sorry but it's only present for CPU VCore, but I have no rail present for the GPU S0 states:\nAt those coils I have no power: L8360,L8310,L8930,L8960,L7550,L7560.\n\nI'm looking for the common point of all those rails......."}
{"post_id":52387,"thread_id":52381,"title":"820-3332 No backlight","user_id":1464,"username":"Bouba148","post_date":"2019-09-18 08:01:32","message":"I'm quit lost on this issue, and I don't really understand how the display\/backlight is managed by this architecture......\nI've noticed that even withh the display\/backlight working, I have NO power on those GPU  Coils\/Rails I've mensionned before......2Informaticos could you please explain me (us) how it works on those machines with U8900, U8000 U9100 please?\nWhich one is doing what in which order\/ sequence.....thank you"}
{"post_id":52393,"thread_id":52381,"title":"820-3332 No backlight","user_id":682,"username":"2informaticos","post_date":"2019-09-18 13:18:48","message":"\"I had No 5V at pins 28-30 of J9000.\"\nIn such case, no image possible; also no backlight, of course.\n\nBe sure to use original charger and check SM_LID signal.\n\n\"could you please explain me (us) how it works\"\nThe forum is most for repair assistance.\nLouis staff provide online training, as in person too.\nMany times I explain things on the forum, but training is better person-to-person..."}
