{"post_id":88242,"thread_id":62558,"title":"820-00928 No post","user_id":7922,"username":"tcampbell34","post_date":"2022-04-02 07:33:56","message":"Got a strange one here. Board is in excellent shape, with no signs of corrosion or damage anywhere. When you try and turn it on, you hear it chime very faintly, and then it just keeps chiming over and over again and never turns on. Nothing on the screen and cap lock does not react. CPU VCORE is stuck at 0.930v at this time, so it appears to not be fully booting. I read that the chime loop can be caused by a bad bios, so I flashed a known good bios with a clean ME to this board. Now when I try to turn it on with just the charger and no battery, it does not chime at all anymore and CPU VCORE is still stuck at 0.930v, but the backlight on the internal screen is on now, but there is no image. If I connect a USB drive to it, the light lights up and flashes, indicating CPU is working, but the keyboard does not work in this state. No reaction from the caps lock key. I then tried to start it SMC bypass mode and it turns on with normal fan spin, not high fan like it normally does in SMC bypass, but now I get a low battery symbol on the screen for a few seconds and then it turns off. CPU VCORE is correct at 0.680v when I do SMC bypass and get the low battery symbol. I can only get that low battery symbol when trying to do an SMC bypass. If I try and connect the charger and the battery, CPU vcore is stuck at 0.930v again and now screen is completely off, no backlight. Do you think its a SMC issue since it seems to try and start is SMC bypass?"}
{"post_id":88247,"thread_id":62558,"title":"820-00928 No post","user_id":682,"username":"2informaticos","post_date":"2022-04-02 12:24:42","message":"Check if AVREF_SMC is correct."}
{"post_id":88250,"thread_id":62558,"title":"820-00928 No post","user_id":7922,"username":"tcampbell34","post_date":"2022-04-02 13:04:59","message":"Yes it is correct at 3v"}
{"post_id":88256,"thread_id":62558,"title":"820-00928 No post","user_id":682,"username":"2informaticos","post_date":"2022-04-02 14:02:57","message":"Check SMC_DCIN\/PBUS_VSENSE and SMC_DCIN\/BMON_ISENSE levels.\n\nBe sure to use 85W original charger."}
{"post_id":88258,"thread_id":62558,"title":"820-00928 No post","user_id":7922,"username":"tcampbell34","post_date":"2022-04-02 16:01:49","message":"I am using an original apple 96W charger actually.\n\nPPBUS_S0_VSENSE - 12.56v\nSMC_DCIN_VSENSE - 0v\nSMC_DCIN_ISENSE - 176mv\nSMC_BMON_ISENSE - 5.9mv"}
{"post_id":88263,"thread_id":62558,"title":"820-00928 No post","user_id":682,"username":"2informaticos","post_date":"2022-04-02 19:00:56","message":"\"PPBUS_S0_VSENSE - 12.56v\"\nI didn't ask that.\n\nCheck mentioned sensors level when you start in SMC bypass."}
{"post_id":88266,"thread_id":62558,"title":"820-00928 No post","user_id":7922,"username":"tcampbell34","post_date":"2022-04-02 21:55:11","message":"Sorry wrong signal. SMC_PBUS_VSENSE is 2.1v both when I try and start normally or in SMC bypass.\n\nNormal boot (Charger only):\nSMC_PBUS_VSENSE - 2.1v\nSMC_DCIN_VSENSE - 0v\nSMC_DCIN_ISENSE - 176mv\nSMC_BMON_ISENSE - 5.9mv\n\nSMC Bypass:\nSMC_PBUS_VSENSE - 2.1v\nSMC_DCIN_VSENSE - 2.65v\nSMC_DCIN_ISENSE - 195mv\nSMC_BMON_ISENSE - 8.3mv"}
{"post_id":88271,"thread_id":62558,"title":"820-00928 No post","user_id":682,"username":"2informaticos","post_date":"2022-04-03 05:53:44","message":"Levels look normal.\nHowever, if only starts in SMC bypass, there should be a sensor issue.\nWhen turned on, check all I\/V sensors output from pages 50-53."}
{"post_id":88275,"thread_id":62558,"title":"820-00928 No post","user_id":7922,"username":"tcampbell34","post_date":"2022-04-03 11:24:59","message":"SMC_CPU_HI_ISENSE - 44mv\nSMC_CPU_IMON_ISENSE - 18mv\nSMC_DDR1V2_ISENSE - 22mv\nSMC_CPUDDR_ISENSE - 28mv\nSMC_CPUHI_COMP_ALERT_L - 0\nSMC_CPU_ISENSE - 6mv\nSMC_SSDLIM_ISENSE - 21mv\nSMC_CPUGT_IMON_ISENSE - 4mv\nSMC_CPUSA_VSENSE - 0.9v\nSMC_CPUSA_ISENSE - 17ma\nSMC_CPUGT_ISENSE - 20ma"}
{"post_id":88276,"thread_id":62558,"title":"820-00928 No post","user_id":682,"username":"2informaticos","post_date":"2022-04-03 12:52:51","message":"Not sure about SMC_CPUHI_COMP_ALERT_L, being marked as active low; compare with good board.\n\nAny chance to start in Diagnostic mode?"}
{"post_id":88326,"thread_id":62558,"title":"820-00928 No post","user_id":7922,"username":"tcampbell34","post_date":"2022-04-04 13:59:25","message":"All the parts for SMC_CPUHI_COMP_ALERT_L are no stuff on these boards so 0v seems normal. I checked another board and it also has 0v there. \n\nI cannot get this board to start at all. I tried another charger and did SMC bypass and now I do get high fan spin, so its definitely in SMC bypass, but has only backlight no image and CPU vcore is stuck at 0.9v. If I connect the battery and try to start it, CPU vcore gets stuck at 1.1v now instead of 0.9v and now the screen does not turn on at all."}
{"post_id":88335,"thread_id":62558,"title":"820-00928 No post","user_id":682,"username":"2informaticos","post_date":"2022-04-04 19:02:46","message":"If board only turns on in SMC bypass mode, there should be a SMC sensor issue."}
{"post_id":88348,"thread_id":62558,"title":"820-00928 No post","user_id":7922,"username":"tcampbell34","post_date":"2022-04-05 09:35:48","message":"Well it does not really turn on it SMC bypass mode either, only shows low battery. While testing, I noticed that it will only show me low battery symbol and 0.6v on vcore when trying to start in SMC bypass mode with the charger connected to the UB300\/400 side of the board. If I try the same on the other side, it turns on with high fan spin, faint backlight on the screen, but only 0.9v on vcore. I found that PP0V9_TBT_T_SVR was shorted to ground from UB000. I removed UB000 and have left it off the board for now. The short is gone, but still the same thing on this side, where it shows low battery when trying to start in SMC bypass. All other symptoms are the same also. The other weird thing on this board is PPVCCGT_S0_CPU is 0.7v all the time, even on boot. This is not normal, since this voltage only should be enabled under heavy graphic load. It seems like the board thinks its under heavy graphic load immediately on boot, so maybe that could point us in the right direction of what could be the issue?"}
{"post_id":88354,"thread_id":62558,"title":"820-00928 No post","user_id":682,"username":"2informaticos","post_date":"2022-04-05 11:51:29","message":"Missing UB000 may affect communication with PCH; it may think HDMI (through thunderbolt) monitor is connected."}
{"post_id":88360,"thread_id":62558,"title":"820-00928 No post","user_id":7922,"username":"tcampbell34","post_date":"2022-04-05 12:47:45","message":"I was getting 0.7v on PPVCCGT_S0_CPU even before removing UB000, but yea I am thinking something else is wrong on this board where it thinks HDMI is connected even when its not. Will try and see if I can find anything else wrong."}
{"post_id":88362,"thread_id":62558,"title":"820-00928 No post","user_id":682,"username":"2informaticos","post_date":"2022-04-05 13:22:24","message":"Mmmmhhh, this has dedicated GPU; connecting external monitor, should enable it.\nIf still get iGPU core voltage, may point to CPU problem..."}
