{"post_id":4075,"thread_id":4075,"title":"SPI resistors getting dragged down","user_id":145,"username":"Sykulski","post_date":"2016-06-28 18:27:18","message":"Board is 820-3476\n\nR6101 and R6103 resistors connected to PP3V3_SUS are getting dragged down somehow. I cannot figure out why. When they er mounted to the board they measure R6101: 0,8K instead of 3,3K and R6103: 1K instead of 100K. When I pull them readings are correct according to schematics. When I put them back (or mount new ones which measure fine until they are mounted) they read too low again.\n\nDiode mode reads 0,370 on PP3V3_SUS. A little too low voltage drop but cannot find the culprit. \n\nI injected 3V into PP3V3_SUS and C1204 getting hot. I removed it and nothing else gets hot. But still resistors near U6100 reads incorrectly.\n\nAny idea to what is going on and what's my next step?\n\nThanks"}
{"post_id":4079,"thread_id":4075,"title":"SPI resistors getting dragged down","user_id":2,"username":"dukefawks","post_date":"2016-06-28 20:25:06","message":"There is stuff in parallel with the resistors so they will never measure correct in circuit, they are fine. What does the board do right now?"}
{"post_id":4081,"thread_id":4075,"title":"SPI resistors getting dragged down","user_id":145,"username":"Sykulski","post_date":"2016-06-29 02:28:24","message":"It's not starting. It was trying to start at one point where it chimed but then rebooted. New chime. Reboot. This happened faster and faster so that the chime became half chime. Something like:\n\nChime.....\nChime..\nChim\nCh\nCh \n\nI stopped it and took out spi and read the data from it. Data looked corrupted. I flash new EFI on brand new chip and put it back on the board and now it is not even starting. Then I tried with a SPI from another working board. Still not starting. \n\nI measure around and see missing SYS_PWR_OK_R. Like this gate don't open because of missing signal from SMC. \n\nBut I suspected the SPI resistors because when I measure them in a working board the read correctly. And also the corrupted data in SPI rom lead me this way. \n\nAnd why do they measure correctly in circuit in the working board when you say they never will?\n\nThanks"}
{"post_id":4092,"thread_id":4075,"title":"SPI resistors getting dragged down","user_id":2,"username":"dukefawks","post_date":"2016-06-29 09:45:44","message":"Prbably some charge left in caps\/FETs, leave the board for a while and measure again.\nBut what was the original issue with this, seems like water damage to me.\nI hope you saved the original ROM!"}
{"post_id":4094,"thread_id":4075,"title":"SPI resistors getting dragged down","user_id":145,"username":"Sykulski","post_date":"2016-06-29 10:12:03","message":"Original issue was small water damage. R8112 was corroded and U8010 burned. Else every other part of the board was fine. I did not have PP3V3_S3 at that point but after ultrasonic cleaning and replacement of these two components power came up and it did the \"chime-thing\" described earlier.\n\nI still have original ROM (still have the chip) but it is corrupted as some info is missing , ie. no serial number, and contents look different when comparing to a ROM from working board."}
{"post_id":4096,"thread_id":4075,"title":"SPI resistors getting dragged down","user_id":2,"username":"dukefawks","post_date":"2016-06-29 10:21:26","message":"Is it turning on now and CPU Vcore present?"}
{"post_id":4098,"thread_id":4075,"title":"SPI resistors getting dragged down","user_id":145,"username":"Sykulski","post_date":"2016-06-29 10:55:00","message":"No it's not turning on. It only started this one time doing the chime boot loop but after I turned it off it did not starts again. \n\nCPU Vcore is present."}
{"post_id":4142,"thread_id":4075,"title":"SPI resistors getting dragged down","user_id":2,"username":"dukefawks","post_date":"2016-07-01 12:50:38","message":"Must be corrosion somewhere else still. Usually on these it is U1950 area or SMC area."}
{"post_id":4305,"thread_id":4075,"title":"SPI resistors getting dragged down","user_id":145,"username":"Sykulski","post_date":"2016-07-06 17:59:00","message":"Probably SMC. Board wants to have it's own life. Sometimes starting to spin the fan when I measure around in different places. No consistency. And when I get fan spin the fan slowly goes high RPM (like it should because i have it out from casing with nothing connected). Then I can take magsafe out and in a couple of times sometimes fan spins sometimes not. After it spinswhen applying magsafe for 2 or 3 times I connect a screen to see whats going on but then it decides to stop spinning and back to initial problem where i am missing SYS_PWROK_R and SMC_DELAYED_PWRGD at U1950.\n\nU1950 area looks fine. Anyway I switched U1950 on your recommendation but still the same. I tried to heat SMC to 150 C with some flux under but still the same."}
{"post_id":7636,"thread_id":4075,"title":"SPI resistors getting dragged down","user_id":137,"username":"john","post_date":"2016-10-04 13:12:37","message":"Sykulski did you fix it?\nI have the same problem...the laptop was working fine i left the office after 5 minutes I come back the screen was black I try to turn it on and I get the chime and then 75% of the chime and then 50% and so on. What was the problem?"}
{"post_id":7637,"thread_id":4075,"title":"SPI resistors getting dragged down","user_id":145,"username":"Sykulski","post_date":"2016-10-04 14:18:56","message":"No I didn't fix it yet. I put it in the to-do pile and wanted to get back to this with fresh eyes some day. But it is still lying there :-)\n\nI suspect mine has several issues because of the inconsistency in power and the weird chime-thing. The SPI was for sure corrupted because when I read the contents of the chip they were corrupted. But the power thing related to sometimes starting sometimes not I don't have a clue. I don't know which of these issues results in the chime-thing though. \n\nI will update if I ever get back to this one. I'm sorry for the lack of help here :-("}
