{"post_id":18642,"thread_id":18642,"title":"[SOLVED]Aus tablet transformer thingie charging only when off","user_id":700,"username":"Nick","post_date":"2017-04-19 06:39:21","message":"hello guys, i got this tablet\/laptop thingie that was completely dead, there was a short on the LCD cable, there were no spare ones so i managed to fix that thing plus new backlight fuse. i also replaced the bios battery that was giving me troubles. after a night charging it came back to life, problem is that it doesn't show it charging when on, pc recognizes it trough usb but no charging. (my usb amp meter says 0.002 Amp) when off it starts charging (0,873 amp ) albeit very slowly. tried a new cable, tried a new bigger charger, but nothing. could it be a software problem? I don't have a spare battery to use for testing and i would be pissed to buy one for nothing, on apple shit i don't care as sooner or later i use them, but on this thing i doubt i will ever see another one. ideas? Danke"}
{"post_id":18679,"thread_id":18642,"title":"[SOLVED]Aus tablet transformer thingie charging only when off","user_id":2,"username":"dukefawks","post_date":"2017-04-19 14:47:34","message":"Asus needs original cable and charger to charge correctly. From a generic cable\/charger it will take 20 hrs+ to charge and only when off. Also some older (TF100-700) ones need the special 5V\/15V charger that switches when tablet is connected."}
{"post_id":18687,"thread_id":18642,"title":"[SOLVED]Aus tablet transformer thingie charging only when off","user_id":700,"username":"Nick","post_date":"2017-04-19 15:38:24","message":"[QUOTE=\"dukefawks, post: 18679\"]Asus needs original cable and charger to charge correctly. From a generic cable\/charger it will take 20 hrs+ to charge and only when off. Also some older (TF100-700) ones need the special 5V\/15V charger that switches when tablet is connected.[\/QUOTE]\n\nthe original one arrived this afternoon, but had the same problem, i solved doing an hard reset. weird. well, tag as solved. thank you again duke"}
