[
    {
        "post_id":30774,
        "thread_id":30774,
        "title":"Another Bricked A1534 SSD",
        "user_id":316,
        "username":"G.Beard",
        "post_date":"2018-01-27 13:21:13",
        "message":"12\" MacBook works fine on El Cap then customer attemptes to install High Sierra. Bricked SSD.\nI am wondering if it's something to do with APFS \/ firmware.\n\n\nSomething I think is related:\nI have attempted on other systems to install High sierra on third party drives (SATA SSDs). They are not even detected by High Sierra installer when the SSD is fresh out of the box. The only way I have found to get these certian SSDs to recognise is to format them to HFS+ first with El Cap \/ other. When booting back into 10.13 installer they are then seem by disk util. I will not go into editing minstallConfig.xml to stop conversion to APFS on third party drives.\n\nNow. If an SSD is converted to APFS and I try to format the APFS drive back to HFS+ with an El Cap installer, disk util does not recognise the APFS volume.\n\nAPFS only works correctly with Apple SSD firmware. I wonder if this is all linked... Like a firmware update required for APFS to work, that fucks up for these 12\" MacBooks during the installation. Or some limbo state where neither El Cap \/ other or High Sierra disk utils can see the SSD?\n\nThis is a half arsed, uneducated theory. Does anyone have anythng more meaningful to add?...\n\nAside from \"Take it to Apple\" because clearly a £1200 Mac should not fuck up after a couple of years. Yes I will be telling the customer to go to Apple as 6 years is the law for UK."
    },
    {
        "post_id":30776,
        "thread_id":30774,
        "title":"Another Bricked A1534 SSD",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-01-27 14:11:07",
        "message":"I doubt that is the problem. Try to boot the macbook in target mode and mount the SSD on another machine. Not sure if the newer macs still support target mode, never tried it yet."
    },
    {
        "post_id":30779,
        "thread_id":30774,
        "title":"Another Bricked A1534 SSD",
        "user_id":316,
        "username":"G.Beard",
        "post_date":"2018-01-27 18:24:48",
        "message":"Well I’ll See if I can get target mode to work.\n\nSo far I tried Linux, windows and OS X on externals but nothing sees the device, let alone a volume.\n\nIts a very thin and pretty gold machine so it will make a nice place mat."
    },
    {
        "post_id":33045,
        "thread_id":30774,
        "title":"Another Bricked A1534 SSD",
        "user_id":1186,
        "username":"Salvatore951",
        "post_date":"2018-03-28 02:12:16",
        "message":"i have a 12 macbook that doesn't detect SSD as well, I don't think it's a software issue or bricked SSD.  There are many board with this problem."
    },
    {
        "post_id":33065,
        "thread_id":30774,
        "title":"Another Bricked A1534 SSD",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-03-28 13:59:39",
        "message":"Just bad NAND chips. As the NAND also holds some firmware the SSD will not be recognized at all if the NAND gets corrupted in the firmware area. Hopeless"
    },
    {
        "post_id":33147,
        "thread_id":30774,
        "title":"Another Bricked A1534 SSD",
        "user_id":316,
        "username":"G.Beard",
        "post_date":"2018-04-01 05:03:45",
        "message":"[QUOTE=\"dukefawks, post: 33065\"]Just bad NAND chips. As the NAND also holds some firmware the SSD will not be recognized at all if the NAND gets corrupted in the firmware area. Hopeless[\/QUOTE]\n\nSo in theory we could use a programmer via ICSP or \"chip-off\" to re-flash the firmware....?"
    },
    {
        "post_id":33188,
        "thread_id":30774,
        "title":"Another Bricked A1534 SSD",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-04-03 12:20:36",
        "message":"Yeah good luck with that as the corrupted NAND may be totally dead. The bad sector list may be lost and all the other parameters. Just forget about these if SSD is dead."
    }
]