{"post_id":5419,"thread_id":5419,"title":"ASUS K42Jr motherboard short to ground.","user_id":331,"username":"daxxone","post_date":"2016-08-14 17:03:04","message":"k42jr_mb_r20_er_1112_1822 search for the schematic I'm using (Rev2 is the closest I can find to the Rev3 board I got). ASUS K42JR REV 3.0 - BoardView search will find the boardview, and ASUS TSIC is the viewing software.\n\nI tried putting 3.3v into the board from the DC jack, and then had to replace PU8301 (PU8301A in the schematic) PU8301 was burned over pin 13 (boot) and pin 12 UGATE, PU8301 is a Buck controller RT8202APQW.\n\n+5VSUSO checked in diode mode is .134 everywhere, and P_+VTT_CPU( IN_SHAPE, IN_PHASE, HG_20, LG_20, at PQ8302, PQ8303, PQ8304, PL8303, PCE8801, PCE8804, PQ8802 (PIn 7 and 6), PQ8804 (PIn 7 and 6), PL8801, PL8802, PL8804, PL8805 ), are all .001 short to ground. Page 83 and 88 of the schematic  for this area of the baord. I don't want to burn PU8301 again, so  should I pull PU8301 off and give it voltage and see what gets hot? or is there something better I can do to figure this out?\n\nThis was the only board I had around with a short to ground for me to play around with. I fixed two motherboards that had been shorted out by bad jack and hinge design and only booted from battery, and another board with a blown mosfet, from what I learned from the youtube channel. I've been aiming at learning more about circuits and board repair so I don't always need to buy a new board if something is simple enough to repair. So I thought I'd come here and ask some people who do this daily. Thanks."}
{"post_id":5420,"thread_id":5419,"title":"ASUS K42Jr motherboard short to ground.","user_id":2,"username":"dukefawks","post_date":"2016-08-14 17:38:54","message":"PQ8301\/PQ8304 are probably shorted, remove them. This has probably killed everything on that bus including the CPU and PCH. I'm pretty sure this board is trash."}
{"post_id":5422,"thread_id":5419,"title":"ASUS K42Jr motherboard short to ground.","user_id":331,"username":"daxxone","post_date":"2016-08-14 18:09:54","message":"I put the CPU in another laptop and it worked fine. So I got that going for me. No charger would stay on with this short, and the only, unregulated voltage was 3.3v and, yeah PCH could be dead now. Thanks for the input. I'll post back when I get some progress, or if it is a full dud."}
{"post_id":5423,"thread_id":5419,"title":"ASUS K42Jr motherboard short to ground.","user_id":331,"username":"daxxone","post_date":"2016-08-14 18:47:29","message":"I should have PQ8304 by the end of the week, I had ordered 5 of them when I ordered RT8202APQW. I was thinking the short was in PQ8304 ( there is no PQ8301 on the Rev3 board I have here, some of the odd colored parts of the schematic have changes from the Rev2, to the Rev3, so I do some guessing here and there ) and with it removed, along with PQ8303, PQ8302, should be be at ground at either end of PL8303? Is this a bad PCE8301? I mean, I can't break the inductor, right? Sorry, just thinking out loud. I got to pull that too. The PQ8304 does test bad off the board."}
{"post_id":5424,"thread_id":5419,"title":"ASUS K42Jr motherboard short to ground.","user_id":2,"username":"dukefawks","post_date":"2016-08-14 19:14:27","message":"PQ8304 was shorted so the full 19V got onto the CPU IO VCC bus. PCH is dead for sure, again this board is fried to hell. You can inject 1.5V on the bus and confirm you can burn your finger on the PCH."}
