{"post_id":53302,"thread_id":53302,"title":"820-00164 No power after replacing bad backlight components","user_id":5175,"username":"tlough75","post_date":"2019-10-12 10:25:06","message":"Ok, so I feel stupid for asking but I am not sure what happened. I have a 820-00164 that had a bunch of back light and LCD connector liquid damage. Pins 2 &3 of the LCD connector were corroded off of the connector so I removed it an replaced with a new one. I had to pretty much replace everything around the LP8550 as well as the LP8550 because the ball under pin 5 was gone, as well as the pad. SO I replaced all of the caps and resistors with donors, ran a wire for a pad and re-soldered a new LP8550 and cleaned the area. the PP3V42_G3H had a couple of corroded parts that I replaced as well. the computer was working before the work except no back light and now I am not even getting a green\/orange light on the charger. I am getting PPDCIN_G3H but nothing else. Any clue where I should look? I'm pretty sure I put all of the components back for PP3V42_G3H but cannot figure out how or why I turned a working no back light board into dead. I admit I sat for a few minutes checking my soldering and it doesn't look like I bridged anything or have cold solder joints."}
{"post_id":53303,"thread_id":53302,"title":"820-00164 No power after replacing bad backlight components","user_id":5175,"username":"tlough75","post_date":"2019-10-12 10:26:59","message":"I'm sure it is probably something I did I just hate to undo all of my work, that is why I am asking for help"}
{"post_id":53304,"thread_id":53302,"title":"820-00164 No power after replacing bad backlight components","user_id":682,"username":"2informaticos","post_date":"2019-10-12 10:53:26","message":"So you have PPDCIN_G3H input voltage (what exactly?), but we don't know too much about PPBUS_G3H and 3V42_G3H.\nPost diode mode readings on both rails.\n\nSome basic voltages for U7100 and Q7010?"}
{"post_id":53306,"thread_id":53302,"title":"820-00164 No power after replacing bad backlight components","user_id":5175,"username":"tlough75","post_date":"2019-10-12 11:31:36","message":"Ok, so I am embarrassed. I found the problem. Pin 3 of D7005 was broken off of the dual diode, it just looked like it was attached. I had touched the joints up previously It just didn't fall off yet. I started probing around and it lifted up a little with the broken leg still attached to the solder pad.  Replaced with donor and now board is running. Best of all, My back light soldering worked as I now have backlight! going to UC it and put it togerther. Thank you for your help and time. This forum is great. Regards,\n\nTim"}
