[
    {
        "post_id":67758,
        "thread_id":60311,
        "title":"820-00928 SSD not recognized",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-11-10 15:13:45",
        "message":"Hello. I got another 820-00928 which looks very clean. No signs of liquid damage or corrosion, but it does not see the internal SSD. It is also slow to start it seems, and take 10 minutes or more to get to the flashing folder icon. When I plug in the charger and hold down the option key, it takes about 1-2 minutes before the backlight will come on, but no image. After another 1-2 minutes, the image will show up and I can select a drive to boot from. I was able to load the Catalina installer and open disk utility, but the internal SSD is not shown. Ran diagnostic mode and as expected, it gave me error VDH002 \"There may be an issue with a storage device\", but I also get PPF004 \"There may be an issue with the fan\". Both fans seem to be working correctly so maybe that points to something else? I have checked all voltages for SSD on page 84 of schematic and they are all fine. I have tried PRAM reset and SMC reset, with no change. Tried to boot in SMC bypass mode, no change. Tried a know good BIOS from the same model, no change. Is there anything else I can try?"
    },
    {
        "post_id":67759,
        "thread_id":60311,
        "title":"820-00928 SSD not recognized",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-11-10 15:33:42",
        "message":"Do you have good connections at J9600?\nPost voltage level for pins 4, 6, 12, 14, 44."
    },
    {
        "post_id":67767,
        "thread_id":60311,
        "title":"820-00928 SSD not recognized",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-11-10 17:41:41",
        "message":"Yes it is screwed down securely. I removed J9600 and the connector looks clean. I have posted voltages below for the pins you mentioned both with the plate attached and removed from J9600.\n\nWithout plate attached:\nPin 4 - 0.378\nPin 6 - 0.378\nPin 12 - 0.388\nPin 14 - 0.39\nPin 44 - 1.036\n\nWith plate attached:\nPin 4 - 1.8\nPin 6 - 3.28\nPin 12 - 3.28\nPin 14 - 0\nPin 44 - 3.28"
    },
    {
        "post_id":67774,
        "thread_id":60311,
        "title":"820-00928 SSD not recognized",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-11-11 02:46:30",
        "message":"Try to boot USB macOS in safe mode.\nAlso try another battery."
    },
    {
        "post_id":67784,
        "thread_id":60311,
        "title":"820-00928 SSD not recognized",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-11-11 07:23:46",
        "message":"I am able to boot into USB macOS in safe mode, but SSD is still not recognized. Tried to run this command in terminal (diskutil eraseDisk JHFS+ SSD disk0) but it gives me this error. Error: -69877: Couldn't open device. I have tried another top case already with battery but it did not change."
    },
    {
        "post_id":67787,
        "thread_id":60311,
        "title":"820-00928 SSD not recognized",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-11-11 08:08:18",
        "message":"I ran HW Monitor and it shows that PCH die is 128 Celsius, which is not normal.\n[ATTACH]59527[\/ATTACH]"
    },
    {
        "post_id":67793,
        "thread_id":60311,
        "title":"820-00928 SSD not recognized",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-11-11 10:27:19",
        "message":"There should be a problem with PCH.\nCompare diode mode readings on data lines of J9600 with good board."
    },
    {
        "post_id":67809,
        "thread_id":60311,
        "title":"820-00928 SSD not recognized",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-11-11 16:20:43",
        "message":"I compared diode mode on J9600 with a good 820-00281 board and they all seem normal. Where is the thermal sensor for PCH die? Is it built into the PCH?"
    },
    {
        "post_id":67855,
        "thread_id":60311,
        "title":"820-00928 SSD not recognized",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-11-12 15:43:59",
        "message":"Should be bad SSD then.\nThat explains why takes so much time to boot, expecting internal SSD to get ready first.\n\nThe 128 PCH temp appeared after reflashing BIOS?\nThis be caused by NO clean ME BIOS.\nIt can be the reason for backlight delay too."
    },
    {
        "post_id":68024,
        "thread_id":60311,
        "title":"820-00928 SSD not recognized",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-11-17 17:14:42",
        "message":"I did not check if the PCH temp was 128 before flashing the BIOS. The BIOS I used was a known good one from a working macbook that was unmodified, so it did not have a clean ME. I have cleaned the ME region on this BIOS now and re flashed it and now the PCH temp is back to normal. The new BIOS seems to have also fixed the issue with the backlight delay and slow boot, but still having SSD issues. I tried to check all the voltages on page 84 again to confirm they were still good, but now its seems I don't have most of them now. Not sure what happened. I tried to clean J9600 with alcohol in case there was some dirt or something but its still the same. I even put the old original BIOS back and checked again and still do not have correct voltages at J9600.\n\nJ9600 with plate attached:\nPin 4 - fluctuates between 0.600-1.8v\nPin 6 - fluctuates between 0.600-1.8v\nPin 12 - 0.184\nPin 14 - 0.180\nPin 44 - 3.28\n\nSSD_PWR_EN - 3.28"
    },
    {
        "post_id":68032,
        "thread_id":60311,
        "title":"820-00928 SSD not recognized",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-11-18 02:04:28",
        "message":"Check same signals\/voltages on the left side.\nPost accurate information please; pin 44 goes to PPBUS_G3H!"
    },
    {
        "post_id":68049,
        "thread_id":60311,
        "title":"820-00928 SSD not recognized",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-11-18 07:53:23",
        "message":"All the information I have posted is accurate. Pin 44 of J9600 goes to PP3V3_S5_POLARIS, not PPBUS_G3H. Here are the voltages I am currently getting at J9600 with the plate attached and secured properly.\n\n\nPP3V3_S5    3.3\nSSD_BOOT_L    0\nSSD_PWR_EN    3.25\nSSD_RESET_L    3.28\nSSD_CLKREQ_L    3.27\nPP3V3_S5_POLARIS    3.3\nSSD_BOOT_LB_L    0.357\nSSD_PWR_LB_EN    0.28\nSSD_RESET_LB_L    0.197\nSSD_CLKREQ_LB_L    0.195"
    },
    {
        "post_id":68061,
        "thread_id":60311,
        "title":"820-00928 SSD not recognized",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-11-18 15:29:26",
        "message":"Sorry, I was looking at 00923 schematic.\nThings happen, with more than 15 pdf files opened in Acrobat Reader.\n\nAs per your readings, you have many bad contacts there."
    },
    {
        "post_id":68077,
        "thread_id":60311,
        "title":"820-00928 SSD not recognized",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-11-18 18:22:14",
        "message":"J9600 looks perfect on this board. I do not see any reason why it would have a bad connection, but the voltages I am getting seem to suggest that. I have tried to clean it and have also tried to use different plates from donor boards, but I still am not getting the correct voltages. Can I remove J9600 from the board and still get the SSD working or I would need to replace the connector with another one?"
    },
    {
        "post_id":68091,
        "thread_id":60311,
        "title":"820-00928 SSD not recognized",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-11-19 02:06:31",
        "message":"You can remove it and bypass all the connections, if possible.\n\nOr check which connections are bad.\nLeave metal plate in place and bypass only bad connections."
    },
    {
        "post_id":68672,
        "thread_id":60311,
        "title":"820-00928 SSD not recognized",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-12-02 11:42:35",
        "message":"I removed J9600 from the board and jumped the connections using wires and now the voltages seem back to normal, but still SSD not recognized. I took a look at the board under thermal camera and I can see that U8605 is getting warm, so I am thinking its bad. Can this chip be changed, or is it tied to the other SSD chips on this board?"
    },
    {
        "post_id":68696,
        "thread_id":60311,
        "title":"820-00928 SSD not recognized",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-12-02 16:28:38",
        "message":"Isn't underfilled???\nStop wasting your time with this board..."
    }
]