[
    {
        "post_id":32792,
        "thread_id":32792,
        "title":"820-3330 wont power on with battery.",
        "user_id":371,
        "username":"nate8organic",
        "post_date":"2018-03-20 21:51:31",
        "message":"I have a 2012 3330 liquid damaged,  had a bad isl and some burnt up lines running on pin 17 of the isl, ran a wire.  the board appeared to be working, but when i put it in a test rig connected the charger and the computer turns right on and responds to the power button on and off.  if i disconnect the charger the computer runs on the battery, but if the computer is off and i disconnect the charger and power it on only from the battery the fan spins up for a second and can hear the hhd power up and then shut off.  so the system tries to boot on with only the battery connected but wont stay on.  what would cause this?  i have double checked with multiple battery's.  \n\nThanks \nNate"
    },
    {
        "post_id":32819,
        "thread_id":32792,
        "title":"820-3330 wont power on with battery.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-03-21 19:40:48",
        "message":"PPBUS without battery connected?"
    },
    {
        "post_id":32853,
        "thread_id":32792,
        "title":"820-3330 wont power on with battery.",
        "user_id":371,
        "username":"nate8organic",
        "post_date":"2018-03-22 12:29:10",
        "message":"ppbus without battery connected is 12.56v system off and 12.57v on\n\nwith bat and charge ppbus is 12.56v\n\nand with batt only 12.36v"
    },
    {
        "post_id":32868,
        "thread_id":32792,
        "title":"820-3330 wont power on with battery.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-03-22 16:41:09",
        "message":"Does it charge the battery? Resistance between pins 17\/18 and 27\/28 of U7000? Any history?"
    },
    {
        "post_id":32875,
        "thread_id":32792,
        "title":"820-3330 wont power on with battery.",
        "user_id":371,
        "username":"nate8organic",
        "post_date":"2018-03-22 21:41:03",
        "message":"Yes, charges the battery and gives orange light, battery is fully recognized by system.  res pin 17\/18 is 10.4 it was 150 something but i noticed and changed out r7051 as it looked burnt and now its 10.4.  27\/28 is 26.5 ish.  i'm attaching some photos of the area affected.  i cannot tell if there was a line from r7051 and r7052 pin 2 to c7031 but i couldn't find anything around the test pad that as you can see in my photo i'm uploading was corroded away on both pads."
    },
    {
        "post_id":32882,
        "thread_id":32792,
        "title":"820-3330 wont power on with battery.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-03-23 04:12:03",
        "message":"Check AMON and BMON voltages when powering on from AC and battery. Maybe one of them reports high current draw when on battery and system shuts down. Must of course measure when it is powering on when on battery."
    },
    {
        "post_id":32895,
        "thread_id":32792,
        "title":"820-3330 wont power on with battery.",
        "user_id":371,
        "username":"nate8organic",
        "post_date":"2018-03-23 12:16:27",
        "message":"Okay that would make sense.  i tested with battery and ac connected.  powered on - Amon was .65-.7v  and Bmon was .05v\n\nWhen i tested with battery only, pressing the power switch at the same time as testing,  Amon was .0v and Bmon was .43v\n\nwould .43v be high current on that line?  as we only got .05v with ac and battery. and if it is high, what chip would you suspect is causing it?"
    },
    {
        "post_id":32906,
        "thread_id":32792,
        "title":"820-3330 wont power on with battery.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-03-23 18:00:05",
        "message":".43 is fine I think. You can remove the ISL6259 and just power on from a charged battery, try if that works. Do not connect to AC with ISL missing!"
    },
    {
        "post_id":32953,
        "thread_id":32792,
        "title":"820-3330 wont power on with battery.",
        "user_id":371,
        "username":"nate8organic",
        "post_date":"2018-03-26 12:24:51",
        "message":"Okay, i removed the isl and the system powers on from the battery and runs on it. i changed out the isl with another one and i still have the same issue."
    },
    {
        "post_id":32970,
        "thread_id":32792,
        "title":"820-3330 wont power on with battery.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-03-26 17:53:05",
        "message":"That would point to AMON or BMON reporting too much current draw. Check traces to pins 17\/18, 27\/28 of U7000. I see some pretty destroyed probe points which could have had vias under them."
    },
    {
        "post_id":32994,
        "thread_id":32792,
        "title":"820-3330 wont power on with battery.",
        "user_id":371,
        "username":"nate8organic",
        "post_date":"2018-03-27 13:47:43",
        "message":"i checked r7050 pin 3 to r7052 to isl getting 5.3 ohms \nr7050 pin 4 to r7051 to isl 9 ohms\n\n27 to r7020 pin 3 = 13.5 ohms\n28 to r7020 pin 4 = 14.5 ohms\n\nwas there any traces to the isl that i missed here?"
    },
    {
        "post_id":33010,
        "thread_id":32792,
        "title":"820-3330 wont power on with battery.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-03-27 15:38:13",
        "message":"Did you try another ISL6259, check all resistors and traces around it? Could be Q7055 or traces to it."
    },
    {
        "post_id":33071,
        "thread_id":32792,
        "title":"820-3330 wont power on with battery.",
        "user_id":371,
        "username":"nate8organic",
        "post_date":"2018-03-28 14:46:38",
        "message":"okay, i did try another isl twice before this.  i replaced Q7055 and checked traces to it all was good. i replaced every chip around the isl and then checked every trace to each one and everything was good.  so i swapped out the isl after all this and it worked.  i'm guessing one of the chips around the isl was bad and perhaps damaged each isl i placed on it? \nnow its running on the battery but appears its not charging,  i connect the charger the battery is at 95% the icon goes to 100% with the thunderbolt through it, but gives green light only, if i remove the charger after a few minutes it had dropped to 93% battery so it was not running on the charger or charging.  i'm guessing its the isl i replaced it with could be bad also.  so i am going to try swapping that out after i eat lunch here and post back on my findings."
    },
    {
        "post_id":33074,
        "thread_id":32792,
        "title":"820-3330 wont power on with battery.",
        "user_id":371,
        "username":"nate8organic",
        "post_date":"2018-03-28 16:45:49",
        "message":"Smh.  i checked back over the isl and i didn't fully connect it (hunger hour) so the same problem persists."
    },
    {
        "post_id":33078,
        "thread_id":32792,
        "title":"820-3330 wont power on with battery.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-03-28 18:52:19",
        "message":"Don't know how much I can trust the soldering now. Bridge over R7050 so the system will not be able to measure current draw from the battery and see if it powers on."
    },
    {
        "post_id":33092,
        "thread_id":32792,
        "title":"820-3330 wont power on with battery.",
        "user_id":371,
        "username":"nate8organic",
        "post_date":"2018-03-29 13:20:11",
        "message":"yeah sorry about that, i normally check over my solder work but was rushed by the guys for lunch.  i double checked over all the soldering.  i bridged over R7050 and it wont power on."
    },
    {
        "post_id":33093,
        "thread_id":32792,
        "title":"820-3330 wont power on with battery.",
        "user_id":371,
        "username":"nate8organic",
        "post_date":"2018-03-29 13:43:54",
        "message":"also just to note. it will power on from the battery without memory installed."
    },
    {
        "post_id":33102,
        "thread_id":32792,
        "title":"820-3330 wont power on with battery.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-03-29 14:38:26",
        "message":"At this point I really have no more ideas, did crap get under the SMC?"
    },
    {
        "post_id":33103,
        "thread_id":32792,
        "title":"820-3330 wont power on with battery.",
        "user_id":371,
        "username":"nate8organic",
        "post_date":"2018-03-29 14:57:10",
        "message":"im not sure if it did but i have been wondering about that also. i will swap it out just to be sure at this point. also i was about to just UC it just in case crap was under something and was causing all this.  i will post back after i try this.  fingers crossed haha"
    },
    {
        "post_id":33163,
        "thread_id":32792,
        "title":"820-3330 wont power on with battery.",
        "user_id":371,
        "username":"nate8organic",
        "post_date":"2018-04-02 18:43:28",
        "message":"I changed out the smc and put it through the UC. still nothing.  I did notice that if i connect j6955 that i get no fan spin at all on just the battery, would something here perhaps cause this issue?"
    },
    {
        "post_id":33195,
        "thread_id":32792,
        "title":"820-3330 wont power on with battery.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-04-03 12:31:06",
        "message":"Is SMC_LID high?"
    },
    {
        "post_id":33212,
        "thread_id":32792,
        "title":"820-3330 wont power on with battery.",
        "user_id":371,
        "username":"nate8organic",
        "post_date":"2018-04-03 13:36:15",
        "message":"No its 3.4v, i was using a second keyboard, tested it with another keyboard and it does attempt to power on with J6955 connected. so perhaps that was related to the test keyboard.  \nI did notice that u6990 had corrosion around it, replaced u6990 and c6990 already, could anything else in that circuit affect the bmon amon ? \nIf i cannot resolve this would [USER=\"1\"]larossmann[\/USER] like to attempt a wholesale repair on this for me? i could mail it out to you for service. DM me if you would like to give this repair a shot."
    },
    {
        "post_id":33226,
        "thread_id":32792,
        "title":"820-3330 wont power on with battery.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-04-04 02:31:23",
        "message":"Kind of out of ideas on this one. I'll poke Louis too."
    }
]