{"post_id":26247,"thread_id":26247,"title":"820-3437-b, water damaged  u7400  r7416, now turns on but chime, no video","user_id":1101,"username":"ielectron","post_date":"2017-10-02 10:48:31","message":"No chime, No video\n\nThis macbook air would not turn on at all, i noticed the water damaged on r7416 which connects to u7400 (1.2V for the RAM), i resoldered the test point, now turns on, 1.2V is ok, all the other main voltages are fine, 8.6V, 5, 3.3V, the fan would start to spin fast after a min which is normal, the trackpad is not connected, there is green light on charger, i can do the SMC reset, but of course not the PRAM reset cause there is no chime, no video, no backlight. I dont see water elsewhere, there is bit sticky stuff on U3510 bluetooth chip, but it not even corroded. How can i go forward?"}
{"post_id":26265,"thread_id":26247,"title":"820-3437-b, water damaged  u7400  r7416, now turns on but chime, no video","user_id":2,"username":"dukefawks","post_date":"2017-10-02 22:51:50","message":"CPU Vcore present on L7310? Is it doing the 3 times on\/off thing before staying on?"}
{"post_id":26337,"thread_id":26247,"title":"820-3437-b, water damaged  u7400  r7416, now turns on but chime, no video","user_id":1101,"username":"ielectron","post_date":"2017-10-04 04:59:35","message":"i think yesterdat it did not do th e3 fan spin thing but im not sure, today i measured L7310 and 1.8V is there, and now is doing the 3 times spin. I put it back together and now starts with chime and picture, boots into osx, i did not do  anything and it fixed itself....?"}
{"post_id":26338,"thread_id":26247,"title":"820-3437-b, water damaged  u7400  r7416, now turns on but chime, no video","user_id":1101,"username":"ielectron","post_date":"2017-10-04 06:53:42","message":"ok, i cleaned the board properly, though i did not see water damage elsewhere, now it always turns on with chime, smc reset always works, but the pram reset is bit weird, it restarts after the chime holding the 4 keys on the keyboard but sometimes it just powers off instead of restarting, but after a while it restarts with chime if im just keep holding the alt+option+p+r , which is how it supposed to do, but now it just stuck on the apple logo, the white line is condtantly getting longer so it is trying to boot but even after 10 mins it still loadaing, same with a usb enclosure or an installing usb, i will try now the internet recovery but first i hav eto do backup somehow, maybe i try the ssd in another macbook."}
{"post_id":26339,"thread_id":26247,"title":"820-3437-b, water damaged  u7400  r7416, now turns on but chime, no video","user_id":1101,"username":"ielectron","post_date":"2017-10-04 06:58:35","message":"now i tried with another SSD and right away it boots fine into osx"}
{"post_id":26340,"thread_id":26247,"title":"820-3437-b, water damaged  u7400  r7416, now turns on but chime, no video","user_id":1101,"username":"ielectron","post_date":"2017-10-04 07:12:11","message":"now i cleaned the ssd with alcohol and the ssd connector too on the board and now works with the original ssd and boots into osx"}
