[
    {
        "post_id":95953,
        "thread_id":63522,
        "title":"820-3476 Airport test and load test errors",
        "user_id":44757,
        "username":"VinceLx2",
        "post_date":"2023-01-28 02:37:57",
        "message":"Hi,\nIt is a clean board, which gives no errors when running Macbook internal diagnostic (D key). WIFI and Bluetooth work fine.\nOn the other hand when I run the ASD 3S162, I got errors on load test and airport test, see attached (ignore the first sensor group error, I simply did not have the DC in)\n\nI replaced the WIFI card, I\/O board, I\/O connector, with the same results.\n\nAny idea about what can generate these errors?"
    },
    {
        "post_id":95956,
        "thread_id":63522,
        "title":"820-3476 Airport test and load test errors",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-01-28 03:39:59",
        "message":"First of all, welcome to the forum!\n\nDo you hany problem when run macOS in normal mode?"
    },
    {
        "post_id":95957,
        "thread_id":63522,
        "title":"820-3476 Airport test and load test errors",
        "user_id":44757,
        "username":"VinceLx2",
        "post_date":"2023-01-28 04:02:34",
        "message":"Thank you!\n\nNo, no issues in MacOS, I can run Heaven load test, no problem\n\nAbout history of this Mac: it arrived with a broken screen, I replaced it and tested, I just want to be sure that all is ok, but not confident with these errors"
    },
    {
        "post_id":95960,
        "thread_id":63522,
        "title":"820-3476 Airport test and load test errors",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-01-28 05:00:41",
        "message":"If machine performs good unde macOS, don't bother with ASD report.\nYou can run HWMonitor, in case you note some strange behavior.\n\nALS, webcamera and keyboard backlight work correctly?"
    },
    {
        "post_id":95961,
        "thread_id":63522,
        "title":"820-3476 Airport test and load test errors",
        "user_id":44757,
        "username":"VinceLx2",
        "post_date":"2023-01-28 06:34:20",
        "message":"ALS, camera, keyboard and LCD backlights are good.\nHWMonitor has no strange values except for Airport at 129ºC, but I have this value also in good Macbooks. In any case the fan is running normal, increasing only when loaded\n\nI will use this Macbook for a few days and see if anything bad happens"
    }
]