{"post_id":21351,"thread_id":21351,"title":"820-00164 green & orange light, only powers on with battery installed","user_id":371,"username":"nate8organic","post_date":"2017-06-06 17:57:08","message":"got in a 00164 customer said son spilled Gatorade in it. he took the liberty to try and clean every part himself.\n\nit came in with only a green light, replaced the q7055 or so i believe ( dont have schematics for this one, holding out on buying it unless i need it bad) cant seem to find it free anywhere. also replaced a bunch of stuff around the lcd connector. after the q7055 the orange light came on.\n\nif i plug in the battery the fan spins up and the computer turns on, as of right now it wont load all the way into osx before it turns off not sure if its just a dead battery that it wont boot in all the way yet before turning off or another problem. if i plug in the charger with no battery in the computer will not turn on, one time it turned on after u pulled battery and it showed a dead battery symbol then turned off. would this likely be the io board? i have an extra around somewhere but cant find it to test right away. also from the time i press the power to the time the screen turns on is about 20-30 seconds.  just tested with a non air power board with with only the power line connected and it powers the machine on it loads to start up and then will turn off at any random moment. going to send it through the sonic cleaner now.\nany thoughts?\nThanks\nNate"}
{"post_id":21355,"thread_id":21351,"title":"820-00164 green & orange light, only powers on with battery installed","user_id":741,"username":"PhilipC","post_date":"2017-06-07 01:53:40","message":"I just fixed one with the same symptoms, It was corrosion on the powerflex and battery needed replacing"}
{"post_id":21383,"thread_id":21351,"title":"820-00164 green & orange light, only powers on with battery installed","user_id":371,"username":"nate8organic","post_date":"2017-06-07 13:44:36","message":"that few times i have tried to power it up it load to the option menu and then before i can select my drive it keeps dying. Even with a new IO board. tried powering on with everything unplugged and it still crashes. crashes before i can run Diagnostics. [USER=\"741\"]PhilipC[\/USER] Did it crash if you had the IO and Powerflex unplugged? any ideas here [USER=\"2\"]dukefawks[\/USER]"}
{"post_id":21384,"thread_id":21351,"title":"820-00164 green & orange light, only powers on with battery installed","user_id":1,"username":"larossmann","post_date":"2017-06-07 14:01:25","message":"Is there corrosion on the trackpad flex or burned pins on either side?"}
{"post_id":21388,"thread_id":21351,"title":"820-00164 green & orange light, only powers on with battery installed","user_id":371,"username":"nate8organic","post_date":"2017-06-07 14:19:00","message":"no the trackpad flex looks good and the trackpad itself, if i disconnect the trackpad it still does the same thing. there was corrosion in the battery connector, i cleaned that. there was corrosion on the jtag and i removed the jtag. maybe there is corrosion under the trackpad connector? i could replace it.\n\nI just ran it through the sonic last night. with no change.  I am kinda bummed because the customer cleaned the thing before hand so something that might have been obvious is now gone.  \n\nThank you for chipping in Louis! all the help i can get is beyond appreciated!"}
{"post_id":21389,"thread_id":21351,"title":"820-00164 green & orange light, only powers on with battery installed","user_id":637,"username":"TCRScircuit","post_date":"2017-06-07 14:20:56","message":"I've seen this with a bad ISL6259 as well. Worth a check in that area to see if anything looks off. Check charger and battery current sensing as well."}
{"post_id":21391,"thread_id":21351,"title":"820-00164 green & orange light, only powers on with battery installed","user_id":2,"username":"dukefawks","post_date":"2017-06-07 14:25:35","message":"ACOK present? PPBUS voltage on AC alone?"}
{"post_id":21393,"thread_id":21351,"title":"820-00164 green & orange light, only powers on with battery installed","user_id":371,"username":"nate8organic","post_date":"2017-06-07 15:10:24","message":"I will look into the isl6259 area and current sensing.  8.57v on ppbus with ac only. with and without the system powered on.  acok is present at 3.34v.  \n\nLooking into around the memory im finding corrosion around the chips and u4000 and u3900 all have green corrosion under them, if i scrap the the sides of them with my tweezers i get green corrosion i already ran it through the cleaner, any recommended ways of removing that from under those chips? i certainly do not want to have to remove them. also that would be a pretty likely reason it powers on and turns back off if the memory is corroded."}
{"post_id":21402,"thread_id":21351,"title":"820-00164 green & orange light, only powers on with battery installed","user_id":637,"username":"TCRScircuit","post_date":"2017-06-08 01:16:11","message":"That could be it... Sense ACOK and PPBUS is ok it's probably not the ISL. You can get rid of the corrosion under the ram by putting a lot of flux around them and giving them a light reflow..."}
{"post_id":21430,"thread_id":21351,"title":"820-00164 green & orange light, only powers on with battery installed","user_id":371,"username":"nate8organic","post_date":"2017-06-08 16:14:57","message":"Okay thanks TCRS,  i tried a re-flow and still no difference.  unless anyone has any other ideas i'm going to give this one back almost fixed but unfixed."}
