[
    {
        "post_id":54972,
        "thread_id":54972,
        "title":"820-3437 strange issue",
        "user_id":1547,
        "username":"CRC2018",
        "post_date":"2019-12-02 02:53:04",
        "message":"So a little bit of history on this one - originally came in with a spill - was mainly focussed around the clock chip and bios chip. I've removed both clock chip and bios chip cleaned it all up and then given it a new clock chip and fixed any oxidised pads underneath each. I've then ultrasonic'd the board dried it off and tested - all working, reassembled the macbook given it back to customer. Now two weeks later it's come back for warranty service as it wont turn on - checked the board again cannot see anything obvious other than a low PP3V3_S4 voltage - 2.4V instead of the 3.3 i would expect and also reading a lower resistance to ground than I would expect (Around 0.5kohm). So given I cannot see anything visible I once again ultrasonic'd the board dried it off and it starts working again. The next day however it has stopped working again! \nPresently have 2.5V on PP3V3_S4\n\nAnyone have any thoughts on where the issue could lie?"
    },
    {
        "post_id":54975,
        "thread_id":54972,
        "title":"820-3437 strange issue",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-12-02 03:36:52",
        "message":"I recommend to start reballing SMC..."
    },
    {
        "post_id":55006,
        "thread_id":54972,
        "title":"820-3437 strange issue",
        "user_id":1547,
        "username":"CRC2018",
        "post_date":"2019-12-03 04:53:40",
        "message":"Reballed SMC - same behaviour anything else to check?"
    },
    {
        "post_id":55007,
        "thread_id":54972,
        "title":"820-3437 strange issue",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-12-03 05:03:28",
        "message":"Post exact voltage for all PM_SLP_Sx_L signals."
    },
    {
        "post_id":55175,
        "thread_id":54972,
        "title":"820-3437 strange issue",
        "user_id":1547,
        "username":"CRC2018",
        "post_date":"2019-12-10 08:46:21",
        "message":"Finally got back to this one after a busy week; there were a catalogue of problems:\n1) Under U1950 pad 8 was corroded\n2) Pad 1 under R8156 was corroded\n3) the SMC hadn't soldered on correctly when I reballed it earlier \n\nAfter fixing all three issues it's now starting normally."
    }
]