{"post_id":155,"thread_id":155,"title":"820-3462 Running Slow","user_id":66,"username":"Micheal Harris","post_date":"2016-03-21 18:53:51","message":"water damaged, works after cleaning but runs slow, fan stays at normal speed, ASD fails TIM test, something about heatsink not properly attached, can't find any obvious damage to the board, I'm lost as where to go from here.\npicture of ASD Failure here\n\n[url]https:\/\/www.dropbox.com\/s\/ig3lg67636wf641\/2016-03-21%2017.05.31.jpg?dl=0[\/url]\n\nEdit: wrong link"}
{"post_id":157,"thread_id":155,"title":"820-3462 Running Slow","user_id":34,"username":"VirtualLife","post_date":"2016-03-21 19:16:00","message":"Did you check the EFI Test? Check if the heatsink is attached correctly. I had the same issue that it tells me that check the heatsink. I replaced the old thermal paste with new one and it went away."}
{"post_id":158,"thread_id":155,"title":"820-3462 Running Slow","user_id":36,"username":"aprendiz","post_date":"2016-03-21 19:16:10","message":"Replace thermal paste between processor and heatsink, check heatsink for visible damage or if you have a replacement on hand....."}
{"post_id":159,"thread_id":155,"title":"820-3462 Running Slow","user_id":66,"username":"Micheal Harris","post_date":"2016-03-21 19:27:49","message":"i have tried to redo thermal paste twice now, i do not have a replacement i could try but i see no damage to the heatsink, i will try EFI test tomorrow, keep forgetting they are different"}
{"post_id":172,"thread_id":155,"title":"820-3462 Running Slow","user_id":1,"username":"larossmann","post_date":"2016-03-21 22:09:30","message":"You can't physically see a broken heatpipe inside the heatsink, which is most likely the case here. Here's what I had to say in an earlier thread:\n   [FONT=inherit] [FONT=inherit]The way that ASD test works is it loads the CPU, unloads it, and then checks how long it takes for temperature to drop, and how quickly\/slowly it rises. Seeing as all these machines use the same heatsink, same fan, same case, when you load the CPU to 100% and then back to 0%, the temperature should increase\/decrease at a specific curve. If it So you have a few options here.\n\n1) Heatpipe inside the heatsink is bad - so it is not conducting properly.\n2) Shitty thermal paste\/no thermal paste.\n3) Fan isn't in there or able to spin at top speed.\n4) You're SOL.\n\nThe practical real world cause of this is that the heatsink was dropped during reassembly\/disassembly from the person who was originally fucking with it, which broke the heatpipe inside the heatsink. Scared, the guy bends the heatsink back into place, and it looks great... right? No, the heatpipe inside is broken!\n\nI'd also check the EFI version of ASD as it is more descriptive with sensors. Check the hardware profile, go to the list of sensors, and read through the list to see which one looks funny. Sometimes you find things that don't show up in the test.[\/FONT]\n [\/FONT]"}
{"post_id":179,"thread_id":155,"title":"820-3462 Running Slow","user_id":2,"username":"dukefawks","post_date":"2016-03-21 22:26:36","message":"It is running slow so it either has a voltage sensor issue or the BIOS chip was messed with. Run EFI version of ASD and check all sensors, the rest can be unchecked."}
{"post_id":205,"thread_id":155,"title":"820-3462 Running Slow","user_id":66,"username":"Micheal Harris","post_date":"2016-03-22 12:08:52","message":"EFI does not contain that test and passes no problem, flicking the heatsink with my finger seemed to make it more responsive, so I'm going to order a new heatsink and see how that goes"}
{"post_id":210,"thread_id":155,"title":"820-3462 Running Slow","user_id":2,"username":"dukefawks","post_date":"2016-03-22 15:19:50","message":"Heatsink will not affect it running slow. Running slow is a sensor issue. Do all sensors pass in ASD? Is the battery connected?"}
{"post_id":213,"thread_id":155,"title":"820-3462 Running Slow","user_id":66,"username":"Micheal Harris","post_date":"2016-03-22 15:56:10","message":"all sensors pass in both versions of ASD, battery is bad due to water damage, with ASD failing the heatsink test and how most MacBooks don't care about the battery being connected, i did not think it was a problem, should i start with the battery then?"}
{"post_id":214,"thread_id":155,"title":"820-3462 Running Slow","user_id":2,"username":"dukefawks","post_date":"2016-03-22 16:35:29","message":"Well yeah, without a battery it will run slow! Just replace the battery and forget about that heat sink and all will be ok. Do check that the heat sink makes good contact. Apple a very thin coat of thermal paste and screw it down. Then lift it again to see if full contact was made on the whole surface. I always use the white thermal paste, the original I find too thick and crumbles.\n\nEdit.\nAll MacBooks 2011+ will run slower without a battery"}
{"post_id":219,"thread_id":155,"title":"820-3462 Running Slow","user_id":66,"username":"Micheal Harris","post_date":"2016-03-22 17:14:21","message":"Good to know, i have never noticed enough of a difference i guess, i use arctic silver 5, never gets crumbly.\nThanks for the help, i will start with a new battery."}
{"post_id":760,"thread_id":155,"title":"820-3462 Running Slow","user_id":66,"username":"Micheal Harris","post_date":"2016-03-30 18:04:15","message":"Update: got around to installing new battery, still running slow, should i order another heatsink for the hell of it?"}
{"post_id":934,"thread_id":155,"title":"820-3462 Running Slow","user_id":2,"username":"dukefawks","post_date":"2016-04-02 12:49:19","message":"Is the battery recognized and charging correctly?"}
{"post_id":2866,"thread_id":155,"title":"820-3462 Running Slow","user_id":66,"username":"Micheal Harris","post_date":"2016-05-20 19:03:36","message":"forgot to check back on this, yes the new battery worked perfectly, the board was still stuck thinking something was wrong with the heatsink, and i even tried a new heatsink when the same model came in, i gave up and bought a new board"}
{"post_id":2882,"thread_id":155,"title":"820-3462 Running Slow","user_id":2,"username":"dukefawks","post_date":"2016-05-21 09:39:19","message":"The heat sink errors can be ignored, the board is fine."}
{"post_id":2890,"thread_id":155,"title":"820-3462 Running Slow","user_id":66,"username":"Micheal Harris","post_date":"2016-05-21 13:00:55","message":"what else would be causing it to run slow then? all other sensors check out in asd"}
{"post_id":3033,"thread_id":155,"title":"820-3462 Running Slow","user_id":2,"username":"dukefawks","post_date":"2016-05-27 04:00:38","message":"Was the BIOS chip messed with?\nDid you replace it with the exact same battery? There are 2 versions, check the correct A**** number on it."}
{"post_id":37600,"thread_id":155,"title":"820-3462 Running Slow","user_id":1637,"username":"Adan","post_date":"2018-07-26 13:51:23","message":"Hi had the same issu with the same MacBook, the cause was comming than I bended the heatsink to take the fans of the board. So I probably broked the heatpipe inside the heatsink. Then I change the heatsink and the problem getted away."}
