{"post_id":37297,"thread_id":37297,"title":"Macbook Air - Chime & Backlight works, No display...","user_id":1716,"username":"PCS ProShop","post_date":"2018-07-19 02:58:44","message":"Mr. Pepe,\n\nI've got a 2011 Macbook Air in the shop. Fan spins up, Audible Chime, Backlight all working.  I've done a pretty complete examination of the board, top & bottom.  Checked Traces, grounds good (solid), have some spots that look pretty crappy (without scope), simple continuity check seems good.  Those nasty traces still get continuity & nominal voltage, and I can get grounds I've tested with solid tone?  I'm kinda bugging out with the amount of \"Time Suck\" this single board\/machine is costing me.  \n\nSo I'm gonna take a chance that my $30 will get me some kind of hint?  Seems like I've got good PP to the display rail?  Am I missing something obvious, or should I just same my time & board swap it?  I'm at (the better part of..) 90min's right now (not counting typing time).  Just over my Bench Fee quoted time, but, don't want to make this a \"Rabbit Hole\".  Any Ideas?\n\nI'll try to post some board shot's in the AM.\n\nThanks,\nJohn"}
{"post_id":37303,"thread_id":37297,"title":"Macbook Air - Chime & Backlight works, No display...","user_id":145,"username":"Sykulski","post_date":"2018-07-19 10:30:08","message":"You checked the board but you are not mentioning if you checked with another display. If not then start there. Don’t diagnose the board before you are 100% sure it is a board issue. It could also just be a bad lcd-cable. If you don’t have a known good display at hand then start with disconnecting internal display and see if an external one shows an image."}
{"post_id":37317,"thread_id":37297,"title":"Macbook Air - Chime & Backlight works, No display...","user_id":1716,"username":"PCS ProShop","post_date":"2018-07-19 12:33:31","message":"First thing I did."}
{"post_id":37325,"thread_id":37297,"title":"Macbook Air - Chime & Backlight works, No display...","user_id":145,"username":"Sykulski","post_date":"2018-07-19 16:38:49","message":"Don’t use comments as replies as they can easily be missed. First thing you did was it trying a known good display or was it to test with external screen while internal display disconnected ?"}
{"post_id":37328,"thread_id":37297,"title":"Macbook Air - Chime & Backlight works, No display...","user_id":1190,"username":"Gmorb","post_date":"2018-07-19 17:44:20","message":"No Title"}
{"post_id":37335,"thread_id":37297,"title":"Macbook Air - Chime & Backlight works, No display...","user_id":682,"username":"2informaticos","post_date":"2018-07-19 19:02:08","message":"Is your board model 820-3115?\nDo you get pure white or black display?\nCheck for knocked off components in the LCD connector area, both sides of the board."}
{"post_id":37392,"thread_id":37297,"title":"Macbook Air - Chime & Backlight works, No display...","user_id":2,"username":"dukefawks","post_date":"2018-07-20 18:50:42","message":"Need to know if you have white screen or black with backlight on. \n\nRemove the SSD and do a PRAM reset and see if you get a question mark."}
