{"post_id":27691,"thread_id":27691,"title":"[SOLVED]820-3476-A Intermittent lower keyboard row","user_id":288,"username":"DannyRinc","post_date":"2017-11-04 10:21:05","message":"Have a board that was previously liquid damaged although it doesn't look like any components were ever replaced. Has had a keyboard replacement twice at a shop, still suffering from intermittent key issues. Particularly a problem with ZXCVB, comes and goes, will work normally for 5-10 minutes when keyboard is reseated. Checked traces and all WS_KBD traces have continuity, and the highest resistance on any trace is .2 ohms. I'm leaning towards just a bad keyboard, although I'm not sure how THAT would be intermittent, possibly bad U4801? Cold solder joints? Will touch up solder and go from there I guess."}
{"post_id":27693,"thread_id":27691,"title":"[SOLVED]820-3476-A Intermittent lower keyboard row","user_id":2,"username":"dukefawks","post_date":"2017-11-04 15:04:18","message":"I would say a bad connector"}
{"post_id":27834,"thread_id":27691,"title":"[SOLVED]820-3476-A Intermittent lower keyboard row","user_id":288,"username":"DannyRinc","post_date":"2017-11-08 09:34:59","message":"Thanks for the suggestion, tried a new connector and no dice. I did try a known good keyboard and I didn't have any issues with it, so we're just replacing her keyboard. What's weird is she says it worked fine for a while then started having those issues. Do keyboards go bad for no reason? I'm inclined to think the customer is just lying to me and spilled shit on their computer again."}
{"post_id":27840,"thread_id":27691,"title":"[SOLVED]820-3476-A Intermittent lower keyboard row","user_id":2,"username":"dukefawks","post_date":"2017-11-08 10:51:01","message":"With Chinese garbage anything is possible."}
{"post_id":28140,"thread_id":27691,"title":"[SOLVED]820-3476-A Intermittent lower keyboard row","user_id":288,"username":"DannyRinc","post_date":"2017-11-16 18:05:35","message":"Chinese garbage it was, all is good to go. Thanks for all the help, you can mark as solved!"}
