[
    {
        "post_id":28239,
        "thread_id":28239,
        "title":"820-3115-b 1.5v s3\/s0 Fet",
        "user_id":1190,
        "username":"Gmorb",
        "post_date":"2017-11-19 14:54:21",
        "message":"hi, on my previous post I had asked about a no backlight issue on the same 820-3115 board. well before i could figure what the issue was the board decided to randomly blow a capacitor taking the u9410 3.3v\/HV POWER MUX CHIP along with it so i replaced the blown capacitor along with the u9410 chip. Now i only get a green light all power rails except S0 are enabled. after doing a lot of troubleshooting i believe the issue lies in between the PM_SLP_S4_L and PM_SLP_S3_L which may be causing no 1v5CPU_EN which is not letting the 1.5v S3\/S0 FET to enable.\n\nSo ive come to ask for some help and guidance. Thanks."
    },
    {
        "post_id":28241,
        "thread_id":28239,
        "title":"820-3115-b 1.5v s3\/s0 Fet",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-11-19 15:35:30",
        "message":"Remove U9410 and forget about thunderbolt, see if S0 rails come back."
    },
    {
        "post_id":28244,
        "thread_id":28239,
        "title":"820-3115-b 1.5v s3\/s0 Fet",
        "user_id":1190,
        "username":"Gmorb",
        "post_date":"2017-11-19 15:41:39",
        "message":"[QUOTE=\"dukefawks, post: 28241\"]Remove U9410 and forget about thunderbolt, see if S0 rails come back.[\/QUOTE]\n\nwow that was easy. worked. is that area shorted or why was it preventing s0?\nwell that got the fan spinning but now the d3895 diode is smoking. im assuming i wont need it if i dont plan to fix thunderbolt guess ill remove that as well?\n\nedit:after removing the diode the chip next to it u3890 smoked as well got a partial fan spin now im back to green light i noticed the smoke coming from the side with the t29 booster pins. removed the chip now im back at spinning fan. guess thunderbolt is fucked for good? it gets extremely hot where u3890 used to be."
    },
    {
        "post_id":28250,
        "thread_id":28239,
        "title":"820-3115-b 1.5v s3\/s0 Fet",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-11-19 18:51:03",
        "message":"Find where the heat is coming from Q3880 tends to short too and the caps around U3890, I hope it is not in the board....."
    },
    {
        "post_id":28253,
        "thread_id":28239,
        "title":"820-3115-b 1.5v s3\/s0 Fet",
        "user_id":1190,
        "username":"Gmorb",
        "post_date":"2017-11-19 19:19:04",
        "message":"cant find anything heating up out of the ordinary the heat from where u3890 sits is no longer there and q3880 isnt getting hot. capacitors tied to the t29 bst boosters are shorting and both pins where u3890 sits are giving my meter a beep too. problem seems to lie in the booster?"
    },
    {
        "post_id":28273,
        "thread_id":28239,
        "title":"820-3115-b 1.5v s3\/s0 Fet",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-11-20 09:02:31",
        "message":"Just remove all that crap, thunderbolt is gone anyway. U3890 and the caps there can all go."
    },
    {
        "post_id":28290,
        "thread_id":28239,
        "title":"820-3115-b 1.5v s3\/s0 Fet",
        "user_id":1190,
        "username":"Gmorb",
        "post_date":"2017-11-20 15:22:19",
        "message":"got it, wont bother fixing thunderbolt. Thanks for the help!"
    }
]