{"post_id":74560,"thread_id":61087,"title":"3476 Wont stay off after shutting down.","user_id":26621,"username":"grmacs","post_date":"2021-04-21 21:19:33","message":"This board had liquid damage and works boots normal and passes all diagnostics but it willl not stay in s5 state after its turned off either by holding down the power button or shutting down through the OS. I thought it was a semi stuck power button or something along the lines of the SMC ONOFF getting pulled down intermittently or enough to be around threshhold but the board will not stay shut down out side of the mac either - I tested with board out and only external keyboard and display attached and then shutting down. I also tried different operating system to make sure it wasn't an OS glitch needing reinstall or something.\n\nSMC ONOFF is steady 3.42V with no signs of pulsing or dropping. I checked circuits related to SMC ONOFF no signs of corrosion and resistors have good values. Replaced U5110 to see if any difference. Checked keyboard and trackpad connectors and touched them up. Nothing looks to be around connectors or underneath. Reflowed SMC.\n\nIs there another signal that would cause the board to boot after shutting down without causing any other issues? My only other guess is something up with the SMC."}
{"post_id":74567,"thread_id":61087,"title":"3476 Wont stay off after shutting down.","user_id":682,"username":"2informaticos","post_date":"2021-04-22 01:41:27","message":"Probably some wake up signal for PCH is not good.\nUsually from Thunderbolt, or airport card.\nWhich areas have been affected by liquid?"}
{"post_id":74572,"thread_id":61087,"title":"3476 Wont stay off after shutting down.","user_id":26621,"username":"grmacs","post_date":"2021-04-22 07:50:49","message":"Board was actually pretty clean when I attained the Mac but LCI by L7195 and TP connector were activated. \n\nCan I do something like ground PLT_RESET_L to keep from starting and then check signals? Trying to think of a way to prevent the board from starting but still check to see what signals are coming in that state."}
{"post_id":74588,"thread_id":61087,"title":"3476 Wont stay off after shutting down.","user_id":682,"username":"2informaticos","post_date":"2021-04-22 14:54:16","message":"Check suspect wake signals when board is on.\nTest the board alone, disconnecting RIO cable and airport card."}
{"post_id":74640,"thread_id":61087,"title":"3476 Wont stay off after shutting down.","user_id":26621,"username":"grmacs","post_date":"2021-04-24 14:56:12","message":"I get 0V at pins 3,4, & 6 of U3560 after board has booted but voltage is present at those pins during start up. Is that correct? From what I can tell it stays 0V until after the board has already restarted... then goes to 3V+ til about halfway through boot. COmes back to 3V briefly then stays at 0V."}
{"post_id":74641,"thread_id":61087,"title":"3476 Wont stay off after shutting down.","user_id":682,"username":"2informaticos","post_date":"2021-04-24 15:01:28","message":"Did you test without airport card?\nIf yes, then remove U3560 and see what happens; w\/ and w\/o airport card."}
{"post_id":74642,"thread_id":61087,"title":"3476 Wont stay off after shutting down.","user_id":26621,"username":"grmacs","post_date":"2021-04-24 15:07:09","message":"Yes. tested out of the mac no IO FLEx\/Board connected.\n\nOk. I;ll pull and test"}
{"post_id":74645,"thread_id":61087,"title":"3476 Wont stay off after shutting down.","user_id":26621,"username":"grmacs","post_date":"2021-04-24 15:35:16","message":"Mark this as solved. Replacing U3560 fixed the problem. There were no signs of corrosion or liquid in that area that I could tell but it is now good!  \n\nThank you for the excellent help!"}
