{"post_id":24222,"thread_id":24222,"title":"[SOLVED]820-3437 no image \/ no backlight","user_id":90,"username":"ytesfay80","post_date":"2017-08-12 23:39:39","message":"This board was sent to me as no backlight after liquid damage. For some reason I didn't even check to make sure there was an image before replacing everything.  I replaced that entire area around the lcd connector and the connector as well as the lp8550 and the LVDS cable.\n\nI am getting 0v on backlight while U8300 has around 3.3v on pins 1-5. Here are some other measurements I got.\nJ8300:\nPin 3\/4 - 0v\nPin 15 - 2.67v\nPin 16 - 3.28v\nPin 18\/19 - 3.3v\nI get 2.5v on BLK_PWM but 0v on BKL_EN\nDiode Mode on Backlight output caps - 0.59v\n\nFor some reason when I turn the machine on I can see the LCD slightly changing colors as if the screen turned on and I can see a faint color change when I turn it off but I don't see any image on the screen. \nI don't have another display to test with but I plugged in an 11\" lcd only with another lvds cable and I was able to see an image on the screen either when putting a flashlight to it."}
{"post_id":24233,"thread_id":24222,"title":"[SOLVED]820-3437 no image \/ no backlight","user_id":90,"username":"ytesfay80","post_date":"2017-08-13 19:08:25","message":"Okay I managed to get a known working display assembly to test with and the same thing happened. I can see a slight change in the darkness of the screen but no backlight comes on and I dont see an image when I put a flashlight on the apple logo.\n\nCould this be an issue with the LED Driver because before I put another one on I accidentally ripped the pad for BKL_PWM but I ran a wire for it and BKL_PWM is 2.5v.\nWhat would cause no image even though the lcd is recognized and getting voltage at the connector?\n\nUpdate: I took a look at the led driver at an angle and I saw that the balls for BKL_ISEN1 and BKL_ISEN2 were melted together. I think the reason is because when I ripped the pad for BKL_PWM I scratched a little too deep so when I put the new driver on there was a slope making it hard for the chip to sit correct.\n\nI removed U7701 and powered on the board with a 11\" lcd only and I still was not able to see any image but again I got 3.3v on both sides of L8304."}
{"post_id":24260,"thread_id":24222,"title":"[SOLVED]820-3437 no image \/ no backlight","user_id":2,"username":"dukefawks","post_date":"2017-08-14 13:09:24","message":"Test it with a known good 13\" screen. Without LP8550 you should get a question mark after 30 seconds."}
{"post_id":24268,"thread_id":24222,"title":"[SOLVED]820-3437 no image \/ no backlight","user_id":90,"username":"ytesfay80","post_date":"2017-08-14 13:27:18","message":"[QUOTE=\"ytesfay80, post: 24233\"]Okay I managed to get a known working display assembly to test with and the same thing happened. I can see a slight change in the darkness of the screen but no backlight comes on and I dont see an image when I put a flashlight on the apple logo.[\/QUOTE]\n\nNo question mark folder ever appeared and I already tried replacing the connector on the board but still the same thing happens.\nI tried again and waited over a minute and no question mark folder appeared. The cpu gets warm and I get a chime."}
{"post_id":24286,"thread_id":24222,"title":"[SOLVED]820-3437 no image \/ no backlight","user_id":2,"username":"dukefawks","post_date":"2017-08-14 20:32:05","message":"Check for missing caps in the eDP lines to LCD connector. Also check soldering of the connector and check continuity to the end of a separate LCD cable."}
{"post_id":24294,"thread_id":24222,"title":"[SOLVED]820-3437 no image \/ no backlight","user_id":90,"username":"ytesfay80","post_date":"2017-08-14 22:39:50","message":"wow I don't know how this happened but C8320\/21 were missing from the board. I put them on from a donor board and put a new LP8550 on and now everything is working fine.\n\nThanks a lot duke."}
