{"post_id":17953,"thread_id":17953,"title":"820-00165, Pin 4 of U7501 .118v","user_id":515,"username":"SMMRepair","post_date":"2017-04-07 12:34:03","message":"I fucking HATE these 820-00165 boards. They seem to break for no god damn reason, or they're so fragile they just die if you look at them wrong.\n\nI'm working on an 820-00165 that had no liquid, but won't turn on. Measuring around, I get all my s5 voltages, and s5_pwrgd is present at R8141, but my pin 4 (P5VS4RS3_EN_R) of U7501 is .196v. I can't recall what the enable voltage should be here, but I'm pretty sure it should be 3.4v. I changed U7501 and Q7520 together, and there's no change.\n\nI hate this model board, and have no clue where to go next. My other enables are present on U7501, but I believe this missing enable voltage is why I have no power.\n\nThanks in advance for any help."}
{"post_id":17955,"thread_id":17953,"title":"820-00165, Pin 4 of U7501 .118v","user_id":36,"username":"aprendiz","post_date":"2017-04-07 13:02:59","message":"PM_SLP_S4_L present even for a second???? PPVRTC_G3H present?? Voltage on R1300-R1303 both pins???"}
{"post_id":17956,"thread_id":17953,"title":"820-00165, Pin 4 of U7501 .118v","user_id":515,"username":"SMMRepair","post_date":"2017-04-07 13:34:13","message":"Thanks, Aprendiz. You're always a good help:\n\nPM_SLP_S4_L is at 0v, I don't see a pulse. When I measured it the first time, it gave me .198--the same reading as pin 4 of U7501. Now I just re-measured it, and it's at 0v, and now so is pin 4 of U7501.\n\nVRTC is present (3.3v). Voltage at R1300 pin 1: 3.3v, pin 2: 3.16v; R1301 pin 1: 3.3v, pin 2: 3.06v; R1302 pin 1: 3.3v, pin 2: 3.3v; R1303 pin 1: 3.3v, pin 2: 3.3v."}
{"post_id":17961,"thread_id":17953,"title":"820-00165, Pin 4 of U7501 .118v","user_id":2,"username":"dukefawks","post_date":"2017-04-07 13:45:28","message":"These boards will power cycle when anything is wrong in the power circuit. I doubt this \"just\" failed, check for corrosion in the usual spots, SMC, U6100, U1950."}
{"post_id":17964,"thread_id":17953,"title":"820-00165, Pin 4 of U7501 .118v","user_id":515,"username":"SMMRepair","post_date":"2017-04-07 13:59:33","message":"Thanks duke. Yes, I've inspected the board incredibly well. Nothing looks bad at all. Only thing I can find is that pin 4 of U7501 is now 0v. It was .118v the very first time I measured it, then it went up to .198v, now it's a solid and steady 0v. All I've done is replace U7501 and Q7520. I'll probably just ditch this one and move on, it's seeming like a nightmare."}
