{"post_id":102033,"thread_id":64265,"title":"820-01949 not charging","user_id":1427,"username":"Narek","post_date":"2023-10-17 10:21:06","message":"Board has slight liquid damage on U3100 chip (photo). I’ve replaced the chip itself (CD3217B12) and other SMD components around, checked resistances and traces - all fine. Computer is turning on and working, but does not charge the battery (doesn’t even detect charger connected). With battery disconnected it takes 5V and ~ 0,30A, doesn't switch to 20V. With battery connected it swiches to 20V but takes constant ~0.024A. PPBUS without battery is 12,26V, with battery is 11,22V. I have replaced U3100 again as well as U7000. R7061\/2 are fine. SYS_DETECT is 3,3V but SYS_DETECT_L is 0V no matter if battery is connected ot not. I’ve replaced Q6955. I have also tried new battery, but with no results. I'm wondering, maybe UB260 got damaged? I've resoldered it, all traces were OK, but who knows...Or maybe Q7065?"}
{"post_id":102051,"thread_id":64265,"title":"820-01949 not charging","user_id":682,"username":"2informaticos","post_date":"2023-10-18 09:57:50","message":"The machine turns on and works without battery connected?\n\nSeems that you have problems on USB-C areas.\nAll USB ports have the same behavior?\nCompare diode mode on LDOs of all CD3215 chips."}
{"post_id":102068,"thread_id":64265,"title":"820-01949 not charging","user_id":1427,"username":"Narek","post_date":"2023-10-19 06:33:22","message":"No, it doesn't turn on without battery, but I think it's typical for these models - they need battery to turn on. \n\nAll USB-C ports behave the same and LDOs on all USB-C controllers are the same with good readings."}
{"post_id":102072,"thread_id":64265,"title":"820-01949 not charging","user_id":682,"username":"2informaticos","post_date":"2023-10-19 16:12:51","message":"MLB must switch to 20V without battery; even not turning on.\nSo you have USB-C areas problem.\n\nDFU can correct such problem sometime."}
{"post_id":102722,"thread_id":64265,"title":"820-01949 not charging","user_id":1427,"username":"Narek","post_date":"2023-11-24 07:42:46","message":"Update for this board...\n\nSo I was working on another board - 820-02020 with very similar issue. After replacing one of the USB-C controllers board was not switching to 20V an not charging battery. Trying different controllers I found out, that [B]controller had to be pulled from M1 board[\/B], in my case donor also was 820-02020. After that, board switched to 20V and was charging battery correctly.[B] I think they could be programmed for working on specific board[\/B], as their output layout on difrent schematics are different (i.e. controllers on 820-01949 have diffrent output than 820-01700). So I decied to go back to 820-01949 board and check my theory,\n\nI got fully working donor 820-01949 which I took one one controller from (U3100_R). Destination board still didn't switch to 20V. So I have replacend another one (U3100_W) - also nothing. But when I replaced UB260 it magically started switching to 20V. But funny part is, that this board doesn't charge or work off original battery which computer came with (though is detected in the system). It's charging and working from new battery. I have tested the original battery with another, fully functional board - it's charging the battery correctly. So I thought another USB-C controllers which I haven't replaced yet may cause this malfunction. I have replaced them  as well including U3060 and another U7000. Sadly there are no changes - original battery won't charge and as soon as I disconnect charger computer shuts down. Another battery is charging fine. But again - original battery is being charged by another, untouched board. Could somebody explain this to me? I have tried DFU restore and another battery flex cable but it hasn't changed anything. The rest of the board looks really good, no damages or corrosion."}
