{"post_id":37756,"thread_id":37756,"title":"820-00840 no GPU vcore.","user_id":637,"username":"TCRScircuit","post_date":"2018-07-30 18:39:17","message":"Got a 00840 trolling me. Came in no liquid with a history of a dog biting it. First thing I checked was output on external. Nothing, Unplugged the screen and tried again. Nothing. This was with a genuine apple usb c to vga dongle. Checked CPU vcore... 0.94 volts. GPU vcore - 0v. Missing GTVR_FCCM. I thought it was U7100, replaced it with no change. PPBUS_S0_CPU drops to 0v every 30 secs then goes back up only near the GPU fets.  I cant find a 00840 schematic so im using a 00875 schematic which is close. GPU is not shorted. \n\nAt this point, i dont know what more it can be. I'm guessing fets, but I dont want to put heat to that area if I dont have to. Anything else I can check before replacing the FETs and U7100 again?"}
{"post_id":37828,"thread_id":37756,"title":"820-00840 no GPU vcore.","user_id":2,"username":"dukefawks","post_date":"2018-07-31 18:37:22","message":"Is a USB mouse lighting up? This is not looking good :("}
{"post_id":37855,"thread_id":37756,"title":"820-00840 no GPU vcore.","user_id":637,"username":"TCRScircuit","post_date":"2018-07-31 21:54:46","message":"I'll check for USB mouse. Part of me thinks the GPU isnt talking to U7100 to enable vcore... crap boards"}
{"post_id":37884,"thread_id":37756,"title":"820-00840 no GPU vcore.","user_id":1748,"username":"patrickribbsaeter","post_date":"2018-08-01 02:10:19","message":"[QUOTE=\"TCRScircuit, post: 37855\"]I'll check for USB mouse. Part of me thinks the GPU isnt talking to U7100 to enable vcore... crap boards[\/QUOTE]\n\nWill send u a email now with information."}
{"post_id":37908,"thread_id":37756,"title":"820-00840 no GPU vcore.","user_id":637,"username":"TCRScircuit","post_date":"2018-08-01 15:32:13","message":"USB mouse flashes for a brief second so something is defiantly up with POST and the CPU. Im guessing its not posting because of GPU vcore being missing. Now to what FCCM means I have no idea. Im going to look around at similar intersil\/renesas chips and see if I can figure out what that pin does. I know its suppose to be 5v. Maybe the FETs are messed up. I dont know, but if the fets are messed up, the GPU could have gotten killed. Hard to say on this one. Ill keep digging."}
{"post_id":37936,"thread_id":37756,"title":"820-00840 no GPU vcore.","user_id":637,"username":"TCRScircuit","post_date":"2018-08-01 21:05:03","message":"I give up. I checked the circuit high at low. Nothing. My only guess is the CPU isnt requesting GPU vcore. It has a SDA line that goes right to the processor. Anyway, this gets 4 min each side at 70c in the USC and if it doesnt work, RIP."}
{"post_id":38004,"thread_id":37756,"title":"820-00840 no GPU vcore.","user_id":637,"username":"TCRScircuit","post_date":"2018-08-02 19:39:46","message":"So, FCCM is a apple term for ZCD enable - Automatic skip mode operation (ZCD) for light load efficiency. Irrelevant because we arn't even getting core voltage. Going to look at the PWM side of things now"}
{"post_id":38006,"thread_id":37756,"title":"820-00840 no GPU vcore.","user_id":637,"username":"TCRScircuit","post_date":"2018-08-02 20:28:21","message":"PWM 1 messed up. 5v to 0 and cycles. Cant get the SIC635 in the us so I will use SIC631s. Replacing all my fets plus the controller again."}
{"post_id":38032,"thread_id":37756,"title":"820-00840 no GPU vcore.","user_id":2,"username":"dukefawks","post_date":"2018-08-03 16:29:51","message":"You don't even know if the controller is being told to turn on. Serial data communication with CPU\/GPU will enable the regulator. Maybe you get lucky but this is a bit more sophisticated than just measuring PWM output signals."}
{"post_id":38308,"thread_id":37756,"title":"820-00840 no GPU vcore.","user_id":637,"username":"TCRScircuit","post_date":"2018-08-11 01:30:15","message":"No Title\n\nIT'S ALIVE!!! ....but with a cracked screen . :("}
{"post_id":38328,"thread_id":37756,"title":"820-00840 no GPU vcore.","user_id":637,"username":"TCRScircuit","post_date":"2018-08-12 01:53:03","message":"It croaked about a millisecond under gpu load. Board bubbled up from a internal short near the CPU and one of the GPU fets shorted ppbus to vcore. RIP."}
