{"post_id":51749,"thread_id":51749,"title":"820-3332 (R6920 is Burning hot)","user_id":1748,"username":"patrickribbsaeter","post_date":"2019-08-27 23:35:42","message":"Hi, 820-3332 Macbook retina 15\"\n\nbeen working on the board for some time now, and it seems new problems keep coming up.\n\ncurrently R6920 which is a 47 ohm resistor for (PPDCIN_G3H_ISOL) ITS BURNING HOT. its boiling.. and ive changed it twice..\n\nI do get the greenlight on charger with 0.260mA.. Ive also changed D6905 and also changed U6990 for PP3V42..\n\nWhat could be causing the resistor to burn so hot(like it was shorted but its not)..???\n\nthanks"}
{"post_id":51756,"thread_id":51749,"title":"820-3332 (R6920 is Burning hot)","user_id":682,"username":"2informaticos","post_date":"2019-08-28 04:28:06","message":"If it has correct ohm value, then overcurrent is the reason to heat it.\nDo you get correct and stable 3V42 at C6999?\nPost C6991\/93 voltage; one of them can have leakage, may need to change."}
{"post_id":51762,"thread_id":51749,"title":"820-3332 (R6920 is Burning hot)","user_id":1748,"username":"patrickribbsaeter","post_date":"2019-08-28 08:20:54","message":"1. I have changed all 3 caps(C6999, C6991\/3).. C6999 = zero volt on both pins. C6999 in continuity mode beeps on both sides to ground. How is that possible when the cap is not broken\/nor shorted?\n\n2. I reballed the SMC earlier because that one was creating issues with P5VS4_EN to U7201.\n\n3. Still getting 0.260mA with dc supply.\n\n4. The problem still remain, why is the R6920 fuming hot. Could it be another IC further down the line after PP3v42.. because i have green light on the charger."}
{"post_id":51765,"thread_id":51749,"title":"820-3332 (R6920 is Burning hot)","user_id":1153,"username":"JohnB8812","post_date":"2019-08-28 08:43:39","message":"Inspect all chips with 3v42 including U1900 I had that happen once"}
{"post_id":51766,"thread_id":51749,"title":"820-3332 (R6920 is Burning hot)","user_id":1748,"username":"patrickribbsaeter","post_date":"2019-08-28 09:20:36","message":"Thanks, John, but there's is no U1900 on this board..? 820-3332.. perhaps u mean another IC?"}
{"post_id":51767,"thread_id":51749,"title":"820-3332 (R6920 is Burning hot)","user_id":1748,"username":"patrickribbsaeter","post_date":"2019-08-28 10:25:39","message":"Update: This is going to sound funny. Never happened to me before. But I happen to put the SMCin the wrong direction. GO FIGURe why the short :)\n\nBut I came to solve that by John giving me the advice on checking for shorts on all PP3v42. So thanks John to you. I'm going to solder on a new SMC and see what happens."}
{"post_id":51769,"thread_id":51749,"title":"820-3332 (R6920 is Burning hot)","user_id":682,"username":"2informaticos","post_date":"2019-08-28 10:33:28","message":"\"C6999 in continuity mode beeps on both sides to ground. How is that possible when the cap is not broken\/nor shorted?\"\nVery possible, if you measure with charger, or battery connected.\nAlso possible if you have lower value than 075 on diode mode (depending of multimeter); which is not good.\nDiode mode on 3V42 rail is aprox 300, with red probe to ground.\n\n\"C6999 = zero volt on both pins\"\nDo you mean completely shorted?\nPost exact value on diode mode.\nLift L6995 and check where the short remains; if is the case.\n\nAnd please, respond to questions...\n\"Post C6991\/93 voltage\""}
{"post_id":51772,"thread_id":51749,"title":"820-3332 (R6920 is Burning hot)","user_id":1748,"username":"patrickribbsaeter","post_date":"2019-08-28 11:03:12","message":"1. I have now PP3v42 stable after changing the SMC which I had put in the wrong direction. I placed a brand new SMC.\n2. The computer draws 19v and power cycling between 1.200\/300amp. The fan is spinning ok.\n3. But no image - still missing\n\nSo i will keep hunting the issue and revert back to you guys.\n\n2informaticos --> Yes, I should have posted the voltages you asked for. The issue was with the SMC being upside down. Thank you for answering my previous questions, greatly appreciated. The DC supply was attached when I did the continuity mode, so that explains it. thx!"}
{"post_id":51776,"thread_id":51749,"title":"820-3332 (R6920 is Burning hot)","user_id":1748,"username":"patrickribbsaeter","post_date":"2019-08-28 14:39:02","message":"Case open again!!!"}
{"post_id":51781,"thread_id":51749,"title":"820-3332 (R6920 is Burning hot)","user_id":1748,"username":"patrickribbsaeter","post_date":"2019-08-28 18:47:03","message":"HEY EVERYONE. I DECIDED TO CONTINUE THIS THREAD AND DECIDED TO FIX THE LAPTOP ANYWAY. (NEVER GIVE UP)\n\nI decide to not give up on the motherboard. Giving up its not the way to success and not the way to learn things. So I spent nearly 3 hours extra fixing the left Fan. I used the hot air gun to take away the broken plastic connector for the fan, it had melted earlier a bit so it did not function... I then jumped wires from under the fan cable directly on its voltage lines and then to the respective location, I added the green coating first on all the cables so they wouldn't short each other. I first didn't connect it to ground as well, so the fan didn't start first. I didn't connect ground, so I thought that might be an issue. Like powering up a computer by shorting it to ground, so I thought the fan might need this too. I redid everything, wires, soldering and this time with ground connected, I also changed the SMC one more time just in case. Now the fan is back on working again and computer power on --> 20v, 1.200amp, Wil now see if I get any display.\n\nA lesson for anyone reading this: Do not give up when it gets hard, re-think, take a breather, go out for a walk, come back with the attitude you can solve the problem and spend that extra time honing it on it. I also learned a couple of few new things from fixing this problem. So it was a blessing in disguise.\n\nI will revert back asap with voltages lines if I don't get any display. meantime I post two images of the fan connector with wires, should anyone of u guys run into the same problem."}
{"post_id":51790,"thread_id":51749,"title":"820-3332 (R6920 is Burning hot)","user_id":682,"username":"2informaticos","post_date":"2019-08-28 19:12:16","message":"Be aware of bench power supply used for MacBooks.\nIf you connect the Magsafe a bit angled, risk to fry the SMC.\nOriginal Magsafe 1 delivers only 6V before the board is recognized by the charger, and Magsafe 2 just 3V."}
{"post_id":51801,"thread_id":51749,"title":"820-3332 (R6920 is Burning hot)","user_id":1748,"username":"patrickribbsaeter","post_date":"2019-08-28 21:09:24","message":"Thanks, 2Informaticos.. very valuable information to know. I did have some issues problem when I come to think about it which you mention it herw about the SMC.  Im checkign this board now and will revert back here, so far I have no display or image.. black screen.."}
