[
    {
        "post_id":88169,
        "thread_id":62552,
        "title":"820-01598 water damage",
        "user_id":386,
        "username":"wirelessplanet",
        "post_date":"2022-03-31 15:11:42",
        "message":"Came in heavily corroded.  I ultrasonic cleaned and reaplced both bad CD3217 and now computer is turning on.  everything is working execpt there is no sound.  sound is being detected in system prefs but sound is coming out of speakers.  i found a couple of shorts around u6400 so i removed it and shorts went away.  replaced it and all is good, but still not getting sound.  the only issue is a short to ground on spkramp_rl_mode.  i replaced u6400 again and replaced r6481 but still same issue.  if i remove the resistor the short to ground goes away. i  am at a loss on this.  did i get 2 bad chips?  is this suppose to show short to ground?. i don't think so becuase spkramp_fl_mode is not on u6450 side."
    },
    {
        "post_id":88173,
        "thread_id":62552,
        "title":"820-01598 water damage",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-03-31 15:56:33",
        "message":"R6481 is 0 ohm resistor, CONNECTED to ground; what value did you expect to get there?\n\nCorrosion under (or around) U6400\/50 is very dangerous; several T2 lines are connected there.\nLeakage from PPBUS_G3H damaged T2."
    },
    {
        "post_id":88174,
        "thread_id":62552,
        "title":"820-01598 water damage",
        "user_id":386,
        "username":"wirelessplanet",
        "post_date":"2022-03-31 16:34:24",
        "message":"Just trying to understand here.  if t2 was damaged wouldn't that stop the laptop from powering on?  and second question.  Since c6406 was short to ground (PPBUS_G3H_SPKRAMP_LEFT) wouldn't that have stopped power from going to t2?"
    },
    {
        "post_id":88177,
        "thread_id":62552,
        "title":"820-01598 water damage",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-03-31 23:45:02",
        "message":"T2 is a complex chip; it may get partial damage only.\nOne time I got 01521 with SPKRAMP_RESET_L shorted to ground because of liquid spill on audio board.\nMachine had even heaphones sound, but nothing on internal speakers.\n\nThere was sufficient time for leakage to T2 lines, before C6406 shorted PPBUS_G3H..."
    },
    {
        "post_id":88206,
        "thread_id":62552,
        "title":"820-01598 water damage",
        "user_id":386,
        "username":"wirelessplanet",
        "post_date":"2022-04-01 11:21:22",
        "message":"[QUOTE=\"2informaticos, post: 88177, member: 682\"]\nMachine had even heaphones sound, but nothing on internal speakers.\n[\/QUOTE]\n\nis the same issue on this board.  is there any way to test to make sure t2 is bad?  should i take u6400 off and test the lines?"
    },
    {
        "post_id":88215,
        "thread_id":62552,
        "title":"820-01598 water damage",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-04-01 12:34:41",
        "message":"I don't see other reason, as you found corrosion there.\n\nSome lines may have test points, or external components connected.\nOther lines can only be accessed under audio amps.\nHowever, is wasting time to remove the chips; the problem is clear..."
    },
    {
        "post_id":88539,
        "thread_id":62552,
        "title":"820-01598 water damage",
        "user_id":386,
        "username":"wirelessplanet",
        "post_date":"2022-04-11 13:31:26",
        "message":"just for an update on this case.  i ordered a donor board and dioded tested all the pads comparing to the working board.  found a reading that was off and found a resistor that was not to spec.  replaced it along both chips and now have speakers.  moral of the story is test all the lines :)"
    }
]