{"post_id":46493,"thread_id":46493,"title":"820-3787 No image","user_id":2316,"username":"Naevius","post_date":"2019-02-20 08:26:49","message":"I have a 820-3787 board that doesn't display any image, also no backlight activation for that matter.\n\nSomeone unskilled has clearly messed with this before, since one of connectors on the wifi module has been ripped off, some of those pogo-pins for connection to the bottom plate have been ripped off (how the crap do you even get to do that?) and there is clearly some solder flux around the GPU, so the GPU has probably been reflowed.\n\nWater damage indicator on U2800 has been activated, can't see any water damage tho. Can't find any other water damage indicators on this board, so have probably been removed.\n\nThe system chimes, so it clearly tries to boot up. PPVCC_S0_CPU = 1.77V. The fans spin at full speed.\n\nNo image at all, also tried external.\n\nNot sure how to work from here. My fear is that at least the GPU is fried by the unskilled person that has worked on this. I know the fans spin at full speed if the SMC can't properly communicate with one of the sensors or the trackpad for example, but is this also the case when it detects the GPU is bad?"}
{"post_id":46495,"thread_id":46493,"title":"820-3787 No image","user_id":682,"username":"2informaticos","post_date":"2019-02-20 09:43:38","message":"I don't recommend you to waste time on this board.\nIf fan spins at max with all perypherals connected, there are more problems than video; like this wasn't already too much...\n\nIf chimes, you can try to confirm USB activity.\nBut is pretty hopeless project."}
{"post_id":46498,"thread_id":46493,"title":"820-3787 No image","user_id":2316,"username":"Naevius","post_date":"2019-02-20 11:03:53","message":"There is USB activity while booting. So might be worth to look at least a little further maybe?\n\nIs there a way to determine if the GPU is bad or there is no \"activation signal\" for the image?"}
{"post_id":46500,"thread_id":46493,"title":"820-3787 No image","user_id":682,"username":"2informaticos","post_date":"2019-02-20 11:12:10","message":"Missing both internal\/external video, points to GPU.\nExternal monitor is allways driven by GPU..."}
{"post_id":46501,"thread_id":46493,"title":"820-3787 No image","user_id":1153,"username":"JohnB8812","post_date":"2019-02-20 11:58:45","message":"\"Is there a way to determine if the GPU is bad\"  Someone reflowing it is usually a good start lol. As 2 informaticos advised, this is a time waster. One I would send back and charge a labor fee for."}
{"post_id":46513,"thread_id":46493,"title":"820-3787 No image","user_id":2316,"username":"Naevius","post_date":"2019-02-20 16:16:07","message":"Ok, I'll stop with this board then. Always feels bad when something can't really be fixed.\n\nThanks for the info."}
{"post_id":46514,"thread_id":46493,"title":"820-3787 No image","user_id":1153,"username":"JohnB8812","post_date":"2019-02-20 16:22:38","message":"It's not so much a it can't be fixed as much as a it's not worth the headache\/time\/effort\/money\/customer complaining about warranty issues etc. When people screw with the board, repair % chances go way way down especially when they rehot CPU\/GPU\/PCH etc."}
