[
    {
        "post_id":35965,
        "thread_id":35965,
        "title":"Question about SMC & Inconsistent Power",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2018-06-19 11:24:47",
        "message":"Before I got to replacing SMCs unnecessarily, I wanted to ask a quick question:\n\nWe have boards come through occasionally with a note of \"no power\", and we test them and they work great. Having made this mistake in the past, we no longer sell them off or send them out when they work fine and pass our tests (if they had a note of \"no power\"), because a lot of the time they end up coming back a week or two later with the same issue--random \"no power\". Having set the boards into test units and waited for the issue to occur, it became obvious the issue was the SMC, as ppbus would be 12.26v whenever they refused to power on. This is with all different model boards over the past year or two. I've just set them aside because I'm not always in the mood to replace an SMC...and because I wasn't sure if it was \"bad SMC\" or just possibly cracked balls underneath.\n\nSo my question is: Is this issue (inconsistent power--board\/unit will work well for weeks then suddenly no power, with 12.26v ppbus) more likely to be a BAD SMC, or simply cracked balls underneath? Or both (some bad, some cracked balls)? When they power on (after sitting cold a while), they work great and pass all tests perfectly (which leads me to suspect the SMC itself is fine). I'm curious because ideally I'd go through and just reflow them all in one go and be done with it. Of course, this leaves open the possibility of the SMC being faulty and needing replacing, and the board coming back again. On the other hand, I'd hate to assume all the SMCs are bad and have to replace 15-20 to get the boards back out. Please note that none of these are liquid-damaged, just boards that will work fine for a week or two then stop powering on. Exact same issue\/symptoms, definitely an SMC issue.\n\nThoughts? I know this is a broad question, but I was hoping maybe someone has a large enough sample size of this issue by now to have learned if it's \"usually\" one or the other--bad chip or cracked balls. Thanks as always!"
    },
    {
        "post_id":35977,
        "thread_id":35965,
        "title":"Question about SMC & Inconsistent Power",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-06-19 20:32:39",
        "message":"I would more suspect corrosion under the SMC or corrosion pulling down SMC_RESET. Need to check if SMC_RESET has a problem first."
    }
]