[
    {
        "post_id":101731,
        "thread_id":64224,
        "title":"01949 No Power",
        "user_id":1423,
        "username":"captainmac",
        "post_date":"2023-09-26 07:25:16",
        "message":"Am struggling a little today with this board and need some clearheaded suggestions; had a couple in a row and can't think straight:)\n\nBoard might have had some work done on it, but i think i spotted all the mistakes (some coils of PMIC were taken off, but so far i don't know why, nothing else seemed missing.)\nall USBC ports draw 5V steady and seem to have all their LDOs out of the port controllers.\n\nPPBus was cycling quickly from 0 to 12.3V, along with PP3V3_G3H_RTC constantly trying to come up with some voltage (too quick to read)\nI first removed R9707: Enable for U6903 was cycling as well, so i took it off and then PPBUS Stabilizes to 12.3V\nI then thought my U6903 was bad (also because it looked to be cycling up to 2.7V and not to 3.3V, which is odd), diode-mode on C6912 was reading just a little low as well so i replaced U6903 (for the second time), and put back R9707:\nNow output at C6912 is again cycling from 0 - 2.7V, as well as PPBUS cycling again.\n\ni took off R6934\/35 to see if there was a difference, and when these fuses are off, i get steady 3.3V at C6912.\nI then thought, there must be a short after R6934\/35 on PP3v3_G3H_RTC, but i cant find it, diode mode is OK at around .380\n\nany idea what is causing this, or am i missing some steps?\nThanks in advance!"
    },
    {
        "post_id":101732,
        "thread_id":64224,
        "title":"01949 No Power",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-09-26 10:13:51",
        "message":"You may have short, or overcurrent on a secondary power supply.\nNeed to change all circuits from pages 54-64..."
    },
    {
        "post_id":101787,
        "thread_id":64224,
        "title":"01949 No Power",
        "user_id":1423,
        "username":"captainmac",
        "post_date":"2023-09-29 07:41:15",
        "message":"Found a short on PP3V3_G3H_VDDMAIN Inside the U7800 chip (tested with multimeter on its pins)..\nI don't have a donor board for this unfortunately, are any other boards' calpe chips compatible?"
    },
    {
        "post_id":101788,
        "thread_id":64224,
        "title":"01949 No Power",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-09-29 08:58:53",
        "message":"Yeah, the PMIC should from other model."
    }
]