[
    {
        "post_id":36454,
        "thread_id":36454,
        "title":"820-4924-A (Retina 2015) Running Slow",
        "user_id":1450,
        "username":"rkrishnan",
        "post_date":"2018-06-30 20:48:43",
        "message":"Hey,\n\nI got an 820-4924-A motherboard with possibly some liquid damage and just did a Bios ME Region clean (since it had an EFI lock in it). Battery charges and it runs off battery so I was happy, but now I am running into a new issue.\n\nThe system is running very slow and kernel_task is using up majority of the CPU. When I run ASD it gives the codes PFM006, and PPN001. I installed iStat and found the Left Fin Stack sensor and air flow proximity sensor area reading as empty.\n\nCould you please point me what I should check for? I am out of ideas on what to test since ASD isn't giving useful information. I already checked I2C_CPUTHMSNS_SDA and I2C_CPUTHMSNS_SCL don't have a short to ground, and PP3V3_S0_CPUTHMSNS_R is getting 3.3v.\n\nI also can't find where the Th1H sensor is located on the motherboard with the schematic.\n\n\nThanks!"
    },
    {
        "post_id":36456,
        "thread_id":36454,
        "title":"820-4924-A (Retina 2015) Running Slow",
        "user_id":36,
        "username":"aprendiz",
        "post_date":"2018-06-30 22:10:04",
        "message":"There is no need to mess with ME region if EFI lock, use original ME......"
    },
    {
        "post_id":36462,
        "thread_id":36454,
        "title":"820-4924-A (Retina 2015) Running Slow",
        "user_id":1450,
        "username":"rkrishnan",
        "post_date":"2018-07-01 07:56:41",
        "message":"Sorry I meant I cleared the part part between the $SVS tags, I thought that was the ME region. I didn't touch anything else."
    },
    {
        "post_id":36464,
        "thread_id":36454,
        "title":"820-4924-A (Retina 2015) Running Slow",
        "user_id":1450,
        "username":"rkrishnan",
        "post_date":"2018-07-01 08:31:18",
        "message":"Fixed! One of the resistors (R5875) near the right fin stack on the schematic was loose and fell off. Soldered it back on and it works again :)"
    },
    {
        "post_id":36471,
        "thread_id":36454,
        "title":"820-4924-A (Retina 2015) Running Slow",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-07-01 09:13:28",
        "message":"What did you do to the ME? The methods posted that you find with Google are totally wrong!"
    }
]