{"post_id":25096,"thread_id":25096,"title":"820-2915 No PPBUS No PP3v42","user_id":651,"username":"RyanLEN","post_date":"2017-09-07 15:17:19","message":"Hi. When I started this board I had PP3v42 but with no green light and no PPBUS. PP3v42 was 3.42V and PPBUS was shorted to ground.ISL was getting hot so I removed it and replaced ISL. I checked PPBUS in diode and most of the short was almost gone (0.386) but still no PPBUS. I plugged in the battery and that caused new ISL to short. PPBus was .012 in diode at this point. Removed new ISL and was back to 0.386 in diode on PPBUS. Plugged in battery with ISL removed and got PPBUS. Then I plugged in the charger as well and got green light for like 10 seconds but no fan spin. Then it turned off. Now things are worse than when I started. I have no PPBUS and no PP3v42. Voltage on F6905 is .475 now with new DCIN board. So Im not getting any power whatsoever. Not sure where to go from here. Thanks in advance. Have a good one.\n\n\nUpdate: PPDCIN shorted to ground as well.\n\nUpdate: Short was on Q7030 & Q7035. Now I have voltage back. PP3v42 is back with a green light. Replaced ISL and now I have PPBUS @ 12.6V. But still no fan spin."}
{"post_id":25100,"thread_id":25096,"title":"820-2915 No PPBUS No PP3v42","user_id":36,"username":"aprendiz","post_date":"2017-09-07 16:57:36","message":"Of course!!! never apply voltage to a buck power supply without the controller (ISL6259), the mosfets will not know what to do and will send all the voltage applied to the circuit or to ground and something will be burnt...\n\nPP3V3_S5??"}
{"post_id":25108,"thread_id":25096,"title":"820-2915 No PPBUS No PP3v42","user_id":651,"username":"RyanLEN","post_date":"2017-09-07 17:34:32","message":"Hey man, how are ya? Thanks. LOL... OK. Lesson learned. With charger only I had PPBUS G3H, PP3v42, pp3v3. I was about to check pp5v_so and U7100 started to boil, as well as C7553 and C7561. U7000 also got very hot and I think its blown again. VIAs around u7000 are pretty discolored now. PPBUS is missing again. Diode mode is O.L. on PPBUS now. And just when everything was starting to look up. LOL. Thanks alot for the response."}
{"post_id":25123,"thread_id":25096,"title":"820-2915 No PPBUS No PP3v42","user_id":2,"username":"dukefawks","post_date":"2017-09-07 19:21:17","message":"The battery can only blow the ISL through the data bus. This battery is a killer and is the first thing to go in the trash. Also SMC probably got killed"}
{"post_id":25130,"thread_id":25096,"title":"820-2915 No PPBUS No PP3v42","user_id":651,"username":"RyanLEN","post_date":"2017-09-07 19:48:50","message":"No battery, only charger. plugged in on last attempt. I had PPBUS which seemed a little low in diode mode (.386) and PP3V42 both which I didnt have to begin with. Green light wassolid then started pulsing. All of a sudden U7100 , C7553 & C7561 boiled. Im not sure yet about ISL, I had to leave. I now have PP3V42 with solid green light but 0 V on PPBUS. Resistance on PPBUS is OL (infinite). So I'm not sure where to go from here. Thanks."}
{"post_id":25140,"thread_id":25096,"title":"820-2915 No PPBUS No PP3v42","user_id":651,"username":"RyanLEN","post_date":"2017-09-08 09:43:42","message":"Update. Starting over. Came in this morning and replaced Q7030 & Q7035, ISL and U7100.  In diode mode G3H is .428, PP3V42 is .332. U7100 has some lines that are beeping to ground. These are pins 10, 13, 16, 4 & 3. Im Fucked right?"}
{"post_id":25144,"thread_id":25096,"title":"820-2915 No PPBUS No PP3v42","user_id":289,"username":"smiba","post_date":"2017-09-08 12:19:40","message":"As you can see in the board view:\nPin 3 is quite literally ground, so thats to be expected.\nPin 4 (CCCSAS0_RTN) is supposed to be connected to ground.\nPin 10 isn't supposed to be ground though, depends on the resistance. Might want to replace U7100 if you can't find out why\nPin 13 is connected to ground through a 0 ohm resistor so its to be expected\nPin 16 (VCCSAS0_LL) is PPVCCSA_S0 before it goes through a coil and a resistor, so that has low resistance to ground. Its not supposed to be a direct short though. So that could mean you killed the CPU or dead U7100, but post resistance in ohm first.\n\nWhat is the resistance to ground in ohm for pin 10 and 16?\n\nI would not say you're fucked, but after reading this topic I wouldn't be surprised its going to be a pain to fix"}
{"post_id":25146,"thread_id":25096,"title":"820-2915 No PPBUS No PP3v42","user_id":651,"username":"RyanLEN","post_date":"2017-09-08 12:44:04","message":"Thanks man. Really appreciate the response and the explanation. That helps. Pin 10 is 0.6 Ohms and pin 16 is between 0.5 and 0.6 Ohm. I have replaced U7100. Just haven't put power to the board yet. Kind of hesitant to. I keep frying Q7030, Q7035 & ISL. Running out of parts, so I want to be sure nothing is going to blow before I do. What else should I check? Thanks again."}
{"post_id":25156,"thread_id":25096,"title":"820-2915 No PPBUS No PP3v42","user_id":2,"username":"dukefawks","post_date":"2017-09-08 15:33:20","message":"If U7100 got hot and fried I'm pretty sure the CPU got fucked too."}
{"post_id":25165,"thread_id":25096,"title":"820-2915 No PPBUS No PP3v42","user_id":651,"username":"RyanLEN","post_date":"2017-09-08 18:42:27","message":"Pin that keeps frying is 17 on U7100,  VCCSAS0_DRVH. Thats output. What can this be? Burned hole through Q7100.  ???   Thanks."}
{"post_id":25180,"thread_id":25096,"title":"820-2915 No PPBUS No PP3v42","user_id":289,"username":"smiba","post_date":"2017-09-09 18:00:28","message":"If there is a hole in Q7100 you can say goodbye to the CPU, its dead."}
{"post_id":25184,"thread_id":25096,"title":"820-2915 No PPBUS No PP3v42","user_id":651,"username":"RyanLEN","post_date":"2017-09-09 19:34:25","message":"Ok. Thanks again."}
