[
    {
        "post_id":43842,
        "thread_id":43842,
        "title":"2017 MacBook Pro Keyboard\/Trackpad warranty issue",
        "user_id":2149,
        "username":"womble123",
        "post_date":"2018-12-21 11:50:50",
        "message":"Hello all!\n\nMy keyboard started having problems a few months ago with some keys sticking or repeating themselves like the V, B and the Backspace mostly. I read about the extended warranty on the 2016\/17 models so I was aware that Apple knew about the problem.\n\nI called Apple (UK) and organised for it to be picked up and was sent to a authorised third party repair centre. A few days later I got a phone call saying that there was liquid damage on the trackpad. I had no knowledge of spilling anything on it ever. Anyhow they refused to fix the keyboard as its the 'same part' as the trackpad. You know, I know and they know its NOT part of it physically, its just that Apple states that its all one part.\n\nThey told me to call Apple and eventually I was put through to one of the senior people who pretty much told me I had to pay for the repair which would be a new top case costing around £560! I argued my position etc but It was like talking to a dumb elephant. Even though I had purchased the extended warranty, AppleCare and that I had paid around £2900 in total just over a year ago. I also mentioned I was a loyal customer as Im typing on a fully specced out (apart from the RAM being third party 32GB and the SSD only being 500GB) 2017 iMac which I use in my home office. I also have an iPhone, HomePod, AirPort Extreme etc etc. They just would not budge and found very frustrating as I have never had a problem with Apple before when it comes to warranty issues.\n\nSo I called back the third party people (this story is condensed by the way, this whole thing took multiple phone calls and about two hours) to ask them to send photos of the liquid damage and told them to go ahead with the repair but then about 15 min later I decided to cancel it as I remember the senior tech guy at Apple saying I could have it inspected by someone else for a second opinion.\n\nThe liquid...I have no idea what it is? I have two Labradors so my best bet is that I will of left the Mac open on the sofa or foot stool, rested there head on it as its warm and drooled...lovely. I have seen them do it before with the lid closed once. One of the tech guy's said that there was no other sign of liquid or stain areas, none of the white liquid dots had changed colour at all and that it was only on the removable trackpad.\n\nSo I cancelled the repair after seeing the photos and am thinking of buying a used trackpad from eBay and replace it myself as I have taken the cover off since it arrived back. I just watched a video and a ifixit teardown and was easy. I already had the drivers (P5 Pentalobe for the bottom and a T5 for the trackpad) from fixing something else Apple related in the past.\n\nSo after all that waffle, do you think Apple will fix the actual problem which means replacing the top case like they said they would of done if the trackpad didn't have liquid damage? Im going to do it anyhow as Apple offered it to go somewhere else to have a second opinion on it. As far I know there is no serial number etc on the trackpad? Also, is there any indicators that's its been opened like buttons that stay pushed in etc?!\n\nSorry for the long message, I am just looking for some support and really wish there was a option of going **** you Apple, Im going to use Windows! But I simply won't as I do generally really like there products etc which is a shame as this situation has really really annoyed me. I would of happily paid the cost of the trackpad even though it would be replaced.\n\nAnyhow, if you could give me what you think is the best advice for the above that would be fantastic. The way I see it is that it will go for a second opinion and there will be zero sign of liquid damage, all the the white dots will be white and the case clean. Im semi templed to just clean the trackpad as it works fine but think it would be best just to replace it for £30-£40.\n\nIf all else fails then I will claim on my home insurance and have to pay a £100 excess.\n\nCheers!"
    },
    {
        "post_id":43861,
        "thread_id":43842,
        "title":"2017 MacBook Pro Keyboard\/Trackpad warranty issue",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-12-21 16:56:51",
        "message":"Your problem should be on the keyboard, because have only few keys not working correctly.\nA problem on the motherboard will affect much more keys.\nIn such case should affect an entire raw\/column of the keyboard matrix.\nAnd sticking, or repeating keys is sign of some liquid more agressive than water..."
    },
    {
        "post_id":43875,
        "thread_id":43842,
        "title":"2017 MacBook Pro Keyboard\/Trackpad warranty issue",
        "user_id":2149,
        "username":"womble123",
        "post_date":"2018-12-21 20:02:48",
        "message":"[QUOTE=\"2informaticos, post: 43861\"]Your problem should be on the keyboard, because have only few keys not working correctly.\nA problem on the motherboard will affect much more keys.\nIn such case should affect an entire raw\/column of the keyboard matrix.\nAnd sticking, or repeating keys is sign of some liquid more agressive than water...[\/QUOTE]\n\nYep, there is nothing wrong with the trackpad. The main problem with the keys is the double pressing when I only tap once, a quick google shows that it’s very common mechanical problem with the 2016\/2017 MacBook Pro mainly being the new butterfly mechanism.\n\nWhat I’m hoping\/asking is that if I send if back off again for a second opinion with a different authorised service repair centre will they do what they were going to do which is replace the whole top case as when they open it up this time the trackpad (which has always been working fine) will show no signs of liquid ingress just like the keyboard and the rest of the machine?"
    }
]