{"post_id":42189,"thread_id":42189,"title":"Macbook air 2011 A1370 random issues.","user_id":1879,"username":"RESQ-MYTECH","post_date":"2018-11-15 06:03:19","message":"Hi all. Greets from the UK. I think I already know the answer to this question, just need clarification. Take out of the equation the customer will whine like a rusty bearing when I quote for the repair, will try to bid me down, even though my component level skills are much better now i do not use an arc welder to solder with and I have a microscope now so I can actualy see the logic boards, I am wondering if I should persue the repair. \n\nSymptons are, not being able to install any version of OSx. There are random green horizontal box's that appear on the screen and also, sometimes 3 beeps with a non illuminated black screen (see video). Upon opening there is clear evidence of liquid ingress and previous attempt at repair. More evident around the RAM chips. See pics. \n\nMy diagnosis is one or more RAM IC's to be at fault.\n\nGiven my soldering skills are mediocre at best, I do not want to attempt a reflow or replacement of these IC's.\n\nAm I better to swerve this repair? Thoughts are on replaceing the logic board.\n\nWhat do you lot think?"}
{"post_id":42190,"thread_id":42189,"title":"Macbook air 2011 A1370 random issues.","user_id":1879,"username":"RESQ-MYTECH","post_date":"2018-11-15 06:06:45","message":"Will not let me upload the files. I will put them on my server with a link so you can view."}
{"post_id":42191,"thread_id":42189,"title":"Macbook air 2011 A1370 random issues.","user_id":1879,"username":"RESQ-MYTECH","post_date":"2018-11-15 06:23:10","message":"here is the link with the images"}
{"post_id":42193,"thread_id":42189,"title":"Macbook air 2011 A1370 random issues.","user_id":682,"username":"2informaticos","post_date":"2018-11-15 06:48:43","message":"If someone already tried to reflow VRAM, possibly with \"chinese honey\", I recommend you to pull out all the chips and reball them.\nIs better option to change them directly, if you get compatible chips."}
{"post_id":42196,"thread_id":42189,"title":"Macbook air 2011 A1370 random issues.","user_id":1879,"username":"RESQ-MYTECH","post_date":"2018-11-15 07:05:57","message":"thats the thing though [USER=\"682\"]2informaticos[\/USER] , I dont trust my skills enough to attempt this level of repair. It is not an issue if its my mba but its a customers and at this time it does ( however not all the time) power on and give an image. Do not want to risk killing the logic board and then have to replace the unit. Since the original post, I have also noticed that when the SSD is in place the machine slows to a snails pace, taking approc 7-8 mins to get to the no files icon and 5-6 mins to detect an external drive is inserted to choose an operating system. Remove the SSD and the machine performs as normal in respect of booting."}
{"post_id":42197,"thread_id":42189,"title":"Macbook air 2011 A1370 random issues.","user_id":682,"username":"2informaticos","post_date":"2018-11-15 07:15:57","message":"You must consult with the client and explain him the problems.\nHe now has an useless board in fact..."}
{"post_id":42199,"thread_id":42189,"title":"Macbook air 2011 A1370 random issues.","user_id":1879,"username":"RESQ-MYTECH","post_date":"2018-11-15 08:01:33","message":"WOW!!!! Decision made. Customer was rude and demamded that the MBA was working fine when he gave it to me. Seeing as I powered it on when he was here and it's in exactly the same state now, I felt he was being..... umm a douch. So he has it back. No longer my problem. Dont get me wrong, I was leaning towards no doing the repair, he made my mind up."}
{"post_id":42203,"thread_id":42189,"title":"Macbook air 2011 A1370 random issues.","user_id":1153,"username":"JohnB8812","post_date":"2018-11-15 09:00:18","message":"This was a dead CPU anyways. Beeping on 2011 is pretty much always CPU there's maybe a 2% chance it's the RAM."}
{"post_id":42206,"thread_id":42189,"title":"Macbook air 2011 A1370 random issues.","user_id":1879,"username":"RESQ-MYTECH","post_date":"2018-11-15 09:47:50","message":"It did fire up say once in every 4ish times to the no files icon. when attempting to load the O\/S from another drive it would crash back to the black screen with 3 beeps. If it got to the point of allowing the installation progressing then there was green blocks in random places on the screen. Then it would power off. main thing was there was no consistancy to the occurance of the issues. the liquid ingress was definatly the main issue and coupled with a sloppy job done with reflowing or possibally changing of the RAM chips made me lean towards it being the RAM. the other issue of running extremly slow with the SSD in-situ also compounded things. TBH, I am glad that I didn't get to involved with it.... I could see this being a can of worms that was open at both ends :)"}
