[
    {
        "post_id":93523,
        "thread_id":63222,
        "title":"2018 A1990 \/ 820-01041 Full Functional Except No Internal Display Image",
        "user_id":34271,
        "username":"crumblenaut",
        "post_date":"2022-10-28 15:30:06",
        "message":"Sooo I have what feels like a weird a 2018 A1990 \/ 820-01041 issue here.  \n\nTL;DR:  Fully functional system apart from no image on internal display despite one being rendered to it.  Backlight is lit and fully controllable, and all display data is shown in System Information.  \n\nDETAILS:\n\nThis had liquid exposure that shorted PPVOUT_S0_LCDBKLT to EDP_INT_AUX_N on the original display's T-CON connector, which fried the U9850 mux chip and left PP3V3_S5 shorted to ground.  There was also liquid exposure to the TouchID connector, which I cleaned up.  After replacing U9850 the PP3V3_S5 short was gone, and after a DFU Revive operation (known issue when TouchID gets hit) the system would boot perfectly to an external screen via a USB-C-to-DVI cable as long as the eDP flex disconnected from the original screen's T-CON board.  I replaced the eDP flex connector as a matter of course as the T-CON side had charring.\n\nI ordered a replacement screen and had no backlight \/ no screen detected when it was connected.  Further investigation via diode mode revealed that the first MUX I put on had an internal fault and that the EDP_INT_AUX_N line was shorted to ground either inside the replacement mux chip or in its BGA post-attachment.  \n\nAfter pulling the replacement U9850 the short disappeared, and after replacing it with another new-from-Rossmann U9850, all EDP_INT_ML_P\/N<0...3> and EDP_INT_AUX_P\/N with a new unit in place show good diode mode readings in the 0.45V-0.65V range.  \n\nWhen the new screen is connected, I get a backlight but no image on the internal display and an extended-display desktop on the external display.  \n- System is fully booted and fully functional.\n- Touch Bar is fully functional, camera is fully functional, ALS appears to be fully functional and will control keyboard backlight brightness properly.\n- The blank internal display's backlight can be controlled with the Touch Bar.  \n- System Information shows the screen info properly as if it's present and fully functional. \n- Boot+D diagnostics pass with the screen disconnected and the only item flagged is \"there may be a problem with the display\" when it's actually disconnected.  I expect that if I ran it now - and could see the results - it'd return ADP000.\n\nBehavior is identical with a should-be-good A1989 display as well.  If I had any other A1989 or A1990 in the shop I'd test the screens again just to be 100% sure they're good but unfortunately I do not have any at my disposal.\n\nSo all of this tells me that the screen is enabled, is being communicated with properly, and is fully functional as far as the MacBook knows.  I'm not even quite sure how to go about probing that signal.\n\nI only have a couple new mux chips on hand and so I'm hoping to avoid replacing the U9850 again unless I really need to, but I do realize that that's the one place the DP signals go through - straight from the dGPU and iGPU into the mux - and so if the issue is problematic eDP output signals going to J8500, they're ONLY going through the mux so that's the most likely place where problems would occur. I'd just like some sort of confirmation that my logic holds before I melt ANOTHER one on there.\n\nFWIW I also have new eDP Flex cables coming in the mail for Monday and although I'm ALMOST certain that the replacement eDP Flex cables I've been using are the correct ones, even the original didn't have a printed part number on it so I'm going off of the hope that my past ordering and current deductive process is valid.\n\nALSO I haven't yet replaced J8500, but it looks flawless, the cam\/ALS portions are fully functional, and connectivity tests good between all EDP pins and test points with no shorts and equal ~0ohm resistance across all eDP lines to their test points.\n\nMy process of elimination says the issue could still be in:\n1) The mux chip or its BGA connection to the board (I hope not)\n2) The eDP flex itself (very possible)\n3) I have two separate bad screens (very unlikely)\n\nAny insight, validation, or next steps would be very much appreciated. :)"
    },
    {
        "post_id":93545,
        "thread_id":63222,
        "title":"2018 A1990 \/ 820-01041 Full Functional Except No Internal Display Image",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-10-29 09:00:38",
        "message":"If all resistors around U9850 are good, try replacing U9801.\nThe worst scenario is bad iGPU, damaged by leakage through U9850.\nNot sure if should work in dGPU mode in such case."
    }
]