{"post_id":32564,"thread_id":32564,"title":"820-3437, Won't Detect SSD, Liquid","user_id":515,"username":"SMMRepair","post_date":"2018-03-14 11:14:09","message":"Dealing with a board that had liquid-damage, but was cleaned very, very well. Hard to tell where all the liquid intruded, but nothing visible damaged\/corroded anymore. The only issue with the board (so far) is that it won't detect an SSD.\n\n1. SSD_PWR_EN, PP3v3_s0sw_ssd_flt both present\n2. No caps\/resistors missing from area or data lines; checked entire board well, no damaged or missing components (this has always been the cause of no-SSD-detect on previous boards, so I looked well)\n3. R3700\/10 measure out fine\n\nBefore I go through and compare all diode measurements and check each data line, I wanted to check to see if there's anything else I should check\/do beforehand. Any help appreciated as always, thanks!"}
{"post_id":32565,"thread_id":32564,"title":"820-3437, Won't Detect SSD, Liquid","user_id":36,"username":"aprendiz","post_date":"2018-03-14 11:32:12","message":"EFI lock? can you boot from external drive???"}
{"post_id":32566,"thread_id":32564,"title":"820-3437, Won't Detect SSD, Liquid","user_id":515,"username":"SMMRepair","post_date":"2018-03-14 12:24:41","message":"Hey Aprendiz, no EFI lock. PRAM resets fine. Boots to USB drive fine as well. No storage\/SSD detected in system preferences or system profiler, etc. SSD also does not seem to get as warm as one normally does (it's warm, but seemingly from proximity to CPU)."}
{"post_id":32576,"thread_id":32564,"title":"820-3437, Won't Detect SSD, Liquid","user_id":2,"username":"dukefawks","post_date":"2018-03-14 16:47:52","message":"Just to be sure, did you try a known good SSD? Next would be some diode mode readings on the connector and check the traces to the PCIE caps."}
{"post_id":32583,"thread_id":32564,"title":"820-3437, Won't Detect SSD, Liquid","user_id":515,"username":"SMMRepair","post_date":"2018-03-14 18:46:40","message":"Hey Duke, thanks. Yeah I tried 3 SSDs just to be safe. I'll get into diode readings tomorrow and will post those; will also check all my continuity on those caps. Will post back tomorrow!"}
