{"post_id":66105,"thread_id":60128,"title":"How can I turn a bios file into a readable format?","user_id":27551,"username":"awbower","post_date":"2020-10-05 21:54:58","message":"I extracted the bios from an 820-3115 MBP using a CH341a programmer. Is there a program that can get this into a readable format so I can see basic information about the computer (ex. serial number)? \n\nThanks"}
{"post_id":66116,"thread_id":60128,"title":"How can I turn a bios file into a readable format?","user_id":682,"username":"2informaticos","post_date":"2020-10-06 07:31:54","message":"Search the file in HxD for SSN..."}
{"post_id":66232,"thread_id":60128,"title":"How can I turn a bios file into a readable format?","user_id":1057,"username":"piernov","post_date":"2020-10-07 11:43:39","message":"UEFITool NE to browse through the EFI modules and NVRAM variables (most likely what you are looking for right now), ME Analyzer to get info about ME region, Intel FITC to get some configuration bits of the Intel platform."}
{"post_id":66309,"thread_id":60128,"title":"How can I turn a bios file into a readable format?","user_id":27551,"username":"awbower","post_date":"2020-10-08 15:40:53","message":"I downloaded UEFITool NE and searched for SSN. It specified the following destination: EfiCrc32GuidedSectionExtractionGuid\/PE32 image section at header-offset 314Ch. After navigating there, the contents did not show anything related to the serial number. I attached a screenshot. What am I doing wrong?"}
{"post_id":66327,"thread_id":60128,"title":"How can I turn a bios file into a readable format?","user_id":682,"username":"2informaticos","post_date":"2020-10-08 16:23:44","message":"Did you try a simply hex editor?"}
{"post_id":66331,"thread_id":60128,"title":"How can I turn a bios file into a readable format?","user_id":27551,"username":"awbower","post_date":"2020-10-08 17:26:52","message":"I extracted the file (PE32 Image Section) and opened it with HxD. I attached a screenshot. For the most part, the decoded text is just nonsense. I feel like I'm doing something wrong though because when I open up a known working bios file in HxD the decoded version is also not intelligible."}
{"post_id":66334,"thread_id":60128,"title":"How can I turn a bios file into a readable format?","user_id":27551,"username":"awbower","post_date":"2020-10-08 17:54:02","message":"I take it back... for some reason the search function didn't work initially. I tried it again and found the serial number hidden among all of the gibberish. \n\nCan I get clean bios files for 820-3115 and 820-00165?\n\nAlso, I know that you can't take a bios chip from one motherboard and transfer it to another motherboard and have the computer work properly... something to do with not being able to properly communicate with the PCH. When I upload a clean bios file to a board, is there anything else that I have to do in order to make the computer function like it should?\n\nThanks"}
{"post_id":66337,"thread_id":60128,"title":"How can I turn a bios file into a readable format?","user_id":682,"username":"2informaticos","post_date":"2020-10-08 18:04:10","message":"If you plan to deal with Apple repairs, get Medusa programmer; is a MUST in this business.\nYou can also clean ME manually, but take more time to remove\/resolder SPI cheap.\n\nIf you have working BIOSes and only want to clean their ME region, upload them somewhere.\nWe also have some links for clean ME files on the forum.\n\nBuilding BIOS file from a chip read from other board, will require changing serial number.\nThis also imply fix checksum of Fsys area."}
{"post_id":66338,"thread_id":60128,"title":"How can I turn a bios file into a readable format?","user_id":27551,"username":"awbower","post_date":"2020-10-08 18:08:48","message":"I have a few computers that I suspect have a corrupted bios (they don't boot) so I do need to build a new one. \n\nI can correct the serial number myself using HxD. \n\nHow do I fix the checksum of the Fsys area?"}
{"post_id":66340,"thread_id":60128,"title":"How can I turn a bios file into a readable format?","user_id":27551,"username":"awbower","post_date":"2020-10-08 18:59:33","message":"I did some research... does this seem correct?\n\n1) Start with a good BIOS with clean ME region for your motherboard (in my case 820-3115)\n2) In HxD, calculate the checksum (Apple uses SHA-1 format) prior to making any changes. Record this number.\n3) Change the serial number to the correct value. \n4) Calculate the new checksum. Subtract the new checksum from the original calculated in step 2.\n5) Change a \"useless\" area of the BIOS by the amount calculated in step 4. Now, after modifying the serial number, the checksum will still be the same as originally."}
{"post_id":66353,"thread_id":60128,"title":"How can I turn a bios file into a readable format?","user_id":1057,"username":"piernov","post_date":"2020-10-09 03:19:07","message":"[MEDIA=youtube]exfG5Iywmjk[\/MEDIA]\n[MEDIA=youtube]poA8HByYqTM[\/MEDIA]"}
{"post_id":66356,"thread_id":60128,"title":"How can I turn a bios file into a readable format?","user_id":682,"username":"2informaticos","post_date":"2020-10-09 03:53:14","message":"Theory sounds good..."}
{"post_id":66405,"thread_id":60128,"title":"How can I turn a bios file into a readable format?","user_id":27551,"username":"awbower","post_date":"2020-10-09 17:01:50","message":"Thank you Piernov that was helpful.\n\nI need to put a new bios onto a 2015 820-00165 board using the process you outlined above. On the forum I was able to find a 2017 820-00165 bios with a clean ME. Are they compatible? I was unable to find the file for a 2015. \n\nThanks"}
