{"post_id":3026,"thread_id":3026,"title":"820-3662 Detects USB 3.0 Devices Only, Doesn't Detect USB 2.0 HDD","user_id":80,"username":"rany","post_date":"2016-05-26 10:03:24","message":"820-3662 Q8020 was blown and I replaced it at the request of the customer (another shop), and did nothing else to solve the possible cause. After some time, may be a month, customer reported that it's not detecting USB 2.0 devices.\nI tried it and it does detect mice, but not USB 2.0 HDDs. Even from a bootable system. Is this common? Anything I should jump to? Otherwise where to start troubleshooting? \nThanks!"}
{"post_id":3035,"thread_id":3026,"title":"820-3662 Detects USB 3.0 Devices Only, Doesn't Detect USB 2.0 HDD","user_id":2,"username":"dukefawks","post_date":"2016-05-27 04:08:36","message":"Q8020 supplies the PCH with the voltage for the USB system. I bet it's dead or power does not get to the PCH. Check power on C1706, but I'm afraid PCH is dead.\nAlso the prediction of this machine returning with issues came true......Are they expecting a warranty repair?"}
{"post_id":3040,"thread_id":3026,"title":"820-3662 Detects USB 3.0 Devices Only, Doesn't Detect USB 2.0 HDD","user_id":80,"username":"rany","post_date":"2016-05-27 10:57:10","message":"3V3 is present on C1706.\nRepair was made back then \"as is\" without warranty just because they requested this particular part to be replaced. I did not \" repair\" the board and I told them I expect it to fail again."}
{"post_id":3137,"thread_id":3026,"title":"820-3662 Detects USB 3.0 Devices Only, Doesn't Detect USB 2.0 HDD","user_id":2,"username":"dukefawks","post_date":"2016-05-29 21:25:46","message":"I'd suspect a dead PCH then. I assume all USB ports give the same issue."}
{"post_id":3306,"thread_id":3026,"title":"820-3662 Detects USB 3.0 Devices Only, Doesn't Detect USB 2.0 HDD","user_id":80,"username":"rany","post_date":"2016-06-06 06:36:28","message":"I gave it back as is. Will not work on it as they convinced the end customer to keep it as is :)"}
