[
    {
        "post_id":8770,
        "thread_id":8770,
        "title":"Learning question",
        "user_id":23,
        "username":"mrjoeham",
        "post_date":"2016-10-27 19:18:25",
        "message":"Good evening everyone.  I got a MacBook today (820-3115-B) that a customer brought in because he is having issues with the USB connection.  He would lose connection in and out and get messages saying the drive was not disconnected correctly.  I assumed it was like damaged physically, maybe loose soldering.  I checked it and the connections are all solid and I browsed around the board and realize it has been worked on before.  I saw this IC in the picture which looked like it was replaced and someone did a pretty shitty job.. the legs aren't even lined up correctly.  Could this chip be the issue for the USB connections he is having?  I havent looked on schematic.  Just wanted to jump on the forum since I haven't visited here in a bit.  Thanks for any replies, Have a fantastic day!"
    },
    {
        "post_id":8774,
        "thread_id":8770,
        "title":"Learning question",
        "user_id":23,
        "username":"mrjoeham",
        "post_date":"2016-10-27 19:46:17",
        "message":"I answered my own question.. It's U6100 SPI ROM.  Programmable IC chip.  Is this Bios and what program to use for programming it?"
    },
    {
        "post_id":8784,
        "thread_id":8770,
        "title":"Learning question",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-10-28 08:42:36",
        "message":"Buy a programmer like EZP2010 or TL866. I doubt it will fix the USB issue though. Check if the serial number in OSX matches the one on the memory slot sticker to be sure the BIOS was not messed with. It may have ME issues now."
    },
    {
        "post_id":8849,
        "thread_id":8770,
        "title":"Learning question",
        "user_id":23,
        "username":"mrjoeham",
        "post_date":"2016-10-29 13:45:46",
        "message":"Thanks Duke.  New project, more for fun than the money now.... awesome."
    },
    {
        "post_id":8850,
        "thread_id":8770,
        "title":"Learning question",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-10-29 13:48:46",
        "message":"Actually if both USB ports have issues then it may very well be an ME region issue. Once you have your programmer post the dump here."
    }
]