{"post_id":68993,"thread_id":60475,"title":"Dim screen only after login after replacing with new display assembly 2019 Macbook 820-01598-A","user_id":22870,"username":"joshAU","post_date":"2020-12-10 00:26:10","message":"Hi.\nI replaced a cracked display assembly in a customers Macbook Pro A2159 (13\", 2019).\n\nOn starting, the Apple logo, and the login screen, appears fine, however, once you input the password and actually login, the screen dims.\nThe brightness control slider on the keyboard is responsive, but it makes no change to the brightness.\nThe desktop is still visible, but a lot darker than normal, but isn't completely without backlight, as you can still see it OK.\n\nI've tried resetting the SMC\/PRAM, to no avail.\n\nI've tried turning off automatic brightness control under System Preferences---Display, with no change.\n\nI've tried with two new aftermarket display assemblies with the same result.\n\nThe unit displays fine on an external monitor. \n\nAny help greatly appreciated."}
{"post_id":68996,"thread_id":60475,"title":"Dim screen only after login after replacing with new display assembly 2019 Macbook 820-01598-A","user_id":682,"username":"2informaticos","post_date":"2020-12-10 05:28:11","message":"Disconnect webcam and try again.\nThere could be an issue with ALS sensor, which is working only once macOS is booted."}
{"post_id":69029,"thread_id":60475,"title":"Dim screen only after login after replacing with new display assembly 2019 Macbook 820-01598-A","user_id":22870,"username":"joshAU","post_date":"2020-12-10 17:06:39","message":"Hi again 2informaticos.\nThanks for your help, once again.\n\nThe webcam data lines seem to be integrated into the EDP cable that connects to J8500.\nI don't think there's a way to disconnect the webcam...short of opening the panel, is there?"}
{"post_id":69031,"thread_id":60475,"title":"Dim screen only after login after replacing with new display assembly 2019 Macbook 820-01598-A","user_id":682,"username":"2informaticos","post_date":"2020-12-10 17:09:50","message":"Did you look at the connectors on the LCD assembly?\nThe one near the LCD cable which comes from MLB..."}
{"post_id":69035,"thread_id":60475,"title":"Dim screen only after login after replacing with new display assembly 2019 Macbook 820-01598-A","user_id":22870,"username":"joshAU","post_date":"2020-12-10 19:42:32","message":"AH, OK, Thanks for that. I'm not very familiar with this model\n\nI disconnected the webcam side of things... but still no change unfortunately.\n\nThe screen looks perfect with Apple logo, and at the login screen, until I input the password, then it goes very dim.\n\nHowever, a correction - the brightness slider bar does actually respond, and it does have some slight effect on the screen brightness- going from fully off to about 1\/4 of the normal brightness. \nI just cannot get it brighter than that, once logged in.\nThat is both with the webcam connector connected or disconnected. \n\nIf I select Restart, or shutdown, the screen will remain dim, i.e. the Apple logo and login screen will be dim, unless I reset the PRAM first. \n\nI also tried with another installation of OSX Big Sur, and booting from a Catalina USB installer, all behave similarly.\n\nOne thing I did notice, is that immediately prior to the screen dimming, the actual colours change for 1\/2 a second, like some sort of graphic artificing, then the screen dims.\nFor example, the White Apple logo on the black background will flicker to a white logo with a red background, then the screen will dim, and the colour will return to normal....\n\nI've attached a 10 second video of the issue.\nThe glitch occurs 6 seconds in.\n\n(For some reason .MOV files cannot be uploaded here directly, so I had to put it in a zip file).\n\nIt makes me suspect perhaps an issue with the GPU...."}
{"post_id":69036,"thread_id":60475,"title":"Dim screen only after login after replacing with new display assembly 2019 Macbook 820-01598-A","user_id":1057,"username":"piernov","post_date":"2020-12-11 04:00:57","message":"Assuming correct model was used, most likely just a low quality LCD assembly, very common on T2 machines. Your best bet is to have it replaced by Apple…"}
{"post_id":69041,"thread_id":60475,"title":"Dim screen only after login after replacing with new display assembly 2019 Macbook 820-01598-A","user_id":682,"username":"2informaticos","post_date":"2020-12-11 05:24:19","message":"Very likely LCD problem.\nTry known good working screen assembly."}
{"post_id":69153,"thread_id":60475,"title":"Dim screen only after login after replacing with new display assembly 2019 Macbook 820-01598-A","user_id":22870,"username":"joshAU","post_date":"2020-12-14 17:49:05","message":"Hi piernov and 2informaticos.\nSorry for the delay.\nI did try it with two brand new aftermarket screens, however both were from the same supplier.\nWe buy quite a lot different mac screens from that supplier, and rarely have issues, but I think this is the first time we've bought that particular model."}
{"post_id":69164,"thread_id":60475,"title":"Dim screen only after login after replacing with new display assembly 2019 Macbook 820-01598-A","user_id":682,"username":"2informaticos","post_date":"2020-12-15 06:50:45","message":"T2 machines give lot of problems with cheap chinese LCD assemblies.\nThey usually do not mount a proper ALS circuit."}
