[
    {
        "post_id":10201,
        "thread_id":10201,
        "title":"830-3437 - Orange Light, VCore present, Fan spin, SPI Working --> no Chime & Video",
        "user_id":289,
        "username":"smiba",
        "post_date":"2016-11-24 14:46:41",
        "message":"830-3437 - Orange Light, VCore present, Fan spin, SPI Working --> no Chime & Video\n\nI really hope this isn't one of those embarrassing issues where I just overlooked something haha\n\nAnyways, this macbook Air was water damaged and already bought to another company who told \"they would need to replace the motherboard as it can't be repaired\", I did not notice a lot of corrosion but I did notice some rusty parts and blackness\/discolouration on the two backlight power pins of the display connector. (And a blown F7700, it no longer blows after replacement though).\n\nWhen you plug in the charger it becomes green for about one second, before it turns Orange. (No battery inserted). The CPU fan will switch on\/off for about 3-4 times for about 4 seconds until it keeps on spinning. There is no Chime\nSystem responds to pressing the power button and shuts down by keeping it pressed or starts by pressing it just once.\n\nCPU Vcore is 1.75V, the CPU gets warm after keeping it on for a while.\n\nAll major power lines are available and at their voltages, SPI chip has both Input and Output communication (Seen with oscilloscope)\n\nWhen plugging in the battery PPBUS_G3H drops from 8.8V to 6.8V, I don't think this is intended. System does not run off battery, although the battery might just be empty. Possible issue in the power circuit?\n\nNo backlight (BKLT_PLT_RST_L signal is Low. The pins on Q7706 look awful but the chip responds as expected. Pin 3&4 (Gate & Source) are about the same voltage), No Keyboard backlight etc.\n\nA lot of the components positive power pin(s) look slightly bad, but this is probably because corrosion usually starts on the positive terminal. Power still goes through them properly and the solder connections are not broken.\n\nSummery:\nCPU Vcore = 1.75V\nSPI Chip I\/O activity\nDoesn't run off battery, when having a battery plugged in PPBUS_G3H drops from 8.8V to ~6.8V\nNo backlight, the FET isn't opened (No power out on PPVIN_S0SW_LCDBKLT_FET)\nFan spins\nOrange Light on charger, battery or not\nNo Chime\nF7700 Backlight fuse was blown, replaced and its no longer blowing.\n\nIf anyone can help me, thanks a lot!"
    },
    {
        "post_id":10202,
        "thread_id":10201,
        "title":"830-3437 - Orange Light, VCore present, Fan spin, SPI Working --> no Chime & Video",
        "user_id":36,
        "username":"aprendiz",
        "post_date":"2016-11-24 15:14:33",
        "message":"Turning on and off when you plug in charger without battery is normal....\nIf you connect an USB mouse, does it shows activity????\nCaps Lock key works??\nHave you tried with another display assembly??\nFuse blown was for a reason, maybe bad cable or display...."
    },
    {
        "post_id":10203,
        "thread_id":10201,
        "title":"830-3437 - Orange Light, VCore present, Fan spin, SPI Working --> no Chime & Video",
        "user_id":289,
        "username":"smiba",
        "post_date":"2016-11-24 15:28:11",
        "message":"[QUOTE=\"aprendiz, post: 10202\"]Turning on and off when you plug in charger without battery is normal....[\/QUOTE]\nObviously\n\n[QUOTE=\"aprendiz, post: 10202\"]\nIf you connect an USB mouse, does it shows activity????\nCaps Lock key works??.[\/QUOTE]\n\nNo and No, For this the system would need to be past POST to work. However since there is no Chime its to be assumed the system does not boot or get past his early bootup stage.\nUSB Mouse doesn't light up either\n\n[QUOTE=\"aprendiz, post: 10202\"]Have you tried with another display assembly??[\/QUOTE]\n\nNope, but the backlight pins on the display are 0V and the FET is not opening so the backlight is completely not being powered.\n\n[QUOTE=\"aprendiz, post: 10202\"]Fuse blown was for a reason, maybe bad cable or display....[\/QUOTE]\n\nI assume the fuse was blown due the huge amount of whatever the person was drinking ended up on the motherboard, the backlight area looks the worst of all with some pins so rusty they barely would stick to the solder without extensive cleaning. Right now the backlight isn't even being enabled so the current going through the fuse is very minimal, but there is no short on the backlight lines which tells me the fuse would most likely not break.\n\nIt is possible that the display is permanently damaged due the short though, but that would still leave voltage on the backlight pins with the screen disconnected.\n\n\nThis all is if I'm correct though, feel free to let me know if I'm being stupid :p"
    },
    {
        "post_id":10206,
        "thread_id":10201,
        "title":"830-3437 - Orange Light, VCore present, Fan spin, SPI Working --> no Chime & Video",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-11-24 16:35:23",
        "message":"The 3 times on\/off does suggest that the system is running POST to some extent. Check corrosion around U6100, especially the resistors to the SMC R6114-17.\nOf course USB mouse should light up first before we can continue with backlight issues.\nOrange light without battery is normal.\nVoltage drops to 6.8V because your battery is very empty and needs to charge."
    },
    {
        "post_id":10222,
        "thread_id":10201,
        "title":"830-3437 - Orange Light, VCore present, Fan spin, SPI Working --> no Chime & Video",
        "user_id":289,
        "username":"smiba",
        "post_date":"2016-11-25 10:55:08",
        "message":"For the next time, do all macbook Air's have this orange light behaviour or just a select few? I know macbook Pro's don't behave this way.\nI'll definitely remember for next time!\n\nI checked Resistors R6114-17 and they all measure within 1% of their specification.\n\nU6100 shows close to no signs of any corrosion, all the pins are looking nice\n\nCould U2800 be causing issues? Since its located right in the middle of the corrosion war-zone?"
    },
    {
        "post_id":10224,
        "thread_id":10201,
        "title":"830-3437 - Orange Light, VCore present, Fan spin, SPI Working --> no Chime & Video",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-11-25 11:12:57",
        "message":"All 2012+ machines do the orange light thing.\nWhat does U2800 thunderbolt have to do with the machine working?\nThis could be anything, corrosion under SMC maybe. Corrosion under any chip could cause this really."
    },
    {
        "post_id":10232,
        "thread_id":10201,
        "title":"830-3437 - Orange Light, VCore present, Fan spin, SPI Working --> no Chime & Video",
        "user_id":289,
        "username":"smiba",
        "post_date":"2016-11-25 12:37:13",
        "message":"After checking the schematic for the pins of U2800 I'm highly sceptical it could prevent the system from posting, you're right.\n\nI'll try to reflow one chip at a time to see if that fixes anything. I know its not a proper fix and I agree, but it at least would tell me what chip I need to reball :)\n\nThanks for your help, if I solve it I'll post to this thread. Otherwise I sadly have to accept not everything can be fixed"
    }
]