{"post_id":21,"thread_id":21,"title":"820-3332-A Intermittently boots to desktop. Passes ASD test.","user_id":3,"username":"CleverTech","post_date":"2016-03-03 21:26:41","message":"820-3332-A will intermittently boot to desktop (external & internal). Will stay stuck on loading bar. Volume keys will work as if desktop environment is running in the background. No signs of previous liquid damage or work done to board. Passes ASD tests consistently.\nWhen it eventually does boot it'll run FurMark GPU stress test normally.\nAny help would be greatly appreciated.\n\nBest regards,\nG"}
{"post_id":22,"thread_id":21,"title":"820-3332-A Intermittently boots to desktop. Passes ASD test.","user_id":3,"username":"CleverTech","post_date":"2016-03-03 21:32:21","message":"No Title"}
{"post_id":24,"thread_id":21,"title":"820-3332-A Intermittently boots to desktop. Passes ASD test.","user_id":1,"username":"larossmann","post_date":"2016-03-04 20:55:52","message":"Just have Apple fix it, this is beyond hope for people like us sadly, like the 820-2915 will lead you down a hole to hell."}
{"post_id":50,"thread_id":21,"title":"820-3332-A Intermittently boots to desktop. Passes ASD test.","user_id":32,"username":"Apple Repair Shop","post_date":"2016-03-20 07:24:42","message":"Really Rossman why is that has he tried Resets or test hard drive? I would test with a new hard drive or at least back up my data then reformat, reinstall OS X, unplug \/ replug Charger\/ Battery PRam reset and see if the problem id fixed. (not in that exact order)"}
{"post_id":68,"thread_id":21,"title":"820-3332-A Intermittently boots to desktop. Passes ASD test.","user_id":1,"username":"larossmann","post_date":"2016-03-20 10:12:02","message":"These are covered under an extended warranty for graphics issues and random shutdowns. Even if you fix the primary issue if the primary issue is NOT with the GPU itself,it will have that GPU issue down the line and your customer will come back saying [I]you fixed it and it does the same thing again! [\/I]Which is the worst thing in this entire business.\n\nI hate 3332s\/2915s with a passion. No matter what you do it will be baaaaaaaaaack. :(\n\nPlus if you bitch at Apple enough about the [I]\"bad customer experience\" [\/I]even if something else is wrong like the SSD they will fix it for free."}
{"post_id":70,"thread_id":21,"title":"820-3332-A Intermittently boots to desktop. Passes ASD test.","user_id":2,"username":"dukefawks","post_date":"2016-03-20 10:18:59","message":"Classic video issue. Take to Apple and have it fixed for free."}
