{"post_id":27062,"thread_id":27062,"title":"[SOLVED]820-4924, No Audio Devices.","user_id":515,"username":"SMMRepair","post_date":"2017-10-20 11:08:38","message":"Working on an 820-4924 board with no audio. WiFi, Bluetooth and iSight all working fine. No liquid or drops, audio just did not work one day.\n\n1. I have 1.5v at 40\/42 of J9510.\n2. Tested with known-good assembly (including IO board\/cable, etc). No audio at all--no chime at startup, \"greyed out\" audio symbol\/controls, no audio devices in output in System Preferences.\n3. Diode measurements at J6602 match working board (can provide here if needed).\n\nI'm leaning towards a bad codec or headphone port, but not sure what to check before proceeding with replacing the codec. I checked all filters near the codec and they're all fine, as are all resistors I checked. No signs of liquid, just a failure somewhere. Unit has no other issues except no audio, with no audio devices detected or showing in OSX at all.\n\nAll help appreciated! Thanks!"}
{"post_id":27075,"thread_id":27062,"title":"[SOLVED]820-4924, No Audio Devices.","user_id":2,"username":"dukefawks","post_date":"2017-10-20 17:25:18","message":"If all voltages are present at the codec it could be the chip. Not the jack as there will be an audio device detected of course, also plugging in headphones it should give audio.\nCheck all voltages to the digital part of the codec, L6300 and the rest there. Also check all resistors in the 6 HDA data lines to the CPU. If that all looks ok then next is replacing the chip."}
{"post_id":27171,"thread_id":27062,"title":"[SOLVED]820-4924, No Audio Devices.","user_id":515,"username":"SMMRepair","post_date":"2017-10-23 10:46:42","message":"Replaced the audio codec and audio has returned. No liquid, just a dead chip (maybe from someone plugging in a bad external audio device?). Anyway, unit seems to be working well now. Thanks again, Duke! As usual, spot-on."}
{"post_id":27190,"thread_id":27062,"title":"[SOLVED]820-4924, No Audio Devices.","user_id":2,"username":"dukefawks","post_date":"2017-10-23 17:45:34","message":"It is in an area that will flex when jack is plugged in. Could be cracks under chip because of flexing."}
{"post_id":27242,"thread_id":27062,"title":"[SOLVED]820-4924, No Audio Devices.","user_id":515,"username":"SMMRepair","post_date":"2017-10-24 14:14:32","message":"So it would be worth reflowing in the future if no liquid is visible? I'll keep that in mind; went ahead and replaced this time, but good to keep in mind (time saver). Thanks, Duke!"}
{"post_id":27253,"thread_id":27062,"title":"[SOLVED]820-4924, No Audio Devices.","user_id":16,"username":"supamodz","post_date":"2017-10-24 21:28:07","message":"Mark as solved"}
