{"post_id":65621,"thread_id":60064,"title":"820-2796 Kernel panic","user_id":5175,"username":"tlough75","post_date":"2020-09-24 07:24:17","message":"On the bench I have an 820-2796 that had an EFI lock on it. I desoldered the EFI IC, soldered it to a little breakout board and backed up the BIOS then removed the EFI lock. Before I did this the laptop did not kernel panic and now it does randomly, and after every time I shut down after it restarts it says \"your computer restrted because of a problem\". I realise I did something to the BIOS or the IC so my question is, should I dump the original back onto the board, or shold I replaced the IC? I imagine I may have heated it too much or something because it was working fine apart from the EFI before. I am currently buying one of those clips so I do not have to remove the IC in the future. I ususally use my Medusa 3 but this LB is from 2010 so it is out of the range for the Medusa 3."}
{"post_id":65636,"thread_id":60064,"title":"820-2796 Kernel panic","user_id":682,"username":"2informaticos","post_date":"2020-09-24 10:20:27","message":"Desolder\/resolder SPI chip with hot air should not be the reason.\nI always did this on 2010\/11 boards without problems.\nBut depends on your hot air station settings too.\n\nYou must discard BIOS mod reflashing backup."}
{"post_id":65641,"thread_id":60064,"title":"820-2796 Kernel panic","user_id":5175,"username":"tlough75","post_date":"2020-09-24 10:51:18","message":"By discarding BIOS mod, are you saying I should flash the original back to chip and then retry?"}
{"post_id":65642,"thread_id":60064,"title":"820-2796 Kernel panic","user_id":515,"username":"SMMRepair","post_date":"2020-09-24 11:06:33","message":"I don't think it's the case in this situation, but you CAN overheat the SPI chip with hot air. This is VERY EASY to do with the Micron N- chips! They will die\/damage very easily if you apply too much heat too directly. Usually it just damages\/corrupts the BIOS dump itself, but you might see the erase\/write process fail, or no chip detected, etc. But yes Micron chips suck. The Macronix and Winbond chips are much, much more resilient to heat. I do not know why, but I have killed several Micron chips even when being extremely careful with the hot air. Your issue sounds different, but honestly I wouldn't be surprised if the chip is damaged, IF it's a Micron chip."}
{"post_id":65645,"thread_id":60064,"title":"820-2796 Kernel panic","user_id":5175,"username":"tlough75","post_date":"2020-09-24 11:28:19","message":"It is a SST I beleive."}
{"post_id":65646,"thread_id":60064,"title":"820-2796 Kernel panic","user_id":5175,"username":"tlough75","post_date":"2020-09-24 11:29:03","message":"So Microchip brand?"}
{"post_id":65648,"thread_id":60064,"title":"820-2796 Kernel panic","user_id":682,"username":"2informaticos","post_date":"2020-09-24 11:31:55","message":"Try first to reflash backup.\nIf still problems, change the chip; but also try backup on it.\nAlways verify read\/write..."}
{"post_id":65649,"thread_id":60064,"title":"820-2796 Kernel panic","user_id":5175,"username":"tlough75","post_date":"2020-09-24 11:33:32","message":"I don't think I overheated it, and the BIOS wrote back to the chip without errors. I used a soldering IRON to put it back on the LB. I have one of those clips that clamps over the legs so I do not have to take it off the board again but I need to build a header or something for the other end to plug into programmer. I think I may first put original dump back on, check to see if it KP, then if not my altered file might be bad. if not, then I think it is safe to assume I need a replacement EFI..."}
{"post_id":65650,"thread_id":60064,"title":"820-2796 Kernel panic","user_id":5175,"username":"tlough75","post_date":"2020-09-24 11:34:46","message":"Thanks I will try to reflash back up first."}
