[
    {
        "post_id":19970,
        "thread_id":19970,
        "title":"820-2610 boots apple logo crashes before it can finish loading",
        "user_id":371,
        "username":"nate8organic",
        "post_date":"2017-05-09 15:54:14",
        "message":"820-2610 boots apple logo crashes before it can finish loading.  i had checked the c7777 prior to changing it and it was 1.17v, and i changed it out for a full size 330uf and its 1.17v still so i do not believe it has to do with the c7777.    i double checked the osx and its good also.  the only thing right now that i can not test to confirm is the lvds cable was a little chard but i cleaned it up and the screen turns on no trouble, i wish i had another duo screen to test this because i have seen a very slightly corroded lvds cable cause the same issue in the past.  \n\nAny ideas?"
    },
    {
        "post_id":19985,
        "thread_id":19970,
        "title":"820-2610 boots apple logo crashes before it can finish loading",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-05-10 03:36:53",
        "message":"Did someone put 8GB RAM in it? These boards are shit and need PC8500 RAM, also they have issues with 8GB. Put 6GB PC8500 in there."
    },
    {
        "post_id":20001,
        "thread_id":19970,
        "title":"820-2610 boots apple logo crashes before it can finish loading",
        "user_id":371,
        "username":"nate8organic",
        "post_date":"2017-05-10 11:29:06",
        "message":"i'm not sure,  i was using a 1600 so i changed it out for an pc3 8500 tried a few sticks 1 and 2gbs tried a pram reset and smc reset and no change, however i guess i was never really getting a bong until i did the pram reset. its almost finished loading the os when the wheel freezes and the system crashes back to a restart.  it does say when it turns back on that it experienced a problem and restarted.  perhaps i just need to run efi and asd at this point?"
    },
    {
        "post_id":20012,
        "thread_id":19970,
        "title":"820-2610 boots apple logo crashes before it can finish loading",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-05-10 12:48:20",
        "message":"You can run ASD, I bet it will bring up nothing but worth a shot."
    }
]