[
    {
        "post_id":63118,
        "thread_id":59766,
        "title":"820-2936-B Powers Off",
        "user_id":26765,
        "username":"sws",
        "post_date":"2020-07-30 17:28:11",
        "message":"Hello,\n\nWorking with an 820-2936-B from a 2011 A1278 that we inherited after Best Buy could not fix.  The computer has a broken screen but the LCD itself looks fine.  It powers on and boot chimes but powers itself down, sometimes partway through boot, sometimes during an Internet recovery.  It's the inconsistency that's confusing.  I don't see any signs of water damage and was honestly hoping for a quick glass replacement and SMC\/PRAM reset but those hopes are quickly fading.\n\nThe only apparent issue, aside from a prior repair attempt that probably used a Phillips bit to remove the Torx screws, is that the webcam cable was torn out of the board but the connector itself left in J3402.  I extracted the connector from the jack and J3402 looks ok on the board.  I have removed the customer-supplied RAM and put in a single stick of known-good.  ASD EFI did not show any issues but I did not run the extended RAM tests because there was no change in behavior between our RAM and the pre-installed RAM.  The computer shut down while trying to boot into ASD OS.\n\nWe tried disconnecting all of the cables aside from display and could not reproduce the power-off issue.  Began reattaching cables and still could not reproduce the power-off issue, even with all of the cables connected again.  So, we began an Internet recovery and everything was going fine but then partway through the install it shut down again.\n\nCharger is an 85W Magsafe1 from Apple direct but we did also try a different charger, with the same result.\n\nBooted from verbose mode a couple times when it was powering itself down with some regularity and twice it got to about the same point.\n\nFirst time through it powered down right after:\n\nrooting via boot-uuid from \/chosen: C6C816DB-704F-389E-BFDB-F2CD80836F29\nWaiting on IOProviderClassIOResourcesIOResourceMatchboot-uuid-media\n\nSecond time through it had the above message plus this:\nApple.AppleFSCompressionTypeZlib load start\nApple.AppleFSCompressionTypeZlib load succeeded\n\nI'm not sure what is supposed to happen after that or what it might be trying to load.  The only relevant hits that I could find with bits of those strings was around people trying to make a Hackintosh work, but not on an actual MacBook.  When it powers itself off, the power button is then unresponsive and we need to pull the charger entirely for a few seconds.\n\nIt's most confusing.\n\nSteve"
    },
    {
        "post_id":63132,
        "thread_id":59766,
        "title":"820-2936-B Powers Off",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-07-31 01:23:40",
        "message":"Disconnect internal HDD and try to boot USB macOS.\n\nCPU gets very hot?\n\nTry new BIOS, clean ME..."
    },
    {
        "post_id":63141,
        "thread_id":59766,
        "title":"820-2936-B Powers Off",
        "user_id":26765,
        "username":"sws",
        "post_date":"2020-07-31 06:13:18",
        "message":"Internal HDD has usually been disconnected and boot from USB sometimes works but when going into OS it still powers off.\n\nCPU does get very hot.  I took the board out last night and noticed that someone, whether Best Buy or otherwise, apparently tried to redo the thermal paste on the cpu and made a mess of it.  There's 2 to 3 mm of thermal paste between the cpu and the heatsink and the heatsink for the gpu is not on straight, with an air gap on one corner - and a few bits of thermal paste in random locations on that side of the board.\n\nI was about to try a new BIOS\/clean ME until ASD EFI showed those as ok.  I can still do that and I have some HY880 here too, but would there be another cause of CPU getting hot?  I'm thinking someone thought to redo the thermal paste in response to the CPU getting hot, so I'd like to find the underlying cause before trying to remove most of the world's thermal paste."
    },
    {
        "post_id":63143,
        "thread_id":59766,
        "title":"820-2936-B Powers Off",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-07-31 06:27:01",
        "message":"Put correct, thin layer thermal paste.\nAnd try another heatsink; original can have broken heatpipe.\n\nStill recommend clean ME region..."
    },
    {
        "post_id":63184,
        "thread_id":59766,
        "title":"820-2936-B Powers Off",
        "user_id":26765,
        "username":"sws",
        "post_date":"2020-07-31 10:53:06",
        "message":"Ok, I'll do the clean ME while I try to find a heatsink.  General practice to use a Pomona 5250 on the U6100, desolder, or is there a hirose connector somewhere that I'm missing for this board?"
    },
    {
        "post_id":63188,
        "thread_id":59766,
        "title":"820-2936-B Powers Off",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-07-31 11:26:44",
        "message":"Remove the chip and use A4064 board...\n[URL unfurl=\"true\"]http:\/\/www.cmizapper.com\/buy\/easy-flash-loose-bits-and-pieces.html[\/URL]"
    }
]