{"post_id":95600,"thread_id":63473,"title":"820-4924... WTF?","user_id":20634,"username":"StraightToThePoint","post_date":"2023-01-14 22:55:09","message":"No backlight board, board came to me with liquid damage, however very minimal, and the spill seemed to have not contact anything critical.\n\nBacklight circuit has no damage, neither does display connector.\n\n0V on backlight output, started to diagnose with good working screen. I would get image, just no backlight. Q7700 would not open, 12.6V all across the board, BKLT_EN would not drop either. I was inspecting U7700, and Q7700, when I guess from me touching either one (not sure which) Q7700 had a fit, and literally caught fire, and exploded...\n\nThe 4 pads (6,5,1,2) are now exposed, and I can peel back that layer... edit (C7701, no stuff, pin 1 is gone)\n\nPretty f*kd. However testing with a multimeter shows no shorts, and continuity is still fine with those pads. Im almost certain I can repair this board, however Id really like some advice on how to proceed with this.\n\nMy questions are why did Q7700 just implode out of the blue and what could this mean. Everything else reads correctly compared to working board. Could L7710 be a culprit (although looks completely fine).\n\nFunniest part is that when I was testing this with my power supply, I saw the amperage spike to over 3.8A, shut it off, damage was done, and F7700 could not be bothered by this. Fuse is still good!"}
{"post_id":95601,"thread_id":63473,"title":"820-4924... WTF?","user_id":682,"username":"2informaticos","post_date":"2023-01-15 04:17:16","message":"Q7700 can explode only if the current find a way to flow through it to ground.\nDid you check diode mode to ground at both pins of D7710?\nDo it w\/ and w\/o LCD connected."}
{"post_id":95951,"thread_id":63473,"title":"820-4924... WTF?","user_id":20634,"username":"StraightToThePoint","post_date":"2023-01-27 21:46:28","message":"Thank you for the help, D7710 showed low on pin 2 in diode mode, read about 0.150V. Definitely was shorted and found C7710 was shorting the rail. Thank you!"}
