[
    {
        "post_id":62345,
        "thread_id":59664,
        "title":"16\" 2019 Macbook Pro Keyboard Backlight Broken",
        "user_id":26943,
        "username":"MattC867",
        "post_date":"2020-07-14 16:38:32",
        "message":"Hi Folks,\n\nMy 16\" MBP keyboard back-light isn't working. The right half of the board (the half under my right hand) doesn't light up at all. Obviously, the machine is in warranty. The trouble is, I just got it back from Apple and they didn't even fix the issue! The repair sheet simply says \"We re-seated a cable on your board\". Does anyone know which cable they're talking about? Or which cable would be the one that carries signals between the logic board power distribution and the keyboard back-light? I figure I'll try re-seating it myself before sending it back to these knuckleheads again *for exactly the same issue*. \n\nI've opened up the machine but as far as I can tell everything is already properly seated. Willing to try pretty much anything as long as I can  put it back together and Apple service can't tell the difference. Fortunately whoever \"worked\" on it already stretched out every single pull tab under the bottom cover, so I have a lot of latitude to mess around without leaving a trace. \n\nThe kicker was the repair sheet said \"Thank you for choosing Apple service\" - like I have a choice!!"
    },
    {
        "post_id":62348,
        "thread_id":59664,
        "title":"16\" 2019 Macbook Pro Keyboard Backlight Broken",
        "user_id":14386,
        "username":"ZAKLINTOWN",
        "post_date":"2020-07-15 00:04:39",
        "message":"On 16\" models there is fewer connectors, look online for teardown, I believe iFixit might have, hadn't looked at it, since there is a few they might left something under the board as fans are getting plugged into board directly now again....just carefully check again if every single connector has flex going into it."
    },
    {
        "post_id":62353,
        "thread_id":59664,
        "title":"16\" 2019 Macbook Pro Keyboard Backlight Broken",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-07-15 00:52:57",
        "message":"First of all, welcome to the forum!\n\nIf you cannot locate any loose cable\/connector, send it back to Apple.\nTry to explain them better which is the problem."
    }
]