[
    {
        "post_id":49573,
        "thread_id":49573,
        "title":"820-2936 starts only in smc bypass mode",
        "user_id":296,
        "username":"jadao",
        "post_date":"2019-05-30 07:10:50",
        "message":"This board had water damage on bottom side, but no corrosion. Doesn?t start (no fan spin) even if I am in S0 state.\nIn SMC bypass fan does spin but no chime.\nI get green\/orange light, ppbus is 12,56v.\nISL was a little bit greenish, but seems to work good, with battery and charger.\n\nI checked the traces and resistors for pins 17-18 and 27-28, continuity until the chip is good and resistance is 3ohms and 21ohms.\n\nPPDCIN sensor was hit by water checked the resistors and they are good, don?t know if the sensor itself can prevent the board from starting.\n\nLooks like an smc or sensor issue.\nHow to troubleshoot sensors without running ASD? One by one?\n\nI did a slight reflow on smc just in the case if water got there but no change.\n\nultrasonic the board also with no change.\n\n\nthanks!"
    },
    {
        "post_id":49577,
        "thread_id":49573,
        "title":"820-2936 starts only in smc bypass mode",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-05-30 09:59:37",
        "message":"First check AVREF_SMC voltage.\nIf good, check then VP0R and VD0R sensors output."
    },
    {
        "post_id":49596,
        "thread_id":49573,
        "title":"820-2936 starts only in smc bypass mode",
        "user_id":296,
        "username":"jadao",
        "post_date":"2019-05-30 20:06:54",
        "message":"Hi 2informaticos!\n\nAVREF_SMC signal is 3.3V\n\n2.1 v at VP0R output\nWitch looks good according to the voltage divider\n\n2.77v at VD0R output \nWitch also looks good according to the voltage divider\n\nThanks"
    },
    {
        "post_id":49597,
        "thread_id":49573,
        "title":"820-2936 starts only in smc bypass mode",
        "user_id":296,
        "username":"jadao",
        "post_date":"2019-05-30 21:47:33",
        "message":"Pff this one was a bitch, I was about to put back the logicboard for no fix and discovered PP5V_S3 present at L7260 but missing at U7300! Run a wire and the board is back to life.\n\nWhat a luck after 2 hours + ultrasonic :(\n\nThanks for everything"
    }
]