[
    {
        "post_id":51591,
        "thread_id":51591,
        "title":"820-4924 weird display",
        "user_id":7452,
        "username":"MOMOH",
        "post_date":"2019-08-23 06:03:38",
        "message":"Have not a had a problem like this one before , and have been sitting with it for a week now , its rather strange by my own definition. The board would power up okay , backlight shine through the Apple log but no image , however when a apply pressure on the FL8300,FL8301,FL8302,FL8303 , then I will get image . I have replaced the whole in the section, replaced the screen connector , used a known good screen even though this one works on another machine,  check for continuity, check for short, but nothing seems to work. still the same thing, the machine would only give image when I apply pressure in this area. have gone over it again and again, and am sure I might go crazy on this one. I did have to post the value as I suppose that fact that I get backlight will sum that up. Have also attached the section of the image."
    },
    {
        "post_id":51597,
        "thread_id":51591,
        "title":"820-4924 weird display",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-08-23 09:22:50",
        "message":"Check all FL8300-03 coils and their traces to J8300 and corresponding C832x capacitors.\nCompare diode mode readings to ground on all data lines in both case; w\/ and w\/o pressure applied on the board (no power, of course)."
    },
    {
        "post_id":51609,
        "thread_id":51591,
        "title":"820-4924 weird display",
        "user_id":7452,
        "username":"MOMOH",
        "post_date":"2019-08-24 04:45:16",
        "message":"okay , will do and report back , Thank you 2informaticos"
    },
    {
        "post_id":51610,
        "thread_id":51591,
        "title":"820-4924 weird display",
        "user_id":7452,
        "username":"MOMOH",
        "post_date":"2019-08-24 04:57:12",
        "message":"reporting back , FL8300-03 to J8300 traces all checks out okay, diode mode to ground on the various data line are same   when I compared to a working board"
    }
]