{"post_id":35996,"thread_id":35996,"title":"A1398 820-3332A Red video distortion","user_id":1655,"username":"tuner2000i","post_date":"2018-06-20 16:55:35","message":"Hello everyone. Glad to be part of this forum. It's my first shot with macbook reapairs so please have some patience with me.\nI normally do playstation 4 repairs, eveything from smd rework to reballing and so on.\ni decided i wanted to give it a shot with macbooks as well since its a good business especially in the country i live in where there's no competition.\nI bought a macbook a1398 advertised as faulty with gpu artifacts. After speaking with the seller he said that no attempt of repair was made so i decided to buy it. Unfortunately when the product arrived i saw that the board was slaughtered. there are no returns for this so i have to take it as it is and figure something out.\n\nafter searching online i saw that i was not the only one having this specific issue, but i did not see anybody actually resolving it, since most took the laptop to the apple replacement program.\nbasically the screen has red horizontal lines distortion mostly where black background is supposed to be. it does not boot to os, continuously restarts after displaying the last text you see in the picture taken at verbose mode.\nThe previous \"repair person\" tried reflowing the GPU, all VRAM, U8900, U9100 and i think maybe even CPU and other components.. You can see how he left the board in the pictures attached.\nI first reballed the GPU because i had to see if he did not mess something up because i found a solder ball right next to it. after taking it off, i found a few oxidated pads, but unfortunately that did not solve the issue.\nAfter putting everything back together it still does the same.\nThere are 2 things i noticed. When he removed the glue from the VRAM he made a small cut in the PCB, about 1mm. as far as i can see there are no traces affected ( I do not have a microscope, only a powerfull magnifier). Can someone please confirm if there are traces there or not.\nAlso, some components near the VRAM were not soldered properly: C8532 and C8208 . C8524 and C8574 were completely missing. I replaced them with a random capacitor from an ipad 4 board as i do not know what value they should have and if it matters.\n\nI suspect that i have a dead GPU or faulty VRAM. I did not try reballing the VRAM, I would replace them but i dont have 256mb DDR5. i only have 512MB chips from PS4\nAlso I ordered a new GPU N13P-GT-W-A2 from ebay UK.\n\nPlease let me know if i am on the right track or if you have any suggestions. also if you saw something like this before please let me know.\n\nPS: friday i have another A1398 coming in with no video."}
{"post_id":36010,"thread_id":35996,"title":"A1398 820-3332A Red video distortion","user_id":1153,"username":"JohnB8812","post_date":"2018-06-20 19:50:50","message":"I’d sent it back to that lying fuck what an asshole"}
{"post_id":36012,"thread_id":35996,"title":"A1398 820-3332A Red video distortion","user_id":1655,"username":"tuner2000i","post_date":"2018-06-20 20:16:00","message":"yeah i know, but some part of me expected that. you can not really find broken newer model macbooks around here that actually worth the time to fix. i managed to get two quite decent, same model so i guess its good. i consider them study material, which ofc i really hope to fix. On ps4's if the APU is bad, there is no way to replace it with a new one as it is married with 3 other chips. so basically you have a scrap board. this way even if somebody kills the chip before you there is still a chance to fix it. I am confident that this issue can be fixed, i'm not really sure it's the GPU, but i thought its the right thing to start with. also there is no video on HDMI, i'm not sure if it is supposed to be while booting, but there is no signal coming out at all."}
{"post_id":36034,"thread_id":35996,"title":"A1398 820-3332A Red video distortion","user_id":2,"username":"dukefawks","post_date":"2018-06-21 15:40:57","message":"I would first pull the VRAM and if you want reball it. Else swap with new. \nFor the missing components it is best to get a donor board for $20 from Ebay\/Ali. The caps you mentioned won't affect anything so that is not the issue.\n\nU8900 was of course the original problem and just needed a resolder\/reflow."}
{"post_id":36043,"thread_id":35996,"title":"A1398 820-3332A Red video distortion","user_id":1655,"username":"tuner2000i","post_date":"2018-06-21 16:08:49","message":"thanks for your reply dukefawks. have you seen something similar to this before?\ncan vram be faulty as well? i also did a reflow on them but nothing changed. that's why i am thinking that they either need reballing or replacement. that is if it's not the GPU that actually needs replacing. from what i read online, the symptom with no boot can be caused by bad gpu, right?\nalso, did you check the picture i put from the VRAM, do you think there are any traces there in the lower layers of the PCB? it does not look like something was damaged, but just wanted to double check"}
{"post_id":36044,"thread_id":35996,"title":"A1398 820-3332A Red video distortion","user_id":2,"username":"dukefawks","post_date":"2018-06-21 16:22:24","message":"No way to tell if it is the GPU\/VRAM or the board itself. I bet the problem is that there is still some glue under the VRAM and that messed up the balls. If there are traces in the 2nd layer I have no idea. If you want to be sure you can get new VRAM, I would wait with replacing the GPU with that Ebay one as the original is probably better. The Ebay one could be a remarked fake one."}
{"post_id":36069,"thread_id":35996,"title":"A1398 820-3332A Red video distortion","user_id":1655,"username":"tuner2000i","post_date":"2018-06-22 18:47:54","message":"No Title\n\nyeah... i read about the fake gpu's and also saw the video Louis made. I have just finished reballing the VRAM. nothing changed. I believe that the VRAM was reballed or changed before. it was quite clean underneath but i am 90% sure they had leaded solder balls. Also, it's very obvious that in the deep scratch some copper from a trace can be seen. as far as i can tell it looks intact. i tried touching it with the multimeter probe on diode mode to find out where it goes but could not find out. i do not want to make the hole bigger only as a last resort, if nothing changes after GPU replacement either...\nalso i replaced the two capacitor mentioned before with same as original values 0.1uF , 6.3V from an iPhone board. now eveything seems to be in place.\ni was able to fully install windows on the machine, but the graphics is even more terrible (i see 4 small screens aligned to the left of the monitor and then just rainbows) and i can not see on which card it's running on. one thing i noticed is that the GPU gets very hot and the fans are almost all the time at full speed.\nwhere i can get some VRAM blocks? do they work from other laptops as well? how about putting bigger size (this i think should not work)."}
{"post_id":36077,"thread_id":35996,"title":"A1398 820-3332A Red video distortion","user_id":2,"username":"dukefawks","post_date":"2018-06-23 07:55:58","message":"Only put the exact same VRAM on there as there should be. It could very well be that the traces inside the board got fucked up by too much heat so it may not be fixable at all. \nGet some new VRAM and a GPU and slap it on there, if that does not help it is probably the board itself."}
{"post_id":36087,"thread_id":35996,"title":"A1398 820-3332A Red video distortion","user_id":1655,"username":"tuner2000i","post_date":"2018-06-23 11:41:08","message":"from my pov the board looks ok despite the fact that they tempered with it pretty hard. i dont know how much these boards last in time, but until now for me it never happened that a board was completely damaged beyond repair (this ofc if i was able to trace where the problem was). some boards were indeed damaged and the pcb was popcorned but that because they were heated up with heat guns.. i had broken pads or traces but most of them fixable. the only concern i have is with that cut over there, but if changing the GPU will not help then i will consider making the hole bigger and see exactly what happened there.\nunfortunately since this is my first attempt to repair a macbook i do not have spare parts. the other A1398 i was supposed to buy, the buyer sold it to somebody else :( \nis there any way to get fast and cheap VRAM in europe? i saw that those boards on ali don't have RAM chips on them and takes about 1 month to deliver to EU. \n\nit can ofc be some componenent dead beside gpu or vram but i have to be at least 100% sure its not these\n\ni saw the exact issue in these posts\/link as well so seems that it happened before\n\n[url]https:\/\/www.youtube.com\/watch?v=p1qaxFbaZJg[\/url]\n\n[url]https:\/\/www.ifixit.com\/Answers\/View\/418633\/Horizontal+lines+on+screen+-+red+screen[\/url]\n\nand some repair shop claiming they can fix it...\n\n[url]https:\/\/www.kingfishercomputers.co.uk\/apple-imac-repairs\/[\/url]"}
{"post_id":36089,"thread_id":35996,"title":"A1398 820-3332A Red video distortion","user_id":2,"username":"dukefawks","post_date":"2018-06-23 11:45:25","message":"These boards do not even have to visibly popcorn to destroy them. They are so densely packed that there are many buried vias the you cannot even see. Many pads under GPU\/VRAM are directly on top of a via so putting any mechanical stress on them will separate them from the via and still look fine.\nJust order some VRAM from China and a donor board or 2. Yes it will take 2-3 weeks, but that is just how this is."}
{"post_id":36106,"thread_id":35996,"title":"A1398 820-3332A Red video distortion","user_id":1655,"username":"tuner2000i","post_date":"2018-06-24 12:07:43","message":"No Title\n\ni was referring to an extreme case where the PCB is popcorned. But this guy seemed to know what U8900 was as i can see that he redid the solder joints on it with leaded solder. the only thing i can say 100% he did not reball or replace was the GPU.\nspeaking about replacing, can somebody please confirm the VRAM model and number on these boards. I have to make sure that i have the right ones and that i order the right ones as well.\nmeanwhile i tried to activate intel GPU in windows without success since the only method i found has to have a working copy of MAC OS.\nI attached a picture so you can see how windows looks like. the resolution is fixed on 800x600, can not be changed.\nAlso the video card 650m is detected and installed but shows error 43 in device manager and GPU-Z can not detect any RAM and no frequency on it...\none thing i do not understand is why the print screens show up fine? should they not be distorted as well? i can not get image on external display i tried the HDMI cable and also thunderbolt to hdmi. it says no signal all the time."}
{"post_id":36128,"thread_id":35996,"title":"A1398 820-3332A Red video distortion","user_id":2,"username":"dukefawks","post_date":"2018-06-24 17:41:06","message":"Windows will not activate the GPU as you need the bootcamp drivers installed. Just ditch the whole windows idea and go OSX please.\nThe VRAM on your board is the correct version."}
{"post_id":36134,"thread_id":35996,"title":"A1398 820-3332A Red video distortion","user_id":1655,"username":"tuner2000i","post_date":"2018-06-24 19:10:26","message":"I have installed the bootcamp drivers. Everything works besides video card.I dont want to run windows on it, i just wanted to see if i can get some usefull info about the board. Just filling time until the gpu arrives. I tried mac os, ubuntu and fedora but none boots. They all hang probably right after trying to load the gpu drivers.\nif gpu or vram are the problem should not the printscreens be distorted as well?"}
{"post_id":36159,"thread_id":35996,"title":"A1398 820-3332A Red video distortion","user_id":2,"username":"dukefawks","post_date":"2018-06-25 17:18:55","message":"I have no idea  about the screen capture. Report back once GPU and VRAM are replaced and also order a donor board."}
{"post_id":36386,"thread_id":35996,"title":"A1398 820-3332A Red video distortion","user_id":1655,"username":"tuner2000i","post_date":"2018-06-29 16:20:40","message":"just replaced gpu. issue is still there :( did not have high hopes anyway\nbut i have noticed something. my PP1V5R1V35_S0GPU is not 1.5V as it says in the manual. I have 1.33V\n\nedit: just saw that this model of vram works with 1.35V as well, so it should be good i guess. i have ordered the vram but it will take a long time to get it"}
{"post_id":36413,"thread_id":35996,"title":"A1398 820-3332A Red video distortion","user_id":1655,"username":"tuner2000i","post_date":"2018-06-30 11:12:07","message":"No Title\n\ni have removed 2 of the VRAM and the red lines dissapeared i had only some white lines but not so thick. i removed the last 2 blocks as well and now there are no lines just white screen. so i think the issue is in the VRAM or the connections between the VRAM and GPU (which can not be repaired ). i found a good working board with 8GB ram for about 200 euro and i bought it. in one month when vram comes from ali i will try to make this one as well. is it possible to upgrade the ram memory from that board with this one to extend it to 16GB? do i have to replace all ram blocks?"}
{"post_id":36425,"thread_id":35996,"title":"A1398 820-3332A Red video distortion","user_id":2,"username":"dukefawks","post_date":"2018-06-30 12:26:28","message":"You cannot just remove VRAM and then expect things to make sense anymore. Replace ALL the VRAM it is all needed."}
{"post_id":36427,"thread_id":35996,"title":"A1398 820-3332A Red video distortion","user_id":1655,"username":"tuner2000i","post_date":"2018-06-30 13:12:01","message":"i know what you mean. i removed it to have the board cleaned by the time the new ones will come. decided to test it to see how it behaves. i am learning while reparing. remember it's my first aproach to a macbook repair."}
