[
    {
        "post_id":50431,
        "thread_id":50431,
        "title":"a1534 Hall sensor to sleep",
        "user_id":1101,
        "username":"ielectron",
        "post_date":"2019-07-03 05:33:50",
        "message":"I replaced a French keyboard to a UK layout one, customer asked for it, not the laptop wont go to sleep when the lid is closed, than i noticed that on the original keyboard there is only one Hall sensor on the left side, and of course there is only one magnet in the lid on the left side but not on the right, and with the new keyboard there is 2 Hall sensor on left and right side, and if i use 2 magnets than the laptop would go to sleep, but of course i cannot install another magnet inside the lid, for that i have to remove the LCD and it would be broken.\n\nSo is it possible to just like remove one Hall sensor or maybe solder a cable like its always on, or its not worth it and i should just order another keyboard with 1 Hall sensor? This laptop is 2015, i think 2016 2017 model has different keyboard."
    },
    {
        "post_id":50433,
        "thread_id":50431,
        "title":"a1534 Hall sensor to sleep",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-07-03 05:48:00",
        "message":"Either on 00045, or 00244 board, J4801 has only one pin for SMC_LID signal.\nSignals for two hall sensors are processed inside keyboard.\nUnless you can disbale one, cutting off its line for example (if possible), then get the correct keyboard."
    },
    {
        "post_id":50486,
        "thread_id":50431,
        "title":"a1534 Hall sensor to sleep",
        "user_id":1101,
        "username":"ielectron",
        "post_date":"2019-07-05 02:03:16",
        "message":"i was able to measure it, the Hall sensor in this case constatnly outputs 3.3V, and when i put a magnet near to it it cuts off the 3.3V, so when the lid is closed the Hall sensor wont output the voltage, so it was easy, i just desoldered the second chip  from the keyboard (iron, not with hot air) and now it works"
    }
]