{"post_id":87075,"thread_id":62436,"title":"MacBook  A2179 \/ Board 820-01958 - liquid damage, Stuck at 5v.","user_id":35597,"username":"zeydullak","post_date":"2022-03-08 18:36:07","message":"Hi Guys,\n\nI am a new member and what a nice forum you made. Jumping on to the topic. We have a liquid damaged Macbook A2179, and we need your help to fix it. We observed corrosions between Q7660 and Q7680 chips. Cleaning with isopropyl and applying some Amtech flux to resolder. \n\nWhen the board connects to the charging cable 61W AC adapter, the USB-C amp meter shows 5v. Amper meters start with 0mA, after 1 second, 100mA and then 230mA, then back to 00 and continues. It loops. \n\nWe have the main power rail PPBUS_G3H - 12.28v (should be 12.60v). But it should be 12.60. \n\nChecked the CD3217 Chips responsible for power management. Both input and LDOs are there.  \n\nPP3V3_G3H_RTC - 3.3v\nPP1V5_UPC_X_LDO_CORE - 1.5v OK\nPP3V3_UPC_X_LDO      - 3.3v OK\n\nBasically, I do not see any problems with CD3217 but I might be wrong. So next step is to check if the charger receives PPBUS_G3H and it receives it (12.28v).\n\nThen I decided to check the CHGR_EN_MVR that is signal coming from Charger (U7000) to U6960. I am using Siglent Digital Occiloscope to measure this. So I turned on the mainboard and the Siglent Occiloscope was connected to the ground and R6960 (1pin). the signal is missing. Normally I should see a straight line but nothing is there. I do not know if something is preventing this signal or charger failed or maybe T2 Chip\/T2 Data related issue. \n\nI attached the picture of the corrosion area as well. \n\nI am lost in the board scheme and cannot move further to troubleshoot the issue. I also referred to this link --> [URL]https:\/\/logi.wiki\/index.php\/CD3217_and_T2_Power_on_Sequence[\/URL]\n\nPlease advise what are the next steps for troubleshooting. \n\nBig thanks.\nZeyd"}
{"post_id":87076,"thread_id":62436,"title":"MacBook  A2179 \/ Board 820-01958 - liquid damage, Stuck at 5v.","user_id":682,"username":"2informaticos","post_date":"2022-03-08 19:17:26","message":"First of all, welcome to the forum!\n\nBe sure all resistors in that area have correct value.\nAlso replace corroded caps.\n\nDon't waste time hunting DC signal with o-scope; use DC voltmeter.\nDo you get L6960 voltage?\n\nWhat is the USB-C behavior (on ampmeter), when both charger and battery are connected?"}
{"post_id":87102,"thread_id":62436,"title":"MacBook  A2179 \/ Board 820-01958 - liquid damage, Stuck at 5v.","user_id":35597,"username":"zeydullak","post_date":"2022-03-09 10:54:56","message":"Thank you. I am checking the resistors at the moment.  L6960  has a 3.3v on both sides.  \n\nI have another working exact same Macbook. I put this mainboard to the working MacBook Pro. USB-C meter shows 20.3v and 0.00 amps. It is not using any power. \n\nOriginal MacBook has burned areas and I attached pictures of it here so that you better understand the damage. I am missing also the PP5V_G3S power rail on this mainboard. I do not know if this is always-on power rail or not. Please check the attached pictures.\n\nIs it possible to test caps and make sure they are working or not?"}
{"post_id":87105,"thread_id":62436,"title":"MacBook  A2179 \/ Board 820-01958 - liquid damage, Stuck at 5v.","user_id":35597,"username":"zeydullak","post_date":"2022-03-09 12:12:23","message":"Just measured the Resistors near the corroded area without removing resistors from the board. \n\nR7664 - 3.1 Ohm\nR7666 - 2.5 ohm\n\nR7684 - 2.3 Ohm\nR7686 - 3.2 Ohm"}
{"post_id":87108,"thread_id":62436,"title":"MacBook  A2179 \/ Board 820-01958 - liquid damage, Stuck at 5v.","user_id":682,"username":"2informaticos","post_date":"2022-03-09 12:32:24","message":"With such damage caused by liquid on audio flex\/board, T2 is very likely dead.\nLeakage from PPBUS_G3H to T2 data line happens very often on these models."}
{"post_id":87112,"thread_id":62436,"title":"MacBook  A2179 \/ Board 820-01958 - liquid damage, Stuck at 5v.","user_id":35597,"username":"zeydullak","post_date":"2022-03-09 12:55:57","message":"So basically PPBUS-G3H damaged the T2 chip by shorting to the data line. Are there any other steps I can check to be sure if T2 is dead or not? Like to tell the customer the exact answer. Thank you."}
{"post_id":87115,"thread_id":62436,"title":"MacBook  A2179 \/ Board 820-01958 - liquid damage, Stuck at 5v.","user_id":682,"username":"2informaticos","post_date":"2022-03-09 14:57:48","message":"Check diode mode to ground on T2 data lines going to audio board; like SPKRAMP_RESET_L, etc."}
{"post_id":87118,"thread_id":62436,"title":"MacBook  A2179 \/ Board 820-01958 - liquid damage, Stuck at 5v.","user_id":35597,"username":"zeydullak","post_date":"2022-03-09 15:59:19","message":"Yes, it is shorted to the ground. It made a beeping sound. This is the end, right?"}
{"post_id":87120,"thread_id":62436,"title":"MacBook  A2179 \/ Board 820-01958 - liquid damage, Stuck at 5v.","user_id":682,"username":"2informaticos","post_date":"2022-03-09 16:04:26","message":"Unfortunately, yes..."}
