[
    {
        "post_id":24917,
        "thread_id":24917,
        "title":"820-00164 Not booting fully.",
        "user_id":135,
        "username":"bjf",
        "post_date":"2017-08-31 19:08:22",
        "message":"This keeps getting stuck on the progress bar. I've obsessively check all of the SPI resistors and traces. Tried a different SPI ROM. I've attached a picture of the area of the board that got spilled on. The spill only hit the U6100 area. It's obvious I have an SPI ROM-related issue, but I'm not sure where to get next with it."
    },
    {
        "post_id":24948,
        "thread_id":24917,
        "title":"820-00164 Not booting fully.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-09-01 16:09:56",
        "message":"You cannot swap the ROM chip from another board. Was the original ROM ever touched?"
    },
    {
        "post_id":24963,
        "thread_id":24917,
        "title":"820-00164 Not booting fully.",
        "user_id":135,
        "username":"bjf",
        "post_date":"2017-09-01 18:43:46",
        "message":"When I say I tried another ROM it's always only for testing, just to see if I can get a different response out of the board. I put the original one back after I observed no difference. This board came to me without anyone else working on it. It had a spill and the picture is truly the only part that got hit, it just happens to be right on top off the ROM."
    },
    {
        "post_id":24965,
        "thread_id":24917,
        "title":"820-00164 Not booting fully.",
        "user_id":316,
        "username":"G.Beard",
        "post_date":"2017-09-02 04:51:14",
        "message":"PRAM reset, booted in single user and fsck -fy the OS?\nBooted from external drive?"
    },
    {
        "post_id":24988,
        "thread_id":24917,
        "title":"820-00164 Not booting fully.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-09-03 03:32:27",
        "message":"It could be ME region issues. I do not have a BIOS with clean ME for these. Check this thread and send them a PM [url]https:\/\/www.rossmanngroup.com\/boards\/forum\/board-repair-troubleshooting\/11949-macbook-air-2015-board-820-00165-problem-with-loading-osx-after-efi-reprogramed[\/url]"
    },
    {
        "post_id":25004,
        "thread_id":24917,
        "title":"820-00164 Not booting fully.",
        "user_id":135,
        "username":"bjf",
        "post_date":"2017-09-03 11:41:28",
        "message":"Ok, thanks, I think I have one. That's the variable I was trying to remove by testing with another ROM. Assuming that ROM also doesn't have a bad ME, wouldn't the system at least boot up, but run slowly?"
    },
    {
        "post_id":25010,
        "thread_id":24917,
        "title":"820-00164 Not booting fully.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-09-03 13:41:56",
        "message":"You can never swap a ROM and expect it to boot. ME is tied to the specific CPU\/PCH on the board. You MUST use a clean ME if you want to test another BIOS."
    },
    {
        "post_id":25047,
        "thread_id":24917,
        "title":"820-00164 Not booting fully.",
        "user_id":468,
        "username":"ALB-Repairs",
        "post_date":"2017-09-05 09:36:46",
        "message":"I can tell you if it had liquid damage around the SPI then its shafted the bios chip and you need to replace it with a clean ME\nIve seen liquid damage around the SPI cause so many macbook airs to hang right near the end of boot and a reflash on a new bios chip has always resolved it for me."
    }
]