{"post_id":55814,"thread_id":55814,"title":"820-00923 Takes a looooong time to wake from sleep?","user_id":515,"username":"SMMRepair","post_date":"2020-01-15 17:24:37","message":"I have an 820-00923 with a few different symptoms that I believe \"might\" be caused by a bad SMC. Basically, it either won't wake from sleep, or takes a very, very long time. Additionally, the power button TouchID and SMC reset functions work, but the button will not turn the board\/unit on or turn it off. You can hold it indefinitely when the unit is powered and it won't do anything. I have tried multiple power buttons (including original to the board), and none work. However, the power button WILL work for an SMC reset.\n\n1. 820-00923, liquid damaged and heavily cleaned before we received; repaired damage to backlight circuitry and a few other very minor non-critical areas.\n2. The power function of the power button does NOT work, but the TouchID and SMC reset functionalities DO WORK.\n3. Diode readings on mesa connector match working board.\n4. Additionally, the unit will not wake from sleep sometimes, beyond trackpad clicking and keyboard backlight \"sometimes\" coming back. Sleep duration does not matter, could be 5 seconds or 20 minutes. Unit will SOMETIMES come back from sleep, but not reliably.\n\nI have not measured PM_PWRBTN_L when depressing power button because I physically can't do it; I need 3 hands. :)\n\nAny ideas? Going to give the SMC a reflow now and will see if that helps. It does look like SMC is a pretty good candidate since it handles power-button-related and sleep-related functions on this model. Curious if there's anything I can check\/test if reflowing SMC doesn't work. Really hate these units right now. :)\n\nEdit: SMC reflow had no effect. Hoping this isn't a PCH\/CPU issue! :("}
{"post_id":55818,"thread_id":55814,"title":"820-00923 Takes a looooong time to wake from sleep?","user_id":682,"username":"2informaticos","post_date":"2020-01-15 18:56:02","message":"You should reball SMC, if board was liquid damaged.\nCheck first all LID and HALL_SENSOR signals.\n\nRemove R4911 and check if you can turn it on\/off with R5225\/26 pads."}
