{"post_id":20909,"thread_id":20909,"title":"820-2915 Ram slot failure after GPU rework","user_id":468,"username":"ALB-Repairs","post_date":"2017-05-26 07:27:47","message":"Hi, Been a while since i last posted. \n\nOn some 2915's i do the GPU on i have experienced ram slot failure (usually the top slot)\n\nIve been wondering if this is something that is resolveable. \nPart of me thinks its CPU ball related, but other clues suggest the slot itself.\n\nIts an iritating fault, and awkard explaining that there slot has failed during rework.\n\nAnyone have any idea of the actual cuase, its only happened on about 3\/30 boards but if i can prevent it i will."}
{"post_id":20910,"thread_id":20909,"title":"820-2915 Ram slot failure after GPU rework","user_id":461,"username":"Gurmon","post_date":"2017-05-26 08:10:34","message":"Its got to do with the way you are doing the rework,or holding the board down. Its never fixable permanently (afaik). Obviously you know what your doing, you may want to tweek your profile a little.\n\nI've done +100 of these, and not a single RAM slot failure. (Famous last words)"}
{"post_id":20916,"thread_id":20909,"title":"820-2915 Ram slot failure after GPU rework","user_id":2,"username":"dukefawks","post_date":"2017-05-26 09:43:12","message":"Too much heat, too long. I don't even remove the RAM sticks, speaker, mag safe, never had an issue.\nThere is no need to heat the complete board. The GPU are is a nice separate area of the board and only that should be heated."}
{"post_id":20930,"thread_id":20909,"title":"820-2915 Ram slot failure after GPU rework","user_id":461,"username":"Gurmon","post_date":"2017-05-26 13:56:21","message":"Duke, which rework station do you use ? Just interested."}
{"post_id":20971,"thread_id":20909,"title":"820-2915 Ram slot failure after GPU rework","user_id":468,"username":"ALB-Repairs","post_date":"2017-05-28 18:38:32","message":"I was being silly with the reason i posted, there was a stray solder ball that worked into the pins (i always remove serial number stickers before rework)\n\nIve only had it happen 4 times\nfirstly on my own mac mini. Like wtf, cant be ram slot solder, one dropped out and the other then did a few months after -- as far as i know its a weak memory controller on sandybridge  CPU's\n\nI had two boards when have one slot fail when i was using my old shuttlestar station with a  different board layout.\n\nIve seen apple refurbed boards do it.\n\nAnd recently i had one fail after a GPU came back within a few days though.\n\nIm thinking it is more likely CPU related than PCB related, 3 of the four boards ive seen it on failed over a decent time period, im just wondering if the lead free process is enough to mess with the CPU balls just that little bit, and if its worth starting to flux them prior to rework."}
