[
    {
        "post_id":76971,
        "thread_id":61360,
        "title":"820 01598 Liquid damage no display",
        "user_id":1104,
        "username":"Jay",
        "post_date":"2021-06-24 14:27:38",
        "message":"Hi folks,\n\nGot a board here that is immaculate but *every* solder joint and every cap\/resistor on the board is discolored. So this was liquid damaged and cleaned after. Been out of the game for a while and I primarily work on older machines so no idea where to start on this one.\n\nUnit draws 19.6V and starts at 0.49 amps, working it's way up to 1.6 amps. When the power is connected I can hear the iphone charging chime and the fan spins a few times. CPU gets warm until I hold down the power button to turn it off. Keyboard backlight stays off, touch bar never turns on. \n\nI figured with the CPU getting warm this thing may actually be booting but the display stays black and even with a flashlight I see no image.\nChecked all the connectors and cables, no corrosion or discoloration on any of them.\n\nAny recommendations on where to start? \nThanks!"
    },
    {
        "post_id":76976,
        "thread_id":61360,
        "title":"820 01598 Liquid damage no display",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-06-24 16:01:55",
        "message":"Check USB activity and external video.\nAny sign of liquid at video connector, touchbar, or audio board?\n\nTry DFU revive.\nEven restore, if no important data to save."
    },
    {
        "post_id":77114,
        "thread_id":61360,
        "title":"820 01598 Liquid damage no display",
        "user_id":1104,
        "username":"Jay",
        "post_date":"2021-06-28 13:53:10",
        "message":"Thanks 2informaticos.\nNo USB activity and no external video. \nNo signs of liquid exposure at video connector, touch bar and no discolored solder\/components either.\n\nUnable to do DFU anything as I do not have another Mac with USB-C. If there is no other way to DFU I'll shelf this repair for now and try that if another USB-C mac comes in."
    },
    {
        "post_id":77115,
        "thread_id":61360,
        "title":"820 01598 Liquid damage no display",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-06-28 13:55:52",
        "message":"It should wotk with a good USB-C hub to USB 3.0 too."
    }
]