{"post_id":61611,"thread_id":59576,"title":"820-00244 - A1534 2016 Running Slow","user_id":21454,"username":"GoodguyFR","post_date":"2020-06-29 17:48:26","message":"Hi !\n\nI hate to work on this board, no fan spin = no fun. The board was liquid damaged, came here with no image. I refurbished the LCD connector that had minor corrosion and replaced the flex, LCD came back. When LCD went back, I discovered there was no KB no TP, the TP flex was damaged so I changed it too and now I have KB and TP, access to session and battery detection & charging.\n\nThe last problem is that the Mac is running really slow, I ultrasonic cleaned the board, no change. I tried with another battery and an other LCD, same thing. I found that PPBUS_G3H is a bit higher as expected at 8.75V and it's probably a clue but I don't know how to interpret this.\n\nThank you for you help and ask me anything that I forgot on this description."}
{"post_id":61613,"thread_id":59576,"title":"820-00244 - A1534 2016 Running Slow","user_id":682,"username":"2informaticos","post_date":"2020-06-29 18:17:31","message":"Run HWMonitor and see if reports any strange value."}
{"post_id":61656,"thread_id":59576,"title":"820-00244 - A1534 2016 Running Slow","user_id":21454,"username":"GoodguyFR","post_date":"2020-06-30 17:49:54","message":"The only thing strange is the \"Heatpipe outgoing Air\" sensor, which is fun because there is no heatpipe on these...the temp is 128°C. Also it shows me 0.00V on something called \"Mainboard S0 Rail\", I don't think it makes sense, the Mac wouldn't run if it was the case."}
{"post_id":61665,"thread_id":59576,"title":"820-00244 - A1534 2016 Running Slow","user_id":682,"username":"2informaticos","post_date":"2020-06-30 18:35:43","message":"Heatpipe temp is irrelevant; I saw it in older machines and doesn't affect.\nShould still be corrosion somewhere on the board.\nTry to start in diagnostic mode."}
{"post_id":61702,"thread_id":59576,"title":"820-00244 - A1534 2016 Running Slow","user_id":21454,"username":"GoodguyFR","post_date":"2020-07-01 09:33:15","message":"Good call diag mode. I have 2 error codes, PFM006 related to the SMC and PPN001 related to the power management. I don't have any SMC for this board to try right now, but if there is crap under the SMC maybe a reballing would be enough. Before, do you have a good board like this to compare some values on SMC and Power IC in diode mode ?"}
{"post_id":61893,"thread_id":59576,"title":"820-00244 - A1534 2016 Running Slow","user_id":21454,"username":"GoodguyFR","post_date":"2020-07-05 07:32:46","message":"Up :)"}
{"post_id":61897,"thread_id":59576,"title":"820-00244 - A1534 2016 Running Slow","user_id":682,"username":"2informaticos","post_date":"2020-07-05 12:33:12","message":"Change the trackpad, or test with known good one..."}
