{"post_id":31132,"thread_id":31132,"title":"Determining RAM issues on 820-3330","user_id":515,"username":"SMMRepair","post_date":"2018-02-05 14:26:25","message":"We've had a few 820-3330 boards returned to us with reported RAM issues. The boards all pass ASD without issue (20 passes), but they seem to hang\/freeze when we run AHT. The cursor doesn't freeze, but AHT locks up and won't respond (\"stop testing\") at all, even if left for hours and hours.\n\nIs there a definitive way to determine if these boards have RAM issues? We don't seem to have this problem with other models, but the 3330 specifically seems to have a lot of RAM issues (similar to the 3115 units?), except it seems to affect both slots on most boards.\n\nIs there a way to more thoroughly test these boards for RAM functionality specifically? Maybe something along the lines of FurMark for RAM? Should we ignore AHT freezing if the board passes ASD? We can't replicate the failures most of the time, but our customers (good customers, not eBay customers) swear the boards froze on them. Any input appreciated. We have a ton of these 3330 boards with reported RAM\/\"GPU\" issues, but I'm not sure how to make the boards fail and replicate those issues reliably each time. We've run ASD on boards for 10 hours, manually test them (youtube videos\/isight\/etc) for 24 hours, agitated the units (pressed on RAM banks and move unit around firmly during stress-testing, etc) and can't seem to replicate the failures. We'll then re-sell the board, and inevitably it will come back a few days later with a reported RAM\/freezing\/\"GPU\" issue.\n\nAny ideas?"}
{"post_id":31134,"thread_id":31132,"title":"Determining RAM issues on 820-3330","user_id":2,"username":"dukefawks","post_date":"2018-02-05 14:59:49","message":"If RAM would be a problem the system typically locks up or crash and reboot. The cursor still being able to move is more likely to be a GPU issue. With these board that is hopeless as I believe the problem is inside the board vias.\nWere any of these boards repaired\/messed with?"}
{"post_id":31135,"thread_id":31132,"title":"Determining RAM issues on 820-3330","user_id":515,"username":"SMMRepair","post_date":"2018-02-05 15:56:26","message":"Hey Duke, nope none of them show signs of repair at all. I thought it might be the GPU, but was optimistic when I saw the boards kept freezing during the first ~10 seconds of the RAM test on AHT. Any recommendation on what to do with the boards? I think we'll end up having damn near 20 of them...\n\nedit: On that note; is there anything we can do to force these boards to crash if it is the GPU? Run FurMark for 10 hours or something? I want to recreate the failures for my own peace of mind."}
{"post_id":31142,"thread_id":31132,"title":"Determining RAM issues on 820-3330","user_id":2,"username":"dukefawks","post_date":"2018-02-05 21:12:16","message":"I use \"Heaven\" for stress testing the GPU. You could also try and run the board on 1 RAM slot, the bad one is usually the one closest to the keyboard so where you put the first stick in.\n\nIf it is the EFI version of AHT that locks up then it is not a GPU issue. EFI version does not load drivers for the GPU that would crash."}
{"post_id":31156,"thread_id":31132,"title":"Determining RAM issues on 820-3330","user_id":515,"username":"SMMRepair","post_date":"2018-02-06 14:30:43","message":"Thanks, Duke. Would you be interested in having me send you a few of these weird GPU issue boards? I'm not sure if you've stopped trying to figure them out or not, but they'll be used for parts otherwise. Shoot me a message if so. A real shame, as we have so many. Thanks again!"}
{"post_id":31158,"thread_id":31132,"title":"Determining RAM issues on 820-3330","user_id":2,"username":"dukefawks","post_date":"2018-02-06 15:21:01","message":"Were they locking up under EFI hardware test or under the OS version?"}
{"post_id":31163,"thread_id":31132,"title":"Determining RAM issues on 820-3330","user_id":515,"username":"SMMRepair","post_date":"2018-02-06 16:22:49","message":"I'm going to do some testing tonight on all boards and let you know (I want to make sure I give you good information). Going to run them all through ASD EFI\/OS, AHT and Heaven and see how it goes. From what I've seen so far, the bad boards seem to freeze on AHT mem test (within 10 seconds), but seem to pass ASD EFI\/OS just fine (I think two of them failed ASD OS (memory test), even with one stick in either slot). I've even left ASD running on 50-loops and come back and the boards will pass just fine, but then will freeze during AHT immediately. I'll leave it overnight and come back and it's still frozen, so it's definitely freezing (and not just lagging during testing).\n\nI'll get some good data with regards to specific freezing with one stick of RAM, then two, and AHT\/ASD\/Heaven. I do think there's probably a mixture of boards with RAM issues and boards with GPU issues, and maybe even some with both (blurring the lines). I'll get good, clean symptoms for them and go from there.\n\nQuick question: When running Heaven, will GPU failure result in power-loss\/restarting, or freezing? I really want to hammer these things to force the failure (they aren't sale-able at this point), so I'd like to make sure I can reliably identify a GPU failure vs. a RAM issue. Does that make sense? Thanks again, Duke, really appreciate it."}
{"post_id":31165,"thread_id":31132,"title":"Determining RAM issues on 820-3330","user_id":2,"username":"dukefawks","post_date":"2018-02-06 17:13:44","message":"GPU issue will manifest itself with either image issues or a kernel panic and reboot. A hard lockup is not common, the cursor can usually still be moved and caps lock light will still work and audio will keep running.\n\nRAM issues will hard lock up the machine possibly resulting in kernel panic and a reboot.\n\nAlso try using DDRL PC12800 memory as some of them were originally equipped with that. In any case it will never hurt to use that."}
