{"post_id":4902,"thread_id":4902,"title":"How does a BATLOW_L signal work?","user_id":288,"username":"DannyRinc","post_date":"2016-07-28 20:01:16","message":"I have yet another MacBook Pro, this one an 820-4924-a. It shows a green light and orange light, but won't boot. I'm not getting a BATLOW_L signal. The schematic says it goes from SCM (u5000) to PCH (u0500) with a pull up resistor in the middle.\n\nDoes it go like this?\n\n.........Resistor\n...............|\nSMC----------------PCH or SMC ------ Resistor ---- PCH\n\n[IMG]https:\/\/www.rossmanngroup.com\/boards\/filedata\/fetch?filedataid=418&type=thumb[\/IMG]\n\nSo does the SMC short the signal to ground when the battery is low? I'm getting 3.3v from PP3v3_S5_PCH_GPIO on pin 1 of R1410, but nothing on the other side of it, so I'm not sure where I need to look for a short to ground.\n\nOn an unrelated note: On the battery connector J7050 I'm getting 12.3v on C7050 and C7060, but then the voltage steadily drops to 4v and then jumps back to 12.3v. Bad cap? Or bad MOSFET? Should I be getting 12.6v or does 12.3v out of PPBUS_G3H mean something is bad?"}
{"post_id":4904,"thread_id":4902,"title":"How does a BATLOW_L signal work?","user_id":1,"username":"larossmann","post_date":"2016-07-28 20:42:18","message":"PP3V3_S5_PCH_GPIO is coming from PP3V3_S5, PP3V3_S5 is created by PPBUS_G3H, and PPBUS_G3H creates PPVBAT_G3H_CONN when the battery is not plugged in. If the voltage is dropping to 4v on PPVBAT_G3H_CONN it makes no sense how PP3V3_S5 wouldn't be jumping as well.\n\nIs PPBUS_G3H stable?\n\nAre the two current sensing circuits on U7100, between pins 17\/18 and pins 27\/28 measuring proper resistance(2.something and 20.something ohms)?\n\nThe batlow signal can suck it if we don't even have stable PPBUS_G3H voltage yet."}
{"post_id":4915,"thread_id":4902,"title":"How does a BATLOW_L signal work?","user_id":288,"username":"DannyRinc","post_date":"2016-07-29 11:24:28","message":"PPBUS_G3H is stable at 12.3v. Again I'm not sure if it's supposed to be at 12.6v. I'm getting 18.6v at Q7180, but only getting 18.1v~18.2v out. From there I'm getting 12.3v out of F7140 consistently with no drops.\n\nPins 17\/18 show 3.8 ohms, but  R7151 shows 2.3 ohms and R7152 shows <.1 ohm. From R7151 to R7150 there's .8ohms of resistance, but there shouldn't be any resistance whatsoever since it's just a straight lead, right?\n\n27\/28 shows 230ohms. R7121 is dead with 127 ohms, R7122 shows 82 ohms, gotta replace both those.\n\nI'll go ahead and replace R7121, R7122, and R7150 and let you know what happens."}
{"post_id":4923,"thread_id":4902,"title":"How does a BATLOW_L signal work?","user_id":288,"username":"DannyRinc","post_date":"2016-07-29 16:01:45","message":"Swapped out 21 & 22, between pins 27 & 28 I now have 20.1 ohms resistance. I swapped out the other 3 resistors as well, R7151 reads 2.2 ohms, ~<.1 ohm for the other two. Still getting 3.8 ohms between 17 & 18. Does it matter a lot? From both R7151 and R7152 to R7150 each way reads .8, which accounts for the extra 1.6 ohms. Could it mean my traces are corroded internally?\n\nAdditionally is a drop from 18.67 to 18.12 through Q7180 (PPDCIN_S5_CHGR to PPDCIN_G3H_INRUSH) something I should replace? Could explain why my voltage is down to 12.3v instead of 12.6v.\n\nedit: Forgot to mention that CHGR_BGATE reads at around 12.2v, so I now get .3v increasing to .5v and then dropping to .3v out of Q7155 and on the batt_conn."}
{"post_id":4928,"thread_id":4902,"title":"How does a BATLOW_L signal work?","user_id":2,"username":"dukefawks","post_date":"2016-07-29 20:01:31","message":"Is the 12.3V stable now and not going back down?\nWas this a liquid damage? Seems like Q7180 is also not opening causing the .6V drop there. Check trace to pin 26"}
{"post_id":4974,"thread_id":4902,"title":"How does a BATLOW_L signal work?","user_id":288,"username":"DannyRinc","post_date":"2016-08-01 15:17:08","message":"12.3v is stable, only not working correctly at bat_conn. Had it plugged in while I was looking at the schematic and the fans came on and were running fine, I turned the board over and it cut off immediately. I'm only getting 1v out of the SMC for DSW_PWRGD now, I feel like I'm making negative progress."}
{"post_id":4976,"thread_id":4902,"title":"How does a BATLOW_L signal work?","user_id":2,"username":"dukefawks","post_date":"2016-08-01 15:35:13","message":"You didn't answer my question. Why are we measuring DSW_PWRGD now? You need to approach this systematically, not just random poking around.\n\nWas this a liquid damage? Seems like Q7180 is also not opening causing the .6V drop there. Check trace to pin 26. \n\n​Is there still a voltage drop over Q7180? Are you getting a green light that turns orange with no battery connected?"}
{"post_id":4977,"thread_id":4902,"title":"How does a BATLOW_L signal work?","user_id":288,"username":"DannyRinc","post_date":"2016-08-01 17:34:34","message":"Yes it was liquid damaged, damage was confined to the LCD connector area of the board. \n\nThe trace to pin 26 is solid, continuity is good. There is still a voltage drop at Q7180. Yes I'm gettting a green light that turns orange with no battery. I skipped over Q7180 because even though I was only getting 18.2v and 12.3v I was getting perfect pp5v pp3v3 and 3v42 rails. \n\nThe only reason I mentioned DSW_PWRGD is because the computer started booting. I had replaced any components that looked burned\/corroded, so like 6, along with the voltage sensing resistors. It literally had not done anything for a day besides my last post, and all of a sudden it kicked on."}
{"post_id":4979,"thread_id":4902,"title":"How does a BATLOW_L signal work?","user_id":288,"username":"DannyRinc","post_date":"2016-08-01 22:27:26","message":"Weeeeeeeeeeeeell there's a crack on the die of the CPU. I guess I should have figured as much from a self attempted repair from a customer. Thanks for all your help guys!!\n\nEdit: Figured I should tell you guys that I found out by laying the board down again and just letting some power run through it, then whenever i touched the heat sink (yeah i had it on) it would turn off. Took it off again and found the crack."}
{"post_id":4983,"thread_id":4902,"title":"How does a BATLOW_L signal work?","user_id":2,"username":"dukefawks","post_date":"2016-08-02 04:25:45","message":"Oh well, that is one for the trash pile."}
