[
    {
        "post_id":55329,
        "thread_id":55329,
        "title":"3662 short to ground on ppbus_g3h",
        "user_id":15432,
        "username":"Patricia",
        "post_date":"2019-12-14 21:09:19",
        "message":"Hi to you all :)\n\nI have a 3662 with a short to ground on PPBUS:G3H\nI removed the F7140 to see on what side the short is and with my bad luck it is on the system side ....\nPP3V42 is ok\nAny tips on how to proceed ,,,, \nThe board has no liquid damage and according to the owner it just died .... no knockoff charger used .\nIt takes 0.245 A with the power supply and has green and orange light .\nAfter close visual inspection I couldnt find any corrosion or anything that could direct me in the right way :)\nI have not done anything else , want to consult with you first :)\nNothing gets hot according to the Flir ...\n\nThanks in advance for any help"
    },
    {
        "post_id":55334,
        "thread_id":55329,
        "title":"3662 short to ground on ppbus_g3h",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-12-15 02:58:55",
        "message":"Post exact ohm value.\nCompare with ohm value readings on all big coils.\nCommon failure is one of FDMF6808 chips.\n\nDo NOT inject voltage yet..."
    },
    {
        "post_id":55352,
        "thread_id":55329,
        "title":"3662 short to ground on ppbus_g3h",
        "user_id":15432,
        "username":"Patricia",
        "post_date":"2019-12-16 15:10:21",
        "message":"I will have to change my posts to \"Hi 2 informaticos \" :) you are the only one replying :)\nSorry I couldnt post back yesterday because the option to reply wasnt there .\nI removed the Phase one FDMF just to see if any change but when I measured the pins I noticed that I have a short on PPVIN_S5_HS_COMPUTING_ISNS as well :(\nExact ohm value on ppbus_g3H is 0.4Ohm......\nI really do have bad luck with these 15 retina boards ....\nAll the big coils have 0.3 or 0.4 Ohms\nThank you for your answer"
    },
    {
        "post_id":55357,
        "thread_id":55329,
        "title":"3662 short to ground on ppbus_g3h",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-12-16 16:22:48",
        "message":"Sounds like dead CPU.\nThere is very low probability to still be alive.\nStart removing FDMF6808 chips one by one.\nEach time check diode mode at PPBUS_G3H.\nWhen it goes high, you've just found the bad chip; can be more than one.\n\n0.4 ohm at CPU VCORE is sign of dead CPU.\nIf you get aprox 1-1.5ohm, after bad FDMF6808 has been removed, you can try replace it with new FDMF6708\nBuy it from reliable store, NOT chinese seller.\nThen PRAY-PRAY-PRAY, power on, PRAY again and tell us if the God heard you..."
    },
    {
        "post_id":55364,
        "thread_id":55329,
        "title":"3662 short to ground on ppbus_g3h",
        "user_id":15432,
        "username":"Patricia",
        "post_date":"2019-12-16 17:16:13",
        "message":"Thanks 2informaticos \nyeah I have been reading other posts and usually bad FDMF6808 means dead cpu .... \nI have removed the first one already and will do the other two as well ....\nI knew it .... as I said with my luck with all retina 15 boards :) \nof all Louis videos I have seen I have never seen him replacing one FDMF..... is it just me or is he extremely lucky with his retina 15 boards :)\nI will order new ones from Digikey , I have found them very nice with support and fast shipping , mouser switzerland dont have them in stock .\nAs soon as I get them I will start praying .... will post the results :)\nThanks again"
    },
    {
        "post_id":55458,
        "thread_id":55329,
        "title":"3662 short to ground on ppbus_g3h",
        "user_id":15432,
        "username":"Patricia",
        "post_date":"2019-12-20 21:35:39",
        "message":"Just a small update ... removed all 3 FDMF and short STILL there :("
    },
    {
        "post_id":55461,
        "thread_id":55329,
        "title":"3662 short to ground on ppbus_g3h",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-12-21 00:40:05",
        "message":"Post exact ohm value (200 ohm scale) at CPU coils.\nCPU could be good, but FDMF chips must be replaced anyway.\n\nAny other big coil has the same value as PPBUS_G3H to ground?"
    },
    {
        "post_id":55466,
        "thread_id":55329,
        "title":"3662 short to ground on ppbus_g3h",
        "user_id":15432,
        "username":"Patricia",
        "post_date":"2019-12-21 06:35:30",
        "message":"All 3 coils have the same value 35.6 ohms to ground (L7310 , L7320, L7330)  PPBUS_G3H has 0.4 ohms to ground and the other coils are in the kiloohms (around 300 kOhms)....\nI am beginning to beleive the Jessa conclusion \"Its never the coil\" :)"
    },
    {
        "post_id":55467,
        "thread_id":55329,
        "title":"3662 short to ground on ppbus_g3h",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-12-21 06:43:34",
        "message":"Of course never is the coil.\nBut same value on a coil like PPBUS_G3H signs the shorted MOSFET.\nThat's the reason we do this test.\n\n35 ohm at CPU coils sounds really good.\nIf you had 0 ohm before, that means at least one FDMF chip was shorted.\nIf now stil short on PPBUS_G3H, could be a filter cap.\nShould be safe to inject voltage now.\nStart with 1V and slowly go high.\nKeep ampers setting at max and check for any hot component.\nRemove CPU heatsink; more easy to detect the heat on the board this way.\n\nI recommend to be sure first, no solders remain between FDMF pads on the board."
    }
]