{"post_id":9417,"thread_id":9417,"title":"820-00138 CPU VCC question","user_id":145,"username":"Sykulski","post_date":"2016-11-09 04:01:34","message":"Hi.\n\nI got this one in with a good amount of coffee inside. I UC it but it did still not turn on. \n\nFound a short in the U7320 (PHASE 2 \/ CPU VR12.5 VCC Power Stage). I removed the chip and computer now boots without it. Battery does not charge but it is because of the battery itself is damaged. Charging a new battery works fine.\n\nMy question is how important is this one chip? Because it has some thin almost invisible horizontal lines on the screen and the computer is with integrated graphics so I am unsure if these thin lines is due to this chip or the screen itself is also damaged. I dont have a 2015 display for testing this at hand and I am unsure if the customer wants to pay for repair if the screen also needs replacement. So before finding a replacement U7320 chip or a replacement display I would like to know if the display symptoms could be caused by this or not. \n\nPPVCC_S0_CPU is 1.78V\n\nThanks"}
{"post_id":9420,"thread_id":9417,"title":"820-00138 CPU VCC question","user_id":2,"username":"dukefawks","post_date":"2016-11-09 05:32:05","message":"It is VERY important...."}
{"post_id":9422,"thread_id":9417,"title":"820-00138 CPU VCC question","user_id":145,"username":"Sykulski","post_date":"2016-11-09 05:55:55","message":"OK. But do you think the almost invisible lines on display are caused by this or the display maybe also can be faulty ?"}
{"post_id":9432,"thread_id":9417,"title":"820-00138 CPU VCC question","user_id":2,"username":"dukefawks","post_date":"2016-11-09 11:58:56","message":"No idea, if the machine boots and runs fine it is probably an LCD issue. Only way to be sure is to check with known good one."}
{"post_id":9440,"thread_id":9417,"title":"820-00138 CPU VCC question","user_id":145,"username":"Sykulski","post_date":"2016-11-09 12:07:27","message":"Ok. But it boots and run fine without the U7320. Vcore is 1.78V and stable. Then what makes this chip so VERY important? Is this vcore a little too low? Schematics says it should be 1.85V. Just curious..."}
{"post_id":9442,"thread_id":9417,"title":"820-00138 CPU VCC question","user_id":2,"username":"dukefawks","post_date":"2016-11-09 12:10:10","message":"I guess Apple put it there just for looks. This is part of the CPU power supply so it will probably fail under stress. Totally useless to eve argue about this."}
{"post_id":9446,"thread_id":9417,"title":"820-00138 CPU VCC question","user_id":145,"username":"Sykulski","post_date":"2016-11-09 12:26:10","message":"Thanks. Not trying to argue. Was just surprised it could even start without it. \n\nI will check another display and if lines disappear I think I will dump this one as the customer most likely will not pay for both new display and new battery and the motherboard repair. \n\nThanks again Duke."}
