[
    {
        "post_id":55138,
        "thread_id":55138,
        "title":"820 2879 not turning on",
        "user_id":17781,
        "username":"LetsFix",
        "post_date":"2019-12-08 22:11:18",
        "message":"the initial issue was not turning on. after that i replaced u7000 for a good know one and it worked. i reassembled and then i notice that it doesnt detect the battery. checked daata lines, okay, repalced u700 again for a good know one. after that i checked ppbus, and i got 12.30v. i thought SMC issue, so i replaced it for another one. it still had 12.3v. after that and turned on for a while, then stooped turning on. after that i reballed the original one and put it back, because i lost green light. now i go green light but it doesnt turn on. where do i go now o this?"
    },
    {
        "post_id":55139,
        "thread_id":55138,
        "title":"820 2879 not turning on",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-12-09 00:02:58",
        "message":"Do you get 0.9V at L7750?\nPost ohm mode to ground there; should be higher than 30K.\nLower value points to bad MCP...\n\n\"checked daata lines, okay\"\nCan you post voltage and diode mode readings on both SC\/SDA?\nIf something strange check disconnecting BIL connector.\nYou can also remove D6950 before touching SMC, or U7000.\nBe sure R7000 is OK and post exact resistance between pins 17\/18 and 27\/28.\n\nDid you try to start in SMC bypass?"
    },
    {
        "post_id":55148,
        "thread_id":55138,
        "title":"820 2879 not turning on",
        "user_id":17781,
        "username":"LetsFix",
        "post_date":"2019-12-09 09:25:41",
        "message":"All testing done with disconnected bill connector. i removed d6950 no change, 12.3v on ppbus whitout battery, solid green light with battery.  board now turns on, oddly enough my charger was just disconnected haha. i get 0.9 at l7750. R7000 ok, i measure continuity on it to u700 pin 12, like schematic says. pin 17-18 i get 3.2ohm and in 27-28 i get 20.4ohm.\n\nSc and SDA data lines are open to ground, and with charger connected i get 3.42 on both of them."
    },
    {
        "post_id":55150,
        "thread_id":55138,
        "title":"820 2879 not turning on",
        "user_id":17781,
        "username":"LetsFix",
        "post_date":"2019-12-09 09:52:35",
        "message":"well problem solved. SMC replaced again did the trick. and fucking bill connector damaged too. i have a questrion though, why did the first replacement do nothing?. i took it from a board that had a broken processor, but that i knew it was good, because it worked before thery let it fall!"
    },
    {
        "post_id":55153,
        "thread_id":55138,
        "title":"820 2879 not turning on",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-12-09 11:02:29",
        "message":"\"Sc and SDA data lines are open to ground\"\nIf really was with red probe to ground, then bad solders under SMC..."
    }
]