{"post_id":28410,"thread_id":28410,"title":"820-2914 really slow","user_id":1218,"username":"geraymartha","post_date":"2017-11-22 20:41:45","message":"hello I have a 820-2914 that pass the ASD but I cant install any os using usb , the only way I was able to install a system was with internet recovery , its lion , but everything is really slow , since asd pass this are not sensor problems? how I can start to troubleshoot this?\n\nthank you."}
{"post_id":28412,"thread_id":28410,"title":"820-2914 really slow","user_id":2,"username":"dukefawks","post_date":"2017-11-22 20:43:03","message":"Working battery connected? Was BIOS chip ever touched? Does it boot to a working OSX from USB?"}
{"post_id":28414,"thread_id":28410,"title":"820-2914 really slow","user_id":1218,"username":"geraymartha","post_date":"2017-11-22 20:47:10","message":"bios was replaced I got this board with out bios and I replace it with other one from a dead board , let me get a os x from usb to try thank you for replay"}
{"post_id":28422,"thread_id":28410,"title":"820-2914 really slow","user_id":289,"username":"smiba","post_date":"2017-11-23 02:01:51","message":"Don't just swap the BIOS from another board like that without flashing it with a clean ME region, 99% sure this is the cause of your issues.\nIf the old BIOS chip had nothing wrong with it place it back\n\nSearch for it on this forum on how to write a clean ME region, it has been explained how to do this a couple of times"}
{"post_id":28443,"thread_id":28410,"title":"820-2914 really slow","user_id":1218,"username":"geraymartha","post_date":"2017-11-23 10:32:02","message":"i don't have the old bios i purchase a few boards from a recycle center and they sell them without the bios"}
{"post_id":28444,"thread_id":28410,"title":"820-2914 really slow","user_id":289,"username":"smiba","post_date":"2017-11-23 11:08:20","message":"I'm surprised, you got this board from a recycling centre that had part(s) missing and you managed to actually make it boot? Alright\n\nYou don't need the old bios, but you do need a clean ME region. There are tutorials about that online, just google something like \"Macbook clean ME region tutorial\" and you will probably find what you're looking for. I don't feel like writing instructions for something someone else will have explained already (and most likely better then I ever will explain).\n\nDid the BIOS come from the same board number?"}
{"post_id":28446,"thread_id":28410,"title":"820-2914 really slow","user_id":1218,"username":"geraymartha","post_date":"2017-11-23 11:27:57","message":"yes is same number , the guys at the recycling keeps bios of all the boards for parts they sell me because they use them to remove efi on other laptops that they get , and usually i get boards for parts missing stuff or with destroyed stuff i think is because they can't fix this boards they just pull out from the bodys without caring about not destroying the board and dump them into a pile like whatever but they are really cheap."}
{"post_id":28455,"thread_id":28410,"title":"820-2914 really slow","user_id":2,"username":"dukefawks","post_date":"2017-11-23 17:53:55","message":"OMG, they are swapping chips to remove EFI lock? That means all machines are fucked up after that. You cannot swap a ROM without transferring the ME region or using a clean ME region."}
