{"post_id":79067,"thread_id":61597,"title":"820-00923 Power button not working.","user_id":135,"username":"bjf","post_date":"2021-08-19 23:13:13","message":"This board had a spill around the power button. I cleaned it up and all the pins on the power button connector are functional and reading correct diode numbers compared to a good board. Touch ID works fine. The power button is pulling SMC_ONOFF_L low and I'm measuring that all the way over to R5170, but the computer is not responding. I've checked all the resistors on the line. Everything looks good. The spill was very minimal. SMC_ONOFF_L is measuring 3.4V. Nothing wrong with anything in the circuit that I can find. Is this just the SMC not responding? Not sure what else it could be."}
{"post_id":79074,"thread_id":61597,"title":"820-00923 Power button not working.","user_id":682,"username":"2informaticos","post_date":"2021-08-20 03:17:48","message":"Do you mean the machine turns on, but cannot turn off with power button?"}
{"post_id":79079,"thread_id":61597,"title":"820-00923 Power button not working.","user_id":135,"username":"bjf","post_date":"2021-08-20 03:27:12","message":"Yes, everything works normally but the power button has no effect, it doesn't turn it on or off, even though it's pulling SMC_ONOFF_L low."}
{"post_id":79082,"thread_id":61597,"title":"820-00923 Power button not working.","user_id":682,"username":"2informaticos","post_date":"2021-08-20 03:38:20","message":"Machine still stays on if pressing power button more than 5s?\nJust in case, test with R5225\/26 pads, instead of power button.\nCheck continuity between different points of SMC_ONOFF_L; may have a broken trace."}
{"post_id":79348,"thread_id":61597,"title":"820-00923 Power button not working.","user_id":135,"username":"bjf","post_date":"2021-08-26 14:05:14","message":"Yes, it stays on. Pressing the power button has no effect no matter how long I hold it. It doesn't turn it on or off.\n\nNo change when using pads. Continuity is good between all the points. SMC_OFF_L is measuring about .715 in diode mode so that's normal also."}
{"post_id":79473,"thread_id":61597,"title":"820-00923 Power button not working.","user_id":135,"username":"bjf","post_date":"2021-08-30 01:38:36","message":"Any other thoughts on this?"}
{"post_id":79478,"thread_id":61597,"title":"820-00923 Power button not working.","user_id":682,"username":"2informaticos","post_date":"2021-08-30 03:56:21","message":"Disconnect touchID and try with R5225\/26 pads.\nIn fact, disconnect anything from the board.\nIt will turn on automatically, when charger is connected; just test if you can turn it off."}
