{"post_id":4671,"thread_id":4671,"title":"Battery won't charge, cable light amber, PPVBAT_G3H_CONN steady with 12,3v.","user_id":285,"username":"registro.lima@gmail.com","post_date":"2016-07-21 22:31:25","message":"[COLOR=#454545][FONT=Helvetica]Hi dear Experts,[\/FONT][\/COLOR]\n[COLOR=#454545][FONT=Helvetica]My MPB late 2013 13\" Retina A1502 EMC 2678 is not charging battery. No water spills (really!!!), stopped working from its own. Macos sais \"Battery not being charged\" and “battery is ok” (in the beginning), now it sais “battery need to be replaced\", cable light is amber and kernel task consumes a lot of CPU if battery is plugged-in. Resetting SMC worked once, but problem came back and reset never worked again. Sent MPB to Genius Bar and they diagnosed the need for Logic board replacement (battery module was fine according to them). I refused the $$$ repair and as I have electronics background took my multimeter and oscilloscope and decided to take a shot trying to repair myself. Bought the logic board pdf and BV. Shunt resistors R7120 and R7150 looks fine (near 0,02 and 0,005 ohms), other resistors and capacitors in this line also looks fine. Since I see steady 12,3V on PPVBAT_G3H_CONN I’m starting to believe that Apple made a mistaken diagnostic and the logic board is ok. Batteries themselves are fine as they are still new (>8 hours discharge). As I can’t find the battery module schematic and BV I’m kinda blind to move on troubleshooting the battery charger board. While doing a visual check I saw signs of faulty components on battery charger board (don’t know the name and PN). Does anyone could give me directions on where to find the schematics and BV? If they are not available, hints on how it works? Need to know which components are faulty in order to try to find them for replacement.[\/FONT][\/COLOR]\n\n[COLOR=#454545][FONT=Helvetica]Thank you in advance and best regards.[\/FONT][\/COLOR]"}
{"post_id":4672,"thread_id":4671,"title":"Battery won't charge, cable light amber, PPVBAT_G3H_CONN steady with 12,3v.","user_id":285,"username":"registro.lima@gmail.com","post_date":"2016-07-21 22:34:09","message":"No Title"}
{"post_id":4675,"thread_id":4671,"title":"Battery won't charge, cable light amber, PPVBAT_G3H_CONN steady with 12,3v.","user_id":36,"username":"aprendiz","post_date":"2016-07-21 22:46:32","message":"just replace the battery...."}
{"post_id":4678,"thread_id":4671,"title":"Battery won't charge, cable light amber, PPVBAT_G3H_CONN steady with 12,3v.","user_id":2,"username":"dukefawks","post_date":"2016-07-22 00:17:42","message":"Battery controller has permanent failure flag set. No economic way to fix this without dedicated hardware, just replace the complete battery."}
{"post_id":4727,"thread_id":4671,"title":"Battery won't charge, cable light amber, PPVBAT_G3H_CONN steady with 12,3v.","user_id":285,"username":"registro.lima@gmail.com","post_date":"2016-07-22 19:49:49","message":"Hi Aprendiz and Dukefawks. Why isn't it economic? I'm sure battery cells are fine 'cause first time the issue occurred and the SMC reset worked I was able to fully charge it. If it's just a couple of components it would cost 10 times less than the entire pack. Furthermore I'd be throwing away pretty good cells just like apple does. ;)\n\nI even believe it would be much cheaper if I could replace the board only. Isn't it available anywhere?\nI'm not doing this for a customer, it's my own computer, so I don't care about being productive here.\nThank you very much"}
{"post_id":4732,"thread_id":4671,"title":"Battery won't charge, cable light amber, PPVBAT_G3H_CONN steady with 12,3v.","user_id":2,"username":"dukefawks","post_date":"2016-07-22 22:54:16","message":"Google: UBRT, but I doubt you want to spend the money on that. Again, just replace the battery!"}
