{"post_id":28393,"thread_id":28393,"title":"820-2936 Green light, quarter fan spin.","user_id":1153,"username":"JohnB8812","post_date":"2017-11-22 17:06:25","message":"Got a board in that was liquid damaged and got quarter fan spin. Nastiest areas were backlight fuse literally exploded, and it was really gross around the ISL6259. Measured voltages to start:\n\n3V42: 3.46\nPPBUS: 12.58\nPPVRTC: 3.31\nPP5V_S5: 4.99\nPP3v3_S5: 3.3\nPP3V3_S4: 3.3\nPP3V3_S3: 0 volts\n\nI decided to replace the ISL and burned resistors and caps around it: R7000, C7026, C7050, C7000, C7001, C7025. I still get a green light AND quarter fan spin, but now instead of one fan spin and nothing with PPBUS staying constant at 12.58 volts, I get constant quarter fan spins in succession and PPBUS jumps from 15 volts (?) down to 12.58 then to 3.9 and then jumps back up once the fan makes another spin attempt. Where would I look next to resolve this? \n\nThe only other area nasty on the board besides ISL was backlight towards top with a completely destroyed fuse also R5400 had lots of white nasty stuff on it. Other than that the only other part of the board coming into contact with liquid was Q7830 and R7830."}
{"post_id":28406,"thread_id":28393,"title":"820-2936 Green light, quarter fan spin.","user_id":2,"username":"dukefawks","post_date":"2017-11-22 20:36:29","message":"To see if U7000 is working correct install battery and see if it charges. \nClock chip U2800 and R7402 are suspect for causing no boot."}
{"post_id":28415,"thread_id":28393,"title":"820-2936 Green light, quarter fan spin.","user_id":1153,"username":"JohnB8812","post_date":"2017-11-22 20:47:25","message":"Ok will do when I get back in on Friday."}
{"post_id":28424,"thread_id":28393,"title":"820-2936 Green light, quarter fan spin.","user_id":289,"username":"smiba","post_date":"2017-11-23 02:46:48","message":"If PPBUS indeed gets to 15V you might want to check your soldering, especially to pin 21 of U7000."}
{"post_id":28476,"thread_id":28393,"title":"820-2936 Green light, quarter fan spin.","user_id":1153,"username":"JohnB8812","post_date":"2017-11-24 13:24:47","message":"Ok so checked soldering and touched up the top half of the chip on the Pin 21 side. It looks very well soldered now and I still get the same result. R7402: 90.9 K and the clock chip looks very clean even tho I would guess it could still be bad. HOWEVER, I did test with a battery Duke, and when I plug in the battery, the machine RUNS off of the battery with and without the charger plugged in. However the charger light stays green, and it doesn't turn orange. PPPBUS with just the battery plugged in and the machine running=11.91 volts."}
{"post_id":28480,"thread_id":28393,"title":"820-2936 Green light, quarter fan spin.","user_id":2,"username":"dukefawks","post_date":"2017-11-24 13:30:49","message":"Resistance between pins 17\/18 and 27\/28 on U7000? Suspect dead resistor or corroded trace in the sense circuits."}
{"post_id":28482,"thread_id":28393,"title":"820-2936 Green light, quarter fan spin.","user_id":1153,"username":"JohnB8812","post_date":"2017-11-24 13:51:13","message":"Pins 17 and 18 34.26 M ohms and steadily falls \nPins 27 and 28 21.6 ohms and steadily falls\n\nR7020 and R7021 10 ohms. Checking for burned traces around that area, but so far I don't see anything out of the ordinary. Would running this through the Ultrasonic before continuing be a good idea?"}
{"post_id":28483,"thread_id":28393,"title":"820-2936 Green light, quarter fan spin.","user_id":1153,"username":"JohnB8812","post_date":"2017-11-24 13:57:53","message":"Update, touched up the soldering on R7051 and I now have 12.55 volts constant on PPBUS. However, I still get quarter fan spin to start up"}
{"post_id":28484,"thread_id":28393,"title":"820-2936 Green light, quarter fan spin.","user_id":1153,"username":"JohnB8812","post_date":"2017-11-24 14:18:59","message":"Ok so I for sure have PPBUS and it does charge the battery. However, it still has quarter spin. PP3V3_S4 present, but PP3v3_S3 missing. Q7830 is the only other component that had liquid on it besides backlight fuse could this be causing 3v3_S3 to not work even tho it's an S0 fet?"}
{"post_id":28485,"thread_id":28393,"title":"820-2936 Green light, quarter fan spin.","user_id":289,"username":"smiba","post_date":"2017-11-24 16:03:42","message":"If you get a quarter spin you are actually moving into S0 for a little moment as the fan will only be activated in S0.\n\nWill the machine POST (chime) on battery? If it does then your ISL circuit is still messed up. Otherwise see if you may have a short on one of the S3\/S0 lines."}
{"post_id":28486,"thread_id":28393,"title":"820-2936 Green light, quarter fan spin.","user_id":1153,"username":"JohnB8812","post_date":"2017-11-24 16:08:53","message":"No machine does not post on battery. It does change the light from green to orange with a battery plugged in now, so i'd assume it's charging it. And will do on the power lines I'm pretty sure it's an S3 rail at this point as PP3v3_S3 is still missing"}
{"post_id":28487,"thread_id":28393,"title":"820-2936 Green light, quarter fan spin.","user_id":289,"username":"smiba","post_date":"2017-11-24 16:48:03","message":"What is the resistance to ground on all S3 and S0 lines in Ohms? Please report"}
{"post_id":28488,"thread_id":28393,"title":"820-2936 Green light, quarter fan spin.","user_id":2,"username":"dukefawks","post_date":"2017-11-24 17:38:28","message":"Duke, and when I plug in the battery, the machine RUNS off of the battery with and without the charger plugged in.\nYou just said the machine ran off a battery.....what is going on here?\n\nReplace clock chip to be sure."}
{"post_id":28489,"thread_id":28393,"title":"820-2936 Green light, quarter fan spin.","user_id":1153,"username":"JohnB8812","post_date":"2017-11-24 17:42:36","message":"Ok so I'm back to having the PPBUS voltage going nuts. \n\nFirst, it would run off the battery but quarter fan spin when charging.\nThen, I touched up the soldering and it got a steady 12.55 volts and a green to orange light with a battery plugged in. \nNow, that has gone away and it's back to a green light only and a fluctuating PPBUS from 3.9 to 13.9. \n\nI will replaced the clock chip, but I think something else is off here now. Would this have to be a corroded trace at this point? Because I don't get how PPBUS would work the way it should then all of a sudden stop. Bad ISL maybe? This board is starting to make me wonder"}
{"post_id":28490,"thread_id":28393,"title":"820-2936 Green light, quarter fan spin.","user_id":289,"username":"smiba","post_date":"2017-11-24 17:53:49","message":"Did you do the S3\/S0 measurements like I said?\n\nAgain if PPBUS is moving around to way above >13V you most likely didn't solder it well, have malfunctioning mosfets (Unlikely, but feel if they're burning hot to make sure. Especially check the one for the low switching) or are having a broken ISL.\n\nPPDCIN_G3H also heavily fluctuating?"}
{"post_id":28491,"thread_id":28393,"title":"820-2936 Green light, quarter fan spin.","user_id":1153,"username":"JohnB8812","post_date":"2017-11-24 18:05:26","message":"Ok I'm gonna replace the ISL to rule that out since I have a several and then measure PPDCIN PPBUS and the S3\/S0's."}
{"post_id":28493,"thread_id":28393,"title":"820-2936 Green light, quarter fan spin.","user_id":1153,"username":"JohnB8812","post_date":"2017-11-24 19:07:59","message":"Ok so new ISL and 100% properly soldered (I tested each pin lol). \nPPDCIN: 16 volts\nPPBUS: 12.55 volts (green to orange light with battery plugged in)\nPPVRTC: 3.32\nPP5V_S5: 4.99\nPP3V3_S5: 3.3\nPP3v3_S4: 3.3\nPP3V3_S3: 0 volts\nPP3v3_S3 diode mode: 2.97 k ohms\nPP5V_S3: 0 volts\nPP5v_S3 resistance mode (can't get an accurate enough reading for diode mode): 12.5 k ohms\n\nAll S0 rails missing. \n\nI would guess the 5v_S3 rail looks most screwed up?\nI have not replaced clock chip yet had to fix 3 iPhone screens and solder ISL back on. Would it be safe to replace that now?"}
{"post_id":28496,"thread_id":28393,"title":"820-2936 Green light, quarter fan spin.","user_id":2,"username":"dukefawks","post_date":"2017-11-24 19:23:55","message":"Only replace clock chip if you have quarter fan spin now."}
{"post_id":28500,"thread_id":28393,"title":"820-2936 Green light, quarter fan spin.","user_id":1153,"username":"JohnB8812","post_date":"2017-11-24 19:38:42","message":"Ok I do have quarter spin still, so I will replace it tomorrow when I get back to the board."}
{"post_id":28514,"thread_id":28393,"title":"820-2936 Green light, quarter fan spin.","user_id":1153,"username":"JohnB8812","post_date":"2017-11-25 10:39:38","message":"Ok so I replaced the clock chip and Y2805 because a solder ball came out of it when removing clock chip. Still have green light and charging but still have quarter fan spin. What would be next thing to approach?"}
{"post_id":28515,"thread_id":28393,"title":"820-2936 Green light, quarter fan spin.","user_id":1153,"username":"JohnB8812","post_date":"2017-11-25 10:49:51","message":"I'm honestly thinking Ultrasonic this and go from there"}
{"post_id":28517,"thread_id":28393,"title":"820-2936 Green light, quarter fan spin.","user_id":2,"username":"dukefawks","post_date":"2017-11-25 11:16:14","message":"It could be anything. If R7402 is good and you also get CPU Vcore pulsing then it can be corrosion pretty much anywhere. But what is the deal with the \"works on battery\" thing you said earlier?"}
{"post_id":28518,"thread_id":28393,"title":"820-2936 Green light, quarter fan spin.","user_id":1153,"username":"JohnB8812","post_date":"2017-11-25 11:20:51","message":"Ok I'm gonna have to inspect closer then. I'm prob gonna replace backlight fuse since it exploded and then ultrasonic this and see what happens from there. \n\nOn the works on battery part, I actually had the machine work off of the battery when working on the ISL6259 area, but it wouldn't charge the battery at all prob from crappy soldering. When I touched that up, I stabilized PPBUS and the battery does charge now, but it won't run off the battery I'm kinda back where I started minus the clock chip."}
{"post_id":28519,"thread_id":28393,"title":"820-2936 Green light, quarter fan spin.","user_id":1153,"username":"JohnB8812","post_date":"2017-11-25 11:27:58","message":"Speaking of that, the backlight fuse pads are completely burned off the board from where it exploded. It almost looks like there's a hole where the fuse was. If that's the case, is this a time waster at that point?"}
{"post_id":28520,"thread_id":28393,"title":"820-2936 Green light, quarter fan spin.","user_id":1153,"username":"JohnB8812","post_date":"2017-11-25 12:02:27","message":"Ok so update, pads not missing and no hole. It was just unbelievablely nasty by the fuse so after about 10 minutes of cleaning. I have the pads clean and I soldered a new fuse. I’m gonna run this through the ultrasonic and go from there. If there is indeed corrosion I can’t see, I would think this may help"}
