{"post_id":33239,"thread_id":33239,"title":"[SOLVED]820-3115 keychain error after little liquid damage","user_id":171,"username":"techrepair","post_date":"2018-04-04 06:14:01","message":"hi , \n       mostly clean board but found little liquid damage and that was cleaned . now the machine always seems to forget keychain . i believe the keychain to be managed by harddrive and os but upon changing many drives and the fault reappearing i would like you to advise what hardware components are involved so i can look into that area. Also i have tried booting from external source but some how after few hours or restarts the problem reappear.\nkindly advise\nthanks"}
{"post_id":33272,"thread_id":33239,"title":"[SOLVED]820-3115 keychain error after little liquid damage","user_id":2,"username":"dukefawks","post_date":"2018-04-05 13:27:52","message":"I really don't think this is a hardware issue. Is this happening on a clean install? Only thing that might cause an issue could be the HDD cable on these, but that would cause more problems than just the keychain."}
{"post_id":33763,"thread_id":33239,"title":"[SOLVED]820-3115 keychain error after little liquid damage","user_id":171,"username":"techrepair","post_date":"2018-04-16 13:45:11","message":"hi Duke ,                              \nthanks for the reply ,   there were some problems such as every few mins it was forgetting wifi password , if i select option such as to show secs in time clock it will just tick the box but the actual function would not happen .\n\n  But keeping your advise in mind  we replaced the cable but it started showing no entry sign( most likely faulty cable) , then\ntried 2011 cable on 2012 board and it worked .\n\nDuring the repair process we also  replaced  r1833 and r2573 as they were liquid damaged. it seems to be functioning so far , no idea if it is related but so far functional . we can close the post .\n\nthanks again"}
{"post_id":33769,"thread_id":33239,"title":"[SOLVED]820-3115 keychain error after little liquid damage","user_id":461,"username":"Gurmon","post_date":"2018-04-16 18:06:51","message":"This will be software issue, rename keychain folder in user library folder, restart mac. New keychain will be created. Passwords will now be remembered until keychain breaks again."}
