[
    {
        "post_id":35676,
        "thread_id":35676,
        "title":"[SOLVED]820-3787, Tons of GPU-Related Sensor Failures",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2018-06-11 07:11:29",
        "message":"Got a large shipment of decommissioned corporate units, and one of the boards is throwing all sorts of GPU-related die sensor failures: TG0D, TG0P, TG1D, Th1H, Th2H. All are reading \"-124 degrees\" in ASD EFI. Not good. Replaced U5850 just to see if that helped, but it didn't. Unit actually runs fine with the exception of the fans running at full-speed and iSight doesn't work (I assume related to sensor issues possibly?).\n\nIs it worth spending time on this one, or are the issues likely related to the GPU itself? I figure a drop is likely on this one; the iSight connector was broken-away from the ground pads when we got it (all pins in place still, diode values check out fine), but that could have been due to a heavy hand removing the LCD assembly.\n\nThanks for any advice\/help in advance, as always!"
    },
    {
        "post_id":35706,
        "thread_id":35676,
        "title":"[SOLVED]820-3787, Tons of GPU-Related Sensor Failures",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-06-11 19:20:49",
        "message":"SMBUS line under the iSight connector are broken. Take off the connector and inspect the traces and you will see 1 or 2 will be broken breaking the SMBUS to the SMC."
    },
    {
        "post_id":35791,
        "thread_id":35676,
        "title":"[SOLVED]820-3787, Tons of GPU-Related Sensor Failures",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2018-06-13 14:57:49",
        "message":"Nailed it--thanks, duke. That was a very un-fun repair...nearly every line was broken under connector, so had to run wires and such small amount of pad to solder to. Ran 'em all through to the front and connected appropriately and all is well--thanks, Duke!"
    },
    {
        "post_id":46496,
        "thread_id":35676,
        "title":"[SOLVED]820-3787, Tons of GPU-Related Sensor Failures",
        "user_id":1423,
        "username":"captainmac",
        "post_date":"2019-02-20 07:44:06",
        "message":"I have a Mac with the exact same sensor failures: TG0D, TG0P, TG1D, Th1H, Th2H ALL READ -124.\nHave checked for corrosion: nothing on the board: looks pristine\nhave also checked the mentioned SMBUS traces but there is nothing wrong there. \n\nAfter disconnecting the iSight cable, the Mac passes these sensortests in ASD and fan no longer runs high.\n\nThought this would be nice to know for anyone having similar issues."
    }
]