{"post_id":56658,"thread_id":56658,"title":"Remote management  Issue","user_id":1501,"username":"Dewanbd","post_date":"2020-02-11 10:56:47","message":"[FONT=Calibri]This is Macbook pro 15 2015 , when trying to install OSX shows remote management issue. When cancel it keep going install osx.\nBut still shows me Remote management popup , Do you know how to stiop it for ever.Thanks.[\/FONT]"}
{"post_id":56660,"thread_id":56658,"title":"Remote management  Issue","user_id":682,"username":"2informaticos","post_date":"2020-02-11 12:00:10","message":"Looks like your machine was enrolled into Device Enrollment Program previously.\nI hope it is not stolen, be aware.\n\nIf you are sure it is legit, problem could be solved flashimg the BIOS I suppose..."}
{"post_id":56662,"thread_id":56658,"title":"Remote management  Issue","user_id":1501,"username":"Dewanbd","post_date":"2020-02-11 12:06:39","message":"I am sure this is not stolen i bought it as auction lot. Can i use same model good bios for flashing it?? I have attached the picture."}
{"post_id":56665,"thread_id":56658,"title":"Remote management  Issue","user_id":682,"username":"2informaticos","post_date":"2020-02-11 13:22:51","message":"So it was owned by Epsilon Data Management\n[url]https:\/\/emea.epsilon.com\/[\/url]\nI'm not sure if we can provide a BIOS file for this case in the forum..."}
{"post_id":56668,"thread_id":56658,"title":"Remote management  Issue","user_id":1744,"username":"PJs","post_date":"2020-02-11 13:46:38","message":"Did you try installing macOS from flash drive and not connecting to internet until it's fully installed with user account set? Laptops bought from larger companies often do this to me, but reinstall without internet connection always solve this unless it really is stolen. Do not connect to wifi when macOS ask you in the end of installation, just skip that step."}
{"post_id":56672,"thread_id":56658,"title":"Remote management  Issue","user_id":1501,"username":"Dewanbd","post_date":"2020-02-11 17:13:00","message":"PJS thanks for your reply. I also solve the problem like this what you said but the problem is when the customer need to reinstall the osx again it comes up. Thats why i am looking for permanent solution. Thanks again."}
{"post_id":56675,"thread_id":56658,"title":"Remote management  Issue","user_id":682,"username":"2informaticos","post_date":"2020-02-11 17:49:15","message":"You can try new BIOS, like is done for non-working machine.\nHowever we do not support this and did not even test somethink like that.\nYou can upload your backup (not here) and see if any correction is possible..."}
{"post_id":56703,"thread_id":56658,"title":"Remote management  Issue","user_id":1501,"username":"Dewanbd","post_date":"2020-02-12 17:30:28","message":"[URL=\"https:\/\/drive.google.com\/open?id=1H0CLM5ajtMhLvFzVD1wxuADmiTI6vsdc\"]https:\/\/drive.google.com\/open?id=1H0...wxuADmiTI6vsdc[\/URL] , could you please try it ? One more thing what Bios programmer you do recommend, I use CH341A but some time it doesn't support all chip. Thanks."}
{"post_id":56704,"thread_id":56658,"title":"Remote management  Issue","user_id":515,"username":"SMMRepair","post_date":"2020-02-12 18:08:57","message":"This is all kinds of shady. If the laptop is not stolen, all you have to do is call up Epsilon and explain that you purchased a decommissioned laptop from an eCycler that is still tied to their Remote Management account. This is ALL based on serial number, so you aren't going to bypass it by reinstalling MacOS...that's a bad suggestion. Anytime the unit ever connects to the internet, Apple's RM servers will identify it and allow Epsilon to control\/lock\/erase\/whatever the unit.\n\nCall them up, and if they say they forgot to remove it, they should be able to do it for you very quickly. If they say the unit was stolen, then you're SOL, and you should use for parts or ask if they want it back."}
{"post_id":56705,"thread_id":56658,"title":"Remote management  Issue","user_id":682,"username":"2informaticos","post_date":"2020-02-12 18:32:36","message":"Get Medusa programmer for Apple jobs.\nYou don't need to remove SPI chip; only for some old models.\n\nUploaded file is trash.\nPlease read the chip correctly.\nIf your programmer doesn't recognize it, manually choose W25Q64B model and read again.\nDon't forget to verify the reading!"}
