{"post_id":61881,"thread_id":59606,"title":"820-2936-B Multiple Issues?","user_id":26765,"username":"sws","post_date":"2020-07-04 20:06:42","message":"Hello,\n\nWe're working with an 820-2936-B from an early 2011 13\" A1278 and the board is behaving inconsistently but never correctly.  On boot, the computer will sometimes appear to start correctly, only to kernel panic and reboot before going into a boot loop.  Late this afternoon we were able to get an OS installed and it appears to run normally with the exception that the power button does not work to power it on.  The only way to power it on is by unplugging and then plugging it in again.  No apparent liquid damage or evidence thereof.\n\nWe've tried swapping RAM with another machine, moving RAM around within the computer, different hard drives, ran EFI-based ASD.  I thought the issue might be VP0R sensor-related based on searches here and elsewhere, but all ASD tests passed, noting that we skipped the longer hard drive test.  I have NTUD3169CZ (Q5300) stocked, amazingly, but before I go replacing components I thought about checking in for ideas on what to test to prove whether NTUD3169CZ or related need to be replaced or if an SMC reflow would be helpful.\n\nSteve"}
{"post_id":61890,"thread_id":59606,"title":"820-2936-B Multiple Issues?","user_id":682,"username":"2informaticos","post_date":"2020-07-05 03:20:17","message":"Any history available, liquid sign?\nVP0R should be good, if ASD EFI didn't report it.\nTry new BIOS, clean ME."}
{"post_id":61994,"thread_id":59606,"title":"820-2936-B Multiple Issues?","user_id":26765,"username":"sws","post_date":"2020-07-07 14:34:32","message":"[QUOTE=\"2informaticos, post: 61890, member: 682\"]\nAny history available, liquid sign?\nVP0R should be good, if ASD EFI didn't report it.\nTry new BIOS, clean ME.\n[\/QUOTE]\n\nNo history on it but we were able to flash to a fresh BIOS using a TL866II and it now consistently boots.  However, the power button still does not work.  The Caps Lock key does not appear to light up when caps lock is on, but the keyboard works fine otherwise.  I thought Caps Lock should have a green dot when on with this model, but I can't remember.  Is there anything to test prior to ordering a new keyboard+backlight for it?\n\nSteve"}
{"post_id":61999,"thread_id":59606,"title":"820-2936-B Multiple Issues?","user_id":682,"username":"2informaticos","post_date":"2020-07-07 16:12:54","message":"Did you flash clean ME BIOS?\n\nSMC_ONOFF_L drops wjem you press power button?\nIf not, some videos available about repairing power button without changing keyboard; not always possible.\n\nBTW, do NOT quote again an entire post, visible few centimeters above..."}
