{"post_id":70038,"thread_id":60591,"title":"820-00928 CPU Shorted?","user_id":1689,"username":"Thomas","post_date":"2021-01-08 14:44:16","message":"I'm working on a 2017 820-00928 Logic Board. It was only liquid damaged on U7410. \n\nPPBUS_HS_CPU is apparently shorted. I compared it to a known good Logic Board. I attempted injecting 8v on that rail and the CPU gets warm. I suspect BAD CPU or am I overlooking?"}
{"post_id":70040,"thread_id":60591,"title":"820-00928 CPU Shorted?","user_id":682,"username":"2informaticos","post_date":"2021-01-08 14:47:10","message":"It is trash now.\nYou've just injected 8V into CPU.\nSo many times explained on the forum how NOT to inject voltage :(..."}
{"post_id":70041,"thread_id":60591,"title":"820-00928 CPU Shorted?","user_id":1689,"username":"Thomas","post_date":"2021-01-08 15:17:10","message":"Got it. \n\nIs this Board trash now 100%? Is just the CPU affected or PCB too?\n\nIf I didn't inject 8v then what would be the next step?"}
{"post_id":70043,"thread_id":60591,"title":"820-00928 CPU Shorted?","user_id":682,"username":"2informaticos","post_date":"2021-01-08 16:01:31","message":"The CPU was PROBABLY dead, once U7410 caused voltage spike on it.\nNow is dead for SURE, as you injected 8V directly, not just a very short time overvoltage."}
{"post_id":70046,"thread_id":60591,"title":"820-00928 CPU Shorted?","user_id":1689,"username":"Thomas","post_date":"2021-01-08 16:29:38","message":"Thanks. I suspected the CPU to be DEAD since U7410 is shorted. \n\nIf I have the skill to remove the CPU and replace it with a known good one just for learning do you think it has a chance?"}
{"post_id":70078,"thread_id":60591,"title":"820-00928 CPU Shorted?","user_id":1689,"username":"Thomas","post_date":"2021-01-09 15:10:37","message":"?"}
{"post_id":70079,"thread_id":60591,"title":"820-00928 CPU Shorted?","user_id":682,"username":"2informaticos","post_date":"2021-01-09 15:43:13","message":"Probably wasting time; nothing to lose, apart of time."}
{"post_id":70324,"thread_id":60591,"title":"820-00928 CPU Shorted?","user_id":22852,"username":"iremont","post_date":"2021-01-16 02:10:24","message":"remove and look ppbus_hs_cpu shorted mayby,"}
{"post_id":70367,"thread_id":60591,"title":"820-00928 CPU Shorted?","user_id":1689,"username":"Thomas","post_date":"2021-01-17 22:34:04","message":"I need to clarify about this repair, when I first started working on it the first thing I did was rule out everything on PPBUS_HS_CPU that could be causing the short besides removing the CPU. Then I injected 8V. I figured that rail was supposed to be around 12V so I started low. That's when the CPU started getting warm. \n\nAnyway actually I got back around to this today, I removed the CPU & what do you know, the short is gone. Now this project will sit until I can find a CPU that I know works. Or unless anyone knows where to get a BRAND NEW CPU, not a pull & reball."}
{"post_id":70368,"thread_id":60591,"title":"820-00928 CPU Shorted?","user_id":1689,"username":"Thomas","post_date":"2021-01-17 22:36:32","message":"Here's a nice picture of the CPU removed, :eek:\n\n[URL unfurl=\"true\"]https:\/\/drive.google.com\/file\/d\/1YbGLsc_COUlrVts6ZSNt88_Rj9Cd5CG4\/view?usp=sharing[\/URL]"}
{"post_id":70380,"thread_id":60591,"title":"820-00928 CPU Shorted?","user_id":682,"username":"2informaticos","post_date":"2021-01-18 03:22:59","message":"So you had short on  PPBUS_HS_CPU  and inject 8V there.\nThe short was caused because of bad power chip from one of CPU power supplies.\nCPU got shorted injecting 8V for sure (maybe already damaged before).\nRemoving CPU, short disappeared of course.\nBut you MUST find the bad power chip, or will fry again another CPU."}
{"post_id":70397,"thread_id":60591,"title":"820-00928 CPU Shorted?","user_id":1689,"username":"Thomas","post_date":"2021-01-18 11:03:13","message":"I'm pretty sure the CPU was already damaged before, which is why I injected 8V. It was the last resort besides replacing the CPU. Now the CPU is removed. SO what your saying is even though the short is gone right now, when I solder on a known GOOD CPU, PPBUS_HS_CPU will have a short there again? \n\nIF SO, then I will not even attempt to power the Board on at all\/inject any kind of voltage after soldering on a known GOOD CPU. Before any power is applied I will confirm if the short is present or not. That way IF the short is back the GOOD CPU should not get damaged AT ALL since no power was applied assuming the soldering is perfect. If it's gone I will attempt to power the Board normally. I have already replaced a few of these touch bar processors with success so I have the soldering method perfected. \n\nI have a great feeling that when I solder a known GOOD CPU back on the short will be back.\n\n[B]2informaticos[\/B],[B] [\/B]Could you please take the time and tell me how I would trace down the BAD power supply chip with the CPU off and the short appearing gone?\nOr if I need to solder on a known GOOD CPU first to trace down the original issue, if that is the case, how would I approach this knowing a GOOD CPU is soldered on? Would you blame a PCB issue at that point and force me to give up?"}
{"post_id":70398,"thread_id":60591,"title":"820-00928 CPU Shorted?","user_id":682,"username":"2informaticos","post_date":"2021-01-18 11:22:55","message":"Just check ohm resistance between I\/O pins of CPU power supplies chips; like 8\/16 for U7210.\nBe aware, there are 6 chips to test.\nWhere are 2-3 chips with output tied together, lift one pin of the coil."}
