{"post_id":92584,"thread_id":63088,"title":"A2179 820-01958 no audio from speakers experimentation","user_id":1547,"username":"CRC2018","post_date":"2022-09-13 11:47:58","message":"So I had a bit of free time to look through some of my boards with weird issues and I had this 820-01958 which had sound only from headphones - no sound from speakers at all. Troubleshooting got me to SPKRAMP_RESET_L having an odd diode mode reading (0.002) and 20ohms to ground. Obviously went through checking which as many of you on here will know this stupid T2 chip turned out to be the reason. \n\nGiven all the other data lines and such were ok including SPKRAMP_INT_L  I decided to do some experimentation. First I tried tieing SPKAMP_RESET_L with a 100K resistor to the PP1V8_G3S Rail - no go, I then tried a 50K Resistor which also was a no go and also a 10K Resistor. Just for the hell of it I thought i'll just run a wire directly to SPKRAMP_RESET_L from PP1V8_G3S and switch on get the apple chime nice and loud and sound is now working.\n\nWhilst I know this isn't a perfect solution it is one way of getting the speakers working again if the T2 chip has been slightly damaged to cause this issue and I thought i'd just share this solution with everyone here."}
{"post_id":92589,"thread_id":63088,"title":"A2179 820-01958 no audio from speakers experimentation","user_id":682,"username":"2informaticos","post_date":"2022-09-13 16:45:47","message":"You've been lucky to have not a pure short there.\nIn this case, your trick supposes a constant consumtion of 35mA aprox; on top of normal current of this power rail.\nIt will not be a problem for U8220, and hopefuly not for U7800.\nThanks for sharing this solution anyway."}
{"post_id":101221,"thread_id":63088,"title":"A2179 820-01958 no audio from speakers experimentation","user_id":28201,"username":"Mortentoft","post_date":"2023-08-27 10:25:41","message":"Hi’ I’ve just did the same thing. Works perfectly. Its not the complete right way but works! Thx a lot🙏"}
