[
    {
        "post_id":49666,
        "thread_id":49666,
        "title":"820-3662-A - No Chime, No Screen",
        "user_id":4718,
        "username":"fredddd",
        "post_date":"2019-06-02 10:15:49",
        "message":"Hi all, I have an 820-3662-A board from a 2013 Macbook Pro Retina. It has a light on the charger and fan spin, however I get no chime and no image or backlight on the screen. The board was water damaged but there is very little corrosion, most of it on the I\/O board. I have tested the 5V, 3V and 1V power rails listed on the power aliases page of the schematic, all of which are fine. I have 1.76v for CPU VCore and the CPU warms up as would be expected.\n\nOut of respect for the forum, I will be honest and admit that I am new to component level repair. I don't have a huge amount of experience but I'm here to learn, not just free load off the experts who reside here! Any help would be much appreciated!"
    },
    {
        "post_id":49667,
        "thread_id":49666,
        "title":"820-3662-A - No Chime, No Screen",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-06-02 10:55:45",
        "message":"Where was the liquid? Are you testing with just the screen plugged in and nothing else?"
    },
    {
        "post_id":49668,
        "thread_id":49666,
        "title":"820-3662-A - No Chime, No Screen",
        "user_id":4718,
        "username":"fredddd",
        "post_date":"2019-06-02 11:34:57",
        "message":"A glass of water was spilled over the keyboard whilst the computer was open apparently. I've tested with just the screen nothing else, screen and keyboard and then screen with everything plugged in."
    },
    {
        "post_id":49669,
        "thread_id":49666,
        "title":"820-3662-A - No Chime, No Screen",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-06-02 11:45:14",
        "message":"I'm talking about the board I don't care about the keyboard...any corrosion near U7310\/20\/30?"
    },
    {
        "post_id":49671,
        "thread_id":49666,
        "title":"820-3662-A - No Chime, No Screen",
        "user_id":4718,
        "username":"fredddd",
        "post_date":"2019-06-02 12:25:28",
        "message":"There are no obvious signs of corrosion, board looks clean in the U7310,20,30 region."
    },
    {
        "post_id":49673,
        "thread_id":49666,
        "title":"820-3662-A - No Chime, No Screen",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-06-02 13:55:46",
        "message":"Ok next step would be to check if you get USB activity on a USB mouse\/pen drive. If yes, image is the issue. If no, either corrosion somewhere, bad BIOS, bad CPU, corrosion by\/bad SMC etc and this will suck."
    },
    {
        "post_id":49674,
        "thread_id":49666,
        "title":"820-3662-A - No Chime, No Screen",
        "user_id":4718,
        "username":"fredddd",
        "post_date":"2019-06-02 14:19:20",
        "message":"Yeah nothing on the USB mouse, tried both ports and no dice!"
    },
    {
        "post_id":49675,
        "thread_id":49666,
        "title":"820-3662-A - No Chime, No Screen",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-06-02 14:41:00",
        "message":"Bad CPU, bad SMC\/corrosion under it, corrosion under some chip, bad BIOS etc. This will suck..."
    },
    {
        "post_id":49676,
        "thread_id":49666,
        "title":"820-3662-A - No Chime, No Screen",
        "user_id":4718,
        "username":"fredddd",
        "post_date":"2019-06-02 14:50:17",
        "message":"Yeah sounds like it! As far as troubleshooting goes, have I got any options for getting closer to the problem or is it just a case of trial and error?\n\nEDIT - Sorry, this was a really poorly worded question. I don't know where to start looking, could you suggest a starting point that I can look into? I don't really want to go down the classic newbie route of \"replace it until you fix it\"."
    },
    {
        "post_id":49677,
        "thread_id":49666,
        "title":"820-3662-A - No Chime, No Screen",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-06-02 15:19:44",
        "message":"Inspect the board very closely for any hints of corrosion. There has to be SOMETHING if this was water damaged....if nothing is found this is a time waster...."
    },
    {
        "post_id":49679,
        "thread_id":49666,
        "title":"820-3662-A - No Chime, No Screen",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-06-02 15:37:06",
        "message":"Disconnect any peripheral, like TP\/KB, camera, LCD, etc.\nKeep only DCIN board and connect USB mouse on the MLB port; disconnect RIO board completely.\nBetter to use an USB pendrive\/HDD with Link LED.\nIf no USB activity, very likely bad CPU.\n\nPower supply of this board is a nightmare.\nF***g FDMF6808N chips kill the CPU most of the time; even without apparent reason..."
    },
    {
        "post_id":49684,
        "thread_id":49666,
        "title":"820-3662-A - No Chime, No Screen",
        "user_id":4718,
        "username":"fredddd",
        "post_date":"2019-06-03 00:30:26",
        "message":"I disconnected everything, leaving just the fans and tried a usb drive. Still nothing!\nAm I looking at replacing the whole board to get this thing working? Do people replace CPUs in Mac boards or is it generally a lost cause at that point?"
    },
    {
        "post_id":49688,
        "thread_id":49666,
        "title":"820-3662-A - No Chime, No Screen",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-06-03 01:43:36",
        "message":"If you really have time to waste, checnge all (3) FDMF6808 with new FDMF6708 from Mouser, not from China.\nI doubt this will help in this case, as no previous issue reported about randomly freeze, or shutdown."
    }
]