[
    {
        "post_id":27891,
        "thread_id":27891,
        "title":"820-2914A\/B GPU chips",
        "user_id":1188,
        "username":"mattknudstrup@gmail.com",
        "post_date":"2017-11-09 15:39:59",
        "message":"Hello,\nI personally have 3 2011 17\" MacBook Pro's (2 early, 1 late) that now all have bad cpu's.  I've been reading the forum for a while and it seems very dicey getting new chips that are not counterfeit.  Does anyone have suggestions for getting good ones?  I don't really care if the all are 6750M or 6770M (I assume they would all work in these machines, I may be wrong).  PS:  I am a DIY'er with pretty extensive experience with repair, but not very experienced at all with BGA's.  Also I don't know all the possible chips that would work on these boards if anyone wants to chime in on that.\nThanks for anyone that can help."
    },
    {
        "post_id":27904,
        "thread_id":27891,
        "title":"820-2914A\/B GPU chips",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-11-09 19:10:49",
        "message":"If you have no experience with BGA you will probably destroy the board and\/or GPU. As GPUs are pretty much unobtanium it would be foolish to even attempt a repair. First time doing big BGA will go wrong many times before you gain the experience of doing this right. \n\nIf you want to learn BGA repair start with something easy like 216-072001 chips, they are easy to get and are cheap. What kind of rework station are you using?"
    },
    {
        "post_id":27921,
        "thread_id":27891,
        "title":"820-2914A\/B GPU chips",
        "user_id":1188,
        "username":"mattknudstrup@gmail.com",
        "post_date":"2017-11-10 07:50:42",
        "message":"Thanks for the reply.  I have an IR6500, which I know is not a tool that a pro would use and placement is going to be difficult.  I have a few boards lying around that I have been practicing on and it seems to be working fairly decent.  Just to give you a little background, I am a computer engineer with 15+ years design work and have designed several VLSI BGA chips.  So I've been doing stuff like this for quite a while, I just don't have direct experience soldering BGA but I would like to get good at it.  I really don't like throwing things out that can be repaired.  Also I would send these laptops in to a professional if I could find one that I could trust because these machines mean a lot to me."
    },
    {
        "post_id":27935,
        "thread_id":27891,
        "title":"820-2914A\/B GPU chips",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-11-10 11:46:15",
        "message":"If you want to practice BGA get some old 2008\/9 boards and replace\/reball the MCP on those and see if that works. It would be a shame to destroy unobtanium GPUs for practice. If you are in the EU I can help you out for repairing the boards."
    },
    {
        "post_id":27950,
        "thread_id":27891,
        "title":"820-2914A\/B GPU chips",
        "user_id":1188,
        "username":"mattknudstrup@gmail.com",
        "post_date":"2017-11-11 08:03:11",
        "message":"Yes I definitely do not want to learn on these boards\/chips.  They are too valuable for that.  Unfortunately I do not live in the EU.  Would you consider me just shipping you a board?  Would you have a way to test it?"
    },
    {
        "post_id":27957,
        "thread_id":27891,
        "title":"820-2914A\/B GPU chips",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-11-11 11:55:17",
        "message":"I don't think it is worth international shipping and customs hassle, sorry."
    },
    {
        "post_id":28297,
        "thread_id":27891,
        "title":"820-2914A\/B GPU chips",
        "user_id":1188,
        "username":"mattknudstrup@gmail.com",
        "post_date":"2017-11-20 17:50:06",
        "message":"Anybody ever use SEE-IC on eBay ([url]https:\/\/www.ebay.com\/itm\/5Pcs-lot-216-0810005-Chipset-Original-New-DC-2017\/201173126072?hash=item2ed6da4bb8:g:4T4AAOSwU-pXtChU[\/url]) or is just another company selling counterfeits.  Sure looks legit and feedback is pretty good.  Getting desperate here.  I have four 2011 17\" Macbook Pros in need of GPU's."
    },
    {
        "post_id":28304,
        "thread_id":27891,
        "title":"820-2914A\/B GPU chips",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-11-20 19:38:17",
        "message":"Yes they currently have DC 1723 0810005 chips and they are real."
    },
    {
        "post_id":28313,
        "thread_id":27891,
        "title":"820-2914A\/B GPU chips",
        "user_id":1188,
        "username":"mattknudstrup@gmail.com",
        "post_date":"2017-11-20 21:12:14",
        "message":"Thanks Duke.  I just ordered the 5 pack.  Do you know if the 6750M will work in the late 2011 model (currently has 6770M)?"
    },
    {
        "post_id":28320,
        "thread_id":27891,
        "title":"820-2914A\/B GPU chips",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-11-21 03:35:51",
        "message":"Yes it will, but you may need to change a few strapping resistors."
    }
]