[
    {
        "post_id":20729,
        "thread_id":20729,
        "title":"What is going on with this 820-3115?",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-05-23 14:59:11",
        "message":"I have an 820-3115 that is driving me crazy...it's got some of the weirdest symptoms I've ever seen:\n\n- When it came in, it had no green light and no power. This is a no-liquid unit. No broken\/missing components.\n- PPBUS was at 12.26v, so I jumped over to check SMC power\/reset, etc.\n- SMC was getting power, and SMC_PM_G2_EN was stable; everything looked OK before SMC, so I replaced the SMC and got green light. \"Great\"; time to plug it in and test\/run diagnostics.\n- Plug the board into one of our test-cases (which are good), and no green light again. Hmm..\n- Realized after 20 minutes that the FAN being plugged in was preventing green light...oddly. I confirmed this several times; plug in charger with fan connected, no green light. Unplug fan, re-plug in charger, and green light returns (and the board powers on most times). If I plug the fan in while the board is on, the fan spins and works, but as soon as I turn off the board, green light will disappear again until I unplug the fan.\n\nPPBUS reads 12.26v when fan is plugged in. When I disconnect the fan, PPBUS jumps to 12.56v. If I plug in charger with fan plugged in, no green light and ppbus is low; when I unplug the fan, ppbus stabilizes and board powers on.\n\nWhat is going on here? No short on PP5v_s0, and I've tried several fans. Could this possible be related to U7200 in some weird way?"
    },
    {
        "post_id":20733,
        "thread_id":20729,
        "title":"What is going on with this 820-3115?",
        "user_id":461,
        "username":"Gurmon",
        "post_date":"2017-05-23 15:10:10",
        "message":"that is a weird one. Obviously you have tried another fan ?\n\nSo,  something is stalling the SMC. my bet would be fan TACH or PWM signals. Check R5660 & R5661 pull ups to start with."
    },
    {
        "post_id":20739,
        "thread_id":20729,
        "title":"What is going on with this 820-3115?",
        "user_id":451,
        "username":"jgraffis",
        "post_date":"2017-05-23 15:30:32",
        "message":"sounds like a bad SMC or something is messing with it. can u get it up and going then run ASD to see what it comes up with?( while fan is plugged in)"
    },
    {
        "post_id":20867,
        "thread_id":20729,
        "title":"What is going on with this 820-3115?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-05-25 11:52:46",
        "message":"I would say you have a short under the SMC between FAN TACH or CTL to some other pin. Try another SMC, if that does not help it may be inside the board. Do some diode mode comparison on the CTL and TACH pins of the SMC."
    },
    {
        "post_id":20877,
        "thread_id":20729,
        "title":"What is going on with this 820-3115?",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-05-25 12:24:24",
        "message":"Thanks duke (and Gurmon, jgraffis)! I'll swap out the SMC and see if that helps. I've seen a lot of funky stuff caused by SMC, so I wouldn't be surprised. Will update thread tonight or tomorrow--thanks!"
    }
]