[
    {
        "post_id":50451,
        "thread_id":50451,
        "title":"MBP 820-3662 Power, no chime",
        "user_id":5257,
        "username":"managerharry",
        "post_date":"2019-07-03 11:41:51",
        "message":"MBP 820-3662 board. It had a bad battery and would only run off AC power but was otherwise OK. Also checked the logic board and found a small amount of liquid damage near DC in board (C8324 & surrounding), and a bit more under the tape at C7372 and C7378, and the CPU screw mount next to C1099 had popped off the board. Cleaned up corrosion and epoxied CPU screw mount. Popped replacement battery in and.... fuck, it powers on and fans spin for about 5 seconds, spin down, then spin back up and it stays on but does not post, no chime. Plugging in USB mouse shows only brief flash of light when USB is first plugged in. SMC reset done using internal kb does result in charging light change blink as per normal but otherwise has no effect. CAPS lock light does not respond. CPU gets warm after 5-10 min, but not particularly hot.  Attempting to power on in SMC bypass results in hurricane mode fans but no post.  Genuine MagSafe 2 charger.\n\nSome readings:\nPPBUS_G3H = 12.68\nPPVRTC_G3H = 3.36\nPP5V_S5 = 5.09\nPP5V_S4 = 5.09\nPP5V_S3 = 5.09\nPP5V_S0 = 5.09\nPP3V3_S5 = 3.36\nPP1V5_S0 = 1.52\nALL_SYS_PWRGD = 3.24\nPLT_RST_BUF_L = 3.35\nPPVCC_S0_CPU = 1.71\nPP1V35_S3RS0_CPUDDR (pin 1 of C1099) = 1.37\nSmc_bc_acok = .85\n\nCPU toast or is there hope?"
    },
    {
        "post_id":50454,
        "thread_id":50451,
        "title":"MBP 820-3662 Power, no chime",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-07-03 11:49:22",
        "message":"Forget it the CPU is toast. That screw mount being broken likely damaged the main CPU. RIP."
    },
    {
        "post_id":50457,
        "thread_id":50451,
        "title":"MBP 820-3662 Power, no chime",
        "user_id":5257,
        "username":"managerharry",
        "post_date":"2019-07-03 12:03:30",
        "message":"Damn, it was working previously even though the CPU mount was busted.  I guess epoxying it to the board & then applying power fucked it over?  Nuts."
    },
    {
        "post_id":50462,
        "thread_id":50451,
        "title":"MBP 820-3662 Power, no chime",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-07-03 12:30:15",
        "message":"Probably broken trace when fixed the screw.\nBut if CPU worked without proper heat disipation, this could be wasted time."
    },
    {
        "post_id":50466,
        "thread_id":50451,
        "title":"MBP 820-3662 Power, no chime",
        "user_id":5257,
        "username":"managerharry",
        "post_date":"2019-07-03 15:14:53",
        "message":"Hmm, considering the cost of replacement boards for this model I'm willing to sink a bit more time into it.  How might I go about trying to determine if it is indeed a broken trace vs dead CPU?"
    },
    {
        "post_id":50467,
        "thread_id":50451,
        "title":"MBP 820-3662 Power, no chime",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-07-03 15:51:19",
        "message":"If board was working before, is strange to die exactly when you worked on it.\nSomething happened then.\nRemember that you have to change FDMF6808 chips too.\nYou can start replacing them with real new FDMF6708 from Mouser, or other serious store; forget chinese sellers."
    },
    {
        "post_id":50468,
        "thread_id":50451,
        "title":"MBP 820-3662 Power, no chime",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-07-03 16:08:41",
        "message":"Good luck to say the least going to be either a broken trace under the screw hole going to the CPU or the CPU is internally broken. To find trace, use a donor and scratch away at the donor to find traces kind of like like Long screw damage on an iPhone"
    }
]