[
    {
        "post_id":73721,
        "thread_id":60991,
        "title":"820-2915 No image \/ no backlight",
        "user_id":26621,
        "username":"grmacs",
        "post_date":"2021-03-30 15:23:07",
        "message":"I've already spent too much time on this and guessing it isn't worth anymore, but this had no image or backlight when I got it. I tried real mac mods bypass and nothing. Also tried to flash gmux to bypass and that failed over and over. I've done both of these on multiple machines successfully. Lastly I jumper wired the bypass but still no image or backlight so I'm guessing theres an issue with the integrated GPU? or traces? No signs of any other issues when inspecting the board.  Thinking i should get a backlight with the jumpers regardless of image but... maybe not.\n\nSMC LId is +3V. Other things that might prevent image?"
    },
    {
        "post_id":73727,
        "thread_id":60991,
        "title":"820-2915 No image \/ no backlight",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-03-30 15:39:26",
        "message":"Did you test for USB activity?\nCaps Lock reacts?"
    },
    {
        "post_id":73730,
        "thread_id":60991,
        "title":"820-2915 No image \/ no backlight",
        "user_id":26621,
        "username":"grmacs",
        "post_date":"2021-03-30 16:00:40",
        "message":"Yes  sorry meant to mention that I get post, chime & data activity. Also LVDS connector and cable looks perfect, (i tested with another LCD just in case with no change) components directly opposite LVDS on board for LVDS data look good."
    },
    {
        "post_id":73736,
        "thread_id":60991,
        "title":"820-2915 No image \/ no backlight",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-03-30 17:16:19",
        "message":"Image should appear before backlight.\nIs the only way to prevent artefacts and unstable video.\n\nNo real reason to search for backlight, if no image present.\nAfter all the changes you did on the board, I'm not sure if can still be recovered.\nWhy did you try hardware mod, if you have GMUX flasher???\n\nIf you didn't get external video, there was GPU problem.\nExternal monitor is always driven by GPU..."
    },
    {
        "post_id":73763,
        "thread_id":60991,
        "title":"820-2915 No image \/ no backlight",
        "user_id":26621,
        "username":"grmacs",
        "post_date":"2021-03-31 07:29:32",
        "message":"Right - yeah I thought maybe backlight on regardless being I ran the jumpers but exactly... no image so no backlight until that happens. I tried gmux flash over and over and it would not work. I tried all of the tricks of grounding plt reset, removing l2406 cap, placing cap between tck and ground. All connections were good. Came to the conclusion that GMUX was maybe bad because just wouldnt go. SO that is no longer placed on board thought I'd give one last effort here to see what your thoughts were before I put in the donor board file. :)  Yes I painted myself in a corner with last ditch effort hard wiring the bypass... Makes no sense that I still have no image but I guess always possible the iGPU has a problem."
    }
]