[
    {
        "post_id":92553,
        "thread_id":63086,
        "title":"A1708 820-00840 Intermittently Not Detecting SSD - Question Mark - Previous Liquid Damage",
        "user_id":25485,
        "username":"it-solve",
        "post_date":"2022-09-12 19:18:42",
        "message":"It turns on and works fine for a while, but often when it starts or awakes from a long-term not usage turns on with a question mark. Same when used for an extended period of time.\n\nPrevious liquid damage around U3890\/5 doesn't seem to be related to SSD lines. Also, some around R3773 and U3700 corner.\n\nTested with two good known SSDs, reinstalled still an intermittent issue. Cant measure with a board outside of the case when an issue occurs hence omitted some measurements.\n\nJ8600 - When Problem Occurs\n4 - 0.24V\n5 - 0.003V - SSD_PWR_EN_CONN_L\n6 - 1.78V - SSD_BOOT_CONN_L\n7 -\n8 - 0V\n9 - 3.4V\n10 - 3.2V\n11 -\n12 -\n13 - 3.2V\n\nLooking at[URL='https:\/\/boards.rossmanngroup.com\/threads\/820-00840-a-hdd-problem.63074\/'] @tipoti trouble[\/URL] when it's working, measurements seem to be the same as mine when not working.\n\nCleaned the connector multiple times and inspected under a scope. No damage."
    },
    {
        "post_id":92557,
        "thread_id":63086,
        "title":"A1708 820-00840 Intermittently Not Detecting SSD - Question Mark - Previous Liquid Damage",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-09-13 01:59:36",
        "message":"If no changes on signal and control lines, then should be a communication problem on data lines.\nYou should test with external USB macOS and check if internal SSD is still detected in Disk Utility, but you can't access it to read\/write."
    },
    {
        "post_id":92564,
        "thread_id":63086,
        "title":"A1708 820-00840 Intermittently Not Detecting SSD - Question Mark - Previous Liquid Damage",
        "user_id":25485,
        "username":"it-solve",
        "post_date":"2022-09-13 02:43:20",
        "message":"When I reboot usually comes online and works as expected. I can load from it, and it runs perfectly with no SSD errors.  Haven't seen it come with a question mark again after I shut down and rebooted from the previous question mark. It loads up straight away until the next time when it crashes and reboots to a question mark.\n\nJust from time to time comes with a question mark and an error after a restart - your mac restarted because of a problem."
    },
    {
        "post_id":92646,
        "thread_id":63086,
        "title":"A1708 820-00840 Intermittently Not Detecting SSD - Question Mark - Previous Liquid Damage",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-09-15 12:10:44",
        "message":"There should be some corroded contacts, traces, or data line components..."
    }
]