[
    {
        "post_id":1773,
        "thread_id":1773,
        "title":"820-3462 No keyboard output",
        "user_id":110,
        "username":"MOberdick",
        "post_date":"2016-04-20 06:19:44",
        "message":"[COLOR=#333333][FONT=Verdana][SIZE=13px]So this board was liquid damaged although I saw no signs of liquid damage on the board itself, i cleaned it anyways. The machine boots up and chimes just fine, has all main power rails ect. The only issue is the board isn't recognizing any keyboard input from the internal keyboard. I have tried a new internal keyboard as well as a new trackpad together and neither have made a difference. Also an external keyboard does seem to work perfectly fine its only the internal one. Ideas on anything that could cause this? The machine DOES react to an SMC reset but wont alt-boot when I try to boot from a bootable or get to the boot menu. Also, The caps lock light on the keyboard does not turn on at all when pressed. 3.3v on all caps near the USB controller. R5710 is 1 kohms and c5710 has 1.3v which seems to be pretty normal. Not really sure where to go from here. Any tips?[\/SIZE][\/FONT][\/COLOR]"
    },
    {
        "post_id":1776,
        "thread_id":1773,
        "title":"820-3462 No keyboard output",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-04-20 07:59:12",
        "message":"C5710 should have 3.4V unless power button is pressed! What is voltage on pin 2 R5710? Both sides should be 3.4V.\nDoes the trackpad at least work? Then we can at least know U5701 is working somewhat."
    },
    {
        "post_id":1779,
        "thread_id":1773,
        "title":"820-3462 No keyboard output",
        "user_id":110,
        "username":"MOberdick",
        "post_date":"2016-04-20 08:14:33",
        "message":"[QUOTE=\"dukefawks, post: 1776\"]C5710 should have 3.4V unless power button is pressed! What is voltage on pin 2 R5710? Both sides should be 3.4V.\nDoes the trackpad at least work? Then we can at least know U5701 is working somewhat. [\/QUOTE]\nC5710 is reading 3.4 now... I might have measured it right as i plugged it in last time so i could have got an inaccurate reading, my bad.. Also R5710 has 3.4v on both pins and the trackpad does indeed work. No lag and the fan spins normally which leads me to believe it was good however I tried a new one anyways just to make sure. I also have tested more than 1 keyboard to rule out the possibility of a bad part"
    },
    {
        "post_id":1788,
        "thread_id":1773,
        "title":"820-3462 No keyboard output",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2016-04-20 10:58:51",
        "message":"C5710 should be 3.42v almost all the time but this is not the main issue. What voltage is present on pin 30 of the keyboard connector? Does it see the trackpad? Is there any corrosion in the U5750 area?"
    },
    {
        "post_id":1789,
        "thread_id":1773,
        "title":"820-3462 No keyboard output",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2016-04-20 10:59:17",
        "message":"fucking shit duke is fast man. i have to work on my typing. if you can turn it on and off with the button than we ignore smc_onoff_l section altogether. I think pin 30 of the keyboard connector is corroded."
    },
    {
        "post_id":1801,
        "thread_id":1773,
        "title":"820-3462 No keyboard output",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-04-20 12:58:29",
        "message":"If trackpad works than U5701 is most likely ok. I would first suspect crap in or under KBD connector. Also check all connector pins make contact to U5701."
    }
]