[
    {
        "post_id":37728,
        "thread_id":37728,
        "title":"820-2915-B no Image",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2018-07-30 05:57:55",
        "message":"This 820-2915 turns on but has no image. Also nothing on an external display. I also noticed that the sleep light is on all the time (SMC_LID is 3.4V) and that it wont chime (also no chime after NVRAM Reset). Next thing i noticed is that it also wont beep without ram installed. I checked CPU_VCORE and it is 1.14V. I also tried to heat the GPU gently to ~100 °C-150 °C as this one is late 2011 but still on change. So i am stuck here."
    },
    {
        "post_id":37735,
        "thread_id":37728,
        "title":"820-2915-B no Image",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-07-30 08:45:39",
        "message":"Yeah, I would forget about this one. You can try the BIOS but that is where this one will end. CPU problems are also common on these."
    },
    {
        "post_id":37766,
        "thread_id":37728,
        "title":"820-2915-B no Image",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2018-07-30 23:59:18",
        "message":"Ok. Thank you for the answer. I looked closly to the Bios IC and it (again) looks like i am not the first one here. I can see a little bit of flux under it. So chances are good that somebody messed with the bios already and may have causet this problems.... Also GPU looks like it has seen more than one Heatgun (as everyone of this 2011 ones...). But if this turns on i will deaktivate it anyways so i would give it a try. Could you please send me a \"clean bios file\" for this one (820-2915-B) as you did for me with some other boards in the past?\nUnfortunately i have only 820-2915-A donors here at the moment..."
    },
    {
        "post_id":37781,
        "thread_id":37728,
        "title":"820-2915-B no Image",
        "user_id":637,
        "username":"TCRScircuit",
        "post_date":"2018-07-31 06:17:18",
        "message":"It's hanging on POST. Like Duke said, forget about this one. Even if you deactivate the GPU through the EFI thing, it's still going to fail in other ways. All the EFI thing does is change gfx acceleration to the the iGPU and not the GPU. The GPU still does tons of things such as BKL_PWM, LCD_EN etc.."
    },
    {
        "post_id":37834,
        "thread_id":37728,
        "title":"820-2915-B no Image",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-07-31 16:47:54",
        "message":"Just slap another BIOS chip on there from a trash board, if that works I will clean the ME for you."
    }
]