[
    {
        "post_id":47702,
        "thread_id":47702,
        "title":"820-2530-A does not recognize battery x though battery symbol",
        "user_id":1517,
        "username":"jurgenkoppen",
        "post_date":"2019-03-21 19:41:29",
        "message":"This machine works fine on mag charger, but apparently has no connection to battery: will shit down when mag is removed. Tried new battery : same x through the battery symbol. I did the SMC reset, but it did not respond as other Mbps have done in the past. Basically ignored it, no changes on mag light nor sounds. PR reset did respond normally. I ran ASD and it showed an error in battery temp sensor. I did not take out the board yet, hoping for some guidance where to start. Rookie alert.."
    },
    {
        "post_id":47711,
        "thread_id":47702,
        "title":"820-2530-A does not recognize battery x though battery symbol",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-03-22 03:50:48",
        "message":"Any history available?\nDisconnect BIL first and see if battery appears in OSX.\nPost PPBUS_G3H w\/ and w\/o battery connected; charger connected in both cases, of course.\nPost diode mode (red probe to ground) on SCL\/SDA lines and voltage too.\nBe sure R6950 is OK."
    },
    {
        "post_id":47724,
        "thread_id":47702,
        "title":"820-2530-A does not recognize battery x though battery symbol",
        "user_id":1517,
        "username":"jurgenkoppen",
        "post_date":"2019-03-22 12:47:45",
        "message":"When no battery is in the machine I have the same battery symbol in OSX crossed out, same as when the battery is connected.\nThe history is that there is no liquid spill detectable, machine works actually really well on AC, and is very clean inside.\nPPBUS_G3H at F7000 is12.63V w\/o battery, reads 12.21V with new battery ( and 9V with the old battery)\nSCL\/SDA lines are both 522 ohm in diode mode, and read each 3.4V w\/o battery and same with new battery\nR 6950 is within specs..."
    },
    {
        "post_id":47725,
        "thread_id":47702,
        "title":"820-2530-A does not recognize battery x though battery symbol",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-03-22 13:01:33",
        "message":"If PPBUS is 12.6 without the battery, you have bad batteries or an issue with the BIL. Are you testing without the BIL plugged in?"
    },
    {
        "post_id":47726,
        "thread_id":47702,
        "title":"820-2530-A does not recognize battery x though battery symbol",
        "user_id":1517,
        "username":"jurgenkoppen",
        "post_date":"2019-03-22 15:07:48",
        "message":"Oh, I think I misunderstood. I tested without BIL plugged in, after I removed the board. I thought with BIL you meant \"Battery In Loup\" instead of \"Battery Indicator Light\" , so I disconnected the battery and thought I followed your instructions. But I see now that you are referencing the J6955 connector. So I can put the board back in and try again..."
    },
    {
        "post_id":47727,
        "thread_id":47702,
        "title":"820-2530-A does not recognize battery x though battery symbol",
        "user_id":1517,
        "username":"jurgenkoppen",
        "post_date":"2019-03-22 15:27:31",
        "message":"Oh yay, thank you, 2informaticos and JohnB,  that FIXED it!!!. Without the battery indicator light plugged in everything is fine! Oh good, I needed a success for a change...I will switch the BIL from a donor and be on my way."
    }
]