[
    {
        "post_id":64386,
        "thread_id":59924,
        "title":"820-00239-A SSD issue",
        "user_id":21359,
        "username":"Fanfwe",
        "post_date":"2020-08-29 08:19:27",
        "message":"Hi,\nI have this board that gives me a question mark folder.\nBooting an OSX installer from USB shows no internal storage in Disk Utility. Booting an OSX installed on a USB drive gives me a critical firmware update issue.\nAlso, the touchbar doesn't work, which I believe is normal as the T1 chip takes its firmware from the SSD (read this in duke's prior post about touchbars).\n\nThe board has no liquid damage.\nLooks like all SSD power rails are present.\nMeasuring the relevant test points in the grid next to U9100 gives me:\nPP1V8_SSD_COLD: present\nSTORAGE_LB_EN: 3.3V\nSSD_RESET_LB_L: 3.3V\nPP0V9_SSD_REG: present\nSSD_PWR_EN_LB_L: 0V\nLPSR_EN_LB_L: 3.3V\nSSD_BOOT_LB_L: 1.7V\nPP3V3_2V7_NAND_VCC: 2.7V\nSSD_PCIE_CLKREQ_LB_L: 3.3V\n\nI don't have a reference board to compare this to, but I'm curious about LPSR_EN_LB_L, which maybe should be low ? Also SSD_BOOT_LB_L has 1.7V, which could be wrong maybe ? And shouldn't SSD_PCIE_CLKREQ_LB_L be low, so that the PCIE bus gets clocked ?\n\nLifeboat connector is in place, with screws, and totally clean, of course."
    },
    {
        "post_id":64387,
        "thread_id":59924,
        "title":"820-00239-A SSD issue",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-08-29 10:11:09",
        "message":"Theoretically, signals ended in \"_L\" are considered active with 0V (active low).\nBut I was already surprised with an incosistency of this rule.\nSo better is to check mentioned signals into working board.\n\nIn older boards, CLKREQ signal (for airport, or SSD), was triggered inserting the corresponding device.\nThe device just ties to ground one pin of the connector.\nIs not the case now, as both are integrated on the MLB.\nBut the signal is not tied to ground directly; there should be some logic to control it."
    }
]