[
    {
        "post_id":22891,
        "thread_id":22891,
        "title":"[SOLVED]Samsung laptop dead after bios update",
        "user_id":700,
        "username":"Nick",
        "post_date":"2017-07-12 08:49:58",
        "message":"Guys I need help finding a direction with this shit\n\ncustomer brings in a perfectly working i7 Samsung laptop with shitton of virus. The guy doing the normal non repair shit formats it and as standard procedure he updates the bios.\nafter the update, turned on the laptop, it stopped charging. He even tried to roll back but completely stopped charging. When the battery was depleted it shut off.\n\ntrying to turn it on would cause the power led to flash a bit, quarter fan spin and off. The charging led always turned on with adapter plugged in\n\nI opened it and tried to reset the cmos by removing the bios battery. Removed the bios battery after removing the main battery. Waited 5 mins. Plugged it back on\n\nDEAD. Completely dead. No light no charging fucking nothing\n\nI don't have board views or schematics. With power plugged in the battery gets 18.7 v. Without the battery gives 16.8. \n\ntried removing bios chip and flash a bios dump. Tried 3 versions. Nothing\n\nI checked every mosfet and coil and they seem ok.\n\nno warm components whatsoever\n\n\n\n... how can formatting a laptop turn into a nightmare? What should I check?"
    },
    {
        "post_id":22892,
        "thread_id":22891,
        "title":"[SOLVED]Samsung laptop dead after bios update",
        "user_id":700,
        "username":"Nick",
        "post_date":"2017-07-12 08:53:02",
        "message":"np-700z5c is the model"
    },
    {
        "post_id":22922,
        "thread_id":22891,
        "title":"[SOLVED]Samsung laptop dead after bios update",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-07-13 03:20:44",
        "message":"No idea but 18V on the battery would indicate a shorted FET or bad charger chip. Used garbage charger?"
    },
    {
        "post_id":23271,
        "thread_id":22891,
        "title":"[SOLVED]Samsung laptop dead after bios update",
        "user_id":700,
        "username":"Nick",
        "post_date":"2017-07-20 02:04:33",
        "message":"Bullshit charger. Changed 2 fets, a coil, a buck converter chip and had to reflash bios. Fixed"
    }
]