[
    {
        "post_id":103029,
        "thread_id":64376,
        "title":"820-00939 (2018 mac mini t2) boot loop",
        "user_id":55107,
        "username":"JoeHobbyist",
        "post_date":"2023-12-08 15:40:58",
        "message":"I have 2018 i7 mac mini (t2) that I'm trying to make useful.\n\nIt boot loops at the apple logo.  Only the apple logo appears for about 20 seconds, and then it reboots.  There is no progress bar or any other on screen output other than the apple logo.\n\nDFU mode works fine, and I have tried both revive and restore.  Both complete successfully without error, but it still loops after revive\/restore.  (there is a step in the restore where a progress bar does appear on screen for a moment).  After a DFU restore, apple configurator will show it as a lock icon that appears and disappears with every reboot loop.\n\nIn DFU mode, it does not loop - it will stay on forever in DFU mode.\n\nPRAM reset makes it chime the apple sound, but it still reboots after 20 seconds.\n\nSSD \/ NAND voltages are OK.  PP1V8_SSD0, PP2V7_NAND_SSD0, PP0V9_SSD0 are all present.  NANDs are not hot.  No other chips are hot.  NANDs and T2 look fine visually.  No missing components found, no caps found shorted.\n\nThe board is clean.  No water damage.  no repairs have been made because nothing has been identified to repair.  No corrosion.\n\nDebug mode, recovery mode, internet recovery, startup manager, target disk: none of these work.  It will not go past the apple logo.  it just reboots.\n\nTried known good RAM and known good power supply (just to be sure), no difference.\n\nAny ideas?"
    },
    {
        "post_id":103038,
        "thread_id":64376,
        "title":"820-00939 (2018 mac mini t2) boot loop",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-12-09 02:35:26",
        "message":"First of all, welcome to the forum!\n\nDid you try starting in safe mode?\nWhat the customer said about how the problem appeared?"
    },
    {
        "post_id":103049,
        "thread_id":64376,
        "title":"820-00939 (2018 mac mini t2) boot loop",
        "user_id":55107,
        "username":"JoeHobbyist",
        "post_date":"2023-12-09 12:47:25",
        "message":"safe mode (holding shift key down) doesn't work.  Apple logo for about 20 seconds, then reboots.  no progress bar.\n\nNo history.  mac mini was given to me as old and broken."
    },
    {
        "post_id":103087,
        "thread_id":64376,
        "title":"820-00939 (2018 mac mini t2) boot loop",
        "user_id":55107,
        "username":"JoeHobbyist",
        "post_date":"2023-12-12 01:31:08",
        "message":"I was testing all the ports today (as best as possible, given it won't boot) for clues.  All 4 TB ports can output displayport video, both USB2 ports will initiate the PRAM reset, but I DID notice that the ethernet port will never light the link light on a switch.  I compared to another working 2018 mini, and the working one will light the link light even before it ever gets to the apple logo.  tomorrow i'm going to look more closely at the ethernet controller chip and it's supporting parts.\n\nstill open to any other ideas or suggestions tho!"
    },
    {
        "post_id":103107,
        "thread_id":64376,
        "title":"820-00939 (2018 mac mini t2) boot loop",
        "user_id":55107,
        "username":"JoeHobbyist",
        "post_date":"2023-12-12 18:55:17",
        "message":"Definitely have an ethernet subsystem issue.  PP1V2_ENET_INTREG is 6 ohms to ground, and PP3V3_ENET is 30 ohms to ground.  Known good board is not like that at all.  I'm guessing U9300 (broadcom ethernet chip) failed.  probably going to grab one from a donor board, and re-check all the caps\/rails while the chip is off as well."
    },
    {
        "post_id":103111,
        "thread_id":64376,
        "title":"820-00939 (2018 mac mini t2) boot loop",
        "user_id":55107,
        "username":"JoeHobbyist",
        "post_date":"2023-12-12 21:16:38",
        "message":"Confirmed: removing U9300 (broadcom ethernet chip) cleared all shorts on PP1V2_ENET_INTREG and PP3V3_ENET, and it immediately booted to recovery and allowed OS installation.  Mac Mini is now useful!"
    },
    {
        "post_id":103116,
        "thread_id":64376,
        "title":"820-00939 (2018 mac mini t2) boot loop",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2023-12-12 23:02:05",
        "message":"Thanks for the solution feedback.\nThis may help other members in the future."
    }
]