[
    {
        "post_id":23004,
        "thread_id":23004,
        "title":"820-3023 Stuck on chime",
        "user_id":893,
        "username":"2andrewd",
        "post_date":"2017-07-13 20:44:03",
        "message":"Okayyy.... this one,\n\nReaches S0, chimes, screen light turns on then right at the end of the initial chime it immediately restarts and gives about 3\/4 length incomplete chime, restarts, gives a half chime and repeats each time less and less chime audible."
    },
    {
        "post_id":23014,
        "thread_id":23004,
        "title":"820-3023 Stuck on chime",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-07-14 03:25:34",
        "message":"Usually RAM issues. Yeah good luck with those 16 RAM chips....."
    },
    {
        "post_id":23016,
        "thread_id":23004,
        "title":"820-3023 Stuck on chime",
        "user_id":441,
        "username":"aurel476",
        "post_date":"2017-07-14 05:37:04",
        "message":"try ram reflow"
    },
    {
        "post_id":23019,
        "thread_id":23004,
        "title":"820-3023 Stuck on chime",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2017-07-14 07:37:11",
        "message":"I have had two of these that were both SPI ROM issues on the 3023."
    },
    {
        "post_id":23028,
        "thread_id":23004,
        "title":"820-3023 Stuck on chime",
        "user_id":893,
        "username":"2andrewd",
        "post_date":"2017-07-14 13:00:47",
        "message":"I was thinking maybe spi so temp swapped one in, was able to reset  pram and smc.  Couple more power cycles and it returned. Any thoughts on what that could be?  Will post more details shortly"
    },
    {
        "post_id":23043,
        "thread_id":23004,
        "title":"820-3023 Stuck on chime",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-07-15 02:31:12",
        "message":"Could be anything, cracked trace somewhere, bad RAM chip. This board is trash."
    },
    {
        "post_id":23064,
        "thread_id":23004,
        "title":"820-3023 Stuck on chime",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2017-07-15 17:41:19",
        "message":"sandy bridge airs are the second worst behind the MCP79u airs. This is a case for the bin at this point."
    },
    {
        "post_id":23090,
        "thread_id":23004,
        "title":"820-3023 Stuck on chime",
        "user_id":893,
        "username":"2andrewd",
        "post_date":"2017-07-16 18:40:28",
        "message":"I could resell it on eBay with the same ethics as the original seller.  These boards come with either nothing wrong at all or as garbage failed attempted repair."
    },
    {
        "post_id":23117,
        "thread_id":23004,
        "title":"820-3023 Stuck on chime",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-07-17 13:05:54",
        "message":"Don't buy garbage boards of Ebay and expect to fix them. 90% is fucked garbage."
    },
    {
        "post_id":76223,
        "thread_id":23004,
        "title":"820-3023 Stuck on chime",
        "user_id":26621,
        "username":"grmacs",
        "post_date":"2021-06-07 08:04:40",
        "message":"NOt sure if this is appropriate to post on someone else's post, but I thought important for people to see my soltuion:\n\nI had this exact same issue on 3023 board that would intermittently have this issue. WHen it did boot, the camera didn't work. I tried with different camera and camera worked. Then it hit me maybe the bad camera was what was causing the issue. In my case it would only have this issue with the bad camera plugged in. Prior to this, I had tried cleanme on BIOS, trying different BIOS, Replacing the ROM chip, reflowing the ram chips, and USC and the problem would return once I reassembled everything. Apparently I just hadn't made the correlation that the problem only existed albeit intermittent, with the bad camera plugged in."
    }
]