[
    {
        "post_id":89307,
        "thread_id":62689,
        "title":"820-01987-A not detecting battery",
        "user_id":1166,
        "username":"Soji",
        "post_date":"2022-05-14 10:36:58",
        "message":"The macbook came with no data Acess on both type-c port. But it’s charging. \nI changed both cd3217, one of the port is not working if I turn the type c upside down and the macbook is not detecting battery anymore , if I remover the charger cable the screen will go off, no battery logo at the top right of the screen.pls help."
    },
    {
        "post_id":89312,
        "thread_id":62689,
        "title":"820-01987-A not detecting battery",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-05-14 11:12:25",
        "message":"Is a bit difficult to understand you.\nPlease, find a better manner to explain; try another translation method.\n\nSo one port works correctly (both directions) and the other one works only in one direction?\nCompare diode mode readings for CC1\/2 lines between both ports.\n\nMachine doesn't turn on with battery alone?"
    },
    {
        "post_id":89323,
        "thread_id":62689,
        "title":"820-01987-A not detecting battery",
        "user_id":1166,
        "username":"Soji",
        "post_date":"2022-05-14 23:03:35",
        "message":"one port charge correctly both direction, and the other one works only in one direction yes.\nthe cc1\/cc2 lines has same diode reading 587.\nAnd machine doesn’t turn on with battery alone. If I power it with charger it comes one but when I remove the charger it goes off. And no Battry logo on the screen too.\nD3328 usb_xa_usb_bot_n is ripped off \nD3354 usb_xa_usb_bot_p is ripped off"
    },
    {
        "post_id":89324,
        "thread_id":62689,
        "title":"820-01987-A not detecting battery",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-05-15 02:12:48",
        "message":"D3354 is connected to USBC_XB_USB_BOT_P.\n\nYou may have another damaged component, or broken trace; check under microscope.\nAlso remove USB-C ports and inspect their terminals.\n\nPost PPBUS_G3H and PP3V3_G3H_RTC voltage with battery alone (no charger)."
    }
]