[
    {
        "post_id":22659,
        "thread_id":22659,
        "title":"820-2850 intermittent  back light issue,",
        "user_id":651,
        "username":"RyanLEN",
        "post_date":"2017-07-06 20:37:50",
        "message":"2010 A1286 came in today for overheating\/shutting down issues.  Everything worked fine (Booted into OS full video and backlight, chime.) except for the overheating when it was dropped off in queue. A couple hours later when I turned it on it would only boot video but no backlight. At this time without removing the board I was only getting 24 volts on LCD Backlight lines. When I removed the board and tested I got the same result. But when I flipped the board upside down and started probing pins on u9701 and resistors around the area the backlight kicked on with 34 v on backlight lines. Now hours later, its still working fine. So my issue is, is that I dont feel comfortable giving this computer back tomorrow to its owner knowing this happened and that I may very well happen again. So to be safe, should I replace U9701 and surrounding resistors since I cant pin point the issue now that its working? Thanks a lot, have a good one."
    },
    {
        "post_id":22665,
        "thread_id":22659,
        "title":"820-2850 intermittent  back light issue,",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-07-07 03:34:45",
        "message":"Overheating....sure. Did you replace C9560?"
    },
    {
        "post_id":22673,
        "thread_id":22659,
        "title":"820-2850 intermittent  back light issue,",
        "user_id":651,
        "username":"RyanLEN",
        "post_date":"2017-07-07 06:18:49",
        "message":"I havent replaced anything yet. Overheating has been resolved. C9560 cause no backlight?"
    },
    {
        "post_id":22682,
        "thread_id":22659,
        "title":"820-2850 intermittent  back light issue,",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-07-07 10:13:55",
        "message":"Replace C9560 first, this should ALWAYS be replaced on 2850 boards."
    },
    {
        "post_id":22693,
        "thread_id":22659,
        "title":"820-2850 intermittent  back light issue,",
        "user_id":651,
        "username":"RyanLEN",
        "post_date":"2017-07-07 14:41:09",
        "message":"Ok. Thank you."
    }
]