[
    {
        "post_id":79921,
        "thread_id":61689,
        "title":"820-01041 New board no camera, ambient light sensor and no keyboard backlight.",
        "user_id":2508,
        "username":"No-Clean",
        "post_date":"2021-09-09 09:27:21",
        "message":"I will like to figure out if this is a board problem or Apple tying things to the T2 chip.\n\nHistory, we have 2 clean no damage complete computers with no boards, we ordered a new board front a trusted vendor, board has the same exact behavior on both computer\/cases: no camera, ambient light sensor doesn't work and no keyboard backlight.\n\nScreen brightness can be adjusted with touch bar and from settings, but not auto regulated, and the option for enabling auto brighness is gone from settings.\nKeyboard backlight cannot be adjusted from touch bar and the option for adjusting it is gone from settings.\n\nSteps to fix it:\nRevive and restore T2 in DFU mode did not fix it.\nReinstall system after T2 restore via internet did not fix it.\nChecked screen connector and flex, screen connector diode mode is on par with working board, I did not check voltage yet.\n\nOne important thing to note is that we did the same exact thing (swap boards) with a 13\" 2018 touch bar model and everything works, that is why we are confused.\n\nAny help will be greatly appreciated."
    },
    {
        "post_id":79927,
        "thread_id":61689,
        "title":"820-01041 New board no camera, ambient light sensor and no keyboard backlight.",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-09-09 14:02:43",
        "message":"Check L8504."
    },
    {
        "post_id":79945,
        "thread_id":61689,
        "title":"820-01041 New board no camera, ambient light sensor and no keyboard backlight.",
        "user_id":2508,
        "username":"No-Clean",
        "post_date":"2021-09-09 22:03:32",
        "message":"L8504 5V, however the screen flex did not have those 5V, screen flex was the problem.\n\nThe reason why I thought it could be T2 related was because recently some 2019 non Apple screen were giving us hell with about same issues, thanks for your help [USER=682]@2informaticos[\/USER]"
    }
]