[
    {
        "post_id":56199,
        "thread_id":56199,
        "title":"820-00281 won't boot",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-01-27 08:51:35",
        "message":"Hey guys. I got a 820-00281 that was liquid damaged and said to not turn on. When I tested it the board did boot, but only display's image to an external monitor and was showing a flashing folder icon. I was able to see the SSD in disk utility so I think it just does not have an OS installed on it. I booted with a test hard drive and it booted into the OS fine but only showed image on external monitor. USB activity was working so I replaced U9850 to see if that would fix the issue. Now the board does not seem to boot fully anymore. I do not get image on internal or external monitor anymore and caps lock does not respond. The board is showing that it is using 19.9v and 1.2 amps, both the CPU and GPU are getting warm and the fans are spinning normally. I checked all my S0 rails and they all appear to be present so i'm not sure what could be wrong. I replaced U9850 a second time to see if there was any change but it is the same. Here are some of the values I got for my S0 rails.\n\nPPVCCIO_S0_CPU - 0.963v\nPPVCCGT_S0_CPU - 0v (Also shows 0v on a good board)\nPPVCCSA_S0_CPU - 1.1v\nPPVCC_S0_CPU - 1.068v\nPP0V6_S0_DDRVTT - 0.593v\nPP1V8_S0 - 1.8v\nPP3V3_S0 - 3.3v\nPP3V3_S0_LEFT - 3.3v\nPP3V3_TBT_X_S0 - 3.3v\nPP3V3_TBT_T_S0 - 3.3v\nPP1V2_S0SW - 1.196v\nPP5V_S0 - 5.1v\nPP5V_S0_KBD - 5.1v\nPP1V8_S0_GPU - 1.8v\nPP3V3_S0_GPU - 3.3v\nPP1V0_S0SW - 0.984v\nPP5V_S0_T139 - 5.1v\nPPVCORE_S0_GPU - 0.904v\nPPVDDCI_S0_GPU - 0.901v\nPP1V5R1V35_S0_GPU_MEM - 1.348v\nPP1V5R1V35_S0_GPU_IC - 1.349v\nALL_SYS_PWRGD - 3.2v\nPM_PCH_SYS_PWROK - 3.3v"
    },
    {
        "post_id":56201,
        "thread_id":56199,
        "title":"820-00281 won't boot",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-01-27 11:40:01",
        "message":"Did you test USB activity again?\n\nSomething happened when you've changed the U9850.\nDid you try same chip again?\nYou should get external video at least.\n\nCheck for knocked off, or moved components.\nHeat applied to the board could affected CPU and even damaged it.\n\nWhich was initial area afected by liquid spill?"
    },
    {
        "post_id":56215,
        "thread_id":56199,
        "title":"820-00281 won't boot",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-01-27 13:45:16",
        "message":"Yes I did test usb activity using a USB drive and the light does not turn on and I am not getting external video. I tried 2 new U9850 chips with no change and I did compare diode mode reading around the LCD connector with another good board and the only value that is slightly different is LCD_IRQ_L, which measures .477 on this board and .490 on a good board. I will check for some knocked off components.\n\nThis board was pretty nasty when I opened it up. There was some sticky substance all over the board, that almost looked like someone has rubbed Vaseline all over the board. The hardest hit area was on the UB300\/400 side of the board but there was also some on the middle section of the board. I have included some images I took of the board when I first opened it. I do not have a UC so I cleaned the board thoroughly using rubbing alcohol and I tested it was still booting to external after that.\n\n[ATTACH type=\"full\" width=\"30%\"]56218._xfImport[\/ATTACH][ATTACH type=\"full\" width=\"30%\"]56221._xfImport[\/ATTACH]\n[ATTACH type=\"full\" width=\"30%\"]56223._xfImport[\/ATTACH][ATTACH type=\"full\" width=\"30%\"]56227._xfImport[\/ATTACH]"
    },
    {
        "post_id":56274,
        "thread_id":56199,
        "title":"820-00281 won't boot",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-01-28 20:21:44",
        "message":"I checked and I'm not getting the voltage for the screen but LCD_MUX_SEL is 1.35v. When I tested LCD_MUX_SEL on my other working board, it initially goes to 1.35v in the first few seconds after connecting the charger, but then it drops to 0v for a few seconds before going up to steady 3.3v. This board seems to get stuck in the stage where that voltage is only 1.35v. Wondering if I should replace U9800 or not since I do not even get caps lock to work.\n\nLCD_MUX_EN - 3.3v\nLCD_MUX_SEL - 1.35v\nPP5V_S0SW_LCD - 0v\nPP3V3_S0SW_LCD - 0v\nPANEL_FET_EN_DLY - 0v\nEDP_PANEL_PWR_EN -0v"
    },
    {
        "post_id":56281,
        "thread_id":56199,
        "title":"820-00281 won't boot",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-01-29 02:52:24",
        "message":"I can only think on damaged CPU in the process of changing U9850.\nOr maybe some components, or traces related with CPU activity.\nA simple video issue shouldn't block USB activity."
    },
    {
        "post_id":56290,
        "thread_id":56199,
        "title":"820-00281 won't boot",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-01-29 08:41:23",
        "message":"I decided to try another USB drive to make sure that there was no activity and this drive does light up when the charger is connected so this board does seem to have some USB activity. I also tried a USB Bluetooth adapter and the led on that also lights up when plugged into the board. The heatsink on this board does get very hot after only connected for a few minutes so idk if that mean the CPU is dead or not. I have replaced U9850 on other 1707's before and never damaged a CPU in the process but I guess its always possible."
    }
]