[
    {
        "post_id":37792,
        "thread_id":37792,
        "title":"820-3115 bizarre USB issue",
        "user_id":468,
        "username":"ALB-Repairs",
        "post_date":"2018-07-31 08:07:28",
        "message":"I have a 3115. On port J4700 the USB is behaving odly. If you disconnect the charger it will eject devices plugged into that port.\nIve replaced the USB 2.0 filter, usb 3.0 filters and MUX (u2670)\nIve also bypassed the USB power switch to ensure its not something to do with U4600. I am currently running the USB power direct from PP5VS3\nIt happens on both USB 2.0 devices and USB 3.0 devices. Ive removed the diodes D4700 and D4710, nothing ive done has changed the issue. \n\nWhat am i missing? \nThanks"
    },
    {
        "post_id":37838,
        "thread_id":37792,
        "title":"820-3115 bizarre USB issue",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-07-31 16:59:22",
        "message":"Pull up\/down whatever it is with USB2.0 plugged in USB_EXTB_SEL_XHCI and see if that cures the problem. That line may be glitching. It will disable USB 3.0 but at least it may continue working."
    },
    {
        "post_id":37888,
        "thread_id":37792,
        "title":"820-3115 bizarre USB issue",
        "user_id":468,
        "username":"ALB-Repairs",
        "post_date":"2018-08-01 03:31:56",
        "message":"[QUOTE=\"dukefawks, post: 37838\"]Pull up\/down whatever it is with USB2.0 plugged in USB_EXTB_SEL_XHCI and see if that cures the problem. That line may be glitching. It will disable USB 3.0 but at least it may continue working.[\/QUOTE]\n\nPulled it down, still the same behaviour. also tried removing the MUX entirely and running solely on ECHI and it still does it. Ive also tried bypassing the mux straight to USB 3.0 whilst using a USB 3.0 device. The problem remains.\nIm not sure ill figure this one out, but being defeated by a USB issue makes me feel pretty dumb.\n\nTried to see if i could access an unused port but none have Test pads."
    },
    {
        "post_id":37921,
        "thread_id":37792,
        "title":"820-3115 bizarre USB issue",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-08-01 15:54:11",
        "message":"If the other port is fine it must almost certainly be the PCH. Not worth taking the risk to fix I think."
    }
]