[
    {
        "post_id":32457,
        "thread_id":32457,
        "title":"820-3032 Ram issue",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2018-03-11 10:24:17",
        "message":"Hello,\nthis 820-3032 had 3x beeping ram. I gave all 16 Ram ICs a reflow and now it wont turn on. PP5V_S0 is there on the fan connector but the fan won´t spin. That is confusing to me. PP0V75_S0_DDRVTT is 0V so the ram is not powered. I followed this path and came to PLT_RESET_L and ISOLATE_CPU_MEM_L. They are both not present - that is why the ram has no power - and should be created by the PCH (as far as i understand). Diode mode readings:\nISOLATE_CPU_MEM_L   : 0.5V\nPLT_RESET_L                 : 0.425V\nso they are not shortet.\nNow i have no idea what to check next."
    },
    {
        "post_id":32461,
        "thread_id":32457,
        "title":"820-3032 Ram issue",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2018-03-11 19:48:14",
        "message":"I am confused as to whether we are currently exploring RAM beeping or dead. If it is dead after RAM reflow my first question would be how\/if at all did you shield the PCH or CPU during this process so excess heat wouldn't go to them, and was your hot air running over them?"
    },
    {
        "post_id":32463,
        "thread_id":32457,
        "title":"820-3032 Ram issue",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2018-03-12 00:34:10",
        "message":"Actually it is dead now. I preheated the board first and did not shield CPU\/PCH as they were on the other side of the board. So i thought that i dont need to shield them... I did not directly run over them with hot air as they are not unter the ram."
    },
    {
        "post_id":32465,
        "thread_id":32457,
        "title":"820-3032 Ram issue",
        "user_id":289,
        "username":"smiba",
        "post_date":"2018-03-12 01:48:14",
        "message":"The MacBook Air 2011 ram issues is from experience 95% of the time the CPU\/PCH or internal traces.\n\nI stopped accepting these unless the customer just wants to get a replacement board straight away (I always try to have one in stock)\n\nMissing memory voltage is something that might be fixable though but that circuit doesn't die easily. Assume you checked for shorts after the reflow?"
    },
    {
        "post_id":32466,
        "thread_id":32457,
        "title":"820-3032 Ram issue",
        "user_id":149,
        "username":"Fizzl92",
        "post_date":"2018-03-12 02:23:15",
        "message":"I think this one is done - unfortunately. Memory Voltagte is not shortet but VCORE is (thats why all the other signals are missing) and it had to be present bevore so i think the CPU died during the process... This was not my first time reflowing ram and i experience the same with this boards... Thank you both for the fast reply."
    }
]