[
    {
        "post_id":80309,
        "thread_id":61725,
        "title":"M1 820-02020",
        "user_id":26621,
        "username":"grmacs",
        "post_date":"2021-09-17 09:52:46",
        "message":"Liquid damage from water. Corrosion around UD560 connections under that chip are now good. DCIN voltage is 5.16V on both ports and zero amps drawing. Checking the CD3217's I'm getting the LDO's on the chip related to the powered port but the readings on the opposite chip are pulsing and erratic. This happens regardless of which port is being used... stable voltage on the connected port and unstable voltage on the unconnected port\/CD3217. I found this rather odd but haven't worked much on boards with CD3217's. Checked for shorts on big coils and all at least appear to be good at .100 or higher."
    },
    {
        "post_id":80311,
        "thread_id":61725,
        "title":"M1 820-02020",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-09-17 09:56:04",
        "message":"Do you get something at PPBUS_AON?"
    },
    {
        "post_id":80312,
        "thread_id":61725,
        "title":"M1 820-02020",
        "user_id":26621,
        "username":"grmacs",
        "post_date":"2021-09-17 10:02:00",
        "message":"Yes but unstable... 11.75V-12.35V"
    },
    {
        "post_id":80328,
        "thread_id":61725,
        "title":"M1 820-02020",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-09-17 13:50:50",
        "message":"Something else damaged by liquid."
    },
    {
        "post_id":80481,
        "thread_id":61725,
        "title":"M1 820-02020",
        "user_id":26621,
        "username":"grmacs",
        "post_date":"2021-09-22 14:27:51",
        "message":"Found a bad shorted cap under U7700. Fixed and PPBUS_AON is stable but CD3217's are still acting the same so it appears U7700 is affected. I would guess there was liquid contact there. Heating with flux gets the board to start trying to take amps but just cycles. Do you have any knowledge of the U7700 Apple chip it appears that it deals with PMU slave function so that would probably explain why the non connected CD3217 unstable. My only thoughts were to try to reball it and pray as I'm guessing it's probably programmed being it has an Apple logo on it haha."
    },
    {
        "post_id":80484,
        "thread_id":61725,
        "title":"M1 820-02020",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-09-22 16:16:26",
        "message":"BGA chips get affected usually after liquid ingress.\nAccumulated crap underneath creates parasite resistors and lekage appears."
    },
    {
        "post_id":80571,
        "thread_id":61725,
        "title":"M1 820-02020",
        "user_id":26621,
        "username":"grmacs",
        "post_date":"2021-09-24 07:20:13",
        "message":"Reball didn't change anything... I'm at least pretty sure that the problem lies with U7700. Does anyone know if these chips are serialized or do you think it's possible I could pull this from another board and it would work? I don't have a donor board to pull from at this time or I would just try it."
    },
    {
        "post_id":80576,
        "thread_id":61725,
        "title":"M1 820-02020",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-09-24 10:35:17",
        "message":"U7700 has internal firmware for sure, as it has GPIO lines; their functions are assigned in its firmware.\nHowever, no idea if the firmware is tied to specific board model.\nOnly 5 GPIO lines are used, maybe not a big issue the firmware."
    }
]