[
    {
        "post_id":51147,
        "thread_id":51147,
        "title":"820-00045 No Display\/Activity on keyboard",
        "user_id":1547,
        "username":"CRC2018",
        "post_date":"2019-08-02 02:46:23",
        "message":"So i've got an 820-00045 board in for repair and the history given to me by the customer was the screen froze and the sound went odd then the macbook wouldnt give any display any more. \n\nOn my testing:\nI've checked PP3v3R3v0_AON which is not shorted and is sitting at 3.31v as it should be\nPPDCIN is also sitting at 14.4v as it should be - the charger is negotiating with the machine and giving the correct voltage according to my usb c meter.\n\nWhen i connect the charger without the battery connected the CPU starts to get warm but there is no picture and the caps lock activity light does not operate. \n\nAlso should add visual inspection under the microscope revealed no signs of liquid damage or burned components. \n\nI dont have much experience with these boards so would appreciate any pointers as to what to check next. My instinct is pointing to potentially dead cpu or some problem with the cpu's power circuitry."
    },
    {
        "post_id":51149,
        "thread_id":51147,
        "title":"820-00045 No Display\/Activity on keyboard",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-08-02 03:05:56",
        "message":"Dead CPU like every single other 00045"
    },
    {
        "post_id":51150,
        "thread_id":51147,
        "title":"820-00045 No Display\/Activity on keyboard",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-08-02 04:21:27",
        "message":"Not worth to waste time on these boards.\nAll them get dead CPU at the end.\nJust for test, you can reflow entire board, better using IR oven.\nIf starts, recover data at least."
    },
    {
        "post_id":51377,
        "thread_id":51147,
        "title":"820-00045 No Display\/Activity on keyboard",
        "user_id":1547,
        "username":"CRC2018",
        "post_date":"2019-08-12 10:07:13",
        "message":"thanks all - i thought as much so have consigned this board to the scrap pile!"
    }
]