[
    {
        "post_id":12109,
        "thread_id":12109,
        "title":"[SOLVED]820-3115 Fan spins on and off cyclically",
        "user_id":296,
        "username":"jadao",
        "post_date":"2016-12-30 12:52:19",
        "message":"This board looked first pretty clean. Fan was spinning on and off cyclically because of PM_SLP_S5_L and PM_SLP_S4_L were jumping from 0 to 3.3V.\nPPBUS_G3H and PP3V42_G3H stable at 12.6V and 3.42V respectively. RTC region looks and measured good.\n\nWhen I noticed one of the little springs completely bent I decided to take a deep look and found the following :\n\nR5492 present but ripped on one side (VD0R)\nQ7812 had pin 5 connected to bad looking test point pad with some kind of viscous shit (on schematic it is called P3V3S0_EN, on brdview it's called PM_SLP_S3_R_L)\nQ7922 ripped missing (related to Ethernet)\nC9401 present but ripped  (Display port) and bad trace between pin 1 c9401 and pin 1 r9401 (Display port)\nC3895 ripped (thunderbolt)\nr6801 present but ripped (audio jack)\nr6700 r6701 ripped missing (audio)\n\nI first repaired R5492 circuit but nothing changed.\nI soldered the missing Q7922, scratched and touched up the test point PM_SLP_S3_R_L near Q7812 and made sure there is continuity and the board turned on and I have 0.8V on cpuVcore.\n\nOf course I don't have yet audio so didn't hear a chime, but I know the board is alive.\nI bet this board had initially only one issue, the very localized red spot, then when removed from chassis they break the hell of it.\nI am not giving any warranty to customer if he brings me board that he trashes against the wall.\n\nMy questions so far is can Q7922 be part of the culprit or most likely Q7812 test point pad?\nIs VD0R sensor circuit can prevent the board from powering on when the voltage divider is broken?"
    },
    {
        "post_id":12114,
        "thread_id":12109,
        "title":"[SOLVED]820-3115 Fan spins on and off cyclically",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-12-30 13:26:44",
        "message":"None of the components you listed will affect the board from turning on and giving a display."
    },
    {
        "post_id":12148,
        "thread_id":12109,
        "title":"[SOLVED]820-3115 Fan spins on and off cyclically",
        "user_id":296,
        "username":"jadao",
        "post_date":"2016-12-31 09:55:30",
        "message":"You are right, I replaced all components listed and everything was working ethernet, audio and so on.\n\nInternal LCD didn't show backlight, and found out LP8550 and c9714 c9710 burning hot. Unplugged power and found out 0.008 short on PP5V_S0 rail.\nIt was LP8850 internally shorted, when removed the chip I found out precisely VLDO input shorted to gnd, Vin was fine but they are tied together in apple designe. Replaced the chip and everything ok. This area was totally clean!\nPassed all EFI\/OS.\n\nI think initial issue was PP5VS0 shorted by lp8850, maybe without lcd plugged in, LP8850 didn't draw current that's why fan was able to spin and sometimes speed was dropping and even restarting cyclically.\n...\nBut since it was so clean I can't believe this happen just like that, I noticed the fan connector a little bit messed so maybe a short occured from the fan killing LP8850...\n\nYou can close this post since it is solved!"
    }
]