[
    {
        "post_id":78996,
        "thread_id":61591,
        "title":"820-01700 Stuck on 20v 0.7A",
        "user_id":32173,
        "username":"Hussamri",
        "post_date":"2021-08-19 07:41:30",
        "message":"Hi Guys.\nI am not a technician, I am just trying to get my laptop work while stuck in Nigeria. I am working with a good technician who is taking care of my macbook.\n At the beginning the laptop was giving 5V 0A, we tried to revive it, as per apple recommendations but nothing happened.\n\nThis guy managed to get the board take 20V 0.7A, I've done some readings and some have recommended to put it in DFU mode, and my guy is not convinced that the board is in DFU mode, he believes that there is a short somewhere around:\n Pp1v8_s5\n S5 rail.\n\nHe suggested that we wait until he gets his thermal camera, to better know where the short is happening, I don't know why I think that there is no problem there, because he couldn't see anything, and yes I do some readings but i do not understand everything, and I keep coming back to him with suggestions that I am not sure of,\nCan someone help please, I really do not want to lose my data, and I am going to be stuck in Nigeria for the upcoming months.\n\n\nCheers,"
    },
    {
        "post_id":79009,
        "thread_id":61591,
        "title":"820-01700 Stuck on 20v 0.7A",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-08-19 11:07:00",
        "message":"First of all, welcome to the forum!\n\nTo enter DFU, no need of S5 voltages.\nBe aware, do not choose restore option; as it will erase all your data!\n\n0.7A is high too much for a board in off state; you've said no S5 voltage.\nI suppose the battery was not connected.\nA thermal cam should show something, in case of such high current.\nSome chip should heat more than normal."
    },
    {
        "post_id":79019,
        "thread_id":61591,
        "title":"820-01700 Stuck on 20v 0.7A",
        "user_id":32173,
        "username":"Hussamri",
        "post_date":"2021-08-19 11:33:42",
        "message":"Thank you so much for your reply,\nI wish I knew everything you guys are talking about before purchasing my laptop.\n\nI am not sure if it is relevant, by I have 64gb of RAM and 2tb of SSDs.\n\nBut to answer your questions: No the 0.7 shows after you connect everything back.\n\nThe board is connected to the battery and still shows 20v 0.7\n\nwould it be possible that I didn't perform the reviving steps correctly, because it my laptop still shows on the host computer when connecting for reviving.\nor does it mean that there is still shorting somewhere?\n\nThanks."
    },
    {
        "post_id":79025,
        "thread_id":61591,
        "title":"820-01700 Stuck on 20v 0.7A",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-08-19 12:06:13",
        "message":"[URL unfurl=\"true\"]https:\/\/boards.rossmanngroup.com\/threads\/how-to-collection.60974\/[\/URL]\nFollow the exact steps from tutorial..."
    },
    {
        "post_id":79041,
        "thread_id":61591,
        "title":"820-01700 Stuck on 20v 0.7A",
        "user_id":32173,
        "username":"Hussamri",
        "post_date":"2021-08-19 14:19:33",
        "message":"Thank you so much,\nI've asked the guy to send a discribtion of what he did, step by step and this is what he sent me:\n\n[I]Initially the board was reading 5v and 0.0Am. After diagnostic I found out they ppbus_g3h was short, then I injected voltage to find the short cos I know it will be obvious to find without a thermo cam. Then I found the short around the ssd chip that takes 5v then supply 2.5v. I removed and the short went off completely and the power was 20v, 0.00am but if left for a while the Amp will go from 4-72 then falls back to 0.0amp. I replaced the chip and immediately 5v was restored but the 2.5v wasn’t and I realized that it requires the computer to turn on before the 2.5v can be pushed out. So I decide to go through the power rails as it was still not turning on but was pushing out 20v , 0.72amp but the amps wasn’t stable. So I checked the pmic rails & they are all present, then I checked the first s5 rail which is pp1v8_s5 and it was 0.0. So I check for a short and realize there was a short of 27.45 but I seem not find where the short was coming from.[\/I]"
    },
    {
        "post_id":79046,
        "thread_id":61591,
        "title":"820-01700 Stuck on 20v 0.7A",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-08-19 14:36:27",
        "message":"\"[I]I found out they ppbus_g3h was short, then I injected voltage to find the short[\/I]\"\nCommon failure for \"a good technician\"  :(.\n\nI just suppose he talks about U9580.\nIf was shorted, probably SSD was already fried.\nIf not, it was killed for sure when injected voltage.\nResistance to ground at L9580\/81 can confirm this.\n\nYour data is lost and T2 cannot boot the board, as it can get access to its dedicated SSD partition."
    },
    {
        "post_id":79050,
        "thread_id":61591,
        "title":"820-01700 Stuck on 20v 0.7A",
        "user_id":32173,
        "username":"Hussamri",
        "post_date":"2021-08-19 14:45:21",
        "message":"So it is either I replace the whole board now, or replace the SSD?\nIf I lost my data already I would go with changing the whole board, I guess."
    },
    {
        "post_id":79052,
        "thread_id":61591,
        "title":"820-01700 Stuck on 20v 0.7A",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-08-19 14:53:38",
        "message":"Replace the board..."
    }
]