[
    {
        "post_id":17731,
        "thread_id":17731,
        "title":"Supply of First-Look Logic Boards Available",
        "user_id":135,
        "username":"bjf",
        "post_date":"2017-04-03 08:42:25",
        "message":"Short Story:\n\nHey everyone, I ran this by Louis to get his okay before posting this but basically, I’m going to be retiring from board repair due to other elements of running my business completely overwhelming me so I need to create some partnerships with some people to offload my supply of boards. These would all be fresh-from-consumer boards that you would have first-look at. I’ll be making weekly shipments and selling them in groups by board model. Feel free to contact me if you're interested or if you have any questions.\n\n\n\nLong Story:\n\nI no longer have a free moment to work on boards so I need to work with other people who are looking for a source of boards. I have a pile of boards that is getting out of control and I no longer have any hope of getting to them. I’ve considered training someone but, if I’m lucky enough to find someone capable enough, it seems like the most time-consuming endeavor I could partake in so I’m opting to just work with other repair techs interested in a steady supply of boards.\n\nMy plan is to sell them by model, so for example, I would offer up all 2015 13” Air boards (820-00165), 2012 MacBook Pro 13” (820-3115) boards and so on for all 30-40 computer generations of models I’m currently buying (2009 and later). So someone could take just one series, or five, or all of them.\n\nI’ve built up some established local sources (recycling centers, advertising, networks of individuals, etc.) over the years where I’m getting complete computers directly from consumers so at least 95% of the boards are untouched before getting to me. They’re not cheap, but the deal I have with everyone is that they can’t be opened before I get them. So in my plan, my employees would pull the boards, clean them in the ultrasonic and any boards that don’t come out working would go into the stack to be sold. As hard as it would be to know what’s wrong with a board but have to move it along, I recognize the value of what I’m offering is that the repair tech I’m selling these to would receive 100% of all the boards. There would be zero attempts to fix anything so all boards, including the hard-fixes, the easy-fixes, the 5-minute fixes, the fuse-fixes, everything would go directly to the repair tech I’m working with. We take pre-cleaning pictures of all the boards also so the tech I’m working with would receive high-res pictures of the front and back of the board in its original state. Prices would be set slightly higher than as-is boards sell for on eBay. The value of these board would be much greater than anything that could be acquired off of eBay, but I think pricing it slightly higher than eBay would be a fair price for both sides.\n\nLet me know if you’re interested or have any questions.\n\nThanks,\nJay"
    },
    {
        "post_id":17734,
        "thread_id":17731,
        "title":"Supply of First-Look Logic Boards Available",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-04-03 11:00:02",
        "message":"I'd be interested in the 820-2936, 820-3115, 820-3330, 820-3437, 820-00165 boards. I've sent you a PM--thanks, Jay!"
    },
    {
        "post_id":17738,
        "thread_id":17731,
        "title":"Supply of First-Look Logic Boards Available",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-04-03 11:32:51",
        "message":"If you are EU based I may have interest."
    },
    {
        "post_id":17742,
        "thread_id":17731,
        "title":"Supply of First-Look Logic Boards Available",
        "user_id":135,
        "username":"bjf",
        "post_date":"2017-04-03 12:34:42",
        "message":"I'm in the US, but if 20-30 boards were sent at a time, maybe shipping costs would make sense? What country are you in?  I can check on costs and let you know what I come up with."
    },
    {
        "post_id":17743,
        "thread_id":17731,
        "title":"Supply of First-Look Logic Boards Available",
        "user_id":135,
        "username":"bjf",
        "post_date":"2017-04-03 12:42:39",
        "message":"[QUOTE=\"SMMRepair, post: 17734\"]I'd be interested in the 820-2936, 820-3115, 820-3330, 820-3437, 820-00165 boards. I've sent you a PM--thanks, Jay![\/QUOTE]\n\nHi Steven, I saw your message, thanks for writing. Let me come up with a list of what we get per month and I'll get back to you. I know we get a whole lot of the ones you mentioned, besides the 3330, but I also want to come up with a list of everything else too. I'll write you back tonight, and post the list here too for other people to see, after I leave work and have a minute to look through our invoice system.\n-Jay"
    }
]