[
    {
        "post_id":57958,
        "thread_id":57958,
        "title":"820-00281 No Image",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-04-02 17:38:53",
        "message":"Hey guys. I got a 820-00281 in that was liquid damaged and has a lot of issues. It originally had only 5v on the charger and I replaced UB300\/400 and also had to replace the resistors around UB090 and run a wire from CB090 to RB090 to restore 20v. Still did not boot due to a short on PPBUS_G3H. Found that PPBUS was shorted to ground through CA325. This whole area looked bad so I replaced CA325 and QA300. The board then turned on but had high fan spin on the left fan only. This was because Q6000 was missing from the board. Replaced that and also has to replace one of the hall sensors because it was damaged. The board boots now and seems to run normally except for a few issues. The main issue is that the internal display only has backlight and no image. I tested with a known good full assembly and had the same issue. External display works fine. It also take a long time to boot into the OS (about 3 minutes). The keyboard backlight also does not come on when you first boot the computer, but does come on if I close the lid and re-open it. Seems like this would be a issue with SMC_LID but the voltages seem normal. I replaced U9850 to try and fix the image issues but that did not help. Still have just backlight on the LCD. Here are some of the voltages I got for the screen.\n\n\nPP5V_S0SW_LCD - 5.1\nPP3V3_S0SW_LCD - 3.3\nEDP_PANEL_PWR_EN - 3.3\nPANEL_FET_EN_DLY - 3.4\nDFR_DISP_PWR_EN - 3.4\nBUF_EDP_PANEL_PWR_EN - 3.4\nBUF_SMC_REST_L - 3.4\nDFR_DISP_SMC_RST_L - 3.4\nDP_INT_HPD - 3.3\nSMC_RESET_L - 3.4\nSMC_LID - 3.4\nSMC_LID_RIGHT - 3.4\nSMC_LID_LEFT - 3.4"
    },
    {
        "post_id":57959,
        "thread_id":57958,
        "title":"820-00281 No Image",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-04-02 23:47:30",
        "message":"If you get backlight, all power rails for LCD connector should be good.\nYou must have a problem with data lines.\nCompare diode mode to ground on all them.\n\nDo you get black, or white screen?"
    },
    {
        "post_id":57962,
        "thread_id":57958,
        "title":"820-00281 No Image",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-04-03 07:15:50",
        "message":"I checked all the EDP_INT_ML and EDP_AUXCH lines and compared their diode mode values to another good board and they are very similar. EDP_INT_ML lines are about .314 (.323 on a good board), and EDP_AUXCH is about .401 (good board .406). I only get backlight and a black screen."
    },
    {
        "post_id":57963,
        "thread_id":57958,
        "title":"820-00281 No Image",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-04-03 07:39:34",
        "message":"Did you pick U9850 from liquid damaged board?\nTry to reflow it, in case of bad solders.\nAlso check for knocked off components around it.\nInspect J8500 traces and contacts."
    },
    {
        "post_id":57978,
        "thread_id":57958,
        "title":"820-00281 No Image",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-04-03 19:31:01",
        "message":"I used a new U9850 that was bought online. I tried to reflow it with no change. I also tried replacing it again with one from a donor board and still have the same symptoms. I did not find any knocked off components near that chip. J8500 looks fine and all the traces and contacts appear normal."
    },
    {
        "post_id":57979,
        "thread_id":57958,
        "title":"820-00281 No Image",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-04-04 02:25:45",
        "message":"Are you sure tested LCD assembly is compatible with this model?\nCheck diode mode at all data input lines of U9850.\nAlso post voltage for LCD_MUX_EN\/SEL; with LCD connected, of course."
    },
    {
        "post_id":58073,
        "thread_id":57958,
        "title":"820-00281 No Image",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-04-07 07:19:36",
        "message":"I just got in another a1707 with a working screen and tested this board with that screen and is it actually getting image now. I think I previously did have an issue with U9850 that was fixed but the display I was testing with seems to also be broken so it was screwing me up. Image works fine on this board now but I am still having an issue with the board booting slowly and it also sometimes will boot to the critical software update screen for the touch bar. Its weird because I will only get to that screen like 10% of the time I try and boot. The rest of the time it boots slowly but get to the OS with a working touch bar. Do you know what would cause this issue?"
    },
    {
        "post_id":58078,
        "thread_id":57958,
        "title":"820-00281 No Image",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-04-07 09:49:40",
        "message":"Try clean ME BIOS first..."
    },
    {
        "post_id":58130,
        "thread_id":57958,
        "title":"820-00281 No Image",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-04-10 14:45:51",
        "message":"I tried a clean me bios I found online but now it does not boot. It tries to boot and then restarts and shows the kernel panic error screen. Do you have a clean me bios for this model?"
    },
    {
        "post_id":58131,
        "thread_id":57958,
        "title":"820-00281 No Image",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-04-10 16:56:21",
        "message":"Not really sure if good\n[url]https:\/\/drive.google.com\/open?id=16adJEM165cARymUCKK6_NZ2w3GbjtOFv[\/url]\nTry it and comment..."
    },
    {
        "post_id":58149,
        "thread_id":57958,
        "title":"820-00281 No Image",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-04-11 12:46:49",
        "message":"Thanks! This does seem to be good because the board now boots again but its still very slow to get to the login screen. Takes about 3-4 minutes from the time I hit the power button until I am able to login. The first time I booted with this ME, it booted to the critical software update screen but I did not have the wifi connected. I shut it down and re connected the wifi antenna cables and then turned it on again and it booted to the login screen this time after about 4 minutes, with a working touch bar. It takes just as long to boot into a test OS from a USB drive also."
    },
    {
        "post_id":58150,
        "thread_id":57958,
        "title":"820-00281 No Image",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-04-11 13:34:39",
        "message":"Run HWMonitor and see if reports any strange sensor value.\nFans spin normal?\nDo you have Medusa programmer?"
    },
    {
        "post_id":58155,
        "thread_id":57958,
        "title":"820-00281 No Image",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-04-11 15:10:56",
        "message":"HWMonitor reports all normal temperatures and the fans spin normally at around 2000 rpm. I do not have a Medusa programmer. I used a CH341A programmer and Flashrom to flash the chip. Diagnostic only reports that the battery is not detected since this one has a bad battery in it right now and I have it disconnected while I wait for a new battery."
    },
    {
        "post_id":58158,
        "thread_id":57958,
        "title":"820-00281 No Image",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-04-11 19:27:14",
        "message":"If I try and boot without the wifi cables connected, it will always boot to the critical software update screen, but if I have the wifi cables connected, it will boot slowly to the login screen. I plugged in the wifi cables once it got to the update screen and then downloaded the update without issue and the board booted. The update takes about 3 minutes to install so what it seems like to me is it is not saving the touchbar update when I reboot and has to re download it each time I start the computer. Is the touchbar driver\/update saved on the internal SSD?"
    },
    {
        "post_id":58159,
        "thread_id":57958,
        "title":"820-00281 No Image",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-04-12 01:05:29",
        "message":"The touchbar driver should be saved on the SSD.\nRecover the data and do fresh install.\n\nPRAM reset tried 2-3 times?"
    },
    {
        "post_id":58174,
        "thread_id":57958,
        "title":"820-00281 No Image",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-04-12 07:31:54",
        "message":"Yes I have tried a PRAM reset and also did a fresh install multiple times and always the same issue. It does not seem to be software related. When the computer gets to the login screen, it works completely normally."
    },
    {
        "post_id":58177,
        "thread_id":57958,
        "title":"820-00281 No Image",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-04-12 08:40:57",
        "message":"Did you write the BIOS file as is, or changed serial number first?"
    },
    {
        "post_id":58179,
        "thread_id":57958,
        "title":"820-00281 No Image",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-04-12 09:40:58",
        "message":"I changed the serial number of the file you gave me first and then wrote it to the chip."
    },
    {
        "post_id":58182,
        "thread_id":57958,
        "title":"820-00281 No Image",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-04-12 10:35:26",
        "message":"If you change serial number, Fsys checksum must be fixed.\nTry the file as is, to discard a BIOS issue."
    },
    {
        "post_id":58195,
        "thread_id":57958,
        "title":"820-00281 No Image",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-04-12 18:55:10",
        "message":"Yea I am pretty sure I fixed the checksum properly when I changed the serial number, but just to make sure, I took your suggestion and flashed the chip with the clean ME you provided, as-is but still have the same issue. I don't think this is a BIOS issue but have no idea what could be causing this."
    },
    {
        "post_id":58196,
        "thread_id":57958,
        "title":"820-00281 No Image",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-04-13 00:05:37",
        "message":"If you have Medusa programmer, then clean ME into original BIOS."
    },
    {
        "post_id":58207,
        "thread_id":57958,
        "title":"820-00281 No Image",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-04-13 12:17:19",
        "message":"I do not have a medusa programmer. I downloaded the correct Clean ME version for my original BIOS and copied it into the original BIOS but still have the same issue. Board still boots slow but then works fine once it does boot. Still trying to find something else wrong on this board but am not having any luck."
    },
    {
        "post_id":58208,
        "thread_id":57958,
        "title":"820-00281 No Image",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-04-13 12:33:45",
        "message":"\"I downloaded the correct Clean ME version for my original BIOS and copied it into the original BIOS\"\nI'm not sure if you understood how to clean ME region; surely not copy\/paste...\n\nUpload somewhere your original BIOS.\nI hope you made a backup first."
    },
    {
        "post_id":58209,
        "thread_id":57958,
        "title":"820-00281 No Image",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-04-13 12:48:08",
        "message":"No I did not just copy and paste it. I followed this guide on win-raid.com on how to clean the ME region using the Intel Flash image tool. [URL=\"https:\/\/www.win-raid.com\/t1658f39-Guide-Clean-Dumped-Intel-Engine-CS-ME-CS-TXE-Regions-with-Data-Initialization.html\"]https:\/\/www.win-raid.com\/t1658f39-Gu...alization.html[\/URL]\n\nHere are both my original and cleaned BIOS files. Idk if you can tell if its cleaned correctly or not. \n\nOriginal: [URL]https:\/\/drive.google.com\/open?id=1MrCADRie4QPHIicBDTZWFevNasGenf8F[\/URL]\n\nClean: [URL]https:\/\/drive.google.com\/open?id=1WN3Vprn96rr5Tjm_C-WUo5neepsSxhgk[\/URL]"
    }
]