[
    {
        "post_id":6409,
        "thread_id":6409,
        "title":"820-3437 liquid damage, semi-OK now but..",
        "user_id":136,
        "username":"george-a",
        "post_date":"2016-09-06 05:04:13",
        "message":"hi guys,\n\nso after UC this one it came back to life but:\n\n1) the fan spins and stops two times and then the machine starts to boot.\n\n2) there was no green\/orange light and NO BACKLIGHT until I reconnected some broken lines\/pads on the secondary I\/O board - that brought back the backlight (???) and the green\/orange light\n\n3) if the battery is connected the system will NOT turn on but there is green\/orange light - I dare not leave it for longer to take measurements - should I?\n\n4) keyboard and trackpad seem unresponsive\n\n\nany help with any of the above is appreciated.\n\nand while I was writing this up I made this for Louis :) - articulated microscope!_=-_-_-_-_-_----> [URL]https:\/\/www.youtube.com\/watch?v=sSAq-OayCrU[\/URL]\n\nthanks guys,\ngeorge"
    },
    {
        "post_id":6412,
        "thread_id":6409,
        "title":"820-3437 liquid damage, semi-OK now but..",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-09-06 06:06:12",
        "message":"1) Normal\n2) Replace IO board and cable, they are always fucked\n3) Check if battery is recognized in OSX. Orange light without battery is normal. What is your PPBUS voltage? Bad battery is very likely.\n4) Corrosion on trackpad connector\/cable or trackpad itself."
    },
    {
        "post_id":6443,
        "thread_id":6409,
        "title":"820-3437 liquid damage, semi-OK now but..",
        "user_id":136,
        "username":"george-a",
        "post_date":"2016-09-07 07:01:41",
        "message":"hi duke - small revisit to (3) since you were probably in a hurry..\n\n3) as mentioned the system will NOT turn on with battery connected - thus cannot check battery status in OSX. Is it safe to leave the magsafe connected to take measurements? Can I tell if the battery is dead by checking the communication with the SMC? If the cells are shorted can this damage the motherboard?\n\nalso \n4) there is no corrosion??\n\ngeorge"
    },
    {
        "post_id":6451,
        "thread_id":6409,
        "title":"820-3437 liquid damage, semi-OK now but..",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-09-07 10:58:01",
        "message":"3) Try a known good battery\n4) Try a known good trackpad and cable. \n\nYou need test parts or else you are just stabbing in the dark."
    }
]