[
    {
        "post_id":71850,
        "thread_id":60807,
        "title":"T2 Mac serial shenanigans",
        "user_id":23409,
        "username":"Melvinzill",
        "post_date":"2021-02-18 14:22:30",
        "message":"Hi, so I have an interesting problem. Got in a liquid damaged 16 Inch MacBook Pro for a customer for board repair. Well there is no fixing this thing, it is toast. I sold him an exact replacement 16\" as I had a used one. Well he called me next day saying his professional software he uses for work doesn't want to activate. Turns out its bound to a particular serial number. And the company said its like 1000EUR to get a replacement licence (he told me its a 15k piece of software). Not great....\n\nIs there any way to transfer the Serial? On the old Macs I could just reprogram the EFI flash chip and it was a done deal. Well this doesn't seem to be the same on T2 enabled machines. I did see two videos using this programmer ([URL]https:\/\/www.unionrepair.com\/by-t200-t2-data-assistant-for-macbook-read-backup-repair.html[\/URL]), but I have no idea if this is even real (I mean it was just on YT) and if this specialty programmer is the only way to do this... I don't want to drop 200EUR (with import and shipping) to find out this was all complete BS. \n\nAnyone ever tried this before?"
    },
    {
        "post_id":71851,
        "thread_id":60807,
        "title":"T2 Mac serial shenanigans",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-02-18 14:51:34",
        "message":"A4069 adapter for Medusa...\n[URL unfurl=\"true\"]http:\/\/www.cmizapper.com\/buy\/medusa-3-accessories.html[\/URL]"
    },
    {
        "post_id":71876,
        "thread_id":60807,
        "title":"T2 Mac serial shenanigans",
        "user_id":23409,
        "username":"Melvinzill",
        "post_date":"2021-02-19 02:32:25",
        "message":"Okay so any old programmer supporting the \"normal\" EFI chip can also write to the T2 flash chip?"
    },
    {
        "post_id":71880,
        "thread_id":60807,
        "title":"T2 Mac serial shenanigans",
        "user_id":1057,
        "username":"piernov",
        "post_date":"2021-02-19 04:36:41",
        "message":"It's a regular 25-series SPI ROM but 1.8V and in a USON 3×4mm package. The above adapter should have the correct footprint and an integrated level shifter, but you could also use a programmer with native support for 1.8V (or a different level shifter) and solder wires to the chip…"
    }
]