[
    {
        "post_id":27303,
        "thread_id":27303,
        "title":"[SOLVED]820-2915 Stuck on Optical Digital Out",
        "user_id":16,
        "username":"supamodz",
        "post_date":"2017-10-25 16:10:03",
        "message":"Hi Guys this one is pulling my brains on this one. Customer came in stating that this unit has no audio which is very strange because on boot you hear it chime. But when you try and play a video there is no sound, if i plug in the headphones there is sound, but when i unplug the headphones the audio is grayed out in the menu bar. Upon inspection i saw that U6200 was completely ripped off the board with ripped traces, so i made a jumper and replaced u6200. Now voltage is back but the problem is still there, i checked for voltage on the 6 pins and everything is within specs. I tried to replace the audio chip and checked all voltage on U6201 the chip has power and still same issue, i am lost and really don't know where else to look. At one point i saw the red light in the audio jack but it is no longer lighting up. What else could be stopping the internal speakers from being detected?"
    },
    {
        "post_id":27314,
        "thread_id":27303,
        "title":"[SOLVED]820-2915 Stuck on Optical Digital Out",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-10-26 03:05:18",
        "message":"Just replace the jack...."
    },
    {
        "post_id":27316,
        "thread_id":27303,
        "title":"[SOLVED]820-2915 Stuck on Optical Digital Out",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-10-26 03:06:23",
        "message":"Broken headphone jack, if you replace it it probably works again.\n\nYou can remove SPDIF detection by removing R6805 which will also make it work again, but SPDIF will stay broken."
    },
    {
        "post_id":27389,
        "thread_id":27303,
        "title":"[SOLVED]820-2915 Stuck on Optical Digital Out",
        "user_id":16,
        "username":"supamodz",
        "post_date":"2017-10-26 19:01:52",
        "message":"[QUOTE=\"smiba, post: 27316\"]Broken headphone jack, if you replace it it probably works again.\n\nYou can remove SPDIF detection by removing R6805 which will also make it work again, but SPDIF will stay broken. [\/QUOTE]\n\nThank you simba your advice worked like a charm! Duke mark this one as solved, even tho your way is the right way but no time for the long painful task on a board with prone gpu issues waiting to die ! Thanks again guys !!!!"
    }
]