[
    {
        "post_id":80444,
        "thread_id":61743,
        "title":"How to measure a short on MacBook",
        "user_id":32584,
        "username":"Erarepair",
        "post_date":"2021-09-22 01:28:12",
        "message":"How do I measure for a short on MacBook. What am expected to see eg if there is short pp1v8_s5, when I measure such, what am I expected to see as a short to ground. Or. If there is short on ppbus_g3h. What value will I see for me to conclude it’s a short. Pls guys am new here but I have been fixing boards for some time now and seem not to understand what a short really is.\nBasically how to measure short on MacBook is my problem.\nThanks guys as I await response."
    },
    {
        "post_id":80450,
        "thread_id":61743,
        "title":"How to measure a short on MacBook",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-09-22 04:46:12",
        "message":"First of all, welcome to the forum!\n\n\"I have been fixing boards for some time now and seem not to understand what a short really is.\"\nHow did you repair them, whitout knowing what a short is?\n\nThere is no difference to measure on normal laptop boards, or Apple made.\nPower rails and signals name can change, but working manner not.\nSome names are still the same as in normal boards.\nEven between normal boards, any designer use the names he likes; there is not a standard at all.\nI say more easy with Apple, as mostly same names used for years.\nSlightly changes when platforms change; like new names, caused by new signals, power rails.\n\nKeep in mind, the forum goal is to help in repair process; with a particular board you have on the desk.\nIn this time, the replies provided also help you to understand something.\n\nReading as more threads as possible (not only personal ones), also provides lot of useful information.\nI recommend you to start reading this thread:\n[URL unfurl=\"true\"]https:\/\/boards.rossmanngroup.com\/threads\/how-to-collection.60974\/[\/URL]\n\nFor personal training, please contact Rossmann staff..."
    },
    {
        "post_id":80455,
        "thread_id":61743,
        "title":"How to measure a short on MacBook",
        "user_id":32584,
        "username":"Erarepair",
        "post_date":"2021-09-22 05:51:25",
        "message":"How do I contact Rossmanngroup staff"
    },
    {
        "post_id":80466,
        "thread_id":61743,
        "title":"How to measure a short on MacBook",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-09-22 10:15:29",
        "message":"There should be some information on the Contact page.\nOr write PM to Louis, or someone else."
    }
]