[
    {
        "post_id":10345,
        "thread_id":10345,
        "title":"27\" Thunderbolt Display Issue?",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2016-11-28 14:47:15",
        "message":"I'm working on a 27\" Thunderbolt display that loses backlight intermittently. It will work fine for a few hours, then the backlight goes out without warning. The image is still there, as I can see it very faintly if I shine a light onto the LCD (a lot tougher to make out than a MBP for sure). \n\nI know a ton of people had issues with these things several years back; I already installed the firmware update(s) for the display, but the issue persists. Without any schematic or boardview--not to mention the incredible difficulty of somehow managing to measure voltages with the thing powered on and the LCD connected--I was hoping maybe someone had knowledge of any \"common issues\" that would cause this. The display powers on perfectly fine (can hear volume, USB ports work, etc), it just has a backlight failure sometimes. If left alone for several hours, it works fine for ~30 minutes initially, then backlight fails. \n\nAny ideas?"
    },
    {
        "post_id":10351,
        "thread_id":10345,
        "title":"27\" Thunderbolt Display Issue?",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2016-11-28 17:20:31",
        "message":"I'd even be fine if there's somewhere I can connect 3.3v to and have the backlight be at full-brightness at all times. I don't care about dimming. Full-brightness would be loads better than zero-brightness."
    },
    {
        "post_id":10360,
        "thread_id":10345,
        "title":"27\" Thunderbolt Display Issue?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-11-28 23:27:12",
        "message":"No idea. Only thing I have done to one of these is replace the cable. You can try and connect a regular thunderbolt cable straight to the board, there is a standard connector on the board inside. Besides that I cannot help as there is no schematics and I have none of them here."
    }
]