[
    {
        "post_id":8286,
        "thread_id":8286,
        "title":"820-3115, Missing all Data Lines to LVDS.",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2016-10-19 17:54:20",
        "message":"820-3115 board that works perfectly via external (thunderbolt) display, but internal LCD non functional. Board had liquid damage, and I had to do quite a bit of work to this one around the SMC area, but all is well in that area now. The liquid damage area was very, very isolated (liquid made it about .5\" in towards top edge of board, half an inch or so on either side of the SMC). Cleaned very well, replaced all visually affected components, reballed SMC, ran a few wires, and all was good. \n\nI do have backlight (black screen, no data signals). Board chimes, boots into OSX, works great via external display, etc., but doesn't show any video (data) through the LCD. Backlight can be adjusted, keyboard backlight works, etc., as normal, just no data. Have tried a new display assembly of course, and actually already replaced the LVDS connector and surrounding LVDS circuitry that are common culprits (L9080, U9000, L9004, C9015, C9010). \n\nEverything now measures out fine except for ALL data lines--pins 8\/9, 11\/12, 14\/15, and 17\/18 are all 0v. I get 0v at pins 1 and 4 of L9080 as well. Pins 6\/7 are 3.3v as well.\n\nSince these all come from U1800 (ugh), is there anything I can check before deciding the PCH has issues? Would a damaged SMC cause these sorts of issues by chance? I replaced the SMC well, and everything else works (so I know it's aligned fine, etc), but maybe one or two solder balls didn't melt properly? I always hold the heat for ~10 more seconds after the chip dances, and give it a few light taps on the side to make sure it snaps-back properly, etc. \n\nNot sure what to check beyond what I mentioned above. Any help appreciated!"
    },
    {
        "post_id":8293,
        "thread_id":8286,
        "title":"820-3115, Missing all Data Lines to LVDS.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-10-19 21:04:45",
        "message":"Measure them on diode mode with positive to GND, system not powered of course."
    },
    {
        "post_id":8379,
        "thread_id":8286,
        "title":"820-3115, Missing all Data Lines to LVDS.",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2016-10-21 07:29:09",
        "message":"Sorry for delay, forgot I posted this one. Diode measurements:\n\nPin 8: .503\n9: .502\n11: .503\n12: .502\n14: .502\n15: .502\n17: .502\n18: .502"
    },
    {
        "post_id":8380,
        "thread_id":8286,
        "title":"820-3115, Missing all Data Lines to LVDS.",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2016-10-21 07:32:52",
        "message":"I edited my above post; at first, pin 18 gave me .480, but after re-measuring it gave .502 (had some flux on it from me replacing the LVDS, probably didn't get a good read the first time)."
    },
    {
        "post_id":8381,
        "thread_id":8286,
        "title":"820-3115, Missing all Data Lines to LVDS.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-10-21 07:32:59",
        "message":"Oh, well now check if all data pins make it to the other side of a LCD cable. Could be bad connector."
    },
    {
        "post_id":8382,
        "thread_id":8286,
        "title":"820-3115, Missing all Data Lines to LVDS.",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2016-10-21 07:47:58",
        "message":"Hey Duke, \n\nI thought the same thing originally, and replaced the connector with a brand new one. Just measured and they all make it to the end of a cable, yes. Thanks!"
    },
    {
        "post_id":8384,
        "thread_id":8286,
        "title":"820-3115, Missing all Data Lines to LVDS.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-10-21 08:32:34",
        "message":"Replace L9080 and if that does not help I guess it is the PCH."
    },
    {
        "post_id":8386,
        "thread_id":8286,
        "title":"820-3115, Missing all Data Lines to LVDS.",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2016-10-21 08:41:27",
        "message":"Thanks, Duke. Yeah I replaced L9080 as part of my original troubleshooting, and no dice. Thank you again for the help! Again, this was a board from my \"dead end, can't figure out, might be a PCH\/CPU problem\" pile. Sorry to hit you with so many of these tough ones! :)"
    }
]