[
    {
        "post_id":40032,
        "thread_id":40032,
        "title":"820-00164 Sensor Issue",
        "user_id":681,
        "username":"iambehr",
        "post_date":"2018-09-28 13:13:52",
        "message":"Hello,\n\nLogic board gets to S0 state but has generic SMC error.\nHWMonitor shows that heatpipe inlet temp and heatpipe outlet temp are 128C.\n\nInlet temp is q5830 attached to U5800, but does anyone know what sensor or bus heatpipe outlet temperature would be? Trying to find if there is a shared data line.\n\nThanks\n\nStefan\n\nEdit: Inlet temp is on SMC 1 dataline, and finstack is on SMC 2, so they don't share a data line. And finstack appears to be reporting correctly anyway.\nPull up resistors for SMBUS SMC 1 are OK, and it appears that the lines are varying in voltage like there is data (don't have oscilloscope unfortunately)."
    },
    {
        "post_id":40035,
        "thread_id":40032,
        "title":"820-00164 Sensor Issue",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-09-29 00:02:22",
        "message":"Q5830 is used for outlet temp report too.\nThis is the reason you get the same temp value.\n\nCheck for corrosion on its area. Be sure to have good continuity to U5800.\nMaybe need to change it."
    },
    {
        "post_id":40067,
        "thread_id":40032,
        "title":"820-00164 Sensor Issue",
        "user_id":681,
        "username":"iambehr",
        "post_date":"2018-10-01 09:01:35",
        "message":"Okay, Replaced Q5830, no change.\nReplaced  U5800 as well with no change.\nI can see that U5800 communicates on SMC S0 \"1\" SMBus, and the camera and U5620 use that as well, and are not reporting errors. Pull up resistors are in good shape as well. \nSensors Q5860 and Q5810 attatched to U5800 are reporting normally.\nDiode mode measurements at pins 2 and 3 of U5800 match my good working board.\nGor frustrated and cut traces at C5801 and rebuilt temp sensor dead bug style near U5800, and verified it is connected according to the schematic, and still not reporting correctly.\nI'm stumped on this one. Could this be a SMC issue?"
    },
    {
        "post_id":40069,
        "thread_id":40032,
        "title":"820-00164 Sensor Issue",
        "user_id":681,
        "username":"iambehr",
        "post_date":"2018-10-01 11:12:25",
        "message":"Okay, trackpad replacement fixed it. No damage or corrosion to trackpad. IPD flex OK. Trackpad uses SMC \"3\" SMBus but was somehow interfering with the other data lines? Or HWmonitor not naming the sensors correctly?\n\nAnyway, it's fixed, and I feel a bit silly."
    }
]