[
    {
        "post_id":14710,
        "thread_id":14710,
        "title":"820-3115 SMC_LID 1.39v",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-02-13 10:27:06",
        "message":"Working on an 820-3115 board with no backlight, and the sleep light stays on; I checked SMC_LID, and it's 1.39v. BIL area looks fine, as does area for R5071\/R6961. Both resistors measure fine. SMC area looks fine, but this board actually had a pretty major burn near R7050 and Q7055, which I repaired, so I wonder if the surge that caused that damage also zapped the SMC. Board powers up and works fine, but the front sleep light stays on and backlight stays off.\n\nWould the next course of action be to replace the SMC? I don't see anything that would affect SMC_LID. Diode mode on SMC_LID is .687, so doesn't appear shorted or anything, just low. \n\nThanks!"
    },
    {
        "post_id":14711,
        "thread_id":14710,
        "title":"820-3115 SMC_LID 1.39v",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2017-02-13 12:29:31",
        "message":"R5071 ok?  \n\nTypically it's either R5071, crap under the SMC, or a burn in the firewire area. SMC_LID makes its way to the SMC through the firewire area, so a hole or serious corrosion in that area will short it to ground around 40-200 ohms."
    },
    {
        "post_id":14717,
        "thread_id":14710,
        "title":"820-3115 SMC_LID 1.39v",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-02-13 12:48:54",
        "message":"Board is entirely clean except near Q7055 where I repaired some burning. Checked everything there, nothing close to BIL or anywhere near smc_lid, of course. No damage or burning near firewire. R5071 measures fine (100k); I have ~1.5v at R5071 pin 1 (smc_lid) and 3.42v on pin 2 (pp3v42). Replaced R5071 to be sure, and same issues. This is looking more and more like an SMC issue, yes? With 3v42 on pin 2 to pull up SMC_LID, and it still only at ~1.5v, then that would mean the SMC isn't spitting it out properly, I'd assume?"
    },
    {
        "post_id":14718,
        "thread_id":14710,
        "title":"820-3115 SMC_LID 1.39v",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-02-13 13:02:24",
        "message":"Also, I ran a small wire from pin 1 to pin 2 of R5071, and backlight works (but no sleep when lid is closed, of course), so the issue is definitely that SMC_LID is missing\/low. I figured that was the cause of no backlight, but did want to include that bit."
    },
    {
        "post_id":14721,
        "thread_id":14710,
        "title":"820-3115 SMC_LID 1.39v",
        "user_id":36,
        "username":"aprendiz",
        "post_date":"2017-02-13 13:31:52",
        "message":"Did you removed BIL?? other than that it is a bad SMC for me......"
    },
    {
        "post_id":14723,
        "thread_id":14710,
        "title":"820-3115 SMC_LID 1.39v",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-02-13 13:34:30",
        "message":"Thanks, Aprendiz. I haven't removed BIL, since that area looks perfectly fine, but will do so. If that doesn't work, I'll proceed to replace SMC. Thanks!"
    },
    {
        "post_id":14731,
        "thread_id":14710,
        "title":"820-3115 SMC_LID 1.39v",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-02-13 13:47:11",
        "message":"Resistance to GND on SMC_LID, should be higher than 100K of course. Any component with a GND connection on SMC_LID can cause this and it could even be the board itself."
    },
    {
        "post_id":14735,
        "thread_id":14710,
        "title":"820-3115 SMC_LID 1.39v",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-02-13 14:24:17",
        "message":"Thanks, Duke. I replaced the SMC, no change. Not sure what the issue is, but I'm getting close to calling it an internal partial shorting of SMC_LID.\n\nI did have one more piece of information that may be relevant; the measurement for SMC_LID bounces around quite a lot; from 1.27v to 1.39v, as high as 1.5v, back down to 1.10v, then back up; never reaches more than right around 1.5v and never drops lower than ~1.17v. I didn't realize how unsteady it was until watching it for a few seconds. \n\nGoing to toss this one into the parts pile unless there's some work-around."
    },
    {
        "post_id":14736,
        "thread_id":14710,
        "title":"820-3115 SMC_LID 1.39v",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-02-13 14:47:06",
        "message":"Removed R6961 and Q5701 to rule out anything else besides the PCB itself? With those removed if the problem persists it will be the PCB. Still sort of fixable to decrease the pull up resistor value, but the PCB may degrade further of course."
    }
]