[
    {
        "post_id":31831,
        "thread_id":31831,
        "title":"820-00426 Stops charging randomly.",
        "user_id":135,
        "username":"bjf",
        "post_date":"2018-02-20 16:15:26",
        "message":"This board had an SMC replacement and works fine most of the time but will occasionally stop charging. The MagSafe light will go out at that point. R5380 and R5381 are measuring normally. Diode measurement on pin 2 of each is right around .513. Continuity to D7050 is good. Tested with known good battery. Not sure what else could be causing this."
    },
    {
        "post_id":31833,
        "thread_id":31831,
        "title":"820-00426 Stops charging randomly.",
        "user_id":36,
        "username":"aprendiz",
        "post_date":"2018-02-20 16:33:47",
        "message":"Original 85W charger??"
    },
    {
        "post_id":31839,
        "thread_id":31831,
        "title":"820-00426 Stops charging randomly.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-02-20 19:30:07",
        "message":"Charger light going out would indicate a One wire problem. Known good magsafe board? When the light goes out does the system still think there is a charger connected or switch to battery?"
    },
    {
        "post_id":31879,
        "thread_id":31831,
        "title":"820-00426 Stops charging randomly.",
        "user_id":135,
        "username":"bjf",
        "post_date":"2018-02-21 12:20:56",
        "message":"Known-good MagSafe. It switches to battery and start to drain it when the MagSafe goes out. It thinks the power adapter has been disconnected. U7000 area is completely clean and measures correctly. R5187 is clean and measures normally. U7100 is clean and was not touched. Pin 14 is normal. Continuity is good throughout SMC_BC_ACOK lines. That line is measuring .466 to ground in diode mode."
    },
    {
        "post_id":31883,
        "thread_id":31831,
        "title":"820-00426 Stops charging randomly.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-02-21 12:32:48",
        "message":"Does ACOK go down when light goes out? Will it shut down when you disconnect the battery when light goes out?"
    },
    {
        "post_id":31890,
        "thread_id":31831,
        "title":"820-00426 Stops charging randomly.",
        "user_id":135,
        "username":"bjf",
        "post_date":"2018-02-21 12:55:33",
        "message":"I'm now waiting for it to fail. It's hooked up. It may take a a while."
    },
    {
        "post_id":32070,
        "thread_id":31831,
        "title":"820-00426 Stops charging randomly.",
        "user_id":135,
        "username":"bjf",
        "post_date":"2018-02-27 13:52:19",
        "message":"Ok, this board has been hooked up, with all components, outside of the case (so I can measure the bottom) and it still hasn't failed. In the case it will fail within about 30 minutes, usually. The only thing I'm not using from the original setup is the keyboard. Any chance a keyboard could affect this? Seems highly unlikely, but I'm stuck since I can't get this thing to fail."
    },
    {
        "post_id":32087,
        "thread_id":31831,
        "title":"820-00426 Stops charging randomly.",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2018-02-27 20:16:33",
        "message":"It is possible that it thinks you're holding power button when you're not or that it thinks you are trying to reset the SMC. Try it again with a different keyboard. I would hope it is that rather than some random crack in the board that flexes just enough once screwed in for it to stop working."
    },
    {
        "post_id":32105,
        "thread_id":31831,
        "title":"820-00426 Stops charging randomly.",
        "user_id":135,
        "username":"bjf",
        "post_date":"2018-02-28 12:13:49",
        "message":"Thanks, it's been running fine now for over a day inside the case with original components. I knew this would be a nightmare. It just doesn't fail consistency enough to get any feedback. It has all screws in now so it looks like its might not be a damaged board or loose component being affected by board flexing. Being that the SMC was replaced, I feel like something is slightly off with that, or with a component surrounding it. Can't see what it might be, but I'm out of ideas."
    }
]