[
    {
        "post_id":8400,
        "thread_id":8400,
        "title":"820-3476 No boot or Odd Boot",
        "user_id":512,
        "username":"BCConnection",
        "post_date":"2016-10-21 14:54:29",
        "message":"Retina no drop or liquid damage\n\nStarted off randomly failing to come out of sleep.\n\nNow the computer rarely will turn on from completely off\n\nPlug in charger you get a green light that turns orange\nBattery unplugged the computer boots itself when charger plugged in\nBacklight sometimes comes on with no image but only occasionally does back light turn on. When it does turn on backlight voltage is 37V\nThere is no chime on backlight turning on and no chime any other time\nNo output to external monitor. USB mouse does turn on the red led optical sensor\n\nChecked all the main voltages on the schematic and all the PM SLP rails everything is there but the computer will not boot.\nPPVCore is there\nDDR is there\n3v3 is there\n5v is there\nG3H is there\nPM SLP s5\/s4\/s3\/s0 are there read 3.3v\n\nIs this a BIOS issue? Bad PCH? Local apple store brought it to me and said it had passed ASD when on and working."
    },
    {
        "post_id":8416,
        "thread_id":8400,
        "title":"820-3476 No boot or Odd Boot",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-10-21 18:29:20",
        "message":"Does the mouse turn on when the computer does not boot? Do a PRAM reset and see if audio comes back."
    },
    {
        "post_id":8467,
        "thread_id":8400,
        "title":"820-3476 No boot or Odd Boot",
        "user_id":512,
        "username":"BCConnection",
        "post_date":"2016-10-22 09:58:44",
        "message":"Tried PRAM no difference. Occasionally after PRAM or SMC reset I get Backlight but still no image.\nThe USB mouse turns on everytime you \"boot\" the laptop and fan spins every time. LCD panel never turns on but does have voltage. Backlight rarely turns on but when it does has 37v.\nIf hooked up via HDMI or Thunderbolt I get no external display"
    },
    {
        "post_id":8468,
        "thread_id":8400,
        "title":"820-3476 No boot or Odd Boot",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-10-22 10:10:03",
        "message":"Disconnect internal LCD and it should display through thunderbolt. I still suspect the LCD assembly."
    },
    {
        "post_id":8511,
        "thread_id":8400,
        "title":"820-3476 No boot or Odd Boot",
        "user_id":512,
        "username":"BCConnection",
        "post_date":"2016-10-23 15:26:53",
        "message":"Duke you were correct. LVDS disconnected and it outputs to external monitor. \n\nLooks like new screen on the way. Never seen that before."
    }
]