[
    {
        "post_id":38304,
        "thread_id":38304,
        "title":"There is a way to test Apple chipset before using them ?",
        "user_id":1789,
        "username":"Razertech",
        "post_date":"2018-08-10 17:24:49",
        "message":"Hi,\nI would like to know is someone have the solution to test GPUs before using them , to avoid lost of time and failures and to loosing time to reball a bad chipset.\nAs all the chipsets from China are craps,  I've seen that for the Xbox 360 and the PS3 some people use a Ω test to test the die, like in this video:\n\nSomeone have the solution for that particulary for these ref:\n[COLOR=#000000][FONT=Arial][SIZE=13px]216-0810001\n216-0810005[\/SIZE][\/FONT][\/COLOR]\n[COLOR=#000000][FONT=Arial][SIZE=13px]216-0810084[\/SIZE][\/FONT][\/COLOR]\n\nThanks"
    },
    {
        "post_id":38312,
        "thread_id":38304,
        "title":"There is a way to test Apple chipset before using them ?",
        "user_id":400,
        "username":"nik1981",
        "post_date":"2018-08-11 02:10:36",
        "message":"I would have thought you would be better off spending time sourcing a good supplier.\n\nEven if you get a chip that tests fine or works for the first 8 hours after fitting it, it doesn’t mean it’s any good."
    },
    {
        "post_id":38322,
        "thread_id":38304,
        "title":"There is a way to test Apple chipset before using them ?",
        "user_id":1789,
        "username":"Razertech",
        "post_date":"2018-08-11 17:17:26",
        "message":"Yes of course but to find a good supplier you have also to test the products, even if you use a fake chipset how to be sure that it's not a bad soldering ?\nAnd of course most suppliers have inconsistent quality no ?\nThis Ω test take less than 5seconds, it's easy and you can save time."
    },
    {
        "post_id":38341,
        "thread_id":38304,
        "title":"There is a way to test Apple chipset before using them ?",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-08-13 03:42:43",
        "message":"You can look at schematic\/baordview and locate some power pins.\nThen measure resistance to ground, on diode and maybe 200ohm scale too.\nThis will let you know atleast if chip is shorted, or has strange value.\nPossibly to measure other signal pins relative to ground, on 200k\/2M scale.\nI2C bus lines, LVDS outputs, who knows which ones are important...\n\nHere is an example for the \"grandpa\" MCP89, based on the dukefawkes comment about 3V42 rail in that platform. [ATTACH]38342._xfImport[\/ATTACH]"
    },
    {
        "post_id":38409,
        "thread_id":38304,
        "title":"There is a way to test Apple chipset before using them ?",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-08-14 17:12:06",
        "message":"This is a waste of time. A dead chip will appear to work fine after it has been heated. You could possibly detect a real electrically defect in the chip but those are rare. The failure is always thermal and broken contacts under the silicon. These will make contact again after heating and will only fail again after many thermal cycles and will take weeks\/months."
    },
    {
        "post_id":38498,
        "thread_id":38304,
        "title":"There is a way to test Apple chipset before using them ?",
        "user_id":1789,
        "username":"Razertech",
        "post_date":"2018-08-16 02:56:57",
        "message":"And fake chips also ?"
    },
    {
        "post_id":38500,
        "thread_id":38304,
        "title":"There is a way to test Apple chipset before using them ?",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-08-16 03:28:03",
        "message":"This kind of test, can only avoid to solder a dead chip; which is reflected by bad values.\nBut it cannot tell you if chip is good, or how much will last...\n[ATTACH alt=\"Click image for larger version  Name:\tMCP79MXT-B3 test.jpg Views:\t1 Size:\t386.9 KB ID:\t38501\"]38501._xfImport[\/ATTACH][ATTACH alt=\"Click image for larger version  Name:\tNF-G6150-N-A2.jpeg Views:\t1 Size:\t287.5 KB ID:\t38502\"]38502._xfImport[\/ATTACH]\nHere comes the same test for MCP79.\nI did that years ago, when a friend reballed many \"rescued\" chips.\nHe claimed that many didn't work at all.\nAfter start testing, he found many with low value (under 10k, even less 1k) on that line.\n\nI added another example, for NF-6150 chip.\nOn top capacitors have been measured on both direction in diode mode.\nYou can see two sets of values; different for two chips, but in the same class of values respectively.\n\nSame kind of values can be taken for the chips you want.\nBut keep in mind, such test will not let you know if a chip is really new, how much will last, nor even if will work after soldered on the board!!!\nJust allows you to detect bad chips, which clearly measure \"out of range\" from its class values."
    }
]