[
    {
        "post_id":89016,
        "thread_id":62651,
        "title":"820-01700 No display",
        "user_id":37056,
        "username":"Zebulon",
        "post_date":"2022-05-02 19:54:45",
        "message":"I’m working on a 820-01700 that was liquid damaged. The LCD assembly was fine looking, but the connectors were completely corroded and burnt away. The connector on the logic board looks perfect. I installed a new flex cable between the new display assembly (tested and working by the way) and still had no image. I was able to get an image on an external display, but at login screen it just appears to hang after entering the password and it starts to load. I know it’s actually running though as I was able to hear interface items as I was clicking around. I came up with the idea of using voice navigation to screen share and I was able to open the screen share on my iMac. What I see is a lower res. 4:3 image and it’s useable to navigate, but this was no solution. What could be causing this issue?"
    },
    {
        "post_id":89017,
        "thread_id":62651,
        "title":"820-01700 No display",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2022-05-02 20:09:39",
        "message":"U9850 is dead and needs to be changed."
    },
    {
        "post_id":89018,
        "thread_id":62651,
        "title":"820-01700 No display",
        "user_id":37056,
        "username":"Zebulon",
        "post_date":"2022-05-02 20:22:23",
        "message":"I have changed the mux twice with a brand new one, but it did not change the result. :("
    },
    {
        "post_id":89022,
        "thread_id":62651,
        "title":"820-01700 No display",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-05-03 00:16:16",
        "message":"Looks like GPU problem, if you get bad resolution on external monitor.\nVRAM issue also possible.\nAfter login, machine tries to load GPU driver and then problem appears.\n\nHeat the GPU\/VRAM with quality flux; no more than 200 degrees, 15-20s.\nIf still the same, you can pass the board through ultrasonic bath too.\n\nInspect first for corroded resistors on GPU area.\n\nBTW, do you get 3V3\/5V_S0SW_LCD, at least in the first few seconds?\nCheck when you hear the chime..."
    }
]