[
    {
        "post_id":58118,
        "thread_id":58118,
        "title":"Info needed ahead of a Macbook coming in for repair.",
        "user_id":1879,
        "username":"RESQ-MYTECH",
        "post_date":"2020-04-10 04:12:23",
        "message":"Hi all. I hope your all healthy and staying safe.\nI am after a little information on an issue with a macbook that is coming in next week. I am going to be upfront with this. The issue is one I have not encountered before, the Macbook being used, all I have is 2 photo's and its a 2017 model, the cable being used I didn't know even exisited . So I wish to glean a little advice before proceding further.\n\nI have attached the photo's the customer has given me and I hope someone will be able to help.\n\nAparantly, this has been working up till a couple if days ago. The Macbook used used to stream audio that a DJ is doing from home. The Macbook has a single headphone jack. He is using a TRS to TRRS convertor ( this is the item I never knew existed). The Macbook no longer detects the cable plugged in thus not giving an input into the Macbook. The cable has been used on a phone and another machine ( not specified) and is working correctly.\nIs there a setting somewhere in the OSx that needs to be changed or is this a hardware related issue? I have also now been told that a light (?) had hit the keyboard in the bottom left area of the keyboard and the X&C are not as responsive as the surrounding keys. I am 90% confident that the impact on the keyboard is not connected to any possible damage to the headphone socket as it is on the other side of the keyboard area,\n\nAny pointers anyone can provide ahead of getting the machine in is greatly appriciated.\n\nThanks in advance"
    },
    {
        "post_id":58123,
        "thread_id":58118,
        "title":"Info needed ahead of a Macbook coming in for repair.",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-04-10 08:49:19",
        "message":"820-xxxx code?\n\nIf audio jack has been used many times, probably hardware problem.\nYou can also check what happen with ring, tip and sleeve signals when connect\/disconnect an audio device.\n\nTry to clean the audio jack first; many videos available on YouTube for sure..."
    },
    {
        "post_id":58129,
        "thread_id":58118,
        "title":"Info needed ahead of a Macbook coming in for repair.",
        "user_id":1879,
        "username":"RESQ-MYTECH",
        "post_date":"2020-04-10 13:58:20",
        "message":"[USER=\"682\"]2informaticos[\/USER] at this time, the customer cant even give me the model of the macbook. appantly, the base is rubbed and the unit has no power to get the serial due to the adapter being left somewhere. i probably will not get this additional info untill i get the unit in my hands. the photo of the headphone socket was the best he could send me. basically at the moment i am in the dark."
    }
]