[
    {
        "post_id":49082,
        "thread_id":49082,
        "title":"820-00292 No Power",
        "user_id":4543,
        "username":"brunomotter",
        "post_date":"2019-05-11 06:05:44",
        "message":"Hello! Got a 5K Late 2015 iMac here with no power. Tested with a known good PSU and nothing. No LEDs light up and no signs of life. I cannot find the schematics for that board anywhere not even for sale... Anyone here has the schematics for a board that has similar layout? The board had corrosion on an IC(or MOSFET, I can't know for sure because have no schematics) near the second bottom screw hole on top of the board, not the classic area near the USB ports where these Macs generally corrode(I live at a beach city, so there's a lot of sea air here)."
    },
    {
        "post_id":49083,
        "thread_id":49082,
        "title":"820-00292 No Power",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-05-11 08:43:25",
        "message":"No schematic available.\nIdentify the chips and find available schematics using the same chips..."
    },
    {
        "post_id":49472,
        "thread_id":49082,
        "title":"820-00292 No Power",
        "user_id":4543,
        "username":"brunomotter",
        "post_date":"2019-05-24 12:49:44",
        "message":"Well, I identified the chip and it's a little PWM controller... The problem is that 2 pads are fucked on the board. One of them corroded so much that it hit the underneath layer and shorted to GND, so I need a way to insulate it. I thought about using UV resin. Anyone here tried this already? If it's not possible than I will need to think another way to do this job. Initially I thought of glueing the component upside down with contacts facing up and wire each one of them to the other components on the board, but that would be a PITA to do and could cause the component to overheat as its central pad would not touch the PCB to spread heat..."
    },
    {
        "post_id":49474,
        "thread_id":49082,
        "title":"820-00292 No Power",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-05-24 13:56:54",
        "message":"I used small piece of kapton tape in such case..."
    }
]