[
    {
        "post_id":41746,
        "thread_id":41746,
        "title":"820-2877 turns off because of backlight circuit",
        "user_id":1998,
        "username":"max",
        "post_date":"2018-11-05 16:31:55",
        "message":"hi, this is my first post at the forum, i really appreciate what you are doing here guys it helped me a lot so thank you :)\nthis board is for 2010 MacBook it was working fine until the screen went black as the customer said.\ni checked the backlight circuit and concluded that when i disconnect the fuse the machine boots fine but with no internal screen external works fine though. replaced most of the components but still the same turning of exactly when it tries to get to the white screen or when the backlight tries to turn on.\nreplaced these components:\nU9700 \nD9710 \nQ9807\nLVDS connector \nno short to ground and the resistance to ground on pins are OL on all pins except the ground pins\nhave no idea what to do next \nany help is appreciated\nthank you\nnote: when i inject 12.5 volt on pin 2 of R9700 PPVIN_BKL \nthe u9700 gets hot and burned pin 3 and 4 removed and replaced with a good chip still the same and no short to ground on the chip pins until power is injected."
    },
    {
        "post_id":41747,
        "thread_id":41746,
        "title":"820-2877 turns off because of backlight circuit",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-11-05 16:43:16",
        "message":"Check R9715\/16 then replace U9700.\nBe sure D9710 is not shorted A-K.\nAlso check continuity between U9700 pins and external components.\nR9730 is OK?"
    },
    {
        "post_id":41748,
        "thread_id":41746,
        "title":"820-2877 turns off because of backlight circuit",
        "user_id":1998,
        "username":"max",
        "post_date":"2018-11-05 18:12:10",
        "message":"thank you for the replay,\nR9715 is 1M and6 R9716 is 244k\ncontinuity is good no short to ground on D9710\nR9730 is 11 ohm"
    },
    {
        "post_id":41750,
        "thread_id":41746,
        "title":"820-2877 turns off because of backlight circuit",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-11-06 01:01:49",
        "message":"I asked for short A-K on D9710.\nCheck if ground points of U9700 really have contact with MLB ground.\nDouble check traces and solders on U9700 area.\nFinally try a new chip, but do not inject voltage again."
    }
]