[
    {
        "post_id":12490,
        "thread_id":12490,
        "title":"[SOLVED]3208 burnt probe point",
        "user_id":372,
        "username":"Rford",
        "post_date":"2017-01-08 17:50:50",
        "message":"Have a 3208 with a burnt probe point. I believe it's probe 815. It's just south of the smc and seems to be part of the smc net for ball 41. It's burnt, I excavated and it took me down a layer. Is this the piece I would jumper pin 1 of c4920 to? Or is there another option? I feel like it could be the wrong layer I've excavated to. Other options?"
    },
    {
        "post_id":12493,
        "thread_id":12490,
        "title":"[SOLVED]3208 burnt probe point",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-01-08 19:59:36",
        "message":"This is the reference voltage for the D\/A converter in the SMC. As far as I know the board should at least power up without it, maybe in SMC bypass mode. What is the problem with the board? If that probe point is gone there is probably also crap under the SMC."
    },
    {
        "post_id":12499,
        "thread_id":12490,
        "title":"[SOLVED]3208 burnt probe point",
        "user_id":372,
        "username":"Rford",
        "post_date":"2017-01-09 00:41:57",
        "message":"When I received it, the problem was that the wifi didn't work. However after plugging it in once and it turning on\/booting once, everything went away (no fan no power etc). Something was spilled on it, I sent it through the US cleaner. Could've been something under the smc at the time, but it's probably clean now. The probe point however, I tried reinforcing with solder and of course the remnants immediately went away and left a blank spot. I was hoping I could excavate and make a connection as I need the board to be normally operational. I wonder if it's critical?"
    },
    {
        "post_id":12509,
        "thread_id":12490,
        "title":"[SOLVED]3208 burnt probe point",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-01-09 07:12:27",
        "message":"US doesn't really clean under the SMC. I would pull the SMC and check for crap and also measure continuity on to the ball and probe point\/capacitor."
    },
    {
        "post_id":12693,
        "thread_id":12490,
        "title":"[SOLVED]3208 burnt probe point",
        "user_id":372,
        "username":"Rford",
        "post_date":"2017-01-10 16:17:21",
        "message":"So I found a like donor board, excavated around the \"good\" probe point to see where it went. Couldn't really see where it lead, so I pulled the smc and tested continuity from ball 42 to the components. for whatever reason, The trace that leads to C4920 from the probe point, though missing, the cap still had continuity, as did the rest of the appropriate components, to the smc ball. (Solved)"
    }
]