[
    {
        "post_id":18576,
        "thread_id":18576,
        "title":"[SOLVED]Question about low ALL_SYS_PWRGD on 820-2936",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-04-18 07:35:51",
        "message":"I have a small pile of 820-2936 boards that all have the same issue; they have quarter-fan spin (twitch), and ALL_SYS_PWRGD is at ~.6-.8v. They all had no liquid, no apparent damage, and I was wondering if anyone has resolved this type of issue before on this specific board? I've spent hours trying to determine what is causing ALL_SYS_PWRGD to be low, but can't figure it out. I've had help in previous threads recommending I remove R7963-67 one-by-one and see which of those rails is pulling down ALL_SYS_PWRGD, but on each board, I removed those resistors and the signal stayed low each time. I got stuck on all of them, and set them aside. I am 100% confident they have no liquid damage. I'm positive they haven't been worked on before. PP3v42, ppbus, ppvrtc, pp3v3_s5, pp3v3_s0, pp5v_s5, pp5v_s0, 5v\/3v sus, etc., all present. Boards do not power on with battery or charger. Checked BIOS chips, swapped from good board to see if it improved things, and nothing.\n\nIs there anything else I need to check? Has anyone else had this issue and resolved it successfully? I've already checked the obvious culprits--U2800, shorts on ALL_SYS_PWRGD, etc., and nothing changes it. ISL area is all good, of course, and my main rails are all present. Are these likely dead PCH\/CPUs? Could it be a bad SMC? I really want to figure these boards out, and they all have the exact same symptoms.\n\nAny leads appreciated. I can provide specific measurements if needed, but I'm really asking more of a specific question as to whether or not anyone has solved a similar issue. I'm out of ideas of where to look, and I hate to use boards that should be repairable for parts boards."
    },
    {
        "post_id":18580,
        "thread_id":18576,
        "title":"[SOLVED]Question about low ALL_SYS_PWRGD on 820-2936",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-04-18 08:53:27",
        "message":"I just ran a wire from pin 1 of R7967 to pin 2 of R7967 (to get ALL_SYS_PWRGD to show up), and the board powers on. I only left it on for a second, for fear this could do some sort of damage. \n\nNot having a real good understanding of how this circuit works, would this help indicate the failure? I assume one of my 5 pwrgd feeder signals are missing (3v3_s0 is present), but I can't seem to find one that is...? Just wanted to include this information, as it may be helpful."
    },
    {
        "post_id":18582,
        "thread_id":18576,
        "title":"[SOLVED]Question about low ALL_SYS_PWRGD on 820-2936",
        "user_id":468,
        "username":"ALB-Repairs",
        "post_date":"2017-04-18 09:50:21",
        "message":"Did the board post? \n\nIve had something odd like this before on a 2936. See if you get a steady fan by removing the PP5V_S0 resistor on one of them. Its an odd way of troubleshooting but if the fan stays on then you can take measurements with allot less faffing about.\nThanks"
    },
    {
        "post_id":18585,
        "thread_id":18576,
        "title":"[SOLVED]Question about low ALL_SYS_PWRGD on 820-2936",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-04-18 09:56:31",
        "message":"With a wire at R7967, the board powers on but gives the no-ram three beep. Which resistor are you referring to on 5v_s0?"
    },
    {
        "post_id":18586,
        "thread_id":18576,
        "title":"[SOLVED]Question about low ALL_SYS_PWRGD on 820-2936",
        "user_id":468,
        "username":"ALB-Repairs",
        "post_date":"2017-04-18 10:07:57",
        "message":"R7860 or R7862. Essentially the plan is to brick an S0 rail to find out if it still pulses or actually remains on.\n\nIve had similar symtoms to what your getting caused by U7400 going bad before. No liquid.ect \n\nI find the fastest way to diagnose these strange issues is by breaking power rails one by one until you maybe get a fan spin. Work from the top backwards, By removing 5V_S0 you also remove ALL_SYS_PWRGD, Which means you also remove CPU_VCORE voltages.\n\nA board missing ALL_SYS_PWRGD will still spin up and stay on with missing power rails, I think whats happening is that something occurs after all_sys_pwrgd is causing it to turn back off.\n\n-Im going to look like an idiot if this doesn't get you anywhere ahaha."
    },
    {
        "post_id":18599,
        "thread_id":18576,
        "title":"[SOLVED]Question about low ALL_SYS_PWRGD on 820-2936",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-04-18 12:20:34",
        "message":"You have to distinguish an ALL_SYS issue and a power cycling issue. If CPU Vcore is also pulsing then ALL_SYS is fine. If CPU Vcore is not pulsing then ALL_SYS is probably not coming all the way high. Best to check this with a scope."
    },
    {
        "post_id":18604,
        "thread_id":18576,
        "title":"[SOLVED]Question about low ALL_SYS_PWRGD on 820-2936",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-04-18 13:18:14",
        "message":"Thanks, Duke! I do get a pulse on ppvcore_s0_cpu every ~4-5 seconds, so I believe you're right, ALL_SYS is fine. What would you recommend to check next? A short on the lower rails?"
    },
    {
        "post_id":18613,
        "thread_id":18576,
        "title":"[SOLVED]Question about low ALL_SYS_PWRGD on 820-2936",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-04-18 16:40:25",
        "message":"Jumper ALL_SYS again so that it stays on and measure all the rails that are involved in generating it. Then see if they are all actually present."
    },
    {
        "post_id":18619,
        "thread_id":18576,
        "title":"[SOLVED]Question about low ALL_SYS_PWRGD on 820-2936",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-04-18 17:58:46",
        "message":"Thanks, Duke--will do!\n\nI wanted to add a bit of information to an above post: when I ran the jumper to force ALL_SYS, I got the 3-beep no-RAM indication, even with RAM installed in the board. I realize I didn't specifically state that I had RAM installed in that post.\n\nWill update thread tomorrow--thanks!"
    },
    {
        "post_id":18645,
        "thread_id":18576,
        "title":"[SOLVED]Question about low ALL_SYS_PWRGD on 820-2936",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-04-19 07:24:32",
        "message":"OK, I have some more information on this one.\n\nI re-ran the jumper, and found that PP1v5_S3RS0 is missing (.371v). This rail missing also means that PM_MEM_PWRGD is missing, which explains my three-beeps when the board powers on.\n\nI traced PP1v5_S3RS0 back to U7801 and found these measurements:   pin1) 5v   2) .20v   3) .20v   4) 0v   5) 1.5v   6) .371v   7) .012v   8) .08v\n\nI then checked Q3205, and got these measurements:   pin1) 0v   2) 0v   3) 0v   4) 0v   5) 3.3v   6) .20v\n\nCompared to a working board, it looks like I should have 1.05v on pin 6 (P1v5CPU_EN) of Q3205...which I believe explains my issue. PM_SLP_S4_L is present at R3205.\n\nI hope my CPU isn't dead. :("
    },
    {
        "post_id":18652,
        "thread_id":18576,
        "title":"[SOLVED]Question about low ALL_SYS_PWRGD on 820-2936",
        "user_id":36,
        "username":"aprendiz",
        "post_date":"2017-04-19 09:12:34",
        "message":"PM_SLP_S4_L is present on both pins of R3205?? If yes check continuity between pin 2 from U7801 to pin 2 of R3205"
    },
    {
        "post_id":18657,
        "thread_id":18576,
        "title":"[SOLVED]Question about low ALL_SYS_PWRGD on 820-2936",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-04-19 09:47:14",
        "message":"Hey Aprendiz--thanks! I checked R3205, and pin 1 I have 3.3v and pin 2 is .20v. R3205 measures out fine (9.72k)."
    },
    {
        "post_id":18659,
        "thread_id":18576,
        "title":"[SOLVED]Question about low ALL_SYS_PWRGD on 820-2936",
        "user_id":36,
        "username":"aprendiz",
        "post_date":"2017-04-19 09:55:46",
        "message":"Seems a bad Q3205...."
    },
    {
        "post_id":18661,
        "thread_id":18576,
        "title":"[SOLVED]Question about low ALL_SYS_PWRGD on 820-2936",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-04-19 10:37:52",
        "message":"Thanks, Aprendiz! I replaced Q3205, and unfortunately there was no change. Still have .20v at pin 2 of R3205. :("
    },
    {
        "post_id":18667,
        "thread_id":18576,
        "title":"[SOLVED]Question about low ALL_SYS_PWRGD on 820-2936",
        "user_id":36,
        "username":"aprendiz",
        "post_date":"2017-04-19 11:20:43",
        "message":"The last thing that can pull down P1v5CPU_EN is U7801........ Measure resistance to ground on pin 2 from U7801..."
    },
    {
        "post_id":18672,
        "thread_id":18576,
        "title":"[SOLVED]Question about low ALL_SYS_PWRGD on 820-2936",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2017-04-19 11:59:11",
        "message":"Thanks, Aprendiz--you're the man.\n\nRTG on pin 2 of U7801 was 390ohms, diode mode showed .143. This is a lot different than a good board, so I replaced U7801 and all seems well. Thank goodness the CPU wasn't at fault.\n\nThis one can be marked as solved! Thanks again, guys!"
    }
]