[
    {
        "post_id":19742,
        "thread_id":19742,
        "title":"[SOLVED]820-2915 - Does not detect battery in OS, not charging or booting from battery",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-05-05 08:23:51",
        "message":"[PLAIN][SOLVED]820-2915 - Does not detect battery in OS, not charging or booting from battery[\/PLAIN]\n\nHi there,\n\nCustomer came in with a 820-2915 motherboard that did not power on, replaced U7000 because bad voltages out and it booted again without issues.\nThe device has no signs of water damage or bad prior repairs.\n\nThe system does not detect a battery, It will not boot off one but if you pull the charger the device will not power off and keep on running from the battery (Until the OS finishes going in suspend). Once in suspend the system dies again while only connected to the battery\n\n\nPretty sure this is an issue with the SMBUS_SMC_BSA_SDA \/ SCL lines, but they seem to be doing ok-ish. I've seen 3.3V on SDA and pretty sure I've seen 3.3V on SCL as well.\nI2C pull-up resistors are not closed\n\nI thought I might have messed up the soldering so I swiped my iron another time on all the pins and ensured a proper connection. After that didn't work I replaced U7000 with another new chip from my reel but the same issue stays.\n\nWhere to look? There aren't many components connected to SMBUS_SMC_BSA and I'm starting to suspect the SMC. But all other sensors come back properly so I don't know.\n\nThanks in advance!"
    },
    {
        "post_id":19743,
        "thread_id":19742,
        "title":"[SOLVED]820-2915 - Does not detect battery in OS, not charging or booting from battery",
        "user_id":36,
        "username":"aprendiz",
        "post_date":"2017-05-05 08:33:00",
        "message":"Have you tried another battery?? BIL unplugged?? other than that, SMC issue.."
    },
    {
        "post_id":19749,
        "thread_id":19742,
        "title":"[SOLVED]820-2915 - Does not detect battery in OS, not charging or booting from battery",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-05-05 08:41:54",
        "message":"3 different batteries tried so far, BIL has been unplugged.\n\nIt just sounds so unlikely for the SMC to just fail on just one I2C line with no other issues with the system at all. Replacing the SMC has been a pain in the ass before so I always try to keep it as a last solution"
    },
    {
        "post_id":19753,
        "thread_id":19742,
        "title":"[SOLVED]820-2915 - Does not detect battery in OS, not charging or booting from battery",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-05-05 08:48:21",
        "message":"Dead SMC...."
    },
    {
        "post_id":19798,
        "thread_id":19742,
        "title":"[SOLVED]820-2915 - Does not detect battery in OS, not charging or booting from battery",
        "user_id":383,
        "username":"roy.ruan",
        "post_date":"2017-05-05 16:57:15",
        "message":"Pulled off the battery indicator. otherwise 99% is the SMC. I've seen a lot, when u7000 got a burnt hole, the charging function would be fucked and SMC needs to replaced.."
    },
    {
        "post_id":19799,
        "thread_id":19742,
        "title":"[SOLVED]820-2915 - Does not detect battery in OS, not charging or booting from battery",
        "user_id":383,
        "username":"roy.ruan",
        "post_date":"2017-05-05 16:57:47",
        "message":"especially when you see\"X\" in the OS"
    },
    {
        "post_id":19842,
        "thread_id":19742,
        "title":"[SOLVED]820-2915 - Does not detect battery in OS, not charging or booting from battery",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-05-06 18:32:56",
        "message":"Bummer, a dead SMC it is then. Will try to replace\n\nIs there a secret trick to getting these on right? I'm always struggling more then I feel that I should be, just positing and keeping them positioned while using the hot air.\nMaybe it's just more of a skill you get better at every time.."
    },
    {
        "post_id":19845,
        "thread_id":19742,
        "title":"[SOLVED]820-2915 - Does not detect battery in OS, not charging or booting from battery",
        "user_id":383,
        "username":"roy.ruan",
        "post_date":"2017-05-06 19:30:13",
        "message":"2011 model is pretty easy to do. it's 0.45 balls..takes a minute or two to reball. \n\nI usually use a led flash light, the very bright one, shine the light and try to look right at the contact between the SMC and the soldering points on the board, and just move it until they kinda line up.\n\nIt is hard to see and make sure 100% precise,but it's good enough to finish the job. \nand don't use too much flux(otherwise would flow around then you heat it),  hot air it then usually then the balls melt ,make the SMC go to the right position"
    },
    {
        "post_id":22731,
        "thread_id":19742,
        "title":"[SOLVED]820-2915 - Does not detect battery in OS, not charging or booting from battery",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-07-08 15:49:22",
        "message":"I wanted to let everyone know that replacing the SMC fixed the issue, reballing indeed was quite easy and went right the first time.\n\nASD comes back with passed\n\nThanks again!"
    }
]