[
    {
        "post_id":35266,
        "thread_id":35266,
        "title":"What is the cause of this type of video-distortion on a MacBook Pro 2012 (820-3115)?",
        "user_id":1423,
        "username":"captainmac",
        "post_date":"2018-05-30 07:07:35",
        "message":"What is the cause of this type of video-distortion on a MacBook Pro mid 2012 (820-3115)?\nHaven't had it in yet, but customer is sending me this via mail, this is after a keyboard-connector replacement from 2 months ago.\nAlso, customer reports issues with battery, computer cant run on battery alone, might be unrelated (just a bad battery) but thought to mention it anyway.\n\nAnyone have a clue what this might be just by looking at this picture? (i'm trying to be as prepared as i can for when it comes back to me)"
    },
    {
        "post_id":35268,
        "thread_id":35266,
        "title":"What is the cause of this type of video-distortion on a MacBook Pro 2012 (820-3115)?",
        "user_id":515,
        "username":"SMMRepair",
        "post_date":"2018-05-30 07:43:06",
        "message":"Bad RAM slot, most likely the bottom one. Unrelated to keyboard repair or battery, just a common failure on this model. Probably works fine until they move the unit, and it will get worse (until slot no longer works at all--three beeps, etc; assuming they deal with the inconvenience until it gets to this point). No sense in repairing it, tell them to max out top slot and call it a day. Otherwise it will be wasted shipping back and forth. Might even offer them $20.00 towards a RAM upgrade."
    },
    {
        "post_id":35269,
        "thread_id":35266,
        "title":"What is the cause of this type of video-distortion on a MacBook Pro 2012 (820-3115)?",
        "user_id":1423,
        "username":"captainmac",
        "post_date":"2018-05-30 10:00:46",
        "message":"Alright, great and thanks for the insight! It’s gonna come in anyway, told her to hop by already. It’s not a mail in repair. \nMight also sell a battery in the process. Thanks again!"
    }
]