[
    {
        "post_id":40564,
        "thread_id":40564,
        "title":"820-2936b ppbus_g3h 15v",
        "user_id":1464,
        "username":"Bouba148",
        "post_date":"2018-10-12 02:48:14",
        "message":"Hi Team,\n\nI have a strange issue on that board:\n\nFirst I had a lot of issue on that board and replaced many components because of no green light no PPBUS: C6999, U7000 etc....\nThen I had PPBUS_G3H at 15V without green light so I replaced Q7030 and Q7035, when I took them out and mesured the resistance between Pin 5 and 1,2,3 I had almost a short: 1.2 Ohms for Q7030 and OL for Q7035 but if i compared with new one the same mesurements are around 40 Ohms.\n\nThen I reflowed the U7000 area for the components to replace themself ( maybe bad soldering contact ).\n\nNow I have the green light, the board is starting ( fan spinning ) [B]BUT PPBUS_G3H is still 15.55V[\/B]\nTried with 85W and 60W official chargers."
    },
    {
        "post_id":40569,
        "thread_id":40564,
        "title":"820-2936b ppbus_g3h 15v",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-10-12 04:06:52",
        "message":"Still short D-S on Q7030; change it.\nBe sure R\/C7025 are OK and pin 24\/U7000 is properly soldered.\nYou may need to change U7000 too..."
    },
    {
        "post_id":40573,
        "thread_id":40564,
        "title":"820-2936b ppbus_g3h 15v",
        "user_id":1464,
        "username":"Bouba148",
        "post_date":"2018-10-12 06:08:06",
        "message":"Replaced once more Q7030 and U7000: PPBUS_G3H is 12.66V and PP3V42 is OK green light OK, fan spinning, just have to check the board back in the chassis and lcd because I plugged a speaker without RAM memory and it's not beeping .....and normaly it should beep without RAM Memory.\nThanks gracia merci so far 2 informaticos like usually......"
    },
    {
        "post_id":40574,
        "thread_id":40564,
        "title":"820-2936b ppbus_g3h 15v",
        "user_id":1464,
        "username":"Bouba148",
        "post_date":"2018-10-12 06:42:23",
        "message":"Everything Fine and OK\n\nCan close the topic"
    },
    {
        "post_id":40578,
        "thread_id":40564,
        "title":"820-2936b ppbus_g3h 15v",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-10-12 07:08:28",
        "message":"For the future, an USB mouse is good enough to detect an working board on the desk.\nSometime USB mouse can cheat you, so I recommend to use a pendrive with OSX installed.\nPendrive should have LED; if flashes, board is loading OSX..."
    }
]