[
    {
        "post_id":23573,
        "thread_id":23573,
        "title":"LP154WT1-SJAV to SJA1",
        "user_id":86,
        "username":"samiam",
        "post_date":"2017-07-28 10:12:51",
        "message":"I have some china special LP154WT1-SJAV screens which don't seem to work with anything\nanyone know if (and where) the firmware chip i can move over from a broken official A1"
    },
    {
        "post_id":23597,
        "thread_id":23573,
        "title":"LP154WT1-SJAV to SJA1",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-07-28 16:33:38",
        "message":"I see no reason for them not to work unless the EDID chip is totally blank which is totally possible if these \"fell\" off the production line before EDID was programmed. I have no idea where the EDID ROM is on these. If you can post a high res picture of the board maybe I can help. I have a bad feeling it is under some shields :("
    },
    {
        "post_id":23621,
        "thread_id":23573,
        "title":"LP154WT1-SJAV to SJA1",
        "user_id":86,
        "username":"samiam",
        "post_date":"2017-07-29 05:23:53",
        "message":"yeah i've tried on like 3 different machines over the past year or so and they don't recognize on anything\n\nI was reading on mike'smods where he was reverse engineering a breakout board\n[url]http:\/\/mikesmods.com\/mm-wp\/?p=212[\/url]\n\nI see the main chip is a parade, but his picture of the older controller design shows the EDID coming from somewhere else\n\nwill take a pic a little later today, going to have to setup one of my newer iPhones as the iPhone 4 i'm using can't take pictures for crap"
    },
    {
        "post_id":23636,
        "thread_id":23573,
        "title":"LP154WT1-SJAV to SJA1",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-07-30 05:11:00",
        "message":"There is a way to flash the EDID over de DP interface. Apple's AST\/MRI has tools to flash the cinema display EDID which use eDP LCDs. So it is possible I have no idea how and no desire to figure it out. There is a good chance there is still a simple EEPROM on the LCD board."
    },
    {
        "post_id":23753,
        "thread_id":23573,
        "title":"LP154WT1-SJAV to SJA1",
        "user_id":86,
        "username":"samiam",
        "post_date":"2017-08-03 07:00:54",
        "message":"No Title\n\nthis is what is not under the heat shields\nlet me know if this helps or i need to take them off and take more pics\nthanks as always Duke"
    },
    {
        "post_id":23773,
        "thread_id":23573,
        "title":"LP154WT1-SJAV to SJA1",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-08-03 13:59:44",
        "message":"2nd picture marked U4 I think could very well be an EEPROM. Good luck getting that off without destroying that flat cable. If it is an EEPROM all pins on 1 side will be GND. Maybe better to hook up some wires and flash it. Removing it will kill the LCD."
    },
    {
        "post_id":23795,
        "thread_id":23573,
        "title":"LP154WT1-SJAV to SJA1",
        "user_id":86,
        "username":"samiam",
        "post_date":"2017-08-03 15:43:04",
        "message":"those cables don't have any heat tolerance? i know the keyboard cable melts in a second. but i thought the lcd tabs were bonded with some high heat and pressure. well i'll try messing around with some dead air screens first for practice this weekend, if not i guess i'll look into flashing. i've never tried flashing beyond ati video cards and mac efi"
    }
]