[
    {
        "post_id":341,
        "thread_id":341,
        "title":"2011 prohibitive symbol on macbook air when switch on. No startup chime",
        "user_id":77,
        "username":"leonattpcs",
        "post_date":"2016-03-24 01:43:12",
        "message":"Hi,\nNo model number for the board itself I am afraid and the owner was too impatient to let me test anymore, but this is what I know:\n2011 macbook air switches on and give the what I now know to be prohibitive symbol when switching on. He has other macs and \"cloned\" another macs os then loaded it onto that through thunderbolt\/firewire which made no difference. That is the point it was at when it was sent to me.\nI believe it may have been some kind of sad issue, but wasn't able to try another sed in it. He had taken it to Apple and they just said it needed a new logic board.\nWhat I was able to do with it, after research, is get the os on it through thunderbolt from my own macbook pro with the macbook air in target disk mode.\nAfter that the macbook air would boot and work properly, but still in target disk mode from my macbook pro - so a bit like a remote desktop in effect.\nWhen trying to boot it as standard it then gave a black screen with white text on giving errors which I can't remember I am afraid. I did take a picture that I would have posted, but I deleted it some time ago. After other research I discovered the only other way of trying to get the os on it was by lading it on from usb memory stick, but I couldn't make one as the usb ports in my macbook pro don't work. I would repair them to get them working again, but don't have the time and don't want to risk killing my own macbook pro at the moment.\nI also tried the internet based recovery which was successful, but wen trying to load from that it gave an error 6002-f.\nAs I say, I was thinking the ssd, but I wasn't given anymore time with it to investigate any further.\nDoes anyone have any other thoughts on issues like that?\nThanks for your time"
    },
    {
        "post_id":357,
        "thread_id":341,
        "title":"2011 prohibitive symbol on macbook air when switch on. No startup chime",
        "user_id":63,
        "username":"spakhnyuk",
        "post_date":"2016-03-24 10:36:55",
        "message":"Boot from a known good OS, format the SSD and reinstall the OS from a known good installer. Cannot say what is bad if anything before trying that."
    },
    {
        "post_id":358,
        "thread_id":341,
        "title":"2011 prohibitive symbol on macbook air when switch on. No startup chime",
        "user_id":63,
        "username":"spakhnyuk",
        "post_date":"2016-03-24 10:38:15",
        "message":"Did you try an NVRAM reset?"
    },
    {
        "post_id":370,
        "thread_id":341,
        "title":"2011 prohibitive symbol on macbook air when switch on. No startup chime",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-03-24 16:43:13",
        "message":"Probably a bad OS install or dead SSD. Never seen this issue caused by the board."
    },
    {
        "post_id":376,
        "thread_id":341,
        "title":"2011 prohibitive symbol on macbook air when switch on. No startup chime",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2016-03-24 20:47:57",
        "message":"Let me guess, Toshiba SSD?"
    },
    {
        "post_id":382,
        "thread_id":341,
        "title":"2011 prohibitive symbol on macbook air when switch on. No startup chime",
        "user_id":77,
        "username":"leonattpcs",
        "post_date":"2016-03-25 04:03:16",
        "message":"I didn't get a chance to look at what make the ssd was, are Toshiba ssd known for causing that?. I didn't try nvram reset, but thanks for the question about that I will try that the next time I need to. i was going to try another known working sed in it from a 13 inch macbook air, but the owner was too impatient for me to investigate anymore.\nThanks for the comments anyway."
    },
    {
        "post_id":396,
        "thread_id":341,
        "title":"2011 prohibitive symbol on macbook air when switch on. No startup chime",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2016-03-25 11:48:50",
        "message":"I hope the owner enjoys their dead computer"
    },
    {
        "post_id":403,
        "thread_id":341,
        "title":"2011 prohibitive symbol on macbook air when switch on. No startup chime",
        "user_id":77,
        "username":"leonattpcs",
        "post_date":"2016-03-25 12:52:40",
        "message":"I know, lack of patience leads to such a waste."
    }
]