[
    {
        "post_id":35237,
        "thread_id":35237,
        "title":"[SOLVED]820-00163 chime but no picture",
        "user_id":1101,
        "username":"ielectron",
        "post_date":"2018-05-29 06:30:02",
        "message":"this was wine damage, i can only see a bit damage on the left side on the board, above the lcd connector (but not close to it)\n\nI could not find schematics or boardview for this, some one can send it to me please?\n\n\ni cleaned that area, dont see liquid anywhere else, but actually the board smells like wine.\n\nSo after cleaning, SMC, PRAM reset, there is chime, fan speed up, if i remove the touchpad fans speed up as they should. so it seems alive but no picture, or on the external monitor.\n\nNot sure if that is the board with the typical GPU voltage controller issue, but anyway i resoldered the voltage controller chip with  soldering iron only, same thing.\n\n\nFor start i really need the schematics and boardview."
    },
    {
        "post_id":35245,
        "thread_id":35237,
        "title":"[SOLVED]820-00163 chime but no picture",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-05-29 12:48:54",
        "message":"I don't have the 00163 either. LCD connector area should be close enough to 3662\/3787. Check for a 5V pulse on L8300. Need to check while it is powering on as there may be only 5V for a second there while it chimes."
    },
    {
        "post_id":35263,
        "thread_id":35237,
        "title":"[SOLVED]820-00163 chime but no picture",
        "user_id":1101,
        "username":"ielectron",
        "post_date":"2018-05-30 04:29:38",
        "message":"what is the closest boardview i can use for this? oh u meant 3662 or 3787 board..."
    },
    {
        "post_id":35566,
        "thread_id":35237,
        "title":"[SOLVED]820-00163 chime but no picture",
        "user_id":1101,
        "username":"ielectron",
        "post_date":"2018-06-07 01:41:43",
        "message":"u8300 was shorted,needed a new lcd cable, and a new lcd connector on the screen board, now its ok"
    }
]