[
    {
        "post_id":55181,
        "thread_id":55181,
        "title":"820-3476-A black screen, backlight, fan spinning, no image -> kernel[?]gpu.Restart",
        "user_id":20324,
        "username":"felix",
        "post_date":"2019-12-10 14:22:33",
        "message":"At first the computer did not boot after being normally shut down. When the power button was pressed it did the chime, it showed a black screen with backlight turned on and spinning fan. The apple logo on the back of the display was turned on as well. But there was no image. SMC and VRAM\/PRAM reset did not change anything. I unplugged battery and ssd and after plugging them back in it worked again. The console reported several times \"Kernel [?] gpu.Restart\".  [ATTACH]55182._xfImport[\/ATTACH]\nThen while high cpu usage I noticed graphic issues (short freezes and sudden black stripes) and several times it led to the black screen with backlight but now followed by the lockscreen. When I entered the password, the application had been quit and the console again reported \"Kernel [?] gpu.Restart\".  [ATTACH]55183._xfImport[\/ATTACH]\nI wanted to rule out a software issue and installed the os on a second partition of the internal ssd but during that process suddenly a lot of flickering white pixels appeared, the apple logo was visible more than one time on different spots and then it showed the black screen with backlight and spinning fan again. Just as before it did not show an image. Unplugging battery and ssd did not have any effect anymore. I connected an external hd with an os installed but it did not show the drive and did not boot, no matter if the internal ssd was connected or not. The led on the enclosure was on and the hd was spinning. External video via thunderbolt did not work. \nI took out the logic board and did not see any corrosion. I put it back in and now the computer is working again. \nIt passed the ASD 3S162 os and efi. \nI do not think that it has a liquid damage but it was dropped at least one time according to the look of the chassis. \n\nI think that gpu and\/or cpu are failing and therefore I would like to change the logic board. But first I want to make sure that this would solve the problem. [LIST=1]\n[*]Can someone confirm that this indicates a failing gpu\/cpu?\n[*]Should I in addition to the console reports run a cpu\/gpu stress test and if yes can you recommend one?\n[*]Is it right to conclude that the ssd cannot be the problem because it did not work to boot from the external hd?\n[*]Could the display also cause the problem and how can I test it without a test display?\n[*]Is there anything else other than logic board, display and ssd that could cause the problem?\n[\/LIST] I really appreciate your help!"
    },
    {
        "post_id":55184,
        "thread_id":55181,
        "title":"820-3476-A black screen, backlight, fan spinning, no image -> kernel[?]gpu.Restart",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-12-10 14:48:19",
        "message":"The GPU is integrated on the CPU (iGPU); no dedicated graphics on this machine.\nYou described a CPU, or RAM problem, probably generated after a drop.\nI suspect broken traces, or solders under CPU, or RAM chips.\n\nInternal LCD is easy to discard; unplug it and check with external monitor."
    },
    {
        "post_id":55225,
        "thread_id":55181,
        "title":"820-3476-A black screen, backlight, fan spinning, no image -> kernel[?]gpu.Restart",
        "user_id":20324,
        "username":"felix",
        "post_date":"2019-12-12 04:35:36",
        "message":"Thank you!"
    }
]