[
    {
        "post_id":35377,
        "thread_id":35377,
        "title":"iMac - 27\" - Late 2015",
        "user_id":517,
        "username":"vaswaniraj",
        "post_date":"2018-06-01 15:06:16",
        "message":"Hi Team,\n\nI received a iMac 27\" Late 2015 in my store last week.  The issue with this iMac is that it starts up and as soon as the Apple Logo appears the progress bar reaches to almost 20% the iMac just shuts down.  If i try to press option and turn the computer on, it stays at the HDD icon, but as soon as I click the HDD icon, it starts doing the same thing.  I thought probably the OS is corrupted, so I made a bootable disk of High Sierra and tried to boot the iMac by pressing the option key.  The OS starts but then it stops by flashing a message on the computer that \" Your computer restarted because of a problem.  Press a key or wait a few seconds to continue starting up.  I tried to run the AST 2 test of this computer and the computer passed all the MRI test.  \nCan anyone advice what further should i troubleshoot in order to make this work. \nThanks and Regards,\nRaj."
    },
    {
        "post_id":35380,
        "thread_id":35377,
        "title":"iMac - 27\" - Late 2015",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2018-06-01 16:21:06",
        "message":"Tried booting off an external hard drive? Sounds like a bad HD tbh..."
    },
    {
        "post_id":35384,
        "thread_id":35377,
        "title":"iMac - 27\" - Late 2015",
        "user_id":517,
        "username":"vaswaniraj",
        "post_date":"2018-06-01 18:07:52",
        "message":"Tried booting with an external HDD, but as I have explained in my original message that it starts but ends up with the message “ Your computer restarted because of a problem. Press a key........\nthen the computer shuts down."
    },
    {
        "post_id":35386,
        "thread_id":35377,
        "title":"iMac - 27\" - Late 2015",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2018-06-01 19:49:34",
        "message":"My bad thought it was bootable installer not drive. Yeah I have no idea then definitely a question for Duke"
    },
    {
        "post_id":35400,
        "thread_id":35377,
        "title":"iMac - 27\" - Late 2015",
        "user_id":517,
        "username":"vaswaniraj",
        "post_date":"2018-06-02 21:27:46",
        "message":"Hi Guys,\nHere is what I did.  \nI opened up the computer and as JohnB8812 doubted the Hard Drive, I went ahead and detached the HDD Sata Cable from the Hard Drive and turned the computer ON, expecting that the computer would show the folder with a Question Mark.  \nThe computer FAN was ON, which earlier the computer was shutting down.  So I thought that the Hard Drive is bad, so I went ahead and connected that Hard Drive via a USB to SATA cable to check if the Hard Drive is functional.  The Hard was not detected by another 2 computers, so I thought the Hard drive is bad, so I bought a New Hard Drive and installed it on the iMac, expecting that the computer will allow me to Partition the New Hard Drive and install the OS.\nThis New hard drive also showed the same behavior as the OLD Hard Drive that was in the system.  \nAgain the same thing.\nAt this point, I booted the system from an External Hard Drive to see if the system prompts me as where to install the OS.\nBut no luck at this point either.\n\nI am thinking is it the Hard Drive cable that is bad ?\nOr it is something else that I need to check.[USER=\"2\"]dukefawks[\/USER]  Could you please look into my case and advice further troubleshooting steps.\nRegards,\nRaj."
    },
    {
        "post_id":35430,
        "thread_id":35377,
        "title":"iMac - 27\" - Late 2015",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-06-04 14:02:30",
        "message":"Could be anything. Not something related to HDD at least. I am sorry but I doubt this will be fixable unless something is known as to how it happened."
    },
    {
        "post_id":35455,
        "thread_id":35377,
        "title":"iMac - 27\" - Late 2015",
        "user_id":517,
        "username":"vaswaniraj",
        "post_date":"2018-06-04 19:54:53",
        "message":"Hi Duke. On further stressing my brain, I feel that the power supply could  be a issue.  The reason why I say the power supply is because if the HDD cable is unplugged the computer fan does not stop, but moment the HDD cable is plugged in, probably the power needed by the HDD to spin is not been sufficient which the power supply can provide, hence the fan and complete system shuts down.  I have ordered a new power supply and will try to change the power supply to see if the same behavior continues.  I think that changing the power supply should solve the problem, but if not then I would just return the unit to the customer as unfixable.  I hope changing the power supply should solve the problem.  I shall keep you guys posted as soon as I get my ordered power supply and after installation of the same.  \nWish me luck.\nThanks \nRaj."
    },
    {
        "post_id":35537,
        "thread_id":35377,
        "title":"iMac - 27\" - Late 2015",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-06-06 14:50:44",
        "message":"I doubt it but possible. Is it the same when the SATA data cable only is disconnected?"
    },
    {
        "post_id":35684,
        "thread_id":35377,
        "title":"iMac - 27\" - Late 2015",
        "user_id":517,
        "username":"vaswaniraj",
        "post_date":"2018-06-11 11:53:54",
        "message":"Hi Duke, When the SATA DATA cable is disconnected the DOES NOT shut down, but while the fan is still on and the SATA DATA cable is re-connected, the fan stops spinning and the complete system just stops."
    },
    {
        "post_id":35708,
        "thread_id":35377,
        "title":"iMac - 27\" - Late 2015",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-06-11 19:24:30",
        "message":"So it just shuts down because it is trying to boot. I have no idea, but on MacBooks I have found issues in CPU Vcore supply causing this. I doubt this board is fixable though as it could be too many things."
    },
    {
        "post_id":36169,
        "thread_id":35377,
        "title":"iMac - 27\" - Late 2015",
        "user_id":517,
        "username":"vaswaniraj",
        "post_date":"2018-06-25 15:42:24",
        "message":"Hi Duke, \nYou can mark this as SOLVED, as changing the power supply on this iMac solved the problem of it shutting down when it was trying to boot.  I would probably say that 27” iMac of Late 2015 have a signature problem of power supply failures. \nThanks for all your help.\nRegards,\nRaj."
    }
]