[
    {
        "post_id":66188,
        "thread_id":60139,
        "title":"820-3437 Power on issue",
        "user_id":5175,
        "username":"tlough75",
        "post_date":"2020-10-06 21:25:19",
        "message":"I have on the bench an 820-3437 with a power on issue. The customer told me that it would charge but not turn on so they replaced the battery. They said the owner used it for a bit but it started acting up so they replaced the battery again. I measured the G3H rails with only battery plugged in and it has those but when I trigger SMC_ONOFF_L and measure voltage on pin 7 of U5110, the voltage drops then recovers when I release the power button as I think it should. SMC_RESET_L behaves the same way. sits at 3.3V until the power button is pressed, drops to .4V then recovers once I let the button go, but the computer will only turn on when I plug MS in. The laptop will shutdown with the power button pressed but will not come on. I attempted an SMC reset but no change. Is it safe to say I have an SMC issue? BTW there are no signs of liquid damage, no corrosion or anything. I will check R5116 and R5100, as well as R7100. I see that SMC_RESET_L also goes to J6100 but. I didn't see anything there."
    },
    {
        "post_id":66201,
        "thread_id":60139,
        "title":"820-3437 Power on issue",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-10-07 01:05:24",
        "message":"Looks like power button acts as SMC reset in fact.\nDisconnect trackpad flex and try R5115\/16 pads instead.\n\nWith trackpad connected, post all U5110 voltages.\nI bet for low level at pin 6..."
    },
    {
        "post_id":66269,
        "thread_id":60139,
        "title":"820-3437 Power on issue",
        "user_id":5175,
        "username":"tlough75",
        "post_date":"2020-10-07 15:26:17",
        "message":"You were correct sir.\n\n             \nU5110 (W\/TPAD)\n1: 3.42V\n2: 0V\n3: 3.42V \n4: 2.8V\n5: 3.38V\n6: [COLOR=rgb(235, 107, 86)].567V[\/COLOR]\n7: 3.41V\n8: 3.3Vv\n\nU5110 (No TPAD)\n1: 3.42V\n2: 0V\n3: 3.42V \n4: 2.8V\n5: 3.38V\n6: [COLOR=rgb(65, 168, 95)]3.4V!!![\/COLOR]\n7: 3.41V\n8: 3.3V\n\nSo it must be either the TPAD or the cable. Time to play a little \"process of elimination\". Thank you for your guidance."
    }
]