[
    {
        "post_id":5945,
        "thread_id":5945,
        "title":"820-3476 u1900 issue",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2016-08-24 16:52:44",
        "message":"I had this board on the shelf for a while since I couldn't figure out the issue. It has already been UC'd and all the main power rails are present, the fan spins, cpu gets warm, usb mouse lights up but there was nothing showing on the screen, thunderbolt wasn't working and no chime. Thunderbolt comes from U1900 so I assume this may be a problem.\n\nThere was small liquid damage by the U1900 chip and I saw that C1910 looked burned on Pin 1.\nThe VDD Pin, PPVRTC_G3H and PP3V3_TBTLC measured 3.3v but I still replaced the chip.\nWhen I removed C1910 the pad for Pin1 was gone so I put a new chip on and ran a wire from Pin 1 of U1900 to C1910.\n\nAfter I finished replacing everything and plugged the charger in I saw I was only getting 2.6v on Pins 1 and 5 of U1900 as well as on C1910\/C0890\/C0891. R2040 which is no stuff had 3.3v on Pin 1 and 2.6v on Pin 2. Also, randomly I would see 3.3v on both pins 1\/5. I'm not sure if the fan connector could be causing this because even though the fan is locked in it is loose and I can pull it out and if I push the fan cable a certain way the fan will spin at normal speed or high speed.\n\nI removed U1900 and C1910 and plugged in the charger and R2040 and C1902 started measuring 3.3v but PPVRTC_G3H still shows around 2.7v. I got 0v on Pin 5 of U1900.\nI measured in diode mode on C0890 and got 0.54v.\n\nWhat else could be pulling PPVRTC_G3H down?\n\nCoincidentally Louis has a video of this similar issue posted today.\n\nAll of these measurements were done with no external cables plugged into the board."
    },
    {
        "post_id":5960,
        "thread_id":5945,
        "title":"820-3476 u1900 issue",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-08-25 01:24:20",
        "message":"PPVRTC is generated by U1900, so without U1900 it will never work.\nYou had a light on a USB mouse so the board was working!"
    },
    {
        "post_id":5972,
        "thread_id":5945,
        "title":"820-3476 u1900 issue",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2016-08-25 09:31:17",
        "message":"Okay but how come PPVRTC_G3H and PP3V3_S5RS3RS0_SYSCLKGEN show 2.7v with the U1900 chip on.\n\nThe board was working but nothing was showing on the screen nor was thunderbolt working and U1900 controls the thunderbolt chip.\n\nUpdate: I put another U1900 chip that I took from an 820-3437 board and now when I plug the charger in I dont get a fan spin anymore but I still get a light on the charger. I checked Pin 5\/C1902 and now I only get 2.05v and nothing on Pin 1 of U1900. I'm not sure if I may have overheated the chip trying to take it off that tough board. \n\nWhen I removed the chip again and plugged the charger in I got 3.34v on C1902."
    },
    {
        "post_id":5980,
        "thread_id":5945,
        "title":"820-3476 u1900 issue",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-08-25 14:04:22",
        "message":"If it starts then PPVRTC is good enough. I cannot diagnose anything if you use garbage chips and are not sure you soldered it correctly....."
    },
    {
        "post_id":5984,
        "thread_id":5945,
        "title":"820-3476 u1900 issue",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2016-08-25 14:12:34",
        "message":"You may be right the chip may have been bad because when I put back the chip that I got measurements from to start this thread the fan started spinning again and I got 2.6v on Pins 1 and 5 of U1900.\n\nI will take another chip from these donor boards that I have. I don't have any more 820-3476 boards but I do have plenty other air and pro boards.\n\nCan I take from any board that uses this chip number \"SLG3NB148CV\" on the schematic?"
    },
    {
        "post_id":5988,
        "thread_id":5945,
        "title":"820-3476 u1900 issue",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-08-25 18:01:33",
        "message":"Yeah are all the same"
    }
]