[
    {
        "post_id":24005,
        "thread_id":24005,
        "title":"2012 15\" MacBook Pro Power Button Issue",
        "user_id":61,
        "username":"wrbailey",
        "post_date":"2017-08-09 15:05:59",
        "message":"820-3332 board. Mother just shipped to me to look at. She had still some water near the machine and obviously got inside... She did not send to me first and took it to an computer repair shop.\n\nI can not find any liquid or signs\/evidence or clues of where liquid could\/would have been.\n\nThe only issue I have right now is that the power button won't turn on the machine. Also, once you plug the charger in, it turns right on. The entire keyboard works as it should, all keys work. You press the power button (and I mean barely touch\/press for a millisecond) and bam, machine turns off. Only way to the get it back on is to remove the battery connection, plug battery back in and then plug the charger up and it'll turn back on...\n\nI'm looking at the schematic and it looks like PIB 5 is the power button (as it is attached to SMC_ONOFF_L and R5710 \/ C5710. \nShould I be looking for a 0V at SMC_ONOFF_L, until the power button is pressed, momentarily bring the signal high?\n\nI measure at r5710 and I am getting 3.415V when the machine is off. When I press the power button, it goes low and comes back up to 3.4v when I let go.\n\nBad keyboard? or something with SMC_ONOFF_L?"
    },
    {
        "post_id":24006,
        "thread_id":24005,
        "title":"2012 15\" MacBook Pro Power Button Issue",
        "user_id":375,
        "username":"gcain",
        "post_date":"2017-08-09 15:28:06",
        "message":"_L means low == on, high == off.\n\nSo you'll always have a voltage (3.3v) until the button is pressed which sends it low."
    },
    {
        "post_id":24009,
        "thread_id":24005,
        "title":"2012 15\" MacBook Pro Power Button Issue",
        "user_id":61,
        "username":"wrbailey",
        "post_date":"2017-08-09 15:41:22",
        "message":"Yeah, that's what I came to...\n\nLooks like I did find shit around U5010. Luckily I have a 2012 13\" which has the same IC and caps\/resistors... Monkey brain time..."
    },
    {
        "post_id":24031,
        "thread_id":24005,
        "title":"2012 15\" MacBook Pro Power Button Issue",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-08-09 19:56:22",
        "message":"Uhm, did you even connect a test keyboard?"
    },
    {
        "post_id":24036,
        "thread_id":24005,
        "title":"2012 15\" MacBook Pro Power Button Issue",
        "user_id":61,
        "username":"wrbailey",
        "post_date":"2017-08-09 21:10:29",
        "message":"[ATTACH type=\"full\" width=\"200px\"]24057._xfImport[\/ATTACH] I did. It did the same thing with another new keyboard.\n\nI have a question... anyone have a better board view for the 820-3332-A board? The one I have, the u5010 area is missing two components... there is a cap and a resistor not on the BV...\n\nThe resistor looks like it is connected to PIN 1 of C5020 and then what looks to be a cap connected to U5010 at pins 2 and 3, in a loop... They're definitely on the board and here is a pic attached...\n\nThey looked terrible and wanted to replace them, but they went into the 5th dimension and I can't locate them on the BV or schematic (like i said, they aren't \"omit\" items, they were there and you can see them in the photo)"
    },
    {
        "post_id":24058,
        "thread_id":24005,
        "title":"2012 15\" MacBook Pro Power Button Issue",
        "user_id":61,
        "username":"wrbailey",
        "post_date":"2017-08-10 06:39:58",
        "message":"Edited the photo with arrows pointing to the \"missing\" components, not shown in BV..."
    },
    {
        "post_id":24107,
        "thread_id":24005,
        "title":"2012 15\" MacBook Pro Power Button Issue",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-08-10 18:56:31",
        "message":"Resistor is a 0ohm on pin 1 and the cap is just a bypass on pin 3 to GND will work fine without the cap.\n\nSMC_ONOFF going low when you press the power button? If not it could be corrosion under U5010 keeping it pulled up."
    },
    {
        "post_id":24124,
        "thread_id":24005,
        "title":"2012 15\" MacBook Pro Power Button Issue",
        "user_id":61,
        "username":"wrbailey",
        "post_date":"2017-08-10 20:42:41",
        "message":"Thank you for the specs on the components.\n\nYes, SMC_ONOFF_L goes from 3.4 to 0 and back to 3.4v when the button is pressed and then released."
    },
    {
        "post_id":24160,
        "thread_id":24005,
        "title":"2012 15\" MacBook Pro Power Button Issue",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-08-11 13:14:26",
        "message":"So what is the issue at the moment, machine cuts out and magsafe light goes green when you press power button?"
    },
    {
        "post_id":52461,
        "thread_id":24005,
        "title":"2012 15\" MacBook Pro Power Button Issue",
        "user_id":6,
        "username":"turbo",
        "post_date":"2019-09-21 11:33:07",
        "message":"i have the exact same issue, any help!!"
    },
    {
        "post_id":52477,
        "thread_id":24005,
        "title":"2012 15\" MacBook Pro Power Button Issue",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-09-22 02:17:02",
        "message":"Please open new thread.\nAnd post the exact measurements and tests done on the board."
    }
]