[
    {
        "post_id":9159,
        "thread_id":9159,
        "title":"820-2936-A quarter fan spin No liquid damage.",
        "user_id":468,
        "username":"ALB-Repairs",
        "post_date":"2016-11-04 04:10:40",
        "message":"Hi\nIm usually pretty good with these issues. This one has caught me out. It has no signs of liquid damage.\n\nIts not the typical quarter fan spin issue that relates to PCH\/EEPROM\/Clock Gen\n\nThis is a little different, it seems to be related to SMC support circuitary.\n\nthe green light disappears frequently.\nPPBUS G3H bounces between 12v0 and 12v6 dependent on weather the fans spinning. \n\nprobing Y5010 can cause symptoms to change, anywhere from fast fan no v-core to being in a full S5 state, again, this seems completely random.\n\nSMC_RESET_L present and stable\nR4999 good\nPP3v42 is stable\nR7021 and R7022 current sensing correct\nR7051 and R7052 current sensing correct\n\nSMC_BC_ACOK correct, green light present, sometimes loses communication with the SMC, and light goes out.\nChecked board with another EEPROM\/Bios chip, no change in symptoms. \nFitted replacement SMC. No change in symptoms.\n\nSMC_ONOFF_L is present and stable. \n\nWhen ive managed to get it stuck in an S3 state i checked the main power rails and found everything present and correct. \n\nI replaced  Y5010. C5010 and C5011 with no change in symtoms\n\nany ideas?"
    },
    {
        "post_id":9161,
        "thread_id":9159,
        "title":"820-2936-A quarter fan spin No liquid damage.",
        "user_id":468,
        "username":"ALB-Repairs",
        "post_date":"2016-11-04 04:44:12",
        "message":"Quick update.\n\nYou all probably think my methodology is ass backwards. Ive narrowed it down to V-Core related issues or potentaily a bad cpu or PCH.\n\nIve done this by breaking a S0 rail so V-core is not enabled. The symtoms changed, the fan remains spinning, and there is no funny business around the SMC anymore. It just acts like a board stuck in S0 now.\n\nTo further this i put the component back to re-enable ALL_SYS_PWRGD and removed U7400 and its associated V-core mosfets. Now the CPU V-core regulator is not present the board again simply acts like a board with no V-Core.\n\nSo thats managed to narrow it down with it likely being a bad CPU"
    },
    {
        "post_id":9165,
        "thread_id":9159,
        "title":"820-2936-A quarter fan spin No liquid damage.",
        "user_id":468,
        "username":"ALB-Repairs",
        "post_date":"2016-11-04 04:57:48",
        "message":"I dont believe it! What a strange set of symptoms for the issue. I replaced the U7400 IC and the thing sprung back to life! thats made my day :)"
    },
    {
        "post_id":9167,
        "thread_id":9159,
        "title":"820-2936-A quarter fan spin No liquid damage.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-11-04 05:00:40",
        "message":"No way U7400 just fails. Probably heated something up or it was liquid damage in U7400 area. This board has a high chance of failing again I'm afraid."
    },
    {
        "post_id":9170,
        "thread_id":9159,
        "title":"820-2936-A quarter fan spin No liquid damage.",
        "user_id":468,
        "username":"ALB-Repairs",
        "post_date":"2016-11-04 07:15:19",
        "message":"There is a good chance you are correct, however there is a cause and effect relationship between V-core and the original fault. I removed PP5v_S0's switch witch means no v-core either. Thats when the symptom changed from quarter fan spin to running without v-core.\n\nThe same occurred when i removed the PP3v3_S0 switch. Both these components are miles away from u7400 and wouldn't have heated anything enough to have a heat related effect. \n\nIll see how it runs, im fairly confident if it fails again it must be a ceramic capacitor around the u7400 chip maybe."
    },
    {
        "post_id":9351,
        "thread_id":9159,
        "title":"820-2936-A quarter fan spin No liquid damage.",
        "user_id":468,
        "username":"ALB-Repairs",
        "post_date":"2016-11-08 03:21:48",
        "message":"Still running beautifully. The effectiveness off heat on ceramic surface mounted caps is short lived, so i feel like i can rule that out. The only other possibility is failing alu-electrolytic's for the V-core. I will update people if it comes back to me."
    }
]