[
    {
        "post_id":47985,
        "thread_id":47985,
        "title":"820-01041 the pleasure of the soldered SSD and no Data-recovery port.",
        "user_id":1309,
        "username":"Inwerp",
        "post_date":"2019-03-30 05:49:46",
        "message":"Hello everyone. Macbook Pro Touchbar 2018 here.\nA little bit of waterdamage, SSD is not recognized anymore. I have no experience with the new models since in Germany almost all Apple customers buying apple care. This one did also, but surprise, he did not use icloud or time machine.\nNo schematics\/Boardview found. Looks like cap is G3HOT and the chip is some kind of a power converter for SSD but i am too dumb to guess what could it be.\nSince it is apple, i could not find anything that really matches by ground plates \/package size on Mouser.\nCan someone advise me a similar board which has boardview for this block?\n\nCoils on Photo 2 are paired, delievering 2.5v, 1.8v and 0.9v. these voltages are present on caps around those two chips which look like SSD drive."
    },
    {
        "post_id":47988,
        "thread_id":47985,
        "title":"820-01041 the pleasure of the soldered SSD and no Data-recovery port.",
        "user_id":1309,
        "username":"Inwerp",
        "post_date":"2019-03-30 05:51:56",
        "message":"there are also two non-soldered ports in middle. i wonder if one of them is actually an unsoldered SSD Recovery port."
    },
    {
        "post_id":47991,
        "thread_id":47985,
        "title":"820-01041 the pleasure of the soldered SSD and no Data-recovery port.",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2019-03-30 06:35:46",
        "message":"It should have a LifeBoat connector, for use with Apple Recovery Tool.\nCompare your board with 00239\/281 boardview."
    },
    {
        "post_id":47992,
        "thread_id":47985,
        "title":"820-01041 the pleasure of the soldered SSD and no Data-recovery port.",
        "user_id":1309,
        "username":"Inwerp",
        "post_date":"2019-03-30 07:13:34",
        "message":"well, i have apple recovery tool, but there's definetely no lifeboat connector on this board. Both unsoldered ports are pretty far away from SSD, so i guess they are something like CPU\/PCH debug ports like on other boards. \nthese two boards look somewhat similar, at least schematics should be almost the same, i will try to figure this out. thank you."
    },
    {
        "post_id":47998,
        "thread_id":47985,
        "title":"820-01041 the pleasure of the soldered SSD and no Data-recovery port.",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2019-03-30 11:50:56",
        "message":"Yeah there is no lifeboat on 2018 machines stupid Apple. I?d replace what?s nasty and go from there"
    },
    {
        "post_id":48010,
        "thread_id":47985,
        "title":"820-01041 the pleasure of the soldered SSD and no Data-recovery port.",
        "user_id":1309,
        "username":"Inwerp",
        "post_date":"2019-03-31 10:33:27",
        "message":"well, the nasty chip is some sort of power ic with 3 outputs which look perfectly fine. found some feedback lines, they are ok. my only hope is that there's something like fuse resistors near the chip. \nas you can see on first photo, there's nasty capacitor near the coil. because apple is very special in board design, this capacitor is G3HOT and the coil is 1.2V SSD power."
    },
    {
        "post_id":48036,
        "thread_id":47985,
        "title":"820-01041 the pleasure of the soldered SSD and no Data-recovery port.",
        "user_id":1309,
        "username":"Inwerp",
        "post_date":"2019-04-01 05:21:14",
        "message":"small update. since disk utility did not show any drives including external USB or recovery loop device, i tried to check if it is recognized in terminal(next hope was to use it with external SSD drive) i can see partitions, it even tries to format them but it keeps saying that i do not have access to the device.\nI cannot boot with linux, can't blank SSD in terminal. thanks to apple T2 security shit.\nSince T2 Security shit needs to read ssd to ask for a password to enable unsigned bootloaders, obviously it simply freezes with a color balloon if i try to change security settings from the recovery os. So even if SSD is simply corrupted, this shit does not work.\n\ni hope someone is way more smarter than me and could tell me if there's a way to change security settings from the console. Nope thats not SIP."
    },
    {
        "post_id":62608,
        "thread_id":47985,
        "title":"820-01041 the pleasure of the soldered SSD and no Data-recovery port.",
        "user_id":2508,
        "username":"No-Clean",
        "post_date":"2020-07-20 10:02:49",
        "message":"I know this is an old thread, but recently I had the same issue and after I repaired the board I still had no booting or starting activity or even image on screen, I then restored the T2 firmware and walla! MacBook started up just fine.\n\nOn a different MacBook also with T2 firmware and iCloud account link to it I restored the T2 firmware and all I got was a gray screen, even after a few more tries same thing, I then tried another option while restoring the T2 firmware that deletes all data on SSDs, I did that and was able to boot into internet recovery to install the OS, if the MacBook had iCloud you will need to have at least the login password of the Macbook or the iCloud account info to enter it before you an install the OS.\n\nI hope this helps someone like me in the future."
    }
]