[
    {
        "post_id":79979,
        "thread_id":61695,
        "title":"820-00165 - Not turning on",
        "user_id":944,
        "username":"mushr00m",
        "post_date":"2021-09-10 13:13:09",
        "message":"I 820-00615 not turning on\n\n\nPPBUS_G3H = 8.58\nPP5V_S5 = 5.04v\nPP5V_S4 and S0 both turn on and after some seconds turn OFF\n\nFAN SPIN start normally and after some seconds it stop but its not QUARTERLY FAN SPIN.\n\nI already reballed the SMC and it had a lot of gray pads\n\nHISTORY: Customer had a question mark folder and brought to another store which seems that the REFLOWED the RAM. The rest of the board looks normal.\n\nHowever I think the QUESTION MARK folder was related to the SMC itself"
    },
    {
        "post_id":79984,
        "thread_id":61695,
        "title":"820-00165 - Not turning on",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-09-10 16:08:50",
        "message":"This can be a nightmare, like many boards sent out without solution from other shops.\nThey damaged something for sure.\nCheck for knocked off components first.\nTry changing RAM chips."
    },
    {
        "post_id":79996,
        "thread_id":61695,
        "title":"820-00165 - Not turning on",
        "user_id":944,
        "username":"mushr00m",
        "post_date":"2021-09-11 07:05:05",
        "message":"Yeah I know it could be a nightmare but to be honest I didnt notice nothing that was tooked OFF.. I will take a look carefully again\n\nSure they damage something... but the RAMS look normal to be honest like a little reflow.. Would you try to remove and reball the RAM? Dont think the REFLOW damage the RAM"
    },
    {
        "post_id":79997,
        "thread_id":61695,
        "title":"820-00165 - Not turning on",
        "user_id":944,
        "username":"mushr00m",
        "post_date":"2021-09-11 07:48:46",
        "message":"I reflowed the RAMS and the machine turned on until user screen... I left it on for a minute and it turned off now it doesn have FAN SPIN and when I press power the fan doesnt start to spin and turn off anymore\n\nIt only does the previous behavior if I do a SMC reset.\n\nI guess I should remove all RAMS... REBALL and solder again. Would you agree with me?"
    },
    {
        "post_id":79998,
        "thread_id":61695,
        "title":"820-00165 - Not turning on",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2021-09-11 09:23:53",
        "message":"Is at least you can do.\nProbably better to change RAM chips directly (from donor board)..."
    },
    {
        "post_id":80004,
        "thread_id":61695,
        "title":"820-00165 - Not turning on",
        "user_id":944,
        "username":"mushr00m",
        "post_date":"2021-09-11 10:30:11",
        "message":"I do not have donor board of this model =(\n\nBut look like they did a terrible reflow job like 200C and didnt not damage but make some bad connections that's what I guess.. I will do the reball and get back to you"
    }
]