[
    {
        "post_id":7408,
        "thread_id":7408,
        "title":"820-3787 A1398 -- Keyboard and Trackpad issues.",
        "user_id":468,
        "username":"ALB-Repairs",
        "post_date":"2016-09-29 13:42:57",
        "message":"Hi - Im new here, but not to the world of macbook board repair. Done hundreds.\n\nThis machine is stumping me though. The symptoms the machine came in with were 'Keyboard and trackpad only work intermittently' This apparently occurred after storage for several months. The laptop and motherboard are clean, and show no signs of liquid ingress. \n\nthey explained that for the most part the keyboard seemed to work, they had fitted a new trackpad, when i received it i noticed the 'no movement but click works' symptom. There is no 18v5 boost on these machines.\n\nI tested all voltages to the trackpad and keyboard controller, I tested another trackpad to no avail.\n\nDigging deeper i tested all the passive components that are anything to do with the keyboard and trackpads function, i found no issues, Im talking about all capacitors and resistors. I tested every trace for continuity. Eventually i decided to change the keyboard controller IC. Being a programmed IC i was worried that it wouldn't function, The design elements for the keyboard and trackpad support matched up between this machine and the 820-3332. \n\nUpon completing the work i re-tested the machine to find the keyboard option keys\/power keys\/ SMC reset keys working to allow boot menu and perform other basic functions. In OSX we now have a slightly different fault. The keyboard doesn't work at all, nor does the trackpad. \n\nScratching my head and thinking thats strange, probably slightly different programming on the 820-3332 keyboard controller, i order two scrap 820-3787 donor boards. Once they arrived i replaced the keyboard controller again, this time sure that i have the correct controller, with the correct programming. \n\nThe symptoms are once more exactly the same.\n\nIve read up that people have experienced this issue and its down the the SPI firmware, I found a good dump for the EFI, and wrote over the dirty ME region with the boards original ME region, reflashing with the known dump. Same results once more. \n\nThis has lead me to think there are a couple of possibilities.\nCould i have a damaged USB section on my PCH- This is an incredibly long shot but the PCH has no real protection for the USB data-lines, can i rule this out as for the most part they seem to communicate (with the keyboard at certain points of this repair working)?. \nCould the communication between the KBC and the PCH somewhat depend on parts of the ME region of the SPI. Should i clean the SPI dump i have with a fresh ME region and hope for the best?\n\nMy main concern is that with the original keyboard controller i had keyboard function in OSX for the most part, This could be a red herring because the customer stated that sometimes in OSX the keyboard completely stops responding. \n\n\nSorry this is probably a lot of poorly written bable to take in without any real measurements or part numbers. If anyone can shine a light at the right pathway i would be very grateful. More odd issues and complex posts to follow, I hope this is the right forum for me."
    },
    {
        "post_id":7440,
        "thread_id":7408,
        "title":"820-3787 A1398 -- Keyboard and Trackpad issues.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-09-30 04:47:39",
        "message":"Is the keyboard recognized under USB devices in OSX? Does KB\/TP work when you are in the EFI boot menu?"
    },
    {
        "post_id":7460,
        "thread_id":7408,
        "title":"820-3787 A1398 -- Keyboard and Trackpad issues.",
        "user_id":468,
        "username":"ALB-Repairs",
        "post_date":"2016-09-30 06:44:37",
        "message":"If i recall correctly i had a functioning keyboard in boot menu with the original keyboard controller however since replacing the keyboard controller it is not (as said above this could be a false negative because they stated the keyboard only worked sometimes) \n\nI dont believe the keyboard is recognised under devices in OSX.\nThanks"
    },
    {
        "post_id":7465,
        "thread_id":7408,
        "title":"820-3787 A1398 -- Keyboard and Trackpad issues.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-09-30 08:11:57",
        "message":"You don't believe it is recognized.....I need more than that, it is kinda important."
    },
    {
        "post_id":7567,
        "thread_id":7408,
        "title":"820-3787 A1398 -- Keyboard and Trackpad issues.",
        "user_id":468,
        "username":"ALB-Repairs",
        "post_date":"2016-10-03 03:42:17",
        "message":"No\nThe SMC reset keys and power button do work though.\n\nit just booted halfway, shut down and now has quarter fan spin. I havent done a PCH on one of these before, lets hope its just EFI failure."
    },
    {
        "post_id":7570,
        "thread_id":7408,
        "title":"820-3787 A1398 -- Keyboard and Trackpad issues.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-10-03 05:48:21",
        "message":"SMC reset and power button is a separate circuit. If the keyboard\/trackpad is not listed under USB devices something is up with U4801, check all power to that chip and the 2 USB lines. Only thing it need to be listed in OSX is power and USB.\nQuarter fan spin now is probably some corrosion somewhere."
    },
    {
        "post_id":7572,
        "thread_id":7408,
        "title":"820-3787 A1398 -- Keyboard and Trackpad issues.",
        "user_id":468,
        "username":"ALB-Repairs",
        "post_date":"2016-10-03 07:18:04",
        "message":"The laptop has no corrosion or signs of liquid ingress so i somewhat doubt there will be corrosion. Everything to U4801 has been tested, all VIN and power rails. \nI can confirm the SPI rom has been checked and re-written with a confirmed good ROM and we are still getting quarter fan spin. \nZac"
    },
    {
        "post_id":9350,
        "thread_id":7408,
        "title":"820-3787 A1398 -- Keyboard and Trackpad issues.",
        "user_id":468,
        "username":"ALB-Repairs",
        "post_date":"2016-11-08 03:20:10",
        "message":"I eventually got around to fitting a new PCH and clearing up the ME region. I changed the PSOC, fitted one from a 820-3536 board, after i noticed the USB datalines not having any real data passed through them. \n\nI now how trackpad movement, click and everything seems great, other than the middle row of keys not responding atall.\nFrom experience i know this is usually the PSOC chip.\n\nIm starting to get concerned, i seem to be destroying these chips super quickly and easy. Im starting to guess they are fairly heat sensitive or pressure sensitive, i think i just need to be a bit more careful when soldering them and i should have a working laptop :)"
    },
    {
        "post_id":9357,
        "thread_id":7408,
        "title":"820-3787 A1398 -- Keyboard and Trackpad issues.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-11-08 05:44:41",
        "message":"Measure all pins on the keyboard connector on diode mode, could just be bad soldered pin on the chip."
    },
    {
        "post_id":9360,
        "thread_id":7408,
        "title":"820-3787 A1398 -- Keyboard and Trackpad issues.",
        "user_id":468,
        "username":"ALB-Repairs",
        "post_date":"2016-11-08 06:35:19",
        "message":"Sorted that all out now. I really need to get a new handpiece for my T210m JBC iron. \n\nNow i just need to get the laptop tested with the new ME region and ensure it doesn't do anything undesirable. The laptop now passes the inbuilt diagnostics though. :)"
    },
    {
        "post_id":9361,
        "thread_id":7408,
        "title":"820-3787 A1398 -- Keyboard and Trackpad issues.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-11-08 07:39:30",
        "message":"See if the fan ramps up when it gets hot. Also see if there is the \"chipset\" test in EFI, that checks for working ME. If it all looks ok can you share the clean ME here? I believe these need 3S162."
    },
    {
        "post_id":9418,
        "thread_id":7408,
        "title":"820-3787 A1398 -- Keyboard and Trackpad issues.",
        "user_id":468,
        "username":"ALB-Repairs",
        "post_date":"2016-11-09 02:49:31",
        "message":"I will do, i need to redownload ASD. I dont think the inbuilt diagnostics check the ME but i cant really remeber. The fans do however ramp up when the machine gets warm.\n\nThe main concerns are that\n1: I took the ME from a 3476 id already cleaned, knowing that they run on similar platforms. I cant remeber where i obtained the ME that is in my 3476 BIN. \n2: When the machine starts up there is maybe a 5 second delay before it starts its power on sequence. When running of my bench supply i notice that it pull 0.2A then back to 0.034, then after a few seconds pulls more current and the fans spin up. \n3: Seems to boot slower than it did when it came in. \n\nAnyway, ill try get ASD ran on it and keep the thread updated."
    },
    {
        "post_id":9421,
        "thread_id":7408,
        "title":"820-3787 A1398 -- Keyboard and Trackpad issues.",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2016-11-09 03:33:35",
        "message":"You cannot just swap an ME like that. Will need to compare all settings with the original ME. Check all settings in FIT"
    },
    {
        "post_id":9425,
        "thread_id":7408,
        "title":"820-3787 A1398 -- Keyboard and Trackpad issues.",
        "user_id":468,
        "username":"ALB-Repairs",
        "post_date":"2016-11-09 04:55:53",
        "message":"[QUOTE=\"dukefawks, post: 9421\"]You cannot just swap an ME like that. Will need to compare all settings with the original ME. Check all settings in FIT[\/QUOTE]\n\nI know that. Sorry i didnt explain myself well enough. Its a clean ME region that ive used to clean a 3476 Bios. I did check all settings with FIT and moved the region using HxD. Ive been correcting ME regions for a while now but i do need to double check this ME build is supported by this chipset platform.\n\nEDIT: Just got it running ASD and can confirm the ME region is still messed up. Back to the drawing board for a little bit."
    }
]