[
    {
        "post_id":58959,
        "thread_id":58959,
        "title":"A1425 2012 820-3462, very slow and freeze",
        "user_id":24772,
        "username":"VinceLx",
        "post_date":"2020-04-30 05:10:49",
        "message":"Hello,\n\nAnother board which looks fine, no visible water damage, but it is very very slow, and finally switches off by itself.\n\nIt takes 2 to 3 minutes to boot, then after entering the password another 2 minutes delay, with the beach ball appearing from time to time.\n\nI put this board in a different case which is fine with another board (keyboard and trackpad ok, SSD and its cable ok), with the same result.\n\nNo anomalies on the temperature sensors, all below 50 C in HWMonitor.\n\nThe original screen was partly damaged, a white vertical flickering strip of 4-5 cm, but I doubt it has an impact? No issue on the screen in the other case.\n\nWhere to start here?"
    },
    {
        "post_id":58973,
        "thread_id":58959,
        "title":"A1425 2012 820-3462, very slow and freeze",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-04-30 09:23:52",
        "message":"Did you try PRAM reset?\nSometime helps doing it 2-3 times.\n\nDid you test w\/o battery and w\/ known good battery?\nAlso try USB macOS."
    },
    {
        "post_id":58992,
        "thread_id":58959,
        "title":"A1425 2012 820-3462, very slow and freeze",
        "user_id":24772,
        "username":"VinceLx",
        "post_date":"2020-04-30 14:32:56",
        "message":"I repeated the PRAM reset several times, did not change the slowness.\n\nWith SSD on USB with MacOS: exactly the same, 3 minutes to boot. Then 1 min 30 s to reach the desktop after entering password.\n\nI do all this without battery (the original battery is dead and I don't have spares)\n\nIt works normally on the other board, same model, without battery."
    },
    {
        "post_id":58993,
        "thread_id":58959,
        "title":"A1425 2012 820-3462, very slow and freeze",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-04-30 14:37:57",
        "message":"Try clean ME into original BIOS.\nIf no luck, try full known good BIOS, clean ME of course."
    }
]