[
    {
        "post_id":89713,
        "thread_id":62741,
        "title":"MacBook A1990 board 820-01041 - battery does not work and not detected",
        "user_id":33224,
        "username":"Vogelek23",
        "post_date":"2022-05-31 09:05:02",
        "message":"Hi there, I'm having this patient on my desk with battery not being detected at all - no charging, laptop only works plugged in to the mains. Replaced battery with a 100% working good one, replaced battery signal flex, checked all corresponding voltages and signals and they look fine (I've got PPBUS_G3H = 12.6V, both I2C_PWR_SDA and I2C_PWR_SCL at 1.8V with nice oscillograms at full amplitude, both R5220 and R5221 OK, PP1V8_SLPS2R OK, both SMBUS_3V3_BATT_SDA and SMBUS_3V3_BATT_SCL correct with an oscillograms, SYS_DETECT_L = 0V, SYS_DETECT = 3.3V). I2C signals from battery go to PMU, SoC and charger chip but I haven't yet replaced any of them. Which one first should I pay the attention to? Or maybe there is something else I missed? Please advise."
    },
    {
        "post_id":89715,
        "thread_id":62741,
        "title":"MacBook A1990 board 820-01041 - battery does not work and not detected",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-05-31 09:33:05",
        "message":"Did you try DFU?\nTry SMC reset too:\n[URL unfurl=\"true\"]https:\/\/support.smartsourcedit.com\/hc\/en-us\/articles\/360037083553-How-to-Reset-SMC-on-MacBook-Air-MacBook-Pro-2018-or-later-with-T2-Security-Chip[\/URL]"
    },
    {
        "post_id":89738,
        "thread_id":62741,
        "title":"MacBook A1990 board 820-01041 - battery does not work and not detected",
        "user_id":33224,
        "username":"Vogelek23",
        "post_date":"2022-06-01 03:32:28",
        "message":"SMC was the very 1st attempt, I did not say that as I found it too obvious, apologies. Did not do a DFU yet, however, did more measurements and found that Q7065 is constantly switched on and off at 4 secs interval (4 secs on, 4 secs off). When on the gate voltage to ground is 4.2V, when off the gate voltage is 12.6V. Drain voltage changes from 12.6V to 0.15V respectively. Do you think DFU revive\/restore may do the trick with that?"
    },
    {
        "post_id":89740,
        "thread_id":62741,
        "title":"MacBook A1990 board 820-01041 - battery does not work and not detected",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-06-01 06:42:06",
        "message":"DFU can solve weird issues on T2 machines.\nOf course, also can cause other problems if can't be completed.\nApple found a good way to put its machines out of warranty.\nYou should save the data first.\n\nJust in case, check ohm resistance over C7020\/23."
    },
    {
        "post_id":89934,
        "thread_id":62741,
        "title":"MacBook A1990 board 820-01041 - battery does not work and not detected",
        "user_id":33224,
        "username":"Vogelek23",
        "post_date":"2022-06-06 05:33:17",
        "message":"C7020\/23 as expected - 2.2 and 3.3 Ohm. DFU revive and restore did not do the trick, sadly. Replaced charger IC (ISL9240HI) - no luck. I'm stuck with no further ideas... What I found is that with no PSU connected there is no single voltage on battery (power and signal pins = 0V). Shouldn't it be 3V on SMBUS at least? When PSU connected the MLB fires up normally but as soon as I unplug PSU the MLB switches off immediately, like no battery has been connected."
    },
    {
        "post_id":89938,
        "thread_id":62741,
        "title":"MacBook A1990 board 820-01041 - battery does not work and not detected",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2022-06-06 07:32:32",
        "message":"Check continuity for data lines between MLB and battery.\nI found one case with bad connection inside battery connector; on its electronics circuitry board."
    },
    {
        "post_id":89941,
        "thread_id":62741,
        "title":"MacBook A1990 board 820-01041 - battery does not work and not detected",
        "user_id":33224,
        "username":"Vogelek23",
        "post_date":"2022-06-06 08:13:22",
        "message":"Following your advice, I found the SMBUS data line pad broken under J6951 connector, although the voltage on this pin is correct and pulses are visible on the oscilloscope - it was bad physical connection to the via underneath. Soldered kynar wire to R6951 pin 2 and battery is now detected correctly and charged. Many thanks for the support, 2informaticos! There is always something to learn with Apple :)"
    }
]