[
    {
        "post_id":29133,
        "thread_id":29133,
        "title":"820-3662 Runs without battery, fails to boot with battery",
        "user_id":1104,
        "username":"Jay",
        "post_date":"2017-12-10 18:14:24",
        "message":"Saw a post from 2016 with the same issue and at the time dukefawks had no solution, hoping this has changed since then :)\nWith battery connected I can get it to POST and boot half way if I press and hold the power button at least until after POST. Booted a few times from ASD but it powers off or goes into a weird sleep (display off, fans still running) after a minute. If I press thepower button normally the fans chirp and give a quarter spin but nothing else happens.\n\nTesting the board (no battery connected):\nWent down the list of power rails and got good measurements from PPBUS_G3H down to PPVIN_S5_HS_OTHER5V_ISNS. For PPDCIN_G3H and PPDCIN_G3H_ISOL I get 16.6V though and the schematic shows me this should be 20V.\n\nCan't track down at which point the voltage drops below the 20V, I tested PPDCIN_G3H at F7005 and get the same result with a different magsafe board.\nAlso took the following readings\n\nU7000 pins:\n1: 3.42V\n2: 0\n3: 0\n4: 3.4V\n5: 3.4V\n\nQ5410:\nOnly get a reading on pin 5 of 3.4V\n\nWhere should this journey take me next?"
    },
    {
        "post_id":29137,
        "thread_id":29133,
        "title":"820-3662 Runs without battery, fails to boot with battery",
        "user_id":289,
        "username":"smiba",
        "post_date":"2017-12-11 02:14:38",
        "message":"Don't get stuck on the PPDCIN_G3H not being 20V. The schematic is not always right (and also I assume its written as 20V just to make sure the engineers design it to handle up to at least 20V). 16.6V sounds about right and if ACOK is high don't worry about it.\n\nHow is PM_BATLOW_L doing? Voltage with both battery plugged in and without battery? Try to see if this voltage changes after you tried to boot and it crashed\nOther then that I wouldn't know for sure but it smells like SMC trouble or random corrosion\n\nEDIT: Also are you using a 87W charger? As I think the voltage for that charger is usually around 20V (But maybe it switches to a lower voltage when its not under high load)"
    },
    {
        "post_id":29144,
        "thread_id":29133,
        "title":"820-3662 Runs without battery, fails to boot with battery",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2017-12-11 06:09:16",
        "message":"The usual 3662 problem that still has not been figured out."
    },
    {
        "post_id":29148,
        "thread_id":29133,
        "title":"820-3662 Runs without battery, fails to boot with battery",
        "user_id":1104,
        "username":"Jay",
        "post_date":"2017-12-11 08:40:28",
        "message":"Thanks [USER=\"289\"]smiba[\/USER] but if the Pro's haven't figured this one out yet, I certainly won't with my two months experience :\/ Plenty of other machines to work on so will not waste any further time on this one. Thanks for the reply though! I use 85W chargers for everything."
    },
    {
        "post_id":30799,
        "thread_id":29133,
        "title":"820-3662 Runs without battery, fails to boot with battery",
        "user_id":1104,
        "username":"Jay",
        "post_date":"2018-01-28 14:35:11",
        "message":"I was working with the wrong information. Issue persists but this is an 820-3787-06, not an 820-3662"
    },
    {
        "post_id":30800,
        "thread_id":29133,
        "title":"820-3662 Runs without battery, fails to boot with battery",
        "user_id":2,
        "username":"dukefawks",
        "post_date":"2018-01-28 15:13:03",
        "message":"Same board just with a GPU. Hopeless at the moment."
    },
    {
        "post_id":30801,
        "thread_id":29133,
        "title":"820-3662 Runs without battery, fails to boot with battery",
        "user_id":1104,
        "username":"Jay",
        "post_date":"2018-01-28 16:58:24",
        "message":"Bummer. Though at this point it’s running 100% and passes all ASD OS\/EFI and AHT tests. Both on battery power and connected.  Battery is 100% though, gonna drain it and see how it acts."
    }
]