[
    {
        "post_id":17231,
        "thread_id":17231,
        "title":"[SOLVED]820-00165 no backlight (8.55v)",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2017-03-23 23:39:32",
        "message":"This board had liquid damage in the area of the LCD Connector and had no backlight. I cleaned up the area and replaced all the components around it. Fortunately the other side of the board is spotless including the LP8550 area. I ended up having to replace the screen and I also replaced the LCD connector. Now I am getting 8.55v on Pins 3\/4 of LCD connector and I can see the question mark folder. \nI noticed that BKL_PWM was 0.17v so I plugged the keyboard in and did a PRAM reset and it went up to around 1.6v. It seemed like the screen was less dim and I could see the question mark folder better. I tried putting the brightness up with the keyboard and that didn't work.\n\nI removed R7704 and ran a wire to C7711 and 3v now is on BKL_PWM but still 8.55v is on backlight.\n\nThis board is a little different from the 820-3437 so I'm not sure how I can check if the feedback trace is fine. The feedback ball and the entire chip look perfect. Here are some more measurements\n\nC7799 in diode mode - 0.614v\nPin 1(D7701) in diode mode - 0.419v and Pin 2 is 0.614v\nBKL_EN - 2.85v\nSMC_LID - 3.4v\nThere is continuity from Pin 2 of D7701 to Probe 1155 on the other side of the board"
    },
    {
        "post_id":17232,
        "thread_id":17231,
        "title":"[SOLVED]820-00165 no backlight (8.55v)",
        "user_id":1,
        "username":"larossmann",
        "post_date":"2017-03-24 00:33:48",
        "message":"Remove LED driver and check continuity from ball A5 to pin 2 of D7701. Not to mention you have a bad LP8550 which is pulling down the PWM signal in the first place."
    },
    {
        "post_id":17249,
        "thread_id":17231,
        "title":"[SOLVED]820-00165 no backlight (8.55v)",
        "user_id":90,
        "username":"ytesfay80",
        "post_date":"2017-03-24 05:21:02",
        "message":"You were right. There was no continuty so I put a new LP8550 and ran a wire from A5 to Probe 1155 and now its working fine. Thanks."
    }
]