[
    {
        "post_id":60403,
        "thread_id":59443,
        "title":"820-2533 Strange power issue.",
        "user_id":5175,
        "username":"tlough75",
        "post_date":"2020-06-03 22:25:24",
        "message":"At the moment I am working on an 820-2533 that has a strange power issue. On the the bench I am able to power the board and leave it running for a good while, but when I put it in the chassis I can get it to turn on, log in and look around for about 30 second before it just turns off, like as if you were just running off the charger and pulled the plug.  I am using a genuine 85W MS1 to do preliminary tests. I am not sure where to go from here as this is a first for me. I am used to 820-00165 problems :LOL:. None of this, \"oh, I am working.... and boom, off\""
    },
    {
        "post_id":60404,
        "thread_id":59443,
        "title":"820-2533 Strange power issue.",
        "user_id":5175,
        "username":"tlough75",
        "post_date":"2020-06-03 22:28:33",
        "message":"Oh and an important second teaser, when it shuts off in the chassis I cannot get it to turn back on. Not even with using \"power on pads\". But on the bench I can shut it off, turn it right back on over and over so I am thinking it has something to do with the chassis, or TPAD because although I can move the cursor, the TPAD will not \"click\". I think that may be a clue..."
    },
    {
        "post_id":60405,
        "thread_id":59443,
        "title":"820-2533 Strange power issue.",
        "user_id":5175,
        "username":"tlough75",
        "post_date":"2020-06-03 22:33:40",
        "message":"After I let it sit for a few minutes I plugged in the MS and hit the power button. The fan jerked a little then started to spin but after the chime it shut back off. I'm starting to think it is possessed.... No signs of liquid damage either unfortunately."
    },
    {
        "post_id":60416,
        "thread_id":59443,
        "title":"820-2533 Strange power issue.",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-06-04 02:08:19",
        "message":"Check if the board always start in the case, with TP\/KB disconnected; use power pads for test.\nFind the way when it always starts properly disconnecting one by one the peripherals."
    }
]