[
    {
        "post_id":58963,
        "thread_id":58963,
        "title":"820-00840 image issues",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-04-30 07:21:37",
        "message":"Hello. I have a 820-00840 board that originally came in with no image on the screen, but I replaced the display assembly with another one and the image was working fine it seemed. I put it back in the case and put all the screws back and then when I started it up again, the image appears normally for a second or 2 and then the whole screen starts getting brighter and brighter until the whole screen is white and you cannot see anything. I quickly turn it off after this to prevent damage to the screen but cannot figure out what would cause this. It will actually sometimes turn on and then screen will act normally, and other times it does this white wash thing as soon as the screen turns on. The board is spotless with no signs of liquid damage or corrosion. I checked backlight voltage during this and it stays at 43v the whole time, so it does not seem like a backlight issue. Any ideas what would cause this?"
    },
    {
        "post_id":58969,
        "thread_id":58963,
        "title":"820-00840 image issues",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-04-30 09:17:09",
        "message":"\"I replaced the display assembly with another one and the image was working fine it seemed.\"\nDid you test again?\n\nCheck if machine can still get the screen changed by Apple free..."
    },
    {
        "post_id":58976,
        "thread_id":58963,
        "title":"820-00840 image issues",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-04-30 09:41:36",
        "message":"Yes I tested the board after replacing the screen with just the display assembly and board, not in the case and it was working fine. Then I put the whole computer back together and tested it again and it worked fine the first boot and then every time after that, the screen would go white. I have been doing more testing and when the computer has no power at all (battery disconnected and charger disconnected) and I connected the charger, everything works fine on the first boot. If I then shutdown and turn the computer on again, without unplugging the charger, the screen will turn white everytime I reboot it until I disconnect power and connect it again. I don't believe the issue is with the display itself and this is a 2017 model and apple will only fix 2016 models with backlight issues."
    },
    {
        "post_id":58978,
        "thread_id":58963,
        "title":"820-00840 image issues",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-04-30 09:58:03",
        "message":"Here is a video of it.\n[media=youtube]XNMmSpQanlU[\/media]"
    },
    {
        "post_id":58982,
        "thread_id":58963,
        "title":"820-00840 image issues",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2020-04-30 10:14:26",
        "message":"F***g Apple screens suffer from video flex too, not only backlight.\n\nDisplay going pure white, means 3V, or 5V missing; TFT matrix remains unpowered.\nIf you get these voltages at J8300, then is a problem with the short video cable, or LCD assembly."
    },
    {
        "post_id":59007,
        "thread_id":58963,
        "title":"820-00840 image issues",
        "user_id":7922,
        "username":"tcampbell34",
        "post_date":"2020-04-30 20:08:33",
        "message":"Ok so I checked the 5v and 3v LCD voltages while the screen was turning white and they were both present and steady. I also tried another screen and got the same symptoms so I knew it was something with the board. I was checking diode mode values on all the connections to J8500 and found that TCON_BKLT_PWM was .040 which seemed low. I did not have another working board to compare it to so I used 3 different donor board that I had and all 3 of them measured about .700 on that line. I removed C8572 but still had the same diode mode value so I decided to replace the SMC, since that is the only other thing connected on this line. With new SMC, TCON_BKLT_PWM is now at .690 and the screen works fine. This one is fixed. Thanks."
    }
]