[
    {
        "post_id":38134,
        "thread_id":38134,
        "title":"how to tell if something is shorted without a beep from the multimeter?",
        "user_id":1190,
        "username":"Gmorb",
        "post_date":"2018-08-05 21:02:18",
        "message":"ive gotten so much good advice here but one thing i still need to know is how do i know when something is considered a short in ohms when the multimeter wont give out a beep.\n\nyou know those shorts that arent easily detectable.\n\nI remember duke telling me to measure resistance to ground and that at a certain ohm\/kohm resistance it meant mcp was dead and whatnot.\n\nwhat resistances indicate a short on a circuit?\n\nhope i explained myself ok. thanks."
    },
    {
        "post_id":38147,
        "thread_id":38134,
        "title":"how to tell if something is shorted without a beep from the multimeter?",
        "user_id":1153,
        "username":"JohnB8812",
        "post_date":"2018-08-06 08:38:47",
        "message":"Zero ohms or very low ohms on a main rail like PPBUS. Basically best way is to compare to a known good board. Low voltage rails will be lower resistance such as CPU VCore where as higher voltage lines like backlight will be higher resistance."
    },
    {
        "post_id":38154,
        "thread_id":38134,
        "title":"how to tell if something is shorted without a beep from the multimeter?",
        "user_id":682,
        "username":"2informaticos",
        "post_date":"2018-08-06 14:53:03",
        "message":"Beep is not equal short!\nMany multimeters, on buzzer scale, beeps till 060-075; higher frequency and low power for higher value.\nNow a real short is 0 (zero) ohms.\nBut we (unproper) consider short a low value, which is to low comparing with expected value in a specific rail; being still much higher than 0 (zero).\n\nAs example, on the DDR power rail we normaly expect more than 100, even 400 (diode mode); higher values for boards with RAM module removed.\n030 indication there is \"titled\" as short, because is too low for that rail; but is till far away of zero.\nBut is not a real short. For this reason we can't use current injection method in such case.\nNothing will go hot with 1.5V\/30ohms (50mA, 75mW), as example.\nWith a 001 indication (diode mode), which can be 0.5-1 ohm (200 ohm scale), we expect 1-3A (2-5W), which can help us to detect the culprit.\n\nBut 3rd Gen iCore CPUs (Ivy Bridge) have very low values as normal.\ni7-3xxx can indicate aprox 1 ohm and is no short at all.\nDo not inject tension in such case!\n\nIs good to create a database (simple txt file) with normal values on the current power rails.\nThen we can compare with the values from a defective board.\n\nCPU core, as GPU core too, can have very low values.\nBut other CPU classe could have much higher values; check 1st and 2nd iCore CPUs.\n\nNortbridge cores and first PCH cores can indicate even 010 as OK.\nOthers should give more than 100.\nnVidia MCP core shows 005-010 as normal.\n\n3V3 and 5V rails give 120-450 as normal; 020 there will indicate a problem.\n\nOn MacBook, PPBUS gives aprox 110-130, or 430-500; lower value for the boards which have Schottky diode integrated on the low-side MOSFET from charger circuit.\nBut these two values are tipcally for PPBUS rail.\n\nKeep in mind, measuring the same rail, even in the same board, with different multimeter, will give different values; but in the same class value.\nMeasuring the same rail in different board will also give different value; but should be close reading."
    }
]